[{"code": "5701", "title": "Fundamentals in Artificial Intelligence", "career": "Postgraduate - Taught", "units": "3.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Div of Engineering", "requirements": "For students in MSc Artificial Intelligence; Not For students who have taken CSCI5150 or ELEG5760 or CSCI3320 or CSCI3230", "description": "With Artificial Intelligence widely employed across various domains, it is essential to learn the basics of AI and get to know different sub-areas of AI. This course will cover the basics and techniques of artificial intelligence, as well as the introduction, general research landscape and frontier of each sub-field in artificial intelligence. This course covers the following topics: Search: uninformed search, informed search and multi-agent search. Machine learning techniques, including linear regression, logistic regression, decision trees, random forests, Bayesian networks, inference and sampling, hidden Markov models and particle filtering; K-nearest neighbors, K-means, support vector machines, gradient boosting. Neural networks and optimization. Introduction to computer vision and natural language processing. Reinforcement learning and recommendation systems. Generative models.", "outcome": "Upon successful completion of this course, students will be able to:1. Understand the basic concepts in artificial intelligence 2. Understand the principles of various machine learning and deep learning techniques3.Understand the principles of different types of neural networks and their optimization4. Understand the principles of reinforcement learning algorithm and recommendation systems5. Apply and evaluate the AI techniques to solve real world problems", "syllabus": "This course covers the fundamentals: Search: uninformed search, informed search and multi-agent search. Machine learning techniques, including linear regression, logistic regression, decision trees, random forests, Bayesian networks, inference and sampling, hidden Markov models and particle filtering; K-nearest neighbors, K-means, support vector machines, gradient boosting, neural networks, and optimization. Introduction to computer vision and natural language processing. Reinforcement learning and recommendation systems. Generative models.Teaching PlanWeeks    Course Topics1    Introduction, Logic, Reasoning and Learning2    Search: Uninformed search, Informed search, Searching with other agents3    Machine Learning: Linear Regression, Logistic Regression, Decision Trees, Random Forests 4    Machine Learning: Bayesian networks, Inference and Sampling5    Machine Learning: Hidden Markov Models and Particle Filtering6    Machine Learning: K-Nearest Neighbors, K-Means, Support Vector Machines, Gradient Boosting7    Machine Learning: Neural Networks8    Optimization: Backpropagation and Stochastic Gradient Descent 9    Introduction to Computer Vision10    Introduction to Natural Language Processing11    Reinforcement Learning, Recommendation Systems12    Generative Models", "required_readings": "The course instructor will recommend the relevant textbook. The course contents will be organized in the form of lecture notes, as well as a list of recommended readings.", "recommended_readings": "1.    Stuart Russell, Peter Norvig. Artificial Intelligence: A Modern Approach (3rd ed.), Englewood Cliffs: Prentice hall, 2010.2.    Mehryar Mohri, Afshin Rostamizadeh and Ameet Talwalkar, Foundations of Machine Learning (Adaptive Computation and Machine Learning series) 2nd Edition, The MIT Press, December 2018.3.     Ian Goodfellow, Yoshua Bengio, and Aaron Courville, Deep Learning (Adaptive Computation and Machine Learning series), The MIT Press, November 2016.4.    Pytorch tutorial: https://pytorch.org/tutorials/beginner/basics/intro.html5.    Deep Learning book: https://www.deeplearningbook.org/6.    Machine Learning book: https://ai.stanford.edu/~nilsson/MLBOOK.pdf", "terms": {"2025-26 Term 1": {"--LEC (3747)": {"startTimes": ["18:30"], "endTimes": ["21:30"], "days": [3], "locations": ["Yasumoto Int'l Acad Park LT7"], "instructors": ["Professor YUE Xiangyu"], "meetingDates": ["3/9", "10/9", "17/9", "24/9", "8/10", "15/10", "22/10", "5/11", "12/11", "19/11", "26/11", "3/12"]}}}, "assessments": {"Homework or assignment": "30", "Others": "30", "Project": "40"}}, {"code": "5702", "title": "Artificial Intelligence in Practice", "career": "Postgraduate - Taught", "units": "3.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Div of Engineering", "requirements": "For students in MSc Artificial Intelligence", "description": "With the fast development of artificial intelligence, it is critical to understand how to build an AI system tailored for specific tasks. This course will teach you the general programming and designing practices of AI systems, understanding how to build a neural network, how to collect training data, and how to design a successful AI project.This course covers the principles of machine learning, data preparation and loading, basic vector operations, multi-layer perception, convolutional neural networks, sequential prediction, vision recognition, text recognition, model optimization and deployment, and distributed training.", "outcome": "Upon successful completion of this course, students will be able to:1. Understand how to design an AI system for a specific task, including data preparation, model selection, model training, and model deployment;2. Develop the programming skills for vector operations and construction of different network structures, including multi-layer perceptron, convolutional neural networks, and recurrent neural networks;3. Develop the programming skills for data preparation, data loading, parallelism and optimization, parallel training, and distributed training;4. Develop the system design skills to build an AI project, including housing price prediction, visual classification, and text analysis;5. Design an AI application using the pretrained large foundational models, including stable diffusion-based image generation, large language models, and image segmentation.", "syllabus": "1. Basic vector, matrix, and tensor operations;2. Image, audio, text, video, and sequential data representation;3. Network structures, multi-layer perception, convolutional neural networks, and recurrent neural network;4. Data preparation, data loading parallelism and optimization, parallel training, distributed training;5. Model optimization and on-device deployment; Large foundation models, stable diffusion-based image generation, large language model, image segmentation;6. Deep learning practices, housing price prediction, visual classification, text analysisTeaching PlanWeeks    Course Topics1    Introduction, logistics, a simple machine learning example.2    Basic vector, matrix, and tensor operations. Introduction to Numpy library.3    1D and 2D signals. Image, audio, text, video, and sequential data representation. Introduction to Scipy, matplotlib and Pytorch.4    Network structure, multi-layer perception, convolutional neural networks, and recurrent neural network.5    Deep learning practice: housing price prediction (Boston House Dataset)6    Data preparation and data loading optimization7    Deep learning practice: visual classification (Fashion MNIST dataset)8    Parallel training, data parallelism, multi-GPU training, distributed training.9    Deep learning practice: text analysis (sentiment analysis on an IMDB dataset)10    Model optimization and on-device deployment.11    Usage of large foundation models: stable diffusion-based image generation, large language model, image segmentation.12    Project presentation and summary  ", "required_readings": "There is no textbook that can satisfy the needs of this course. The course contents will be organized in the form of lecture notes, as well as a list of recommended readings. ", "recommended_readings": "1. Pytorch tutorial: https://pytorch.org/tutorials/beginner/basics/intro.html2. Tensorflow tutorial: https://www.tensorflow.org/tutorials3. Numpy tutorial: https://numpy.org/doc/stable/user/absolute_beginners.html ", "terms": {"2025-26 Term 1": {"--LEC (3748)": {"startTimes": ["18:30"], "endTimes": ["21:30"], "days": [1], "locations": ["Yasumoto Int'l Acad Park LT5"], "instructors": ["Professor XUE Tianfan"], "meetingDates": ["1/9", "8/9", "15/9", "22/9", "29/9", "6/10", "13/10", "20/10", "27/10", "3/11", "10/11", "17/11", "24/11"]}}}, "assessments": {"Homework or assignment": "60", "Project": "40"}}, {"code": "5703", "title": "Emerging Technologies in Artificial Intelligence", "career": "Postgraduate - Taught", "units": "3.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Div of Engineering", "requirements": "For students in MSc Artificial Intelligence;Pre-requisites: AIMS5701 and AIMS5702", "description": "This course introduces emerging and enabling technologies in artificial intelligence to solve real-world problems in a various daily and industrial application. The course will offer a number of research or topical seminars, given by research or industry experts, to let the students keep abreast of the trends of the development in artificial intelligence technologies. Moreover, the course will further discuss the advantages and limitations of the new technologies as well as the ethical issues induced from AI applications.", "outcome": "Upon successful completion of this course, students will be able to:1.    learn the up-to-date research trends and development of artificial intelligence technologies in various daily and industrial applications.2.    understand the advantages and limitations of the new technologies.3.    understand the ethical issues of AI applications.", "syllabus": "Major Concepts and Topics to be Covered1. Research or topical seminars of various new AI technologies2. Advantages and limitations of new technologies3. Ethical issues of AI applicationsTeaching PlanWeeks    Course TopicsWeek 1-6    Research or topical seminars of the new AI technologies, followed by discussion session.Week 7-9    Ethical issue of AI technologies and applications Week 10-12    Project presentations", "required_readings": "Readings will be recommended by the course teacher.", "recommended_readings": "Readings will be recommended by the course teacher.", "terms": {"2025-26 Term 1": {"--LEC (2214)": {"startTimes": ["9:30", "18:30"], "endTimes": ["11:15", "20:30"], "days": [4, 2], "locations": ["Yasumoto Int'l Acad Park LT3", "Lady Shaw Bldg LT1"], "instructors": ["Professor LIN Xiaojun", "Professor LIN Xiaojun"], "meetingDates": ["2/9", "4/9", "9/9", "11/9", "16/9", "18/9", "23/9", "25/9", "30/9", "2/10", "9/10", "14/10", "16/10", "21/10", "23/10", "28/10", "30/10", "4/11", "6/11", "11/11", "13/11", "18/11", "20/11", "25/11", "27/11"]}}}, "assessments": {"Others": "30", "Project": "30", "Participation": "40"}}, {"code": "5710", "title": "Deep Learning Fundamentals and Theories", "career": "Postgraduate - Taught", "units": "3.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Div of Engineering", "requirements": "For students in MSc Artificial Intelligence; Not for students who have taken ELEG5491 or ELEG5760 or CMSC5743 or AIST4010", "description": "This course provides an introduction to deep learning. Students taking this course will learn the basics, theories, models, algorithms, implementation, and recent progress of deep learning, and obtain empirical experience on the designing, training, and understanding of deep neural networks. The course starts by establishing the relations between classical machine learning models and deep learning models, followed by the introduction of representative neural network architectures, optimization techniques for training deep neural networks, implementation of large-scale deep learning, multi-task deep learning, transferred deep learning, recurrent neural networks, transformer networks, applications of deep learning to language processing and computer vision, and understanding why deep learning works. The students taking are expected to have basic background knowledge on calculus, linear algebra, probability, statistics, and random process as a prerequisite.", "outcome": "Upon successful completion of this course, students will be able to:1. Understand the fundamental concepts, theories and algorithms of deep learning. 2. Understand the relations between conventional machine learning models and deep learning models.3. Understand the principles of designing different deep neural networks for various applications.4. Implement and train deep neural networks with deep learning toolboxes.Understand why deep learning outperforms other machine learning methods when the training data is in large scale.5. Obtain empirical experience of designing and training deep models in practical applications.", "syllabus": "Week 1:    Revisit and relations between conventional ML and DL modelsWeek 2:    Multi Layer Perceptron IWeek 3:    Multi-layer Perceptron II & Convolutional Neural Networks IWeek 4:    Convolutional Neural Networks IIWeek 5:    Optimization of deep neural networksWeek 6:    Network structures/QuizWeek 7:    Recurrent neural network & Transformer network IWeek 8:    Recurrent neural network & Transformer network IIWeek 9:    Advanced ArchitecturesWeek 10:    Generative networksWeek 11:    Advanced topics IWeek 12:    Advanced topics II", "required_readings": "To be provided by the course teacher.", "recommended_readings": "1. Y. Bengio, I. Goodfellow, and A. Courville, “Deep Learning,” Book in preparation for MIT press. 2. Y. Bengio, “Learning Deep Architectures for AI,” Foundations and Trends in Machine Learning, 2009. 3. Yoshua Bengio and Aaron Courville, “Pascal Vincent, Representation Learning: A Review and New Perspectives”, Arxiv, 2012. 4. G. E. Hinton et al., “A Fast Learning Algorithm for Deep Belief Nets,” Trends in Cognitive Sciences, Vol. 11, No. 10, 2007. 5. G. E. Hinton, “Learning Multiple Layers of Representation,” Trends in Cognitive Sciences, Vo;. 11, No. 10, 2007. 6. Richard, O. Duda, Peter E. Hart, and David G. Stork, “Pattern Classification,” second edition, New York, NY: Wiley-Interscience, 2000. 7. Christopher M. Bishop, “Pattern Recognition and Machine Learning,” Springer 2006. 8. More papers to be distributed in class", "terms": {"2025-26 Term 2": {"--LEC (3729)": {"startTimes": ["18:30"], "endTimes": ["21:30"], "days": [2], "locations": ["Wong Foo Yuan Bldg LT4"], "instructors": ["Professor LI Hongsheng"], "meetingDates": ["6/1", "13/1", "20/1", "27/1", "3/2", "10/2", "24/2", "3/3", "10/3", "17/3", "24/3", "31/3", "14/4"]}}}, "assessments": {"Essay test or exam": "55", "Homework or assignment": "45"}}, {"code": "5720", "title": "Computer Vision and Pattern Recognition", "career": "Postgraduate - Taught", "units": "3.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Div of Engineering", "requirements": "For students in MSc Artificial Intelligence; Not for students who have taken ENGG5104 or CMSC5711 or CSCI5280 or MAEG5720", "description": "Computer vision enables computers and systems to derive high-level understanding from digital images, videos and other visual inputs.This course will cover fundamental knowledge and advanced topics in image processing, computer vision and pattern recognition, including image acquisition, processing and transformations, feature detection, segmentation, motion estimation, stereo vision, 3D reconstruction and modeling, scene detection and classification, object alignment and tracking, face detection and recognition, color image processing and digital photography. Machine learning and deep learning algorithms for computer vision and their system applications will be discussed.", "outcome": "Upon successful completion of this course, students will be able to:1. Understand how mathematical and scientific concepts are applied in image processing and computer vision2. Understand how to extract information and features such as point, lines, corners and colour information from images3. Understand the process of retrieving 3-D shapes and motions from image data and the methods of object tracking 4. Perform image transformation in the color and spatial domains 5. Understand basic knowledge and algorithms in computer vision6.  Identify, formulate and develop practical and innovative image processing and computer vision applications to solve real world problems.", "syllabus": "This course will cover fundamental knowledge and advanced topics in image processing, computer vision and pattern recognition, including image acquisition, processing and transformations, feature detection, segmentation, motion estimation, stereo vision, 3D reconstruction and modeling, scene detection and classification, object alignment and tracking, face detection and recognition, color image processing and digital photography. Machine learning and deep learning algorithms for computer vision and their system applications will be discussed.Teaching PlanWeeks    Course Topics1    Introduction, image formation, representation and geometry2    Image processing and transformations, filtering, segmentation, clustering3    Feature extractions and object recognition4    3D image representation and reconstruction, stereo vision, optical flow, 3D imaging systems5    Multi-view geometry, feature matching, surface fitting and active ranging6    Machine learning for computer vision7    Neural networks and deep learning for computer vision8    Face detection and recognition9    Motion analysis and activity recognition, object tracking10    Image rendering, medical imaging11    Color imaging and digital photography12    Applications of computer vision systems", "required_readings": "The course instructor will recommend the relevant textbook. The course contents will be organized in the form of lecture notes, as well as a list of recommended readings. ", "recommended_readings": "1.    Computer Vision: A Modern Approach, 2nd Edition, Forsyth & Ponce, Pearson, 2011.2.    Digital Image Processing, 3rd Edition, Gonzalez and Woods, Prentice Hall, 2008.3.    Multiple View Geometry in Computer Vision, 2nd Edition, Richard Hartley and Andrew Zisserman, Cambridge University Press, March 2004.", "terms": {"2025-26 Term 2": {"--LEC (3716)": {"startTimes": ["18:30"], "endTimes": ["21:30"], "days": [4], "locations": ["Yasumoto Int'l Acad Park 405"], "instructors": ["Professor OUYANG Wanli"], "meetingDates": ["8/1", "15/1", "22/1", "29/1", "5/2", "12/2", "26/2", "5/3", "12/3", "19/3", "26/3", "2/4", "9/4", "16/4"]}}}, "assessments": {"Homework or assignment": "30", "Others": "30", "Project": "40"}}, {"code": "5730", "title": "Natural Language Processing", "career": "Postgraduate - Taught", "units": "3.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Div of Engineering", "requirements": "For students in MSc Artificial Intelligence;Not for students who have taken CSCI5640", "description": "Natural language processing (NLP) focuses on system development that allows human-computer interaction using linguistic and textual data. This course introduces the main concepts of the natural language processing tasks, such as parsers, syntax, semantics, discourse, language modeling, machine translation, text generation and summarization, multilinguality and multimodality, etc. It also covers the research methods, including statistical and stochastic learning methods, expectation maximization algorithms and deep learning models. It will further discuss the applications and technological advances in large language models.", "outcome": "Upon successful completion of this course, students will be able to:1. Understand the role of NLP in human computer interaction using linguistic and textual data2. Understand the textural information processing techniques to meet real-world needs 3. Understand the set of key machine learning and statistical methods which are widely used in NLP4. Understand the applications and technological advances in language models5. Implement practical applications of NLP using common tools such as NLTK, Pytorch and Dynet", "syllabus": "This course introduces the main concepts of the natural language processing tasks, such as parsers, syntax, semantics, discourse, language modeling, machine translation, text generation and summarization, multilinguality and multimodality, etc. It also covers the research methods, including statistical and stochastic learning methods, expectation maximization algorithms and deep learning models. It will further discuss the applications and technological advances in large language models.Weeks    Course Topics1    Introduction to NLP 2    Text Classification, logistic regression, parsing3    Syntax, semantics, word vectors and vector semantics4    Statistical and stochastic learning methods: hidden Markov models, trees, conditional random fields, 5    N-gram models, expectation maximization algorithms, latent variable models6    Language modeling, RNN, attention, transformer, BERT, GPT7    Computational graphs and sequence-to-sequence models8    Pretrained language models, fine-tuning and prompting9    Text generation and summarization10    Multilinguality and multimodality11    NLP system applications: question answering, conversational systems, ChatGPT12    Advances in large language models", "required_readings": "The course instructor will recommend the relevant textbook. The course contents will be organized in the form of lecture notes, as well as a list of recommended readings. ", "recommended_readings": "1.    Dan Jurafsky and James H. Martin. Speech and Language Processing (3rd ed.), Pearson, 2023.2.    James Allen. Natural Language Understanding (2nd ed.), Pearson, 1994.3.    Alexander Clark, Chris Fox, and Shalom Lappin. The Handbook of Computational Linguistics and Natural Language Processing, Wiley-Blackwell, 2013.", "terms": {"2025-26 Term 2": {"--LEC (2238)": {"startTimes": ["17:30", "10:30"], "endTimes": ["18:15", "13:15"], "days": [2, 4], "locations": ["William M W Mong Eng Bldg LT", "Lady Shaw Bldg LT1"], "instructors": ["Professor WANG Liwei", "Professor WANG Liwei"], "meetingDates": ["6/1", "8/1", "13/1", "15/1", "20/1", "22/1", "27/1", "29/1", "3/2", "5/2", "10/2", "12/2", "24/2", "26/2", "3/3", "5/3", "10/3", "12/3", "17/3", "19/3", "24/3", "26/3", "31/3", "2/4", "9/4", "14/4", "16/4"]}}}, "assessments": {"Homework or assignment": "30", "Others": "30", "Project": "40"}}, {"code": "5740", "title": "Generative Artificial Intelligence", "career": "Postgraduate - Taught", "units": "3.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Div of Engineering", "requirements": "For students in MSc Artificial Intelligence;Not for students who have taken AIST5030 or SEEM5030", "description": "Generative models are widely used in different applications of artificial intelligence. This course covers mathematical and computational foundations of generative modeling, as well as applications in engineering, design, science, and the arts. The topics include foundation models, deep learning models, variational autoencoders, generative adversarial networks, autoregressive models such as Transformers, neural text decoding, prompt programming, and detection of generated content. Applications to language models and multimodality system, as well as social responsibility in generative modeling will also be discussed.", "outcome": "Upon successful completion of this course, students will be able to:1. Understand the concepts underlying generative AI2. Understand the principles of various generative AI models and applications3. Develop the practical skills to design and implement generative models to various domains 4. Develop the awareness of ethical and social responsibility associated with generative AI", "syllabus": "Teaching PlanWeeks    Course Topics1    Introduction to generative AI2    Deep learning models 3    Autoregressive models, sequence-to-sequence model4    Variational autoencoders5    Generative adversarial networks6    Flow-based models, diffusion models7    Language models and prompt engineering, neural text decoding, detection of generated content8    Chat-GPT and conversational AI9    Speech, audio, music generation10    Image and video generation11    Generative AI for non-engineering applications12    Ethical and social implications", "required_readings": "The course instructor will recommend the relevant textbook. The course contents will be organized in the form of lecture notes, as well as a list of recommended readings. ", "recommended_readings": "1.    I. Goodfellow, Y. Bengio, and A. Courville, Deep Learning, MIT Press, 2016 2.    OpenAI Blog (https://openai.com/blog/): This is the official blog of OpenAI, where you can find the latest news and research on GPT and other AI models.3.    The Gradient (https://thegradient.pub/): A great blog that covers recent advances in AI and machine learning, including GPT and other generative models.", "terms": {"2025-26 Term 2": {"--LEC (2240)": {"startTimes": ["18:30"], "endTimes": ["21:30"], "days": [3], "locations": ["William M W Mong Eng Bldg 407"], "instructors": ["Professor CHENG Yu"], "meetingDates": ["7/1", "14/1", "21/1", "28/1", "4/2", "11/2", "25/2", "4/3", "11/3", "18/3", "25/3", "1/4", "8/4", "15/4"]}}}, "assessments": {"Homework or assignment": "30", "Others": "20", "Project": "50"}}, {"code": "5760", "title": "Technology Commercialization of AI Innovations", "career": "Postgraduate - Taught", "units": "3.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Div of Engineering", "requirements": "For students in MSc Artificial Intelligence; or\nFor all MSc Programmes in Faculty of Engineering;Pre-requisites: AIMS5701 and AIMS5702;Exclusion: CMSC5730 or ENGG3802/3803/5700 or ESTR3502 or FTEC5570 or IEMS5712 or SEEM3450 or IERG5340 or ROSE5790", "description": "Artificial Intelligence has brought significant impact on all facets of human activities, including personal, industrial, and societal. This course aims at challenging the students to unleash their innovative power to create new AI applications and services that may lead to the formation of new startups in the Great Bay Area. The course will introduce a market-oriented model of thinking to complement the technology-oriented model, thus enabling the students to develop an all-rounded thinking pattern and get prepared to join the commercial world.The course adopts the Lean Start-Up Approach to Entrepreneurship to guide the students to go through a rigorous business development process, consisting of the following steps.1. Define their business idea.2. Design their products or services.3. Develop their Minimal Viable Products (MVP) to illustrate their designs.4. Devise their business strategies to reach their target markets.5. Develop the business plan to explain their ideas clearly.This is a highly interactive and hands-on to help project teams to refine their business plans. The students should have the knowledge in machine learning and deep learning.", "outcome": "Upon successful completion of this course, students will be able to:1.    Develop a market-oriented model of thinking that will complement their familiar technology-oriented model of thinking in order to better prepare them for entering into the commercial world.2.    Unleash their innovative power to develop one or more marketable applications (products or services) based on the AI technologies they learned.3.    Develop execution plans for these potential products/services based on the Lean Start-Up Approach.4.    Produce slide decks to introduce viable business models for these products/services.5.    Potentially, form one or more business development team(s) and create real opportunities to launch startups in HKSTP or other incubators in the Great Bay Area.", "syllabus": "(Week 1) Lecture 1: Technology Commercialization – Introduce the Lean Start Up Approach.(Week 2) Lecture 2: Lean Canvas – How shall you create a business idea?(Week 3) Discussion 1: What is your business idea?(Week 4) Lecture 3: Market Opportunities – Where is your target market?(Week 5) Lecture 4: Business Models – How shall you structure your business?(Week 6) Discussion 2: What do you really want to sell?(Week 7) Lecture 5: Minimal Viable Product (MVP) – What shall you build?(Week 8) Discussion 3: How to build your MVP?(Week 9) Lecture 6: Team Formation – Who will you need to work with?(Week 10) Lecture 7: Business Plan – How can you develop a viable business plan to get investors’ interests?(Week 11) Discussion 4: How to make your business plan?(Week 12) Project Presentation", "required_readings": "1.    The Lean Start Up Methodology. URL: https://theleanstartup.com/principles.2.    The Lean Canvas. URL: https://www.leancanvas.com/.3.    Design Thinking in Entrepreneurship. URL: https://shabablab.com/blog/article/design-thinking-entrepreneurship/#:~:text=The%20design%20thinking%20process%20requires,very%20iterative%20instead%20of%20sequential.4.    Minimal Viable Product: A Step-to-Step Guide. URL: https://clearbridgemobile.com/planning-a-minimum-viable-product-a-step-by-step-guide/.5.    How to Make a Compelling Pitch Deck and Secure Funding? URL: https://maccelerator.la/en/blog/venture-capital/how-to-make-a-compelling-pitch-deck-and-secure-funding/?utm_source=mediars_deck.", "recommended_readings": "1.    Why Startups Fail: A New Roadmap for Entrepreneurial Success, by Tom Eisenmann (Currency, 2021).2.    Lean Business Model: Why the Lean Start-Up Changes Everything - A faster, smarter methodology for launching companies may make business plans obsolete by Steve Blank, Harvard Business Review (May 2013).3.    Tim Brown Urges Designers to Think Big. URL: https://www.youtube.com/watch?v=UAinLaT42xY. 4.    Adi Ignatius, “How Indra Nooyi Turned Design Thinking Into Strategy: An Interview with Pep-siCo’s CEO”, Harvard Business Review, Sep 2015. ", "terms": {"2025-26 Term 2": {"--LEC (3710)": {"startTimes": ["14:30"], "endTimes": ["17:15"], "days": [6], "locations": ["Wu Ho Man Yuen Bldg 404"], "instructors": ["Professor CHOI Wai Shan"], "meetingDates": ["10/1", "17/1", "24/1", "31/1", "7/2", "14/2", "28/2", "7/3", "14/3", "21/3", "28/3", "11/4", "18/4"]}}}, "assessments": {"Classwork": "15", "Homework or assignment": "60", "Presentation": "25"}}, {"code": "5761", "title": "From Business Plan to Investable AI Ventures", "career": "Postgraduate - Taught", "units": "3.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Div of Engineering", "requirements": "For students in MSc Artificial Intelligence; or \nFor all MSc Programmes in Faculty of Engineering;Pre-requisite: AIMS5760 or IEMS5712 or IERG5340;A team with AI application ideas for commercialization in mind", "description": "The course offers a unique blend of theory and practical application in transforming business ideas in artificial intelligence (AI) innovations into investable ventures, through holistic experiential learning experience. It empowers students with the strategies and communication skills needed to create compelling investment proposals, to convey their vision, articulate the unique value proposition of their AI solutions, and demonstrate their understanding of market dynamics and competitive landscape. The students will learn the design thinking business remodeling approach and the efficient fundraising strategies to prepare for the compelling investment pitches and formalizing plans to attract funding. The course offers real-world pitching opportunities for the students to pitch their business plans persuasively to the genuine investors in the market, gaining experience that goes beyond traditional academic assessments.", "outcome": "Upon successful completion of this course, students will be able to:1.    Create viable investment proposals for AI-based business ventures.2.    Understand and apply principles of design thinking for AI applications in business model ideation.3.    Understand the key considerations and challenges in transforming a business plan into a viable venture.4.    Analyze and develop corporate strategies in different patent situations.5.    Understand and apply effective fundraising strategies.6.    Develop and present persuasive pitches to prospective investors and venture capitalists.", "syllabus": "Weeks    Course Topics1    Investment Proposal: -    Understanding what makes an effective investment proposal-    Difference between a business plan and an investment proposal-    Overview of key components2    Business Plans deep-dive remodeling:-    Detailed review of business plans and how to transform them into viable ventures-    Design Thinking principles for technological innovations business remodeling3    Fundraising Strategies-    Different fundraising strategies, including crowdfunding, angel investing, venture capital, and more-    Key decision factors in various stage of AI venture developments-    Valuation of ventures4    Overcoming Challenges in Transformation-    Overview of common challenges when transforming a business plan into a venture, and strategies to overcome them-    Stakeholders management and balance their interests-    Investors’ expectation in AI innovations5    Corporate Strategies in Different Patent SituationsUnderstanding the legal considerations when transitioning from a business plan to a venture, including IP rights, contracts, and more6    Discussion & Workshop: Understanding and Identifying Customers needs & Challenges for AI venture7    Discussion & Workshop: How to collaborate & communicate with commercial talents 8    Discussion & Workshop: Brainstorming Techniques for Disruptive Business Modeling9    Discussion & Workshop: Designing viable Business models & successful entrepreneurial team10    Discussion & Workshop: Investment pitching techniques & case studies11    Mock Pitching Session -    Students present their investment proposals and pitches for feedback.12    Investment pitch session to current investors panel", "required_readings": "•    \"Human + Machine: Reimagining Work in the Age of AI\" by Paul R. Daugherty and H. James Wilson•    Deal Terms – The Finer Points of Venture Capital (Deal Structure, Valuation, Terms Sheet, Stock Options and Getting VC Deals Done)  by Alex Wilmerding•    Designing for the digital age: How to create human-centered products and services, by Kim Goodwin•    Product design and development (Irwin Marketing), 6th Edition, by Karl Ulrich and Steven Eppinger", "recommended_readings": "• Venture Deals: Be Smarter Than Your Lawyer and Venture Capitalist by Brad Feld and Jason Mendelson, 2016• International Private Equity by Eli Talmor & Florin Vasvari• The design of everyday things, (revised and expanded edition), by Don Norman• Designing for the digital age: How to create human-centered products and services, by KimGoodwin• User experience revolution, by Paul Boag• Paper Prototyping: The Fast and Easy Way to Design and Refine User Interfaces, Carolyn Snyder• This is service design thinking: Basics-tools-cases, Kindle edition, by Mark Stickdorn• The handbook of service innovation, by Renu Agarwal, Göran Roos, Willem Selen• Service innovation: How to go from customer needs to breakthrough services, by Lance A.Bettencourt• Jon Kolko, 2015, Design Thinking comes of Age, Harvard Business Review Sep 2015• Tim Brown 2008, Design Thinking, IDEO HBR Design Thinking Review, June 2018• What is Design Thinking https://www.youtube.com/watch?v=Ee4CKIPkIik• Lean Startup Meets Design Thinking https://www.youtube.com/watch?v=bvFnHzU4_W8• Tim Brown urges designers to think big https://www.youtube.com/watch?v=UAinLaT42xY• Adi Ignatius, 2015, How Indra Nooyi Turned Design Thinking into Strategy: An Interview withPepsiCo’s CEO, Harvard Business Review Sep 2015• The Entrepreneur's Guide to Business Law by Constance E. Bagley• The Art of Startup Fundraising by Alejandro Cremades", "terms": {"2025-26 Summer Session": {"--LEC (1051)": {"startTimes": ["9:30", "13:30", "9:30"], "endTimes": ["12:15", "17:15", "12:30"], "days": [6, 6, 0], "locations": ["Yasumoto Int'l Acad Park 402", "Yasumoto Int'l Acad Park 402", "Yasumoto Int'l Acad Park 402"], "instructors": ["Professor CHAU Chi Wai", "Professor CHAU Chi Wai", "Professor CHAU Chi Wai"], "meetingDates": ["16/5", "17/5", "23/5", "24/5", "30/5", "31/5", "6/6", "7/6", "13/6", "14/6", "20/6", "21/6", "27/6", "28/6"]}}}, "assessments": {"Classwork": "15", "Presentation": "35", "Participation": "30", "Report": "20"}}, {"code": "5780", "title": "Artificial Intelligence Internship", "career": "Postgraduate - Taught", "units": "3.00", "grading": "Graded", "components": "Practicum", "campus": "Main Campus", "academic_group": "Div of Engineering", "requirements": "For students in MSc Artificial Intelligence", "description": "This course is designed to allow students to acquire a basic understanding and the skills of the practical aspects of the artificial intelligence area. During the internship, the student must attach to a company in a study-related position for no less than 12 weeks. The student will have an academic supervisor (as primary supervisor) and an industry co-supervisor from the company, both have the expertise to provide advice to the student. The student must submit a report summarizing the internship experience at the end of the internship. Additional presentation may be required by the hosting company.", "outcome": "Upon successful completion of this course, students will be able to:1.    Understand the impact of artificial intelligence in a global and societal context。2.    Use the techniques, skills, and modern engineering tools necessary for engineering practice appropriate to the degree discipline.", "syllabus": "This course is designed to allow students to acquire a basic understanding and the skills of the practical aspects of artificial intelligence area.  During the internship, the student must attach to a company in a study-related position for no less than 12 weeks.  The student will have an academic supervisor (as primary supervisor) and an industry co-supervisor from the company, both have the expertise to provide advice to the student.  To be qualified for award of the subject credit, the student must submit a report summarizing the internship experience at the end of the internship. Additional presentation may be required by the hosting company.", "required_readings": "Readings will be recommended by the project supervisor.", "recommended_readings": "Readings will be recommended by the project supervisor.", "terms": {"2025-26 Summer Session": {"-P01-PRA (1122)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["No Room Required"], "instructors": ["Staff"], "meetingDates": ["11/05/2026 - 03/08/2026"]}}}, "assessments": {"Others": "20", "Presentation": "40", "Report": "40"}}, {"code": "5790", "title": "Artificial Intelligence Project I", "career": "Postgraduate - Taught", "units": "3.00", "grading": "Graded", "components": "Project", "campus": "Main Campus", "academic_group": "Div of Engineering", "requirements": "For students in MSc Artificial Intelligence", "description": "The students will design, research and develop projects under the supervision of an academic staff in related area of artificial intelligence. At the end of the course, the students must give presentations to the academic and/or industry supervisors, and submit project reports detailing the findings and deliverables.", "outcome": "Upon successful completion of this course, students will be able to:1. Design and prototype a project in artificial intelligence 2. Understand and carry out basic project management3. Give a fluent technical presentation; and  4. Write a report detailing the findings and deliverables of the project.", "syllabus": "The courses design and prototype a research and/or development project under the supervision of an academic staff in any related area of artificial intelligence. At the end of the course, the student must give a presentation to the academic and/or industry supervisors, and submit a report detailing the findings and deliverables. Details will be provided by the academic supervisor.", "required_readings": "Readings will be recommended by the project supervisor.", "recommended_readings": "Readings will be recommended by the project supervisor.", "terms": {"2025-26 Term 2": {"-J01-PRJ (3688)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["No Room Required"], "instructors": ["Staff"], "meetingDates": ["05/01/2026 - 13/04/2026"]}}}, "assessments": {"Others": "30", "Presentation": "30", "Report": "40"}}, {"code": "5791", "title": "Artificial Intelligence Project II", "career": "Postgraduate - Taught", "units": "3.00", "grading": "Graded", "components": "Project", "campus": "Main Campus", "academic_group": "Div of Engineering", "requirements": "For students in MSc Artificial Intelligence; Pre-requisite: AIMS5790", "description": "The students will continue and further develop the project designs achieved in AIM5790 to address more functional and practical issues and make the projects more complete and sustainable. The projects will be supervised by an academic staff in related area of artificial intelligence. At the end of the course, the students must give presentations to the academic and/or industry supervisors, and submit project reports detailing the findings and deliverables.", "outcome": "Upon successful completion of this course, students will be able to:1. Design and prototype a project in artificial intelligence 2. Understand and carry out basic project management3. Give a fluent technical presentation; and  4. Write a report detailing the findings and deliverables of the project.", "syllabus": "The students will design, research and develop projects under the supervision of an academic staff in related area of artificial intelligence. At the end of the course, the students must give presentations to the academic and/or industry supervisors and submit project reports detailing the findings and deliverables.", "required_readings": "Readings will be recommended by the project supervisor.", "recommended_readings": "Readings will be recommended by the project supervisor.", "terms": {"2025-26 Summer Session": {"-J01-PRJ (1121)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["No Room Required"], "instructors": ["Staff"], "meetingDates": ["11/05/2026 - 22/06/2026"]}}}, "assessments": {"Others": "30", "Presentation": "30", "Report": "40"}}]