[{"code": "1001", "title": "The Beauty of Kunqu Opera", "career": "Undergraduate", "units": "2.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Fac Office of Arts", "requirements": "", "description": "(UGED1061 is double-coded with ARTS1001.)This course introduces students to the music, performance, literature and aesthetics of Kunqu opera in order to enhance their understanding of traditional Chinese culture, classical Chinese literature as well as performing arts. Selected scenes from Kunqu classics, such as The Peony Pavilion and The Palace of Eternal Youth will be analyzed and discussed before they are staged for appreciation. Under the teachers’ guidance, students will be able to experience the unity of song and dance as well as the artistic expression of emotions in the world of Kunqu opera.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "1002", "title": "From Tradition to Modernity: Selected Readings of 20th Century Chinese Culture", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Fac Office of Arts", "requirements": "", "description": "The course is designed as a sequel to ARTS1000 (Classics of Chinese Humanities: Selected Readings) by focusing on a number of representative texts by famous Chinese intellectuals and writers. They bear witness to the mental deliberations of a generation—or two generations—caught between the forces of tradition and modernity as they found their way through the thicket of source materials from both Chinese and Western cultural traditions. Each author chooses to confront the legacies of Chinese tradition—literary, cultural, and intellectual—by subjecting them to a new reevaluation from modern perspectives derived from their newly acquired knowledge and/or experience from the West. Their modes of analysis have set a new intellectual and scholarly benchmark for later generations. In short, these texts have become modern “classics” in their own right.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "1003", "title": "Introduction to Chinese Classics", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Fac Office of Arts", "requirements": "", "description": "This course aims at illustrating the relationship between Chinese classics texts and Chinese culture. Through discussions of important texts in Confucianism, Daoism and Buddhism, students can gain a deeper understanding of these philosophical schools and the underlying features of Chinese tradition, beliefs and values.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "1004", "title": "Introduction to Environmental Humanities: Debates in China", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Fac Office of Arts", "requirements": "", "description": "This course introduces to students the emerging field of environmental humanities with a particular focus on China. Human activities have been drastically transforming the ecosystem. How do we in the humanities understand the changing nature, live with pollution, and make sense of ecological deterioration? How do technology, capital and state intertwine and contribute to climate changes and environmental crises? How do people in the humanities engage with issues of sustainability and environmental justice in everyday life? This course introduces major concerns in the field of environmental humanities through the lens of China, the “World’s Factory” and the most populated country with the second largest economy, whose environmental challenges have great implications for the rest of the world. This course will first survey topics of scientific and technological intervention of our natural world in the Anthropocene era. It then looks at case studies of specific topics such as agricultural sustainability, waste management, water crisis, species extinction, and environmental justice. Each topic will contain one week discussion of the topic’s global manifestations and related debates in China, and one week’s introduction on humanities response to the issues. Students will be guided to develop critical understanding of our natural world and to develop innovative ideas and humanistic responses.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "1005", "title": "Introduction to Music and Philosophy", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "Classwork\nDiscussion\nLecture", "campus": "Main Campus", "academic_group": "Fac Office of Arts", "requirements": "", "description": "This course introduces music and philosophy as intersecting practices through which human beings give meaning to the world around them. By exploring philosophy through music and music through philosophy from cross-cultural perspectives, the course exposes students to a variety of ways that knowledge, existence, religion, ethics, politics, culture, and sound converge.Rather than a comprehensive introduction to the fields of philosophy and music, this course uses a topical approach to explore several themes in these fields through discussion of selected musical examples and readings presented within an interdisciplinary framework. No background in music or philosophy is assumed or required.", "outcome": "Students will: Become familiar with a broad range of musical and philosophical traditions from diverse geographical locations and historical eras Acquire global perspectives on the arts and humanities, and learn to situate their own perspectives and experiences within a global context Develop fundamental critical thinking and research skills—how to read, listen, think, and write critically about music and philosophy Cultivate an appreciation of the role of music and philosophy in the development of various forms of human community Appreciate the interdisciplinary nature of musicology, philosophy, and humanities in general", "syllabus": "Unit 1: Classical Traditions of Greece and ChinaUnit 2: Religion, Music, and Philosophy Unit 3: Music and Contemporary Thought ", "required_readings": "Students will read selected excerpts from the following works:Plato. Five Dialogues. Translated by G. M. A. Grube, Hackett Publishing Co., 2002.Plato. The Republic of Plato. Edited by James Adam, Cambridge University Press, 1963.Cook, Scott. “‘Yue Ji’ 樂記 -- Record of Music: Introduction, Translation, Notes, and Commentary.” Asian Music, vol. 26, no. 2, Apr. 1995, pp. 1–96. Feld, Steven. Sound and Sentiment: Birds, Weeping, Poetics, and Song in Kaluli Expression. University of Pennsylvania Press, 1990.Cassirer, Ernst. The Philosophy of Symbolic Forms. Routledge, 2019.Levi-Strauss, Claude. “The Structural Study of Myth.” The Journal of American Folklore, vol. 68, no. 270, Oct. 1955, pp. 428–444. Hildegard of Bingen. Hildegard of Bingen’s Book of Divine Works with Letters and Songs. Edited by Matthew Fox, Bear & Co., 1987.Aslan, Reza. No God but God: The Origins, Evolution, and Future of Islam. Random House, 2011.Rūmī, Jalāl al-Dīn. Rumi: In the Arms of the Beloved. Translated by Jonathan Star, Penguin Group, 2008.Kant, Immanuel. Critique of the Power of Judgment. Edited by Paul Guyer et al., Cambridge University Press, 2009.Burke, Edmund. Philosophical Inquiry into the Origin of Our Ideas of the Sublime and Beautiful. Simon & Brown, 2018.Zhao, Tingyang. “A Political World Philosophy in Terms of All-Under-Heaven (Tianxia).” Diogenes, vol. 56, no. 1, Feb. 2009, pp. 5–18. Lyotard, Jean-François. The Postmodern Condition: A Report on Knowledge. University of Minnesota Press, 1984.In addition to these texts, in-depth listening and discussion of musical examples will be a core element of the class, and students will be required to listen to assigned musical examples outside of class.", "recommended_readings": "", "terms": {"2022-23 Term 2": {"--LEC (5735)": {"startTimes": ["10:30"], "endTimes": ["13:15"], "days": [2], "locations": ["Sino Building UG06"], "instructors": ["Professor Adam Joseph KIELMAN, \n\nProfessor Gregory Scott MOSS"], "meetingDates": ["10/1", "17/1"]}}}, "assessments": {"Attendance": "10", "Examination": "40", "Others": "50"}}, {"code": "6000", "title": "Reconnections: Studying China across humanistic disciplines", "career": "Postgraduate - Research", "units": "3.00", "grading": "Graded", "components": "Practicum", "campus": "Main Campus", "academic_group": "Faculty Office of Arts (PG)", "requirements": "", "description": "The state of humanities in academia the world over is in crisis. Part of the crisis is caused by global trends toward financial and technological capitalism, but the other part of the problem has to be sought in the humanistic disciplines themselves. Over-specialization in research, fragmentation among and within disciplines, the pressure of utilitarian goals (such as grant-getting for faculty promotion and practical job-orientation for students) are but some of the manifestations obvious to all. How to remedy the situation? Short of an institutional overhaul, we might begin from our own academic base, humanities departments under the Faculty of Arts.From an academic point of view, over-specialization in the humanities departments results in scholars working in narrow and isolated fields without interaction with colleagues in other departments and fields. The study of China also suffers from such an academic trend, which results in fragmentary studies of narrowly defined topics that fail to connect with each other and with the larger background. A further problem, particularly evident in some humanities fields, is the over-reliance on Western theory, which is applied to Chinese data without reflection or mediation. Certain theoretical excesses, as exemplified in the work of Michel Foucault and other poststructuralist theorists, have led to a general distrust of the human subject itself. Indeed, even the word “humanities” has lost its meaning. This seminar is designed to explore new ways of making “connections” or “reconnections” across various disciplines and theoretical domains, it is broadly-based by design and all-inclusive in content. It is also intended to serve as a general forum for faculty-student discussion so as to provide a stimulus for humanistic scholarship and future research.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}]