[{"code": "1001", "title": "The Beauty of Kunqu Opera", "career": "Undergraduate", "units": "2.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Fac Office of Arts", "requirements": "", "description": "This course introduces students to the music, performance, literature and aesthetics of Kunqu opera in order to enhance their understanding of traditional Chinese culture, classical Chinese literature as well as performing arts. Selected scenes from Kunqu classics, such as The Peony Pavilion and The Palace of Eternal Youth will be analyzed and discussed before they are staged for appreciation. Under the teachers’ guidance, students will be able to experience the unity of song and dance as well as the artistic expression of emotions in the world of Kunqu opera.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "1002", "title": "From Tradition to Modernity: Selected Readings of 20th Century Chinese Culture", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Fac Office of Arts", "requirements": "", "description": "The course is designed as a sequel to ARTS1000 (Classics of Chinese Humanities: Selected Readings) by focusing on a number of representative texts by famous Chinese intellectuals and writers. They bear witness to the mental deliberations of a generation—or two generations—caught between the forces of tradition and modernity as they found their way through the thicket of source materials from both Chinese and Western cultural traditions. Each author chooses to confront the legacies of Chinese tradition—literary, cultural, and intellectual—by subjecting them to a new reevaluation from modern perspectives derived from their newly acquired knowledge and/or experience from the West. Their modes of analysis have set a new intellectual and scholarly benchmark for later generations. In short, these texts have become modern “classics” in their own right.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "1003", "title": "Introduction to Chinese Classics", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Fac Office of Arts", "requirements": "", "description": "This course aims at illustrating the relationship between Chinese classics texts and Chinese culture. Through discussions of important texts in Confucianism, Daoism and Buddhism, students can gain a deeper understanding of these philosophical schools and the underlying features of Chinese tradition, beliefs and values.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "1005", "title": "Introduction to Music and Philosophy", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "Classwork\nDiscussion\nLecture", "campus": "Main Campus", "academic_group": "Fac Office of Arts", "requirements": "", "description": "This course introduces music and philosophy as intersecting practices through which human beings give meaning to the world around them. By exploring philosophy through music and music through philosophy from cross-cultural perspectives, the course exposes students to a variety of ways that knowledge, existence, religion, ethics, politics, culture, and sound converge.Rather than a comprehensive introduction to the fields of philosophy and music, this course uses a topical approach to explore several themes in these fields through discussion of selected musical examples and readings presented within an interdisciplinary framework. No background in music or philosophy is assumed or required.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "1007", "title": "Creative Cities and Urban Cultural Life", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Fac Office of Arts", "requirements": "", "description": "Creative economy and cultural industries have been considered crucial strategies for driving the urban development of global cities. The dynamic landscape of the global cultural scene, where culture converges with the economy, community, heritage, and innovative technologies, has created an impetus for many cities to adopt innovative approaches in utilising urban spaces and cultural resources, enabling citizens to vividly reimagine their urban and cultural life. These approaches are envisioned as and manifested in the form of the development of large-scale urban regions and city clusters, where major cultural facilities such as museums, art districts, performance venues, and festivals significantly contribute to social well-being and intercultural dialogue.This course is designed to provide students with an opportunity to explore the interface between culture, urban space, and the economy with an eye towards the radically changing cultural landscape of Hong Kong. By offering students both theoretical knowledge and firsthand field experience, this course examines museums, galleries, and various cultural institutions as exemplary cases of how different forms of cultural activities can be turned into powerhouses of creative synergies and economic growth. By the end of the course, students will have gained insight into the complex relationships between the emerging phenomenon of creative cities and urban cultural life, as well as heritage and Chinese culture.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "1008", "title": "Take on Hong Kong: The Revitalisation and Interpretation of Hong Kong's Cultural Heritage", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "Field Studies/Field-trip\nLecture", "campus": "Main Campus", "academic_group": "Fac Office of Arts", "requirements": "", "description": "This course explores cultural heritage definitions and relevant conceptualisations in the local context. It introduces the historical development of cultural heritage in the contemporary world. It then further discusses the current legal and policy framework of local heritage selection and conservation. It requires the students to reflect on what heritage is and how heritage shall be selected and defined. Through various local case studies, students will explore the social relation between cultural heritage and the local community. They will debate how cultural heritage shall be interpreted from a local perspective but could be operated sustainably.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "6000", "title": "Reconnections: Studying China across humanistic disciplines", "career": "Postgraduate - Research", "units": "3.00", "grading": "Graded", "components": "Practicum", "campus": "Main Campus", "academic_group": "Faculty Office of Arts (PG)", "requirements": "", "description": "The state of humanities in academia the world over is in crisis. Part of the crisis is caused by global trends toward financial and technological capitalism, but the other part of the problem has to be sought in the humanistic disciplines themselves. Over-specialization in research, fragmentation among and within disciplines, the pressure of utilitarian goals (such as grant-getting for faculty promotion and practical job-orientation for students) are but some of the manifestations obvious to all. How to remedy the situation? Short of an institutional overhaul, we might begin from our own academic base, humanities departments under the Faculty of Arts.From an academic point of view, over-specialization in the humanities departments results in scholars working in narrow and isolated fields without interaction with colleagues in other departments and fields. The study of China also suffers from such an academic trend, which results in fragmentary studies of narrowly defined topics that fail to connect with each other and with the larger background. A further problem, particularly evident in some humanities fields, is the over-reliance on Western theory, which is applied to Chinese data without reflection or mediation. Certain theoretical excesses, as exemplified in the work of Michel Foucault and other poststructuralist theorists, have led to a general distrust of the human subject itself. Indeed, even the word “humanities” has lost its meaning. This seminar is designed to explore new ways of making “connections” or “reconnections” across various disciplines and theoretical domains, it is broadly-based by design and all-inclusive in content. It is also intended to serve as a general forum for faculty-student discussion so as to provide a stimulus for humanistic scholarship and future research.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "6002", "title": "Advanced Studies in the Humanities", "career": "Postgraduate - Research", "units": "3.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Faculty Office of Arts (PG)", "requirements": "For students in Research Postgraduate Programmes under Faculty of Arts", "description": "This course provides an opportunity for students to be exposed to current developments in specific areas of the Humanities. The topics vary according to the research expertise of the staff or visiting academics.Course content and format is determined by the instructor(s).Students are allowed to take the above course more than once and gain the units each time they pass the course. However, students cannot take courses with the same course code more than once in a single term.", "outcome": "1. Acquire critical familiarity with the issues discussed.2. Analyze and critically interpret some significant primary texts in the Humanities chosen by the course instructor.", "syllabus": "The syllabus and assessment type may vary according to the teaching staff and the topic selected. Please refer to the course outline for details.", "required_readings": "To be provided by the instructor concerned. The reading list varies depending of the course teacher and the topics selected.", "recommended_readings": "To be provided by the instructor concerned. The reading list varies depending of the course teacher and the topics selected.", "terms": {"2024-25 Term 1": {"--LEC (4422)": {"startTimes": ["14:30"], "endTimes": ["17:15"], "days": [4], "locations": ["Wong Foo Yuan Bldg 107B"], "instructors": ["Staff"], "meetingDates": ["5/9", "12/9", "19/9", "26/9", "3/10", "10/10", "17/10", "24/10", "31/10", "7/11", "14/11", "21/11", "28/11"]}}, "2024-25 Term 2": {"--LEC (4461)": {"startTimes": ["14:30"], "endTimes": ["17:15"], "days": [4], "locations": ["Esther Lee Bldg 204"], "instructors": ["Staff"], "meetingDates": ["9/1", "16/1", "23/1", "6/2", "13/2", "20/2", "27/2", "6/3", "13/3", "20/3", "27/3", "3/4", "10/4", "17/4"]}}}}, {"code": "7001", "title": "Performing Public Humanities", "career": "Postgraduate - Research", "units": "3.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Faculty Office of Arts (PG)", "requirements": "For students enrolled in Research Postgraduate Programmes in the Faculty of Arts.", "description": "Performing Public Humanities explores the ongoing questions and stakes of cultivating a public-facing humanities today, with a focus on performance as advocacy and action. As such, this course examines public humanities through performance, and simultaneously highlights the work of universities and cultural nonprofits across a variety of contexts, collaborations, and communities. RPg students come together for co-creative research that crisscrosses performance and public human inquiry, with the aim of fostering socially engaged thinking that cuts across disciplinary modes of interrogation.This course does not require prior performing experience or knowledge.", "outcome": "Students who complete this course will be able to: Initiate and lead discussions about cultivating a public-facing humanities today. Examine public human inquiry through multiple understandings and perspectives of performance. Foster and facilitate socially engaged thinking in and across universities and cultural nonprofits.", "syllabus": "I. Contexts “Public humanities”: current approaches, theories, praxes “Performance” as advocacy and action “Social engagement” across disciplines and practices Performing public human inquiry: student-led seminar III. Collaborations Performing public humanities: collaborations and divergence Themed debate, based on assigned readings and prepared case studies focusing on universities and cultural nonprofits Experiential activity: participating and observing an open rehearsal of an LGBTQ+ voice ensemble or another local civic musical group Performing public human inquiry: student-led seminar IIIII. Communities Performing public humanities: communities and individuals Themed debate, based on assigned readings and prepared case studies focusing on universities and cultural nonprofits Experiential activity: co-curating a grassroot outreach program Performing public human inquiry: student-led seminar III", "required_readings": "Bate, Jonathan, ed. 2014. The Public Value of the Humanities. London: Bloomsbury. Conquergood, Dwight. 2013. “Beyond the Text: Toward a Performative Cultural Politics.” In Cultural Struggles: Performance, Ethnography, Praxis (edited and with a critical introduction by E. Patrick Johnson), 47–63. Ann Arbor, MI: University of Michigan Press. Knowles, Ric. 2017. Performing the Intercultural City. Ann Arbor, MI: University of Michigan Press. Kondo, Dorinne. 2018. Worldmaking: Race, Performance, and the Work of Creativity. Durham, NC: Duke University Press. Leonard, Sophia, Benjamin Reiss, Víctor Velázquez Antonio, and Makenzie Renee Fitzgerald. 2020. “Public Humanities in the Reconstructed University.” American Literature 92, no. 4: 781–790. MacLachlan, Heather. 2020. Singing Out: GALA Choruses and Social Change. Ann Arbor, MI: University of Michigan Press. Rai, Shirin M., Milija Gluhovic, Silvija Jestrovic, and Michael Saward, ed. 2021. The Oxford Handbook of Politics and Performance. New York: Oxford University Press. Smulyan, Susan, ed. 2020. Doing Public Humanities. London: Routledge.----------. 2022. “Why Public Humanities?” Daedalus 151, no. 3 (Summer): 124–137.Sommer, Doris. 2014. The Work of Art in the World: Civic Agency and Public Humanities. Durham, NC: Duke University Press.", "recommended_readings": "André, Naomi. 2018. Black Opera: History, Power, Engagement. Champaign, IL: University of Illinois Press. Berkowitz, Carin, and Matthew Gibson. 2022. “Reframing the Public Humanities: The Tensions, Challenges & Potentials of a More Expansive Endeavor.” Daedalus 151, no. 3 (Summer): 68–81. Brooks, Peter, and Hilary Jewett, ed. 2014. The Humanities and Public Life. New York: Fordham University Press. Fauser, Annegret, and Michael A. Figueroa, ed. 2020. Performing Commemoration: Musical Reenactment and the Politics of Trauma. Ann Arbor, MI: University of Michigan Press. Hahn, Tomie. 2021. Arousing Sense: Recipes for Workshopping Sensory Experience. Champaign, IL: University of Illinois Press. Krmpotich, Cara. 2016. “Public Humanities as Third Space: Memory, Meaning-Making and Collections and the Enunciation of ‘We’ in Research.” University of Toronto Quarterly 85, no. 4 (Fall): 82–92. Looser, Diana. 2021. Moving Islands: Contemporary Performance and the Global Pacific. Ann Arbor, MI: University of Michigan Press. Mullen, Mary L. 2016. “Public Humanities’ (Victorian) Culture Problem.” Cultural Studies 30, no. 2: 183–204. Overend, David. 2023. Performance in the Field: Interdisciplinary Practice-as-Research. Cham: Palgrave Macmillan. Schwan, Anne, and Tara Thomson, ed. 2022. The Palgrave Handbook of Digital and Public Humanities. Cham: Palgrave Macmillan.", "terms": {"2024-25 Term 2": {"--LEC (1203)": {"startTimes": ["10:30"], "endTimes": ["13:15"], "days": [4], "locations": ["Esther Lee Bldg 204"], "instructors": ["Professor LIAO Yvonne"], "meetingDates": ["9/1", "16/1", "23/1", "6/2", "13/2", "20/2", "27/2", "6/3", "13/3", "20/3", "27/3", "3/4", "10/4", "17/4"]}}}, "assessments": {"Discussion": "30", "Essays": "20", "Fieldwork or field study": "20", "Participation": "30"}}, {"code": "1004", "title": "Introduction to Environmental Humanities: Debates in China", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Fac Office of Arts", "requirements": "", "description": "This course introduces to students the emerging field of environmental humanities with a particular focus on China. Human activities have been drastically transforming the ecosystem. How do we in the humanities understand the changing nature, live with pollution, and make sense of ecological deterioration? How do technology, capital and state intertwine and contribute to climate changes and environmental crises? How do people in the humanities engage with issues of sustainability and environmental justice in everyday life? This course introduces major concerns in the field of environmental humanities through the lens of China, the “World’s Factory” and the most populated country with the second largest economy, whose environmental challenges have great implications for the rest of the world. This course will first survey topics of scientific and technological intervention of our natural world in the Anthropocene era. It then looks at case studies of specific topics such as agricultural sustainability, waste management, water crisis, species extinction, and environmental justice. Each topic will contain one week discussion of the topic’s global manifestations and related debates in China, and one week’s introduction on humanities response to the issues. Students will be guided to develop critical understanding of our natural world and to develop innovative ideas and humanistic responses.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}]