[{"code": "1090", "title": "Field trip to GBA: Aerospace Sciences and Earth Informatics", "career": "Undergraduate", "units": "1.00", "grading": "Graded", "components": "Field Studies/Field-trip", "campus": "Main Campus", "academic_group": "ASEIN & X Double Major PC", "requirements": "", "description": "This course aims to provide students with site visits in the Greater Bay Area (GBA). Through the guided visits to institutions and private sector relevant to the field of aerospace science and Earth informatics, students are given opportunity to explore and understand the current practices and research frontier in the field. Students are required to participate in all activities including the tutorial discussions and group presentation, and to submit an individual report afterwards.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "2010", "title": "Introduction to Aerospace Science and Earth Informatics", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "Lecture\nInteractive Tutorial", "campus": "Main Campus", "academic_group": "ASEIN & X Double Major PC", "requirements": "", "description": "This introductory-level course offers a comprehensive overview of the fundamental concepts and applications within the fields of aerospace sciences and Earth informatics. Students will explore the evolution of the solar system, delve into the intricacies of Earth's planetary environment, understand the basics of the tools and technologies used to explore the Earth and space, and gain insights into the multidisciplinary field of aerospace science and engineering. The course emphasizes the acquisition and analysis of data from space and other planets, highlighting its significance in understanding our universe and improving life on Earth.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "3010", "title": "Intermediate Topics in Aerospace Science and Earth Informatics", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "Lecture\nInteractive Tutorial", "campus": "Main Campus", "academic_group": "ASEIN & X Double Major PC", "requirements": "", "description": "The Intermediate Topics in Aerospace Science and Earth Informatics covers intermediate-level topics such as Aerodynamics through lectures and tutorials/project work. Exploration of the principles of aerodynamics, focusing on the fundamentals of fluid dynamics and airflow. Students will gain a comprehensive understanding of lift, drag, and other aerodynamic forces, as well as the tools to analyze airfoil and wing performance. The course is essential for anyone interested in the field of aerospace engineering, as it forms the basis for designing and optimizing aircraft and other aerospace vehicles.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "4010", "title": "Advanced Topics in Aerospace Science and Earth Informatics", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "Lecture\nInteractive Tutorial", "campus": "Main Campus", "academic_group": "ASEIN & X Double Major PC", "requirements": "", "description": "This course will cover advanced topics in Aerospace Science and Earth Informatics, such as orbital mechanics, whereby students will delve into the fundamental principles of classical mechanics with a focus on the motions of celestial bodies and artificial satellites under the influence of gravitational forces. Students will explore the mathematical and physical foundations of orbital dynamics, gaining the skills necessary to analyze and predict the trajectories of spacecraft and other objects in space. The course is essential for understanding space missions, satellite operations, and interplanetary travel.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}]