[{"code": "4001", "title": "Capstone Project I", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "Thesis Monitoring Course", "campus": "Main Campus", "academic_group": "Biotech, Entrep&Healthc Mgt PC", "requirements": "", "description": "This course is a capstone project I: Critical analysis of existing business models and policies related to biotechnology and healthcare.This course is designed to allow students to conduct independent study related to biotechnology, entrepreneurship and healthcare management. Students will form groups (2-3 persons in a group) to critically analyze on selected companies or policies on healthcare and/or environmental sustainability so that they will be motivated by how these companies/ policies are running and the significance of these business/ policies in contributing to the society. Students will take this chance to apply the knowledge and technique learnt from concentration-required courses and study deeper into specific topics of their interests in biotechnology, entrepreneurship and/or healthcare management. Students and the instructor will meet regularly to discuss each step of the process. Students are expected to give oral presentations and submit their reports at the end of the course.", "outcome": "After taking this course, students are expected to acquire the following knowledge and skills::- ⁠Integrative understanding: Learn how biotechnology, entrepreneurship, and healthcare management intersect.- ⁠Critical analysis: Develop skills to evaluate biotech and healthcare models and policies.- ⁠Research and independent study skills: Gain experience in independent research and data analysis.- ⁠Application of knowledge: Apply specialized knowledge to analyze biotech, entrepreneurship, and healthcare management.- ⁠Entrepreneurial perspective: Foster innovation and growth by examining existing models and policies.", "syllabus": "To be advised by the course coordinator.", "required_readings": "To be advised by the course coordinator.", "recommended_readings": "To be advised by the course coordinator.", "terms": {"2024-25 Term 2": {"-M01-TMC (9541)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["No Room Required"], "instructors": ["Professor WONG Wing Tak Jack"], "meetingDates": ["06/01/2025 - 14/04/2025"]}}}, "assessments": {"Presentation": "50", "Report": "50"}}]