[{"code": "3111", "title": "Ageing, Health and Society", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "Classwork\nLecture\nWeb-enhanced Teaching", "campus": "Main Campus", "academic_group": "Nethersole School of Nursing", "requirements": "", "description": "The aim of this course is to provide students with a basic understanding of population ageing from the bio-physiological and sociological perspectives. It focuses on the development of a multi-dimensional understanding of the factors that affect the health of older adults and the ways that socio-demographic changes shape societal attitudes towards old age. Emphasis is placed on discussions of the impact of population ageing on the social and health care needs of a society.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "3112", "title": "Basic Care in Gerontology", "career": "Undergraduate", "units": "4.00", "grading": "Graded", "components": "Field Studies/Field-trip\nLaboratory\nLecture\nOthers\nInteractive Tutorial\nWeb-enhanced Teaching", "campus": "Main Campus", "academic_group": "Nethersole School of Nursing", "requirements": "", "description": "The aim of this course is to equip students with foundational knowledge and essential skills to address the basic care needs of older people. Emphasis is placed on promoting an understanding of the basic principles of care to help older people to meet their basic life needs. Fundamental concepts such as nutrition, exercise, oral care, basic hygiene care, foot and nail care, communication, and psychosocial care are also covered.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "3113", "title": "Promoting Successful Ageing: Individual and Societal Perspectives", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "Lecture\nInteractive Tutorial\nVisit", "campus": "Main Campus", "academic_group": "Nethersole School of Nursing", "requirements": "", "description": "The aim of this course is to provide students with a comprehensive overview of the concepts, principles and theories of successful ageing from the health and social perspectives. Emphasis is placed on exploring and discussing the subjective and objective dimensions of successful ageing, the modifiable factors affecting the achievement of successful ageing, and the strategies to promote successful ageing at both individual and societal levels.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "3114", "title": "Psychology in Ageing: Theories and Application", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "Lecture\nInteractive Tutorial\nWeb-enhanced Teaching", "campus": "Main Campus", "academic_group": "Nethersole School of Nursing", "requirements": "", "description": "The aim of this course is to provide students with a basic understanding of the concepts and theoretical approaches of psychology relevant to ageing and aged care in various care settings. Emphasis is placed on the application of these concepts to understand individual and group behaviour and the health and social care needs of individuals and groups.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "3211", "title": "Chronic Disease Management in Ageing", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "Field Studies/Field-trip\nLaboratory\nLecture\nInteractive Tutorial", "campus": "Main Campus", "academic_group": "Nethersole School of Nursing", "requirements": "", "description": "This course comprises both theoretical and practical components to enhance students’ understanding of the complexities of caring for older people with major chronic diseases. It takes an interdisciplinary approach to chronic disease management from the health and social perspectives. Emphasis is placed on the care designed to directly address the physical and psychosocial consequences of chronic disease for older people and their caregivers.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "3212", "title": "Death, Dying and End-of-life Care", "career": "Undergraduate", "units": "2.00", "grading": "Graded", "components": "Laboratory\nLecture\nOthers\nInteractive Tutorial\nWeb-enhanced Teaching", "campus": "Main Campus", "academic_group": "Nethersole School of Nursing", "requirements": "", "description": "This course aims to provide students with a basic understanding of the concepts and principles of end-of-life care, and to equip them with essential knowledge and skills in the provision of hospice care and advance care planning to older people with terminal illness sufferers and their families.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "3213", "title": "Dementia: Prevention and Management", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "Lecture\nInteractive Tutorial\nVisit", "campus": "Main Campus", "academic_group": "Nethersole School of Nursing", "requirements": "", "description": "The aim of this course is to provide students with a comprehensive overview of the pathophysiological, behavioural and psychosocial aspects of dementia. Emphasis is placed on equipping students with the knowledge and skills required to prevent, detect and manage dementia in older people. The course also highlights the roles of family caregivers, multidisciplinary care team, and community care services in managing dementia.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "3214", "title": "Ethical, Legal and Financial Issues in Ageing", "career": "Undergraduate", "units": "2.00", "grading": "Graded", "components": "Debate\nLaboratory\nLecture\nInteractive Tutorial\nWeb-enhanced Teaching", "campus": "Main Campus", "academic_group": "Nethersole School of Nursing", "requirements": "", "description": "The aim of this course is to enhance students' understanding of the legal and ethical issues relating to aged care. It focuses on the legal principles governing professional practice in Hong Kong, including torts, contracts, confidentiality, informed consent and related ordinances; the basic ethical principles and theories relating to gerontological practice; the ethical issues and dilemmas encountered in practice; the financial planning for older people; and the funding models for aged care services.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "3215", "title": "Family and Informal Care in Ageing", "career": "Undergraduate", "units": "2.00", "grading": "Graded", "components": "Classwork\nLecture\nWeb-enhanced Teaching", "campus": "Main Campus", "academic_group": "Nethersole School of Nursing", "requirements": "", "description": "The aim of this course is to provide students with a basic understanding of the roles of and the contemporary issues relating to family and informal care in an ageing society. The basic concepts covered include family theories, gender roles and family functions in caregiving, the cost of informal care, caregiver stress, strategies to sustain informal care, and collaboration between formal and informal care. The course also explores the emerging trends of informal care in a changing society.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "3311", "title": "Aged Care Service Planning and Delivery Models", "career": "Undergraduate", "units": "5.00", "grading": "Graded", "components": "Field Studies/Field-trip\nLecture\nInteractive Tutorial\nWeb-enhanced Teaching", "campus": "Main Campus", "academic_group": "Nethersole School of Nursing", "requirements": "", "description": "The aim of this course is to provide students with a comprehensive understanding of the principles, concepts and skills involved in planning and delivering aged care services in a variety of geriatric settings, including community, rehabilitative and residential care settings. The basic concepts covered with regard to these settings include ageing in place, social involvement and participation, integrated community-based care, home-based care delivery model, discharge planning, interdisciplinary and cross-sectoral service coordination, and the residential care home accreditation system. The course highlights the notion of health and social care partnership, and a multi-dimensional perspective is adopted to facilitate students to examine the service planning and delivery model for the provision of community, rehabilitative and residential care services to older people.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "3312", "title": "Gerontological Practicum", "career": "Undergraduate", "units": "12.00", "grading": "Graded", "components": "Discussion\nPracticum\nSeminar", "campus": "Main Campus", "academic_group": "Nethersole School of Nursing", "requirements": "", "description": "The aim of this clinical practicum is to provide students with clinical practice opportunities to apply related principles, concepts and theories for planning and delivering aged care services in community, rehabilitative and residential care settings. Students are facilitated to develop their knowledge of and skills in service planning, coordination and delivery in these settings.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "3411", "title": "Health and Social Care Policy in Ageing", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "Field Studies/Field-trip\nLecture\nInteractive Tutorial\nWeb-enhanced Teaching", "campus": "Main Campus", "academic_group": "Nethersole School of Nursing", "requirements": "", "description": "The aim of this course is to provide students with a comprehensive understanding of policy issues relating to health and social care needs of older people. The course also examines the operation of health care and social care systems to further students' understanding of the planning and delivery of aged care services for older people.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "3412", "title": "Innovations and Evidence-based Practice for Aged Care Services", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "Lecture\nInteractive Tutorial\nWeb-enhanced Teaching", "campus": "Main Campus", "academic_group": "Nethersole School of Nursing", "requirements": "", "description": "This course aims to provide students with an overview of the research methods used in examining health and social care issues, and to equip them with knowledge of evidence-based practice with special reference to gerontology. The course also examines the impacts of the changing health and social care context on the delivery of aged care services, and introduces the evidence-based innovative models of aged care service delivery.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "3413", "title": "Leadership and Management in Aged Care Services", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "Lecture\nInteractive Tutorial", "campus": "Main Campus", "academic_group": "Nethersole School of Nursing", "requirements": "", "description": "This course enables students to apply the theoretical and skill-based knowledge that they have learnt in coordinating individual client care and organising care groups for clients in various community and long-term care settings. Emphasis is on leadership and management skills, and multi-disciplinary teamwork and collaboration between health and social care sectors.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "3414", "title": "Infectious Diseases and Their Control", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "Lecture\nInteractive Tutorial\nVisit", "campus": "Main Campus", "academic_group": "Nethersole School of Nursing", "requirements": "", "description": "The aim of this course is to help students understand infectious diseases and their clinical control. Emphasis is placed on various aspects of clinical practice, including principles of diagnosis and treatment, epidemiology and prevention strategies, methods of surveillance, development of infection control policies, and the clinical impact of infection control teams in hospitals and the community.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "3415", "title": "Complementary and Alternative Medicine", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "Field Studies/Field-trip\nLaboratory\nLecture\nWeb-enhanced Teaching", "campus": "Main Campus", "academic_group": "Nethersole School of Nursing", "requirements": "", "description": "The aim of this course is to introduce students to the efficacy, choice, use and explanatory mechanisms of complementary and alternative medicine using a range of selected therapies. It focuses on the health concepts and common approaches of traditional Chinese medicine, as well as the roles and responsibilities of aged care workers practicing in this field.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "3416", "title": "Student Exchange Programme", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "Field Studies/Field-trip\nLecture\nInteractive Tutorial", "campus": "Main Campus", "academic_group": "Nethersole School of Nursing", "requirements": "", "description": "This course aims to develop students with an international and cultural perspectives on issues arising from an ageing global population. The course provides valuable opportunities for students to learn about the structures and delivery of aged care services in different cultures. Such exposure will also help students develop cross-cultural insights to better understand the core elements of best practices and innovative approaches in aged care.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}]