[{"code": "1702", "title": "Learning Hokkinese/ Southern Min through Poems and Songs", "career": "Undergraduate", "units": "2.00", "grading": "PTH/CAN", "components": "Lecture", "campus": "Main Campus", "academic_group": "Yale-China Chin Lang Ctr", "requirements": "", "description": "An elementary course designed for students who are interested in language and culture in Taiwan and Southern Fujian. Course content includes sounds and tones, simple daily conversation, traditional and popular songs, as well as ancient and modern poetry. Classroom activities include 1. Comparing and analysing the differences in pronunciation, vocabulary and grammar of Hokkinese/ Southern Min, Cantonese and Putonghua; 2. Song appreciation; 3. Poetry appreciation and recitation. This course will also help learners understand Taiwan and Southern Min culture, and understand Putonghua with a Hokkinese/ Southern Min accent better.", "outcome": "Upon completion of this course, students will be able to:1. Converse on simple daily topics;2. Understand the differences between Hokkinese/ Southern Min, Cantonese and Putonghua in terms of consonants, vowels, tones, vocabulary and grammar;3. Recite selected ancient and modern poems in Hokkinese/ Southern Min;4. Recite the lyrics of selected modern songs in Hokkinese/ Southern Min;5. Understand Putonghua with a Hokkinese/ Southern Min accent better.完成本科目後，學生將能夠：1. 掌握簡單的日常會話；2. 了解福建話、廣東話和普通話在聲母、韻母、聲調、詞彙和語法方面的差異；3. 用福建話朗誦十餘首古代與現代詩；4. 用福建話朗誦十餘首現代歌曲的歌詞；5. 更好地聽懂帶有福建話口音的普通話。", "syllabus": "1. Comparison of pronunciation, vocabulary and grammar, and song appreciation (Teresa Teng, Fong Fei-fei, Lo Ta-yu, Harlam Yu)2. Comparison of pronunciation, vocabulary and grammar, and song appreciation (Fei Yuqing, Jody Chiang, Eric Moo, Kulilay Amit)3. Comparison of pronunciation, vocabulary and grammar, and song appreciation (Li Yasha, Wu Bai, Mayday, The Last Day of Summer, 831)4. Comparison of pronunciation, vocabulary and grammar, and poetry recitation (Book of Songs, Chu Ci)5. Comparison of pronunciation, vocabulary and grammar, and poetry recitation (Yuefu poetry, Fu)6. Comparison of pronunciation, vocabulary and grammar, and poetry recitation (gushi, regulated verse)7. Comparison of pronunciation, vocabulary and grammar, and poetry recitation (Song Ci, Yuan Opera)8. Comparison of pronunciation, vocabulary and grammar, and poetry recitation (Modern Chinese poetry)1. 語音、詞彙與語法對比、歌曲欣賞（鄧麗君、鳳飛飛、羅大佑、庾澄慶）2. 語音、詞彙與語法對比、歌曲欣賞（費玉清、江蕙、巫啟賢、張惠妹）3. 語音、詞彙與語法對比、歌曲欣賞（李婭莎、伍佰、五月天、八三夭）4. 語音、詞彙與語法對比、詩詞朗誦（詩經、楚辭）5. 語音、詞彙與語法對比、詩詞朗誦（樂府詩、賦）6. 語音、詞彙與語法對比、詩詞朗誦（古體詩、近體詩）7. 語音、詞彙與語法對比、詩詞朗誦（宋詞、元曲）8. 語音、詞彙與語法對比、詩詞朗誦（新詩）", "required_readings": "Lecture notes.", "recommended_readings": "N/A", "terms": {"2024-25 Term 1": {"--LEC (6793)": {"startTimes": ["10:30"], "endTimes": ["12:15"], "days": [4], "locations": ["Yasumoto Int'l Acad Park 411"], "instructors": ["Staff"], "meetingDates": ["5/9", "12/9", "19/9", "26/9", "3/10", "10/10", "17/10", "24/10", "31/10", "7/11", "14/11", "21/11", "28/11"]}}, "2024-25 Term 2": {"--LEC (8001)": {"startTimes": ["12:30"], "endTimes": ["14:15"], "days": [2], "locations": ["Mong Man Wai Bldg 704"], "instructors": ["Staff"], "meetingDates": ["7/1", "14/1", "21/1", "4/2", "11/2", "18/2", "25/2", "11/3", "18/3", "25/3", "1/4", "8/4", "15/4"]}}}, "assessments": {"Examination": "30", "Homework or assignment": "20", "Participation": "25", "Test or quiz": "25"}}]