[{"code": "1001", "title": "Greater Bay Area Field Trip", "career": "Undergraduate", "units": "1.00", "grading": "Distinction/Pass/Failure", "components": "Field Studies/Field-trip", "campus": "Main Campus", "academic_group": "Co-op Education Pgm Comm", "requirements": "", "description": "This course is designed for first year undergraduates across all disciplines. Through visits to companies and government institutions in the Greater Bay Area, it helps to enhance students' understanding of the economic, cultural and geopolitical underpinnings in the region.", "outcome": " Enhance communication and presentation skills Understand range of career possibilities Demonstrate insight and understanding of a GBA environment, culture and challenges", "syllabus": "Through visits to companies and government institutions in the Greater Bay Area, the course helps to enhance students' understanding of the economic, cultural and geopolitical underpinnings in the region.Remarks: The assessment type below is for reference only. For the specific assessment scheme, please refer to the course outline. ", "required_readings": "Reading materials will be provided by the course instructor. ", "recommended_readings": "Additoinal readings will be introduced as the topics are discussed. ", "terms": {"2024-25 Term 2": {"-F01-FLD (7380)": {"startTimes": ["12:00"], "endTimes": ["12:00"], "days": [1], "locations": ["No Room Required"], "instructors": ["Dr. LAI Hon Weng"], "meetingDates": ["6/1"]}}}, "assessments": {"Attendance": "20", "Participation": "40", "Report": "40"}}, {"code": "2001", "title": "Asia Field Trip", "career": "Undergraduate", "units": "2.00", "grading": "Distinction/Pass/Failure", "components": "Field Studies/Field-trip", "campus": "Main Campus", "academic_group": "Co-op Education Pgm Comm", "requirements": "", "description": "This course is designed for second year undergraduates across all disciplines. Through visits to companies and government institutions in Asia, it helps to enhance students' understanding of the economic, cultural and geopolitical underpinnings in the regions.", "outcome": " Enhance communication and presentation skills Understand range of career possibilities Demonstrate insight and understanding of an Asian environment, culture and challenges Develop cross-cultural sensitivity", "syllabus": "Through visits to companies and government institutions in Asia, it helps to enhance students' understanding of the economic, cultural and geopolitical underpinnings in the regions.Remarks: The Assessment Type below is for reference only. For the specific assessment scheme, please refer to the course outline. ", "required_readings": "Reading materials will be provided by the course instructor. ", "recommended_readings": "Additional readings will be introduced as the topics are discussed. ", "terms": {"2024-25 Term 2": {"-F01-FLD (7381)": {"startTimes": ["12:00"], "endTimes": ["12:00"], "days": [1], "locations": ["No Room Required"], "instructors": ["Dr. LAI Hon Weng"], "meetingDates": ["6/1"]}}}, "assessments": {"Attendance": "20", "Participation": "40", "Report": "40"}}, {"code": "3001", "title": "Unlocking Employability Potential and Personal Branding", "career": "Undergraduate", "units": "1.00", "grading": "Distinction/Pass/Failure", "components": "Workshop", "campus": "Main Campus", "academic_group": "Co-op Education Pgm Comm", "requirements": "", "description": "This course is designed for undergraduates of year 2 or above across all disciplines to enhance their understanding of what a strong professional application comprises. Specifically, it will focus on helping students develop a compelling personal brand so that they can create lasting impressions both on paper and in person. Coursework includes writing an effective Elevator Pitch, undertaking a holistic Personality Test, completing a self-reflection report that delves into students’ passions, personal goals and own strengths, attending boot-camps/workshops that cover the winning skills and common pitfalls of navigating interview activities such as Aptitude Tests, Gameathon Assessment, Video/Group Interviews, Interactive Days (Team Days) and Assessment Centers, taking part in mock interviews, and reviewing and enhancing students’ CV and LinkedIn profile. Advisory: for students enrolled in the Co-operative Education Programme only.", "outcome": " Understand range of career possibilities; Demonstrate insight into character traits, personal passions, strengths and areas of growth; Exhibit confidence and poise during job interviews; and Produce effective CVs and online profiles.", "syllabus": " Personal branding Finding your motivations Charting your career Navigating in-person and digital interviews Reviewing and enhancing CV ad Linkedln profile", "required_readings": "Reading materials will be providled by the course instructor. ", "recommended_readings": "Additional readings will be introduced as the topics are discussed. ", "terms": {"2024-25 Term 1": {"AW01-WKS (6368)": {"startTimes": ["8:30"], "endTimes": ["18:15"], "days": [6], "locations": ["Yasumoto Int'l Acad Park LT3"], "instructors": ["Dr. LAI Hon Weng"], "meetingDates": ["2/11", "9/11"]}, "BW01-WKS (5359)": {"startTimes": ["8:30"], "endTimes": ["18:15"], "days": [6], "locations": ["Yasumoto Int'l Acad Park LT3"], "instructors": ["Dr. LAI Hon Weng"], "meetingDates": ["16/11", "23/11"]}}, "2024-25 Term 2": {"-W01-WKS (7728)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["TBA"], "instructors": ["Dr. LAI Hon Weng"], "meetingDates": ["06/01/2025 - 13/01/2025"]}}}, "assessments": {"Homework or assignment": "80", "Participation": "20"}}, {"code": "3002", "title": "Developing Workplace Professionalism", "career": "Undergraduate", "units": "2.00", "grading": "Distinction/Pass/Failure", "components": "Lecture", "campus": "Main Campus", "academic_group": "Co-op Education Pgm Comm", "requirements": "", "description": "This course is designed for undergraduates of year 2 or above across all disciplines to enhance students’ commercial savviness and understanding of Hong Kong’s legal system and regulations tied to the business ecosystem. Specifically, it focuses on helping students develop sensitivity when navigating interactions with others in a corporate setting, and sharpening their awareness of information security issues such as data privacy, intellectual property, and their impacts on companies’ and personal productivity and success. The course will also offer an introductory overview of corresponding laws and regulations that govern the space. Coursework includes experiential learning opportunities such as Outward Bound and Business Etiquette Workshop, and individual written assignments. Advisory: for students enrolled in the Co-operative Education Programme only.Some class sections may be offered in blended or online mode.", "outcome": " Demonstrate strong leadership skills; Resolve interpersonal tensions while fuelling change; Recognize and embrace diversity and inclusion; Enhance team productivity through skilful communication; Develop fundamental awareness of information security best practices in the workplace; and Understand the essential topics of law and regulations concerning the business arena", "syllabus": "Part A: Being an Agent of Change Dynamic Leadership Emotional intelligence in leadership Harnessing esprit de corps Boosting performance and productivity Part B: Regulatory Compliance in Data, Cybersecurity and Hong Kong Legal System Digital Disruption vs Information Security Summary of Hong Kong Legal System", "required_readings": "Reading materials will be provided by the course instructor.", "recommended_readings": "Additional readings will be introduced as the topics are discussed. ", "terms": {"2024-25 Term 1": {"--LEC (8116)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["TBA"], "instructors": ["Dr. LAI Hon Weng"], "meetingDates": ["11/11/2024 - 25/11/2024"]}}, "2024-25 Term 2": {"A-LEC (6395)": {"startTimes": ["8:30"], "endTimes": ["10:15"], "days": [5], "locations": ["Esther Lee Bldg LT4"], "instructors": ["Dr. LAI Hon Weng"], "meetingDates": ["10/1", "17/1", "24/1", "7/2", "14/2", "21/2", "28/2", "14/3", "21/3", "28/3", "11/4"]}, "B-LEC (5103)": {"startTimes": ["14:30"], "endTimes": ["16:15"], "days": [5], "locations": ["Yasumoto Int'l Acad Park LT8"], "instructors": ["Dr. LAI Hon Weng"], "meetingDates": ["10/1", "17/1", "24/1", "7/2", "14/2", "21/2", "28/2", "14/3", "21/3", "28/3", "11/4"]}, "C-LEC (6545)": {"startTimes": ["16:30"], "endTimes": ["18:15"], "days": [4], "locations": ["Yasumoto Int'l Acad Park LT7"], "instructors": ["Dr. LAI Hon Weng"], "meetingDates": ["9/1", "16/1", "23/1", "6/2", "13/2", "20/2", "27/2", "13/3", "20/3", "27/3", "3/4", "10/4", "17/4"]}}}, "assessments": {"Attendance": "40", "Homework or assignment": "60"}}, {"code": "4001", "title": "Work Placement and Continuous Assessment", "career": "Undergraduate", "units": "1.00", "grading": "Distinction/Pass/Failure", "components": "Others", "campus": "Main Campus", "academic_group": "Co-op Education Pgm Comm", "requirements": "", "description": "This course is designed for undergraduates of year 2 or above across all disciplines to help students critically evaluate their learnings from the work experience. Specifically, it helps students develop insight into how they can leverage their newly acquired skills and discovered competencies to maximize their potential for future career success. Coursework includes completing a continuous self-assessment (e.g. Gallup Strengthsfinder, Korn Ferry Leadership Architect), and assignments such as a reflection paper about the work experience, an actionable personal development plan, recording a short workplace video, and taking online modules in each work term. Advisory: for students enrolled in the Co-operative Education Programme only.", "outcome": " Set clear, actionable goals for self-improvement; Identify opportunities to learn through introspection and feedback; Develop positive mentoring relationships with professionals from the industry; and Acquire practical work experience complementing personal strengths and career interests.", "syllabus": " Evaluation and Self-empowerment Learning, Unlearning and Relearning Cultivating Mentoring Relationships", "required_readings": "Reading materials will be provided by the course instructor. ", "recommended_readings": "Additional readings will be introduced as the topics are discussed. ", "terms": {"2024-25 Term 1": {"-O01-OTH (7612)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["No Room Required"], "instructors": ["Dr. LAI Hon Weng"], "meetingDates": ["02/09/2024 - 25/11/2024"]}}, "2024-25 Term 2": {"-O01-OTH (4618)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["No Room Required"], "instructors": ["Dr. LAI Hon Weng"], "meetingDates": ["06/01/2025 - 14/04/2025"]}}}, "assessments": {"Homework or assignment": "40", "Others": "30", "Participation": "30"}}]