[{"code": "1001", "title": "Introduction to Policy Sciences", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "Lecture\nInteractive Tutorial", "campus": "Main Campus", "academic_group": "Data Science & Policy Stud PC", "requirements": "", "description": "This course introduces key concepts, theories and models in the study of policy sciences. To resolve complex and multi-level public problems of a globalized world in ways that help to identify and enhance the common interest, policy sciences provide an integrated and interdisciplinary approach for making good policy decisions. This course also aims to help students understand the process and structure in designing policies. The concerns of this course are integrating theory and practice into actionable social knowledge and apply it to real world problems.", "outcome": "By the end of this course, students should be able to: a. Understand the policy process and its application in real life policies; b. Understand key concepts and theoretical approaches to public sciences and analysis; c. Adopt and apply theories to understand real world problems; d. Formulate their own knowledge system based on the knowledge and concepts introduced.", "syllabus": "1. Introduction to Policy Sciences and public policy  2. Basic concepts & theories in Policy Sciences 3. Key models and frameworks in Policy Analysis  4. Wicked problems & international affairs in the globalized world 5. Integrated and interdisciplinary approach for policy-making 6. Main process and structure in designing and evaluating policies 7. Theories and its application in the context of Hong Kong and comparative contexts", "required_readings": "- Howlett, M., Ramesh, M., & Perl, A. (2009). Studying public policy: Policy cycles and policy subsystems (Vol. 3). Oxford: Oxford University Press. - Sabatier, P. A., & Weible, C. M. (Eds.). (2014). Theories of the policy process. Westview Press.", "recommended_readings": "- Birkland, T. A. (2015). An introduction to the policy process: Theories, concepts, and models of public policy making. Routledge. - Hajer, M., Hajer, M. A., & Wagenaar, H. (Eds.). (2003). Deliberative policy analysis: understanding governance in the network society. Cambridge University Press. - Innes, J. E., & Booher, D. E. (2010). Planning with complexity: An introduction to collaborative rationality for public policy. Routledge.", "terms": {"2022-23 Term 1": {"--LEC (5011)": {"startTimes": ["14:30"], "endTimes": ["17:15"], "days": [3], "locations": ["Lee Shau Kee Archi Bldg G02"], "instructors": ["Professor CHAN Chee Hon"], "meetingDates": ["7/9", "14/9", "21/9", "28/9", "5/10", "12/10", "19/10", "26/10", "2/11", "9/11", "16/11", "23/11", "30/11"]}}, "2023-24 Term 1": {"--LEC (5838)": {"startTimes": ["14:30"], "endTimes": ["17:15"], "days": [3], "locations": ["Lee Shau Kee Archi Bldg G02"], "instructors": ["Professor CHAN Chee Hon"], "meetingDates": ["6/9", "13/9", "20/9", "27/9", "4/10", "11/10", "18/10", "25/10", "1/11", "8/11", "15/11", "22/11", "29/11"]}}}, "assessments": {"Essay test or exam": "70", "Homework or assignment": "20", "Others": "10"}}, {"code": "1002", "title": "Data Science and Public Policy", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Data Science & Policy Stud PC", "requirements": "", "description": "(UGEC1731 is double-coded with DSPS1002.) This course focuses on the important connection between data science and public policy by identifying and analyzing the policy challenges posed by data science technologies. It assesses what policy options and tools are available to address them and examines what new capacities governments and also citizens must develop in the era of data science. Students would also be introduced to the professional and ethical responsibilities and social, economic, political and legal impacts under the changes and innovations brought by data science.", "outcome": " This course is expected to achieve the following outcomes for the students:    Good knowledge of the fundamental concepts, major intellectual and competing perspectives in the study of data science and policy studies  Awareness of the importance of the role of data science in society, including its opportunities and threats  Appreciation of the competing perspectives and contrasting views from major stakeholders on issues and problems of data science and policy studies and realization of the assumptions behind  Ability to think critically and analytically on public issues and policy challenges related to data science  Ability to apply the concepts and theories learnt in the course to formulate solutions to address real-world problems at a policymaking level    ", "syllabus": " Topics to be covered included:   Introduction and Overview: Technology and Public Policy - Normative Policymaking vs. Positive Policymaking   Part I: Theoretical Foundation and Analytical Framework   This section would define data science, which is an interdisciplinary field that uses scientific and statistical methods, processes, algorithms, and systems including big data and advanced computer technologies such as AI and IoT (Internet of Things) to generate knowledge and insights from data, and provides the theoretical framework for understanding and evaluating its impacts on policymaking.   The Rise of Data Science and Disruptive Technology   Evidence-Based Policymaking   Programme Implementation and Diffusion of Technology                               Part II: Technology and Policy Challenges   This section introduces the major inventions and trends in data science such as Big Data, which is dataset that cannot be stored, captured, managed and analyzed by means of conventional database software, and examines their impacts and implications on policymaking. In addition, the challenges of other discoveries such as open data, open innovation, and AI, for government and society would also be examined.   Big Data and Policymaking   Open Data and Open Innovation                                      AI and the Future of Work   Data Science and State Surveillance   Part III: Technology and Societal Impact   This section would discuss how data connectivity enabled by information and communication technologies (ICT) affects social and political lives. For example, smart city is a city that uses ICT to increase operational efficiency, share information with the public and improve both the quality of government services and citizen welfare. We would identify the issues and factors dividing the success and failure in the adoption and effects of those technologies.    Smart City   Social Media and Society   Social Media and Governance   Design Thinking and Public Participation                  ", "required_readings": " Introduction: Technology and Public Policy Normative Policymaking vs. Positive Policymaking  *Anderson, James. (2015)  Public Policy-Making.  8th ed.  Stamford, CT: Cengage, Chapter 1.  *Kingdon, John.  (1984)  Agendas, Alternatives, and Public Policies.  2nd ed.  New York, NY: Harper Collins, Chapter 4.     Part I: THEORETICAL FOUNDATION AND ANALYTICAL FRAMEWORK   The Rise of Data Science and Disruptive Technology:A Private Sector Perspective, A Missing Public Sector Perspective   *Bower, J. L., & Christensen, C. M. (1995). Disruptive Technologies: Catching the Wave. Harvard Business Review 73 (1), 43-53. *Davenport, Thomas H., and D. J. Patil, “Data Scientist: The Sexiest Job of the 21st Century.” Harvard Business Review, Oct 2012. *Schonberger M. and Cukier K. Big Data: A Revolution That Will Transform How We Live, Work, and Think. Boston: Houghton Mifflin Harcourt, Boston, 2013, Chapter 1-3.   Evidence-Based Policymaking: The Role of Science and Data in Policymaking *Cairney, Paul. (2016) The Politics of Evidence-Based Policy Making. NY: Palgrave Macmillan, Chapter 1-2. *Sanderson, Ian. (2002) “Evaluation, Policy Learning and Evidence-Based Policy Making.” Public Administration, Vol 80, Issue 1.     Programme Implementation and Diffusion of Technology: Bridging the Reality Gap   *Knill, C., & Tosun, J. (2012). Public Policy: A New Introduction. Palgrave Macmillan, Chapter 7. *Rosen, Harvey and Ted Gayer.  (2010)  Public Finance.  9th ed.  New York: McGraw-Hill, Chapter 6. *Straub, Evan T. (2017) “Understanding Technology Adoption: Theory and Future Directions for Informal Learning.” Review of Educational Research.   Part II: TECHNOLOGY AND POLICY CHALLENGES   Big Data and Policymaking: The Bigger, the Better? *Desouzai, Kevin C., and Benoy Jacob. (2017) “Big Data in the Public Sector: Lessons for Practitioners and Scholars.” Administration & Society, Vol. 49 (7): 1043-1064. *Höchtl, Johann, Peter Parycek & Ralph Schöllhammer (2016) “Big Data in the Policy Cycle: Policy Decision Making in the Digital Era,” Journal of Organizational Computing and Electronic Commerce, 26:1-2, 147-169.   Open Data and Open Innovation: Citizens-Oriented and Bottom-Up *Clarke, Amanda, and Helen Margetts. (2014) “Governments and Citizens Getting to Know Each Other? Open, Closed, and Big Data in Public Management Reform.” Policy and Internet, Vol. 6, 4. *Janssen, Marijn, Yannis Charalabidis, and Anneke Zuiderwijk. (2012) “Benefits, Adoption Barriers and Myths of Open Data and Open Government.” Information Systems Management, Vol. 29, 4: 258-268. *Mergel, Ines. “Implementing Open Innovation in the Public Sector: The Case of Challenge.gov.” Public Administration Review, Nov/Dec 2013.   AI and the Future of Work: Will Machine Replace Us? *Lee, Kai-Fu. AI-Superpowers: China, Silicon Valley, and the New World Order? NY: Mariner, Chapter 5, 6 and 8.   Data Science and State Surveillance: Who Would Watch the Watchdog? *Brayne, Sarah. (2017) “Big Data Surveillance: The Case of Policing.” American Sociological Review, Vol. 82, 5: 977-1008. *Lyon, David. (2014) “Surveillance, Snowden, and Big Data: Capacities, Consequences, Critique.” Big Data & Society, July 2014.   Part III: Technology and Societal Impact   Smart City: Risk and Opportunities *Cowley, Robert, Simon Joss, & Youri Dayout. (2018) “The Smart City and Its Publics: Insights from Across Six UK Cities.” Urban Research and Practices, 11, 1: 53-77. *Ho, Ezra. “Smart Subjects for a Smart Nation? Governing (Smart) Mentalities in Singapore.” Urban Studies, 2017, Vol. 54(13), pp. 3103-3118. *Kitchin, Rob. (2014) “The real-time city? Big data and smart urbanism.” GeoJournal, 79, 1-14.   Social Media and Society: Citizens as the Actor *Bennett, Lance and Alexandra Segerberg. (2011) “Digital Media and the Personalization of Collective Action.” Information, Communication and Society. 14, 6: 770-799. *Mcintyre, Lee. (2018) Post-Truth. Boston, MA: MIT Press, Chapter 1-3 and 5. *Sandoval-Almazan, Rodrigo, and J. Ramon Gil-Garcia. (2014) “Towards Cyberactivism 2.0? Understanding the use of social media and other information technologies for political activism and social movements.” Government Information Quarterly, 31: 365-378.   Social Media and Governance: State as the Actor *Bradshaw, Samantha, and Philip N. Howard. (2019) The Global Disinformation Order: 2019 Global Inventory of Organized Social Media Manipulation. Oxford Internet Institute, University of Oxford. *Persily, Nathaniel, & Joshua A. Tucker, eds. (2020) Social Media and Democracy. NY: Cambridge University Press, Chapter 1, 2, 7, 8 and 13.   Design Thinking and Public Participation: the Human Dimension of Technology *Brown, Tim, & Jocelyn Wyatt. “Design Thinking for Social Innovation.” Stanford Social Innovation Review. Winter 2010. *Hao, Karen. “Should a Self-Driving Car Kill the Baby or the Grandma? Depends on Where You’re From.” MIT Technology Review. Oct 24, 2018. *Liedta, Jeanne, and Randall Salzman. Applying Design Thinking to Public Service Delivery. IBM Center for The Business of Government, Part I.  ", "recommended_readings": "   Introduction: Technology and Public Policy Normative Policymaking vs. Positive Policymaking Lindblom, Charles, “The Science of Muddling Through” in Jay Shafritz, Albert Hyde, and Sandra Parkes, eds. (2004) Classics of Public Administration. 5th ed. Belmont, CA: Wadsworth. Rebman, Thomas. “Do Your Data Scientists Know the “Why” Behind Their Work?” Harvard Business Review, May 16, 2019.   Part I: THEORETICAL FOUNDATION AND ANALYTICAL FRAMEWORK   The Rise of Data Science and Disruptive Technology: A Private Sector Perspective, A Missing Public Sector Perspective Manyika J, Chui M, Brown B. et. al. (2011). Big Data: The Next Frontier for Innovation, Competition, and Productivity. Available at: www.mckinsey.com.   Evidence-Based Policymaking: The Role of Science and Data in Policymaking Head, Brain W. (2008) “Three Lenses of Evidence-Based Policy.” Australian Journal of Public Administration, Vol. 67, Issue 1. Stoker, Gerry and Mark Evans. Evidence-based Policy Making in the Social Sciences: Methods that Matter. Bristol, England; Chicago, Illinois: Policy Press 2016.   Programme Implementation and Diffusion of Technology: Bridging the Reality Gap Howlett M. & Ramesh M. (1995). Studying Public Policy: Policy Cycles and Policy Subsystems. Toronto; New York; Oxford: Oxford University Press. Chapter 8. Peters, B. Guy. (1993) American Public Policy: Promise and Performance. Chatham, N.J.: Chatham House Publishers. Chapter 8.   Part II: TECHNOLOGY AND POLICY CHALLENGES   Big Data and Policymaking: The Bigger, the Better? Brady, H. E. (2019). The challenge of big data and data science. Annual Review of Political Science. https://doi.org/10.1146/annurev-polisci-090216-023229 Rethemeyer R K & Isett K (2016) Big Data in Public Affairs, Public Administration Review 76(6), 928-937. Schintler L A and Kulkarni R (2014) Big Data for Policy Analysis: The Good, The Bad, and the Ugly, Review of Policy Research 31(4), 343-348.   Open Data and Open Innovation: Citizens-Oriented and Bottom-Up Welch, Eric, Mary Feeney, and Chui Hyun Park. (2016) “Determinants of Data Sharing in U.S. City Governments.” Government Information Quarterly, Vol. 33, 3: 393-403. Veljkovic, Natasa, Sanja Bogdanovic-Dinic, Leonid Stoimenov. (2014) “Benchmarking Open Government: An Open Data Perspective.” Government Information Quarterly, Vol. 31, 2: 278-290.   AI and the Future of Work: Will Machine Replace Us? OECD, OCED Employment Outlook 2019: The Future of Work. Vochozka, Marek, Tomas Kliestik, Jana Kliestikova, and Graţiela Sion. “Participating in a Highly Automated Society: How Artificial Intelligence Disrupts the Job Market.” Economics, Management and Financial Markets, December 2018, Vol. 13(4).   Data Science and State Surveillance: Who Would Watch the Watchdog?   China's Social Credit System (Collection). South China Morning Post. https://www.scmp.com/topics/chinas-social-credit-system. Graham, Stephen, and David Wood. (2003) “Digitizing Surveillance: Categorization, Space, and Inequality.” Critical Social Policy, Vol. 23, 2: 227-248. Tufekci,, Zeynep. (2014) “Engineering the Public: Big Data, Surveillance and Computional Politics.” First Monday, Vol. 19, 7. Zuboff, Shoshana. (2019) The Age of Surveillance Capitalism. London: Profile Books   Part III: Technology and Societal Impact   Smart City: Risk and Opportunities Allwinkle, S., & Cruickshank, P. (2011). Creating Smarter Cities: An Overview. Journal of Urban Technology, 18(2), 1–16 Greenfield, A. (2013). Against the Smart City (The City is Here for You to Use). New York: Do Projects. Hollands, R. G. (2008). Will the Real Smart City Please Stand Up? City, 12(3), 303–320. The Smart City Blueprint for Hong Kong (https://www.smartcity.gov.hk)   Social Media and Society: Citizens as the Actor Mergel, Ines. “A Framework for Interpreting Social Media Interactions in the Public Sector.” Government Information Quarterly, 30: 327-334. O’Connor, Cailin, & James O. Waetherall. (2019) The Misinformation Age. New Haven: Yale University Press. Tang, Gary, & Francis L. F. Lee. (2013) “Facebook Use and Political Participation: The Impact of Exposure to Shared Political Information, Connections with Public Political Actors, and Network Structural Heterogeneity.” Social Science Computer Review, Vol. 31, No. 6: 763-773.   Social Media and Governance: State as the Actor King, Gary, Jennifer Pan, & Margaret E. Roberts. (2013) “How Censorship in China Allows Government Criticism but Silences Collective Expression. American Political Science Review 107, 2: 1-18. King, Gary, Jennifer Pan, & Margaret E. Roberts. (2017) “How the Chinese Government Fabricates Social Media Posts for Strategic Distraction, Not Engaged Argument.” American Political Science Review 111, 3: 484-501.   Design Thinking and Public Participation: the Human Dimension of Technology Awad, E, Dsouza, Sohan Dsouza, Richard Kim, Jonathan Schulz, Joseph Henrich, Azim Shariff, Jean-Francois Bonnefon, & Iyad Rahwan. “The Moral Machine Experiment.” Nature 563 (2018): 59-64. Liedtka, Jeanne, Randy Salzman, & Daisy Azer. (2017) Design Thinking for the Greater Good: Innovation in the Social Sector. NY: Columbia University Press.    ", "terms": {"2022-23 Term 2": {"--LEC (7147)": {"startTimes": ["14:30"], "endTimes": ["17:15"], "days": [3], "locations": ["Science Centre L5"], "instructors": ["Dr. KWOK Pak Ki"], "meetingDates": ["11/1", "18/1", "1/2", "8/2", "15/2", "22/2", "1/3", "15/3", "22/3", "29/3", "12/4", "19/4"]}}}, "assessments": {"Essay test or exam": "65", "Presentation": "25", "Participation": "10"}}, {"code": "1003", "title": "Foundation of Data Science", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "Lecture\nInteractive Tutorial", "campus": "Main Campus", "academic_group": "Data Science & Policy Stud PC", "requirements": "", "description": "This course is intended for students with little or no programming experience. It is designed to provide students with a firm foundation for learning modern data science, which uses computer programming to wrangle and analyze data. Adopting a hands-on approach, this course covers all the basics of programming in Python, as well as general computer programming concepts and techniques, such as branching, looping and inheritance. It also familiarizes students with some of the most useful Python libraries for data science, such as NumPy, pandas and matplotlib. This course plays a foundational role in the data science curriculum.", "outcome": "By the end of the course, students should be able to: Understand the role computation can play in solving problems. Understand the basic programming concepts and techniques. Write programs in Python that allow them to accomplish useful goals.  Use Python libraries to complete simple data science tasks. ", "syllabus": " Values and Variables   Simple Data Types: int, float, string, boolean  Lists  Conditional Statements: if, if-else, if-elif-else  Dictionaries  User Input   Iteration: for loops, while loops  Functions and Modules  Classes and Objects  Files  Exceptions  Python libraries for data science: NumPy, pandas, matplotlib.", "required_readings": " Lacey, N. (2019). Python by Example: Learning to Program in 150 Challenges. Cambridge University Press. Matthes, E. (2023). Python Crash Course: A Hands-On, Project-Based Introduction to Programming (3rd Edition). No Starch Press. Vasiliev, Y. (2022). Python for Data Science: A Hands-On Introduction. No Starch Press.", "recommended_readings": " Deitel, P., & Deitel, H. (2019). Intro to Python for Computer Science and Data Science: Learning to Program with AI, Big Data and the Cloud. Pearson. Milliken, C. P. (2019). Python Projects for Beginners: A Ten-Week Bootcamp Approach to Python Programming. Apress. Shaw, Z. (2017). Learn Python 3 the Hard Way: A Very Simple Introduction to the Terrifyingly Beautiful World of Computers and Code. Addison-Wesley Professional. Stephenson, B. (2019). The Python Workbook: A Brief Introduction with Exercises and Solutions (2nd Edition). Springer. Sweigart, A. (2019). Automate the Boring Stuff with Python: Practical Programming for Total Beginners (2nd Edition). No Starch Press. Sweigart, A. (2021). The Big Book of Small Python Projects: 81 Easy Practice Programs. No Starch Press. Ustun, I. (2018). Learning Python for Data Science. Packt Publishing. [Video]. VanderPlas, J. (2022). Python Data Science Handbook (2nd Edition). O'Reilly Media. Zelle, J. (2016). Python Programming: An Introduction to Computer Science (3rd Edition). Franklin, Beedle & Associates.", "terms": {"2022-23 Term 1": {"A-LEC (9062)": {"startTimes": ["14:30"], "endTimes": ["17:15"], "days": [2], "locations": ["Esther Lee Bldg 207"], "instructors": ["Dr. WONG Kwong Cheong"], "meetingDates": ["6/9", "13/9", "20/9", "27/9", "11/10", "18/10", "25/10", "1/11", "8/11", "15/11", "22/11", "29/11"]}}, "2023-24 Term 1": {"A-LEC (6153)": {"startTimes": ["14:30"], "endTimes": ["17:15"], "days": [2], "locations": ["Wong Foo Yuan Bldg UG01"], "instructors": ["Dr. WONG Kwong Cheong"], "meetingDates": ["5/9", "12/9", "19/9", "26/9", "3/10", "10/10", "17/10", "24/10", "31/10", "7/11", "14/11", "21/11", "28/11"]}}}, "assessments": {"Homework or assignment": "30", "Project": "20", "Participation": "10", "Test or quiz": "40"}}, {"code": "1004", "title": "Statistics for Data Science and Policy Studies", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Data Science & Policy Stud PC", "requirements": "", "description": "This course provides an introduction to data science and its applications in policy analysis. Students will learn the fundamental concepts of statistics and probability theory and their role in policy research. Through hands-on exercises and case studies, students will gain practical experience in descriptive statistics, probability distributions, statistical inference, and analysis. Students will also develop skills in communicating statistical results to policy audiences through effective writing and data visualization techniques. By the end of the course, students will have a solid understanding of statistical methods commonly used in policy analysis and be able to apply them to real-world problems in policy studies.", "outcome": "By the end of the course, students should be able to: Analyze and interpret policy data using descriptive statistics and statistical inference techniques. Apply appropriate statistical tests, such as t-tests and ANOVA, to policy data to answer research questions. Demonstrate proficiency in communicating statistical results to policy audiences through effective writing and data visualization techniques. Apply statistical techniques to solve real-world problems in policy analysis and data science.", "syllabus": " Introduction to Data Science, Statistics, and Policy Analysis  Overview of data science and policy analysis Role of statistics in policy analysis   Descriptive Statistics  Measures of central tendency (mean, median, mode) Measures of variability (range, variance, standard deviation) Probability distributions and histograms Box plots and scatter plots   Probability distributions  Basic concepts of probability theory Discrete and continuous probability distributions  Random variables and expected values   Inferential Statistics  Sampling distributions and the central limit theorem Point estimation and interval estimation Hypothesis testing and p-values Statistical power and effect size Type I and Type II errors   Choice of Statistical Tests  For example: T-test, ANOVA, and Chi-square test   Regression and Prediction  Correlation analysis Simple linear regression analysis   Communicating Statistical Results in a Policy Context  Writing statistical reports for policy audiences Creating effective data visualizations for policy audiences Interpreting and communicating statistical results for policy audiences  ", "required_readings": "Bruce, P. C., Bruce, A., & Gedeck, P. (2020). Practical statistics for data scientists : 50+ essential concepts using R and Python (Second edition.). O’Reilly Media, Inc.", "recommended_readings": "Salcedo, J. (2017). Basic Statistics and Data Mining for Data Science (1st edition). Packt Publishing. [Video]Rahman, A. (2020). Statistics for Data Science and Policy Analysis (A. Rahman, Ed.; 1st ed. 2020.). Springer Singapore.", "terms": {"2023-24 Term 2": {"--LEC (7424)": {"startTimes": ["14:30"], "endTimes": ["17:15"], "days": [3], "locations": ["Lee Shau Kee Archi Bldg G04"], "instructors": ["Dr. KWOK Pak Ki"], "meetingDates": ["10/1", "17/1", "24/1", "31/1", "7/2", "21/2", "28/2", "13/3", "20/3", "27/3", "3/4", "10/4", "17/4"]}}}, "assessments": {"Homework or assignment": "20", "Project": "40", "Participation": "10", "Test or quiz": "30"}}, {"code": "2101", "title": "Research Methods for Policy Studies", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "Lecture\nInteractive Tutorial", "campus": "Main Campus", "academic_group": "Data Science & Policy Stud PC", "requirements": "", "description": "This course introduces major methods used in policy studies research, with both quantitative and qualitative methods as the foci. This course discusses major methodological issues, stages and process of research, the use of appropriate methods, strategies and tools with the objective of enabling students to adopt a multimethod and critical approach to conduct research of public policies and data science. Course contents also include the interpretation and communication of findings to different stakeholders, research ethics and limitations, and using research to generate impact.", "outcome": "By the end of this course, students should be able to: a. Have a clear picture about the theory, concept, measurement, and hypothesis in research methods in policy studies; b. Know about the main stages and approaches for conducting qualitative and quantitative research in policy studies; c. Develop the basic skills to evaluate public policy and social programmes", "syllabus": "1) Introduction to major methods used in policy studies research (both quantitative and qualitative methods) 2) Theories and concepts of research principles and design 3) Knowledge of major statistical methods widely used in policy studies 4) Skills and methods in qualitative and quantitative analysis 5) Multimethod and critical approach to conduct research of public policies and data science 6) Ethics and social responsibilities of policy research", "required_readings": "- Neuman, W. L. (2013). Social research methods: Qualitative and quantitative approaches. Pearson education. - Majchrzak, A., & Markus, M. L. (2014). Methods for Policy Research. CA: Sage.", "recommended_readings": "- Bryman, A. (2016). Social research methods. NY: Oxford university press. - Denzin, N. K., & Lincoln, Y. S. (1994). Handbook of qualitative research. CA: Sage. - Singleton Jr, R., Straits, B. C., Straits, M. M., & McAllister, R. J. (1988). Approaches to social research. NY: Oxford University Press. - Spencer, L., & Ritchie, J. (2002). Qualitative data analysis for applied policy research. In Analyzing qualitative data (pp. 187-208). NY: Routledge.", "terms": {"2022-23 Term 2": {"--LEC (4720)": {"startTimes": ["14:30"], "endTimes": ["17:15"], "days": [2], "locations": ["Chen Kou Bun Bldg 108"], "instructors": ["Dr. KWOK Pak Ki"], "meetingDates": ["10/1", "17/1", "31/1", "7/2", "14/2", "21/2", "28/2", "14/3", "21/3", "28/3", "4/4", "11/4", "18/4"]}}, "2023-24 Term 1": {"--LEC (4774)": {"startTimes": ["14:30"], "endTimes": ["17:15"], "days": [1], "locations": ["Hui Yeung Shing Bldg G03"], "instructors": ["Dr. KWOK Pak Ki"], "meetingDates": ["4/9", "11/9", "18/9", "25/9", "9/10", "16/10", "30/10", "6/11", "13/11", "20/11", "27/11"]}}}, "assessments": {"Essay test or exam": "50", "Homework or assignment": "20", "Others": "10", "Project": "20"}}, {"code": "2102", "title": "Statistical Analysis for Policy Decision", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "Lecture\nInteractive Tutorial", "campus": "Main Campus", "academic_group": "Data Science & Policy Stud PC", "requirements": "Pre-requisite(s): DSPS1003", "description": "This course introduces the tools and techniques of statistical analysis for policy decision. In designing policies, statistical analysis provides the key to making evidence-based and data-driven decisions. This course teaches students how to collect and analyze both observational and experimental data, and make better decisions based on empirical findings. The course also equips students with a good foundation of statistical knowledge and quantitative skills to prepare them for mastering the data analytics and coding in data science.", "outcome": "By the end of this course, students should be able to: a. Develop the statistical skills for conducting quantitative research; b. Develop the effective skills to perform statistical analysis and evaluation on public policy; c. Establish a solid foundation for data analytics and coding in data science", "syllabus": "1) Introduction in quantitative analysis for policy research (tools and statistical techniques) 2) Statistical knowledge in quantitative analysis and decision-making in policies 3) Basic skills in designing quantitative research (data collection, hypothesis setting and testing, modeling, etc.) 4) Analyzing different kinds of data (e.g., observational data, experimental data) 5) Report of findings and data visualization 6) Major tools and statistical packages in quantitative analysis and data science", "required_readings": "- Agresti, A., Franklin, C. A., Klingenberg, B. (2016). Statistics: The art and science of learning from data. 4th ed. NY: Pearson. - Gorard, S. (2003). Quantitative methods in social science research. NY: Continuum. - Miller, J. D. (2017). Statistics for Data Science. UK: Packt.", "recommended_readings": "- Neuman, W. L. (2013). Social research methods: Qualitative and quantitative approaches. NY: Pearson education. - Punch, K. F. (2013). Introduction to social research: Quantitative and qualitative approaches. CA: Sage. - Thompson, B. (2002). What future quantitative social science research could look like: Confidence intervals for effect sizes. Educational Researcher, 31(3), 25-32. - Black, T. R. (1999). Doing quantitative research in the social sciences: An integrated approach to research design, measurement and statistics. CA: Sage.", "terms": {"2022-23 Term 1": {"--LEC (7259)": {"startTimes": ["14:30"], "endTimes": ["17:15"], "days": [1], "locations": ["Hui Yeung Shing Bldg 501"], "instructors": ["Professor CHAN Chee Hon"], "meetingDates": ["5/9", "19/9", "26/9", "3/10", "10/10", "17/10", "24/10", "31/10", "7/11", "14/11", "21/11", "28/11"]}}, "2023-24 Term 2": {"--LEC (6061)": {"startTimes": ["14:30"], "endTimes": ["17:15"], "days": [2], "locations": ["Hui Yeung Shing Bldg G03"], "instructors": ["Professor CHAN Chee Hon"], "meetingDates": ["9/1", "16/1", "23/1", "30/1", "6/2", "20/2", "27/2", "12/3", "19/3", "26/3", "2/4", "9/4", "16/4"]}}}, "assessments": {"Others": "10", "Project": "30", "Short answer test or exam": "60"}}, {"code": "2104", "title": "Advanced Programming for Data Science", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Data Science & Policy Stud PC", "requirements": "Pre-requisite(s): DSPS1003", "description": "This course is designed for students with prior programming experience interested in learning C# programming and game development. The course covers fundamental programming concepts like object-oriented programming, control structures, collections, and error handling in C#. Students will also learn how to create games with Unity, including working with the Unity editor, physics engine, game assets, and game AI.The course begins with an introduction to C# programming language and control structures and gradually progresses to advanced programming concepts, such as inheritance and polymorphism. Additionally, students will learn how to handle errors and debug code.The second half of the course focuses on Unity game development. Students will learn to use the Unity editor to create game objects, scenes, and gameplay mechanics. They will also learn to work with some of Unity's built-in features, e.g., animations, particle effects, and game AI.By the end of the course, students will have the skills and knowledge necessary to write a C# program and build a fully functional and engaging game with Unity.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "2201", "title": "Data Preprocessing for Data Analytics", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "Lecture\nInteractive Tutorial", "campus": "Main Campus", "academic_group": "Data Science & Policy Stud PC", "requirements": "Pre-requisite(s): DSPS2102 or (DSPS1003 and DSPS1004)", "description": "This course teaches students the major computing applications and coding languages, such as R and/or Python, of data analytics and how to apply them in public policy. The emphasis of the course is to apply data analytics to make theory-guided and data-driven policy decisions. With the technical competence provided by the course, students are expected to be both a skillful user of data analytics and an intelligent policymaker informed by data science.", "outcome": "Students are expected to acquire the basic knowledge of computing applications and coding languages, such as R and/or Python, of data analytics and apply it to solve problems in public policy.", "syllabus": "1) Introduction to data analytics for public policy  2) Quantitative research design and basic methods for analysis 3) Understanding the application of major computing applications and coding languages, such as R and/or Python 4) Basic knowledge in data collecting, data coding and analysis  5) Interpreting research results in different models", "required_readings": "- Dunleavy, P., & Margetts, H. (2015). Design principles for essentially digital governance. - Milan, S., & ten Oever, N. (2017). Coding and encoding rights in internet infrastructure. Internet Policy Review, 6(1). - Raschka, S., & Mirjalili, V. (2017). Python machine learning. Packt Publishing Ltd. - VanderPlas, J. (2016). Python Data Science Handbook. CA: O’Reilly.", "recommended_readings": "- Lane, J. (2016). Big data for public policy: The quadruple helix. Journal of Policy Analysis and Management, 35(3), 708-715. - Gil-Garcia, J. R., Pardo, T. A., & Luna-Reyes, L. F. (2018). Policy Analytics: Definitions, Components, Methods, and Illustrative Examples. In Policy Analytics, Modelling, and Informatics (pp. 1-16). Springer, Cham. - Sun, Y., Song, H., Jara, A. J., & Bie, R. (2016). Internet of things and big data analytics for smart and connected communities. IEEE access, 4, 766-773.", "terms": {"2022-23 Term 2": {"--LEC (4734)": {"startTimes": ["10:30"], "endTimes": ["13:15"], "days": [2], "locations": ["Wong Foo Yuan Bldg 401"], "instructors": ["Dr. WONG Kwong Cheong"], "meetingDates": ["10/1", "17/1", "31/1", "7/2", "14/2", "21/2", "28/2", "14/3", "21/3", "28/3", "4/4", "11/4", "18/4"]}}, "2023-24 Term 1": {"--LEC (6874)": {"startTimes": ["10:30"], "endTimes": ["13:15"], "days": [1], "locations": ["Chen Kou Bun Bldg 706C"], "instructors": ["Dr. WONG Kwong Cheong"], "meetingDates": ["4/9", "11/9", "18/9", "25/9", "9/10", "16/10", "30/10", "6/11", "13/11", "20/11", "27/11"]}}}, "assessments": {"Essay test or exam": "40", "Homework or assignment": "25", "Others": "10", "Project": "25"}}, {"code": "2202", "title": "Database Systems for Data Science", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Data Science & Policy Stud PC", "requirements": "Pre-requisite(s): DSPS1003", "description": "This course covers the fundamental concepts of database systems and their role in data science projects. Students will gain practical experience working with relational databases, as well as learn how to design effective data models and optimize database performance. Topics covered may include SQL basics, entity-relationship modeling, normalization, indexing, and query optimization. This course is ideal for individuals with prior programming experience interested in learning about databases for data science.", "outcome": "By the end of the course, students should be able to: Create effective data models using entity-relationship diagrams and normalization techniques. Write SQL queries to retrieve and manipulate data from relational databases. Evaluate the performance of database systems. Apply database systems to real-world examples.", "syllabus": " Introduction to Databases and Data Management  Overview of database systems and their role in data science Relational databases and their components  Data models, data schemas, and data types SQL basics for data retrieval and manipulation   Data Modeling and Normalization  Entity-relationship modeling and diagramming Normalization and data redundancy Relational database design principles   SQL for Data Science  SELECT statements and basic data retrieval Filtering and sorting data Joins and subqueries Aggregation functions and grouping Data modification statements (INSERT, UPDATE, DELETE)   Advanced Topics and Future Trends in Database Technologies  Database security and data privacy Database administration (e.g., backup and recovery strategies and user management) Database optimization (e.g., indexing, table partitioning and sharding, and query optimization) NoSQL databases and big data systems Data warehousing and business intelligence   Case Studies and Practical Applications  Real-world examples of databases in data science Data governance and ethics  ", "required_readings": "Beaulieu, A. (2020). Learning SQL (Third edition.). O’Reilly.Elmasri, R., & Navathe, S. (2016). Fundamentals of database systems (Seventh edition.). Pearson.", "recommended_readings": "Badia, A. (2020). SQL for data science: data cleaning, wrangling and analytics with relational databases. Springer Nature.Kleppmann, M. (2017). Designing data-intensive applications : the big ideas behind reliable, scalable, and maintainable systems (First edition.). O’Reilly Media.", "terms": {"2023-24 Term 1": {"--LEC (4464)": {"startTimes": ["10:30"], "endTimes": ["13:15"], "days": [4], "locations": ["Hui Yeung Shing Bldg 501"], "instructors": ["Dr. KWOK Pak Ki"], "meetingDates": ["7/9", "14/9", "21/9", "28/9", "5/10", "12/10", "19/10", "26/10", "2/11", "9/11", "16/11", "23/11", "30/11"]}}}, "assessments": {"Homework or assignment": "20", "Project": "40", "Participation": "10", "Test or quiz": "30"}}, {"code": "2301", "title": "Policy Analysis and Design Thinking", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "Lecture\nInteractive Tutorial", "campus": "Main Campus", "academic_group": "Data Science & Policy Stud PC", "requirements": "", "description": "This course integrates public policy analysis and design thinking to give students an integrated and comprehensive approach of resolving public problems. Design thinking, with its key features of being solution-based, user involvement, co-creation of knowledge, co-evolution of solution and problem, complements the economics-based and analytical model of public policy analysis well. Together they strengthen students’ ability in serving the dual role of a capable policy designer and an effective analyst who solve the policy problem and satisfy the diverse concerns of stakeholders.", "outcome": "By the end of this course, students should be able to: a. Understand the process of policy making and steps and theoretical perspectives of design thinking; b. Apply the framework of design thinking in policymaking; c. Analyze policy from different stakeholders’ perspectives in policy design;  d. Have a solid foundation of policy design and analysis.", "syllabus": "1) Basic knowledge in public policy analysis (key concepts, major theories, main methods) 2) Integrated and comprehensive approach in resolving public problem from a design thinking perspective 3) Process of policy making, understanding key factors (e.g., common interest, stakeholders, interest groups, etc.） 4) Understanding actors in policy design, their roles, and interaction dynamics  5) Acquiring knowledge about analytical model of public policy analysis", "required_readings": "- Brown, T. (2009). Change by Design: How Design Thinking Transforms Organizations and Inspires Innovation. NY: Harper Collins. - Dunn, W. N. (2015). Public policy analysis. NY: Routledge. - Weimer, D. L., & Vining, A. R. (2017). Policy analysis: Concepts and practice. NY: Routledge.", "recommended_readings": "- Liedtka, J., King, A., & Bennett, K. (2013). Solving Problems with Design Thinking: Ten Stories of What Works. NY: Columbia Business School - Howlett, M., Ramesh, M., & Perl, A. (2009). Studying public policy: Policy cycles and policy subsystems (Vol. 3). Oxford: Oxford University Press. - Sabatier, P. A., & Weible, C. M. (Eds.). (2014). Theories of the policy process. CA: Westview Press.", "terms": {"2022-23 Term 1": {"--LEC (6912)": {"startTimes": ["14:30"], "endTimes": ["17:15"], "days": [4], "locations": ["Wong Foo Yuan Bldg 405"], "instructors": ["Dr. WANG Daan"], "meetingDates": ["8/9", "15/9", "22/9", "29/9", "6/10", "13/10", "20/10", "27/10", "3/11", "10/11", "17/11", "24/11", "1/12"]}}, "2023-24 Term 2": {"--LEC (9169)": {"startTimes": ["10:30"], "endTimes": ["13:15"], "days": [4], "locations": ["Hui Yeung Shing Bldg G05"], "instructors": ["Professor WONG Wai Ho"], "meetingDates": ["11/1", "18/1", "25/1", "1/2", "8/2", "22/2", "29/2", "14/3", "21/3", "28/3", "11/4", "18/4"]}}}, "assessments": {"Essay test or exam": "70", "Others": "10", "Project": "20"}}, {"code": "2501", "title": "Managing Technology and Policy Innovation", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "Lecture\nInteractive Tutorial", "campus": "Main Campus", "academic_group": "Data Science & Policy Stud PC", "requirements": "", "description": "This course introduces the theories and strategies of managing technology and policy innovation by analyzing the process and key factors. It shows how organizational, institutional and social contexts are interconnected in fostering policy creativity and promoting the diffusion and adoption of innovation. It lets students understand that policy innovation via technologies is a social and organizational process and sustainable policy innovation is only possible with recognition of the technological, institutional, and human dimensions of technological innovation.", "outcome": "By the end of this course, students should be able to: a. Identify and understand key literature and theories on innovation in the public sector b. Understand how technology can encourage or hinder government innovation c. Identify the major factors driving the result and performance of policy innovation d. Draw experience from both local and global perspectives in analyzing cases of technology and innovation", "syllabus": "1) Theories and strategies of managing technology and policy innovation 2) Public policy analysis and application and development of technology 3) Policy creativity and innovation in organizational, institutional and social contexts 4) Mechanism and process of policy innovation, learning, and diffusion 5) Case studies in governmental innovation and policy innovation", "required_readings": "- Leyden, D. P., & Link, A. N. (2015). Public sector entrepreneurship: US technology and innovation policy. Oxford: OUP. - Mazzucato, M. (2016). From market fixing to market-creating: a new framework for innovation policy. Industry and Innovation, 23(2), 140-156. - Vonorta, N. S., Rouge, P. C., Aridi, A. (2015). Innovation Policy. NY: Springer. - Wallace, D. (2017). Environmental policy and industrial innovation: Strategies in Europe, the USA and Japan. NY: Routledge. (Chap 1 & 2).", "recommended_readings": "- Block, F. L., & Keller, M. R. (2015). State of innovation: the US government's role in technology development. NY: Routledge. (Chap 10 & 11). - Costantini, V., Crespi, F., Martini, C., & Pennacchio, L. (2015). Demand-pull and technology-push public support for eco-innovation: The case of the biofuels sector. Research Policy, 44(3), 577-595. - Guo, P., Wang, T., Li, D., & Zhou, X. (2016). How energy technology innovation affects transition of coal resource-based economy in China. Energy Policy, 92, 1-6. - Wallace, D. (2017). Environmental policy and industrial innovation: Strategies in Europe, the USA and Japan. NY: Routledge. (Chap 5 & 7).", "terms": {"2022-23 Term 2": {"--LEC (8501)": {"startTimes": ["14:30"], "endTimes": ["17:15"], "days": [1], "locations": ["Fung King Hey Bldg Swire Hall2"], "instructors": ["Dr. KWOK Pak Ki"], "meetingDates": ["9/1", "16/1", "30/1", "6/2", "13/2", "20/2", "27/2", "13/3", "20/3", "27/3", "3/4", "17/4"]}}, "2023-24 Term 2": {"--LEC (6352)": {"startTimes": ["14:30"], "endTimes": ["17:15"], "days": [1], "locations": ["Hui Yeung Shing Bldg 501"], "instructors": ["Dr. KWOK Pak Ki"], "meetingDates": ["8/1", "15/1", "22/1", "29/1", "5/2", "19/2", "26/2", "11/3", "18/3", "25/3", "8/4", "15/4"]}}}, "assessments": {"Essay test or exam": "50", "Others": "10", "Presentation": "20", "Project": "20"}}, {"code": "2730", "title": "Linear Algebra for Data Science", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Data Science & Policy Stud PC", "requirements": "Pre-requisite(s): DSPS1003", "description": "This course is designed to provide students with the essential foundational concepts of modern linear algebra for understanding contemporary data science and machine learning techniques. Stressing on intuition from coding rather than traditional mathematical proofs, this course approaches linear algebra from a computational perspective, where linear algebra concepts are implemented in Python code with a focus on applications in data science and machine learning. This course is ideal for students with prior programming experience who are interested in understanding modern linear algebra and its applications in data science and machine learning from a computational perspective.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "2830", "title": "Calculus for Data Science", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Data Science & Policy Stud PC", "requirements": "Pre-requisite(s): DSPS1003", "description": "This course is designed to provide students with the essential foundational concepts of calculus for understanding contemporary machine learning and data science algorithms in which calculus is used as an optimization tool. It approaches calculus, both single-variable and multivariate, from a computational perspective, stressing on intuition from coding rather than traditional mathematical proofs. This course is ideal for students with prior programming experience who are interested in understanding the powerful optimization algorithms used in modern data science and machine learning.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "3190", "title": "Big Data Analytics for Public Policy", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Data Science & Policy Stud PC", "requirements": "Pre-requisite(s): DSPS2202", "description": "This course provides a comprehensive understanding of Big Data computing systems and programming models. Students will gain hands-on experience working with mainstream open-source platforms for Big Data processing and analytics, including Hadoop and Spark. The course covers the architecture and components of Hadoop and Spark, data processing with Spark, and advanced topics such as Spark Streaming, graph processing, and machine learning. Students will learn to develop operational and programming tools for data collection, serialization, migration, and workflow coordination in Big Data pipelines. By the end of the course, students will be able to design and implement solutions to real-world Big Data problems using Hadoop or Spark. This course is ideal for students with prior programming and database experience interested in developing expertise in Big Data computing systems and programming models for processing and analyzing large-scale datasets.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "3202", "title": "Machine Learning for Public Policy", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "Lecture\nInteractive Tutorial", "campus": "Main Campus", "academic_group": "Data Science & Policy Stud PC", "requirements": "Pre-requisite(s): DSPS2201", "description": "This course introduces students to the machine learning concepts and techniques that are relevant to policy analytics. Major topics include linear regression, predictive modeling, classification, resampling methods, dimension reduction techniques, principal component analysis, smoothing splines. Additional topics such as decision trees, support vector machines and clustering methods may also be introduced. Students will learn how to employ these methods to conduct supervised and unsupervised learning for social and policy analytics, and gain hands-on experience with real-life data using data science software.", "outcome": "Students are expected to: Understand the distinction between supervised and unsupervised learning, and identify appropriate tools to address research questions with “big data” Make use of the following supervised learning algorithms: linear and logistic regression, K-nearest neighbors, discriminant analysis, cross-validation and bootstrap, shrinkage estimation, generalized additive models, tree-based methods, and support vector machines in social and policy analysis Apply basic unsupervised procedures including clustering and principal components analysis in social and policy analysis Appreciate the bias-variance tradeoff and apply model selection methods based on cross-validation and bootstrapping to a prediction challenge Analyze real-world dataset using data science software", "syllabus": "Major topics include linear regression, predictive modeling, classification, resampling methods, dimension reduction techniques, principal component analysis, smoothing splines. Additional topics such as decision trees, support vector machines and clustering methods may also be introduced.", "required_readings": "James, G., Witten, D., Hastie, T. and Tibshirani, R (2014). An Introduction to Statistical Learning, 8th printing 2017. New York: Springer.", "recommended_readings": "Magallanes, Jose Manuel (2017). Introduction to Data Science for Social and Policy Research: Collecting and Organizing Data with R and Python. New York: Cambridge University Press.Hastie, T., Tibshirani, R. and Friedman, J (2009). The Elements of Statistical Learning: Data Mining, Inference and Prediction, 2nd Edition.", "terms": {"2022-23 Term 1": {"--LEC (9061)": {"startTimes": ["10:30"], "endTimes": ["12:15"], "days": [4], "locations": ["Wu Ho Man Yuen Bldg 404"], "instructors": ["Dr. WONG Kwong Cheong"], "meetingDates": ["8/9", "15/9", "22/9", "29/9", "6/10", "13/10", "20/10", "27/10", "3/11", "10/11", "17/11", "24/11", "1/12"]}, "-T01-TUT (9145)": {"startTimes": ["12:30"], "endTimes": ["13:15"], "days": [4], "locations": ["Wu Ho Man Yuen Bldg 404"], "instructors": ["Dr. WONG Kwong Cheong"], "meetingDates": ["8/9", "15/9", "22/9", "29/9", "6/10", "13/10", "20/10", "27/10", "3/11", "10/11", "17/11", "24/11", "1/12"]}}, "2022-23 Summer Session": {"--LEC (1231)": {"startTimes": ["10:30", "10:30"], "endTimes": ["12:15", "12:15"], "days": [3, 1], "locations": ["Chen Kou Bun Bldg 108", "Chen Kou Bun Bldg 108"], "instructors": ["Dr. WONG Kwong Cheong", "Dr. WONG Kwong Cheong"], "meetingDates": ["15/5", "17/5", "22/5", "24/5", "29/5", "31/5", "5/6", "7/6", "12/6", "14/6", "19/6", "21/6", "26/6", "28/6"]}, "-T01-TUT (1327)": {"startTimes": ["12:30", "12:30"], "endTimes": ["13:15", "13:15"], "days": [3, 1], "locations": ["Chen Kou Bun Bldg 108", "Chen Kou Bun Bldg 108"], "instructors": ["Dr. WONG Kwong Cheong", "Dr. WONG Kwong Cheong"], "meetingDates": ["15/5", "17/5", "22/5", "24/5", "29/5", "31/5", "5/6", "7/6", "12/6", "14/6", "19/6", "21/6", "26/6", "28/6"]}}, "2023-24 Term 1": {"--LEC (6875)": {"startTimes": ["10:30"], "endTimes": ["12:15"], "days": [4], "locations": ["Hui Yeung Shing Bldg G03"], "instructors": ["Dr. WONG Kwong Cheong"], "meetingDates": ["7/9", "14/9", "21/9", "28/9", "5/10", "12/10", "19/10", "26/10", "2/11", "9/11", "16/11", "23/11", "30/11"]}, "-T01-TUT (6876)": {"startTimes": ["12:30"], "endTimes": ["13:15"], "days": [4], "locations": ["Hui Yeung Shing Bldg G03"], "instructors": ["Dr. WONG Kwong Cheong"], "meetingDates": ["7/9", "14/9", "21/9", "28/9", "5/10", "12/10", "19/10", "26/10", "2/11", "9/11", "16/11", "23/11", "30/11"]}}}, "assessments": {"Examination": "40", "Homework or assignment": "20", "Project": "30", "Participation": "10"}}, {"code": "3310", "title": "Collaborative Governance in a Global Context", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "Lecture\nInteractive Tutorial", "campus": "Main Campus", "academic_group": "Data Science & Policy Stud PC", "requirements": "", "description": "This course aims to provide students with knowledge, skills and applications of collaborative governance in a rapidly changing globalized world. Collaborative governance is broadly defined as the processes and structures of public policy decision making and management that engage people constructively across the boundaries of public, private and civic society for a public purpose that could not otherwise be accomplished. With the increasingly limited role of government in governance, the ability of policymakers to collaborate with non-state actors across levels and boundaries becomes critical for addressing policy challenges. The course focuses on how collaborative governance can build consensus and deliberative purposes of public policy and governance through studying its formats, process, rationales, concepts and outcomes as well as evaluation of its effectiveness and dilemma. The course also intends to nurture students to have a responsible and reflective role in society and to pursue a better governance.", "outcome": "By the end of this course, students should be able to: Understand how collaborative governance can benefit the policy making and implementation from multiple theoretical perspectives Understand the cooperation and negotiation among governments, the public and other key stakeholders Establish a knowledge structure of collaborative governance encompassing the dynamics in a global context Have the idea of pracitical collaborative governance by investigating the global cases of collaborative governance", "syllabus": " Introducing collaborative governance in a rapidly changing globalized world Understanding public policy decision making process in an interactive and global context Distinguish different actors and level of analysis in collaborative governance Challenges and difficulties in international cooperation and public policy problem-solving Future development and innovative mode", "required_readings": " Ansell, C., & Gash, A. (2008). Collaborative governance in theory and practice. Journal of public administration research and theory, 18(4), 543-571. Aoyama, Y., & Parthasarathy, B. (2016). The Rise of the Hybrid Domain: Collaborative Governance for Social Innovation. Cheltenham, Gloucestershire: Edward Elgar Publishing. Donahue, J. D., & Zeckhauser, R. J. (2011). Collaborative Governance: Private roles for public goals in turbulent times NJ: Princeton University Press. Emerson, K., Nabatchi, T., & Balogh, S. (2012). An integrative framework for collaborative governance. Journal of public administration research and theory, 22(1), 1-29.", "recommended_readings": " Huxham, C., Vangen, S., Huxham, C., & Eden, C. (2000). The challenge of collaborative governance. Public Management an International Journal of Research and Theory, 2(3), 337-358. Duffield, M. (2014). Global governance and the new wars: the merging of development and security. Zed Books Ltd.", "terms": {"2022-23 Term 1": {"--LEC (7523)": {"startTimes": ["10:30"], "endTimes": ["12:15"], "days": [3], "locations": ["Wu Ho Man Yuen Bldg 405"], "instructors": ["Dr. WANG Daan"], "meetingDates": ["7/9", "14/9", "21/9", "28/9", "5/10", "12/10", "19/10", "26/10", "2/11", "9/11", "16/11", "23/11", "30/11"]}, "-T01-TUT (7542)": {"startTimes": ["12:30"], "endTimes": ["13:15"], "days": [3], "locations": ["Wu Ho Man Yuen Bldg 405"], "instructors": ["Dr. WANG Daan"], "meetingDates": ["7/9", "14/9", "21/9", "28/9", "5/10", "12/10", "19/10", "26/10", "2/11", "9/11", "16/11", "23/11", "30/11"]}}}, "assessments": {"Essays": "25", "Examination": "40", "Presentation": "25", "Participation": "10"}}, {"code": "3320", "title": "Data Science and Regulation", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "Lecture\nInteractive Tutorial", "campus": "Main Campus", "academic_group": "Data Science & Policy Stud PC", "requirements": "", "description": "The course focuses on the regulatory issues and concerns when the governments take data science as a paradigm to enhance the capacity of public policy. Advance in data science radically transforms the way data can be handled and utilized, and inevitably generates new regulatory concerns and debates due to the clash of competing values and interests. For example, while privacy and citizen rights advocates strive to decrease unexpected uses of data, many scientists and institutions may attempt to use data to design and evaluate public policies in order to maximize its effectiveness. This course discusses theoretical approaches to regulations from multidisciplinary and transdisciplinary approaches for the analysis of regulatory institutions, practices and ideas in data regulation as well as the dillemma between utilization of data and its protection, accessibility and transparency.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "3330", "title": "AR/VR Applications for Policy Design", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Data Science & Policy Stud PC", "requirements": "Pre-requisite(s): DSPS1003", "description": "This course is designed to provide students with practical knowledge and skills in creating virtual and augmented reality (VR/AR) experiences for policy design and analysis. Students will learn about the capabilities and limitations of various VR/AR systems and their applications in policy design and analysis. They will also learn to create 3D models using appropriate software and techniques and use Unity as a development platform to create VR/AR applications. This course is ideal for students with prior programming experience interested in exploring VR/AR technology's potential for policy design and analysis.", "outcome": "By the end of the course, students should be able to: Describe the capabilities and limitations of VR/AR technology and their applications in policy design and analysis. Create 3D models using 3D modelling software and techniques, e.g., Blender Use Unity as a development tool to create VR/AR applications. Apply VR/AR tools to address actual policy issues and make better policy.", "syllabus": " Introduction to VR/AR Technology What is VR/AR technology? Different types of VR/AR systems and their capabilities. Examples of VR/AR applications in policy design and analysis. Fundamentals of 3D Modeling Overview of 3D modeling principles and techniques. Hands-on experience creating 3D models using software such as Blender. Unity for VR/AR App Development Introduction to Unity as a development platform for VR/AR apps. Fundamentals of creating VR/AR apps in Unity. Best practices for VR/AR app design. VR/AR for Policy Design Applying VR/AR technology to policy design and analysis. Hands-on experience using VR/AR tools to address actual policy issues. Collaboration and teamwork in VR/AR app development.", "required_readings": " Jerald, J. (2015). The VR book: Human-centered design for virtual reality. Morgan & Claypool. Murray, J. W. (2020). Building Virtual Reality with Unity and SteamVR. CRC Press.", "recommended_readings": " Bouna, P. (2022). C# Object-Oriented Programming for Beginners in C# and .NET.. Packt Publishing. (Video) Baron, D. (2021). Game development patterns with Unity 2021 : explore practical game development using industry design patterns and best practices in Unity and C# (2nd ed.). Packt Publishing.  Buttfield-Addison, P., Manning, J., & Nugent, T. (2019). Unity game development cookbook : essentials for every game (First edition.). O’Reilly Media, Inc.  Sapio, F. (2018). Practical Unity game development. PACKT Publishing. (Video)", "terms": {"2023-24 Term 2": {"--LEC (7425)": {"startTimes": ["10:30"], "endTimes": ["13:15"], "days": [2], "locations": ["Chen Kou Bun Bldg 706C"], "instructors": ["Dr. KWOK Pak Ki"], "meetingDates": ["9/1", "16/1", "23/1", "30/1", "6/2", "20/2", "27/2", "12/3", "19/3", "26/3", "2/4", "9/4", "16/4"]}}}, "assessments": {"Homework or assignment": "20", "Project": "50", "Participation": "10", "Test or quiz": "20"}}, {"code": "3350", "title": "Computer Simulation for Policymaking", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Data Science & Policy Stud PC", "requirements": "Pre-requisite(s): DSPS1003 and DSPS1004", "description": "This course introduces the fundamentals of systems modeling and simulation, which are increasingly popular tools for developing, implementing, and evaluating public policy. The course will expose students to diverse system modeling and simulation approaches and emphasize their applications in policymaking to equip them with the skills they will need to conduct technically-focused policy analysis. Teaching is conducted through class lectures and tutorials related to simulation software applications (e.g., Anylogic). This course is ideal for individuals with prior programming experience interested in exploring computer simulation’s potential for policy design and analysis.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "3501", "title": "Policy Leadership and Entrepreneurship Workshop", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "Interactive Tutorial\nWorkshop", "campus": "Main Campus", "academic_group": "Data Science & Policy Stud PC", "requirements": "", "description": "This course studies how leadership and entrepreneurship are interrelated to create social and political impacts throughout the policy process, in particular, how leadership acts as an important factor to influence the social environment to nurture entrepreneurial activities. Leadership provides social source of influence and vision that one uses to inspire action taken by others, and to mobilize others to achieve a common goal. Entrepreneurship is the recognition of opportunities by coupling needs, wants, resources, and problems with innovative solutions and make changes to society. With a workshop format, the course provides students more interactive experience to equip them with the mindset, skills, and strategies of policy leadership and entrepreneurship. Policy leaders and entrepreneurs will be invited to serve as guest speakers in order to offer students the opportunities to learn from their practical experience.", "outcome": "By the end of this course, students should be able to: Understand the concepts and theories of leadership and their practice in public policy Understand the concepts and theories of policy entrepreneurship and their practice Understand the relationships between policy leadership and entrepreneurship and how to integrate the two concepts to search for and respond to opportunities to have better results and innovations Apply the framework of policy leadership and entrepreneurship in major cases and policy areas across local and global contexts", "syllabus": " Foundation of policy leadership and entrepreneurship   Policy leadership and entrepreneurship in Hong Kong and major countries  Global governance and network under policy leadership and entrepreneurship  Application of policy leadership and entrepreneurship in major policy areas   Future research and agenda of policy leadership and entrepreneurship", "required_readings": " Harrison, R.T., & Leitch, C.M. (Eds.). (2018). Research Handbook on Entrepreneurship and Leadership. Cheltenham, UK: Edward Elgar Pub. Ho, M-H R., Kennedy, J.C., Uy, M.A., & Chan, K-Y. (2020). Entrepreneurship-Professionalism-Leadership: A Multidimensional Framework for Human Capital and Career Development in the 21st Century. Singapore: Springer Singapore Pte. Limited. Kuratko, D.F., & Morris, M.H. (2013). Entrepreneurship and leadership. Cheltenham, UK: Edward Elgar Publishing Limited.", "recommended_readings": " Eyal, O., & Kark, R. (2004). How do transformational leaders transform organizations?: A study of the relationship between leadership and entrepreneurship. Leadership and policy in schools, 3(3), 211-235. Reid, S. W., Anglin, A.H., Baur, J.E., Short, J.C., & Buckley, M.R. (2018). Blazing new trails or opportunity lost? Evaluating research at the intersection of leadership and entrepreneurship. The Leadership Quarterly, 29(1), 150-164.", "terms": {"2022-23 Term 2": {"-T01-TUT (7373)": {"startTimes": ["14:30"], "endTimes": ["16:15"], "days": [3], "locations": ["Wu Ho Man Yuen Bldg 405"], "instructors": ["Professor TAM Kam Lan Annie"], "meetingDates": ["11/1", "18/1", "1/2", "8/2", "15/2", "22/2", "1/3", "15/3", "22/3", "29/3", "12/4", "19/4"]}, "-W01-WKS (7374)": {"startTimes": ["16:30"], "endTimes": ["17:15"], "days": [3], "locations": ["Wu Ho Man Yuen Bldg 405"], "instructors": ["Professor TAM Kam Lan Annie"], "meetingDates": ["11/1", "18/1", "1/2", "8/2", "15/2", "22/2", "1/3", "15/3", "22/3", "29/3", "12/4", "19/4"]}}, "2023-24 Term 2": {"-T01-TUT (7672)": {"startTimes": ["14:30"], "endTimes": ["16:15"], "days": [3], "locations": ["Chen Kou Bun Bldg 108"], "instructors": ["Professor TAM Kam Lan Annie"], "meetingDates": ["10/1", "17/1", "24/1", "31/1", "7/2", "21/2", "28/2", "13/3", "20/3", "27/3", "3/4", "10/4", "17/4"]}, "-W01-WKS (7671)": {"startTimes": ["16:30"], "endTimes": ["17:15"], "days": [3], "locations": ["Chen Kou Bun Bldg 108"], "instructors": ["Professor TAM Kam Lan Annie"], "meetingDates": ["10/1", "17/1", "24/1", "31/1", "7/2", "21/2", "28/2", "13/3", "20/3", "27/3", "3/4", "10/4", "17/4"]}}}, "assessments": {"Classwork": "40", "Essays": "30", "Presentation": "20", "Participation": "10"}}, {"code": "3790", "title": "Social Network Analysis for Public Policy", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Data Science & Policy Stud PC", "requirements": "Pre-requisite(s): DSPS2201", "description": "This course is designed to introduce students to the concepts and methods of social network analysis (SNA), including network types, levels of analysis, data collection, descriptive methods and inferential methods, and their applications in public policy, such as policy agenda setting, policy network, advocacy coalition, policy learning and diffusion, and policy implementation. It also familiarizes students with network analysis software (e.g., Python and/or R). This course is ideal for students with basic knowledge of data analytics who are interested in understanding and using SNA in public policy studies.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "3791", "title": "Natural Language Processing for Public Policy", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Data Science & Policy Stud PC", "requirements": "Pre-requisite(s): DSPS3202", "description": "This course is designed to introduce students to some common methods of Natural Language Processing (NLP), including text classification, topic modelling, text summarization, event extraction and text scaling, and their applications in public policy, such as data collection for evidence-based policymaking, interpretation of political decisions, policy communication, and investigation of policy effects. It also familiarizes students with some of the most useful Python libraries for NLP, for example, transformers, stanza and spaCy. Ethical issues are also discussed. This course is ideal for students with basic knowledge of machine learning who are interested in understanding and using NLP tools in data-driven policymaking.", "outcome": "By the end of the course, students should be able to: Understand the principles behind the common NLP methods. Use the common Python libraries for NLP to solve problems. Describe the (mis-)uses of NLP in public policy.  Apply NLP tools to address actual policy issues and make better policy.", "syllabus": " NLP Methods Text Classification and Sentiment Analysis Topic Modelling: Latent Dirichlet Allocation (LDA), Principal Component Analysis (PCA) Text Summarization Event Extraction Score Prediction   Question Answering Culturally Adjusted Machine Translation  NLP Applications in Public Policy Data Collection for Evidence-based Policymaking Interpretation of Political Decisions Policy Communication Investigation of Policy Effects  Ethical Issues of NLP Applications in Public Policy  Python libraries for NLP transformers stanza spaCy", "required_readings": " Albrecht, J., Ramachandran, S., & Winkler, C. (2020). Blueprints for Text Analytics Using Python: Machine Learning-Based Solutions for Common Real World (NLP) Applications. O'Reilly Media. Jin, Z., & Mihalcea, R. (2022). Natural Language Processing for Policymaking. In Handbook of Computational Social Science for Policy (pp. 141-162). Springer.  Sarkar, D. (2019). Text Analytics with Python: A Practitioner's Guide to Natural Language Processing (2nd Edition). Apress.", "recommended_readings": " Bird, S., Klein, E., & Loper, E. (2009). Natural Language Processing with Python: Analyzing Text with the Natural Language Toolkit. O'Reilly Media. Jain, S. M. (2022). Introduction to Transformers for NLP: With the Hugging Face Library and Models to Solve Problems. Apress.  Taulli, T. (2023). Generative AI: A Non-Technical Introduction. Apress. Tunstall, L., von Werra, L., & Wolf, T. (2022). Natural Language Processing with Transformers (Revised Edition). O'Reilly Media. Vajjala, S., Majumder, B., & Gupta, A. (2020). Practical Natural Language Processing: A Comprehensive Guide to Building Real-World NLP Systems. O'Reilly Media.    Yildirim, S., & Asgari-Chenaghlu, M. (2021). Mastering Transformers: Build State-of-the-Art Models from Scratch with Advanced Natural Language Processing Techniques. Packt Publishing.  ", "terms": {"2023-24 Term 2": {"--LEC (9168)": {"startTimes": ["10:30"], "endTimes": ["13:15"], "days": [2], "locations": ["Wong Foo Yuan Bldg 405"], "instructors": ["Dr. WONG Kwong Cheong"], "meetingDates": ["9/1", "16/1", "23/1", "30/1", "6/2", "20/2", "27/2", "12/3", "19/3", "26/3", "2/4", "9/4", "16/4"]}}}, "assessments": {"Homework or assignment": "25", "Project": "30", "Participation": "10", "Test or quiz": "35"}}, {"code": "3801", "title": "Internship", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "Practicum", "campus": "Main Campus", "academic_group": "Data Science & Policy Stud PC", "requirements": "", "description": "The aim of this course is to provide students with practical work experiences in the application of both data science and policy studies learned in DSPS programme. Students will be given opportunities to observe and experience the management operations and to have hands-on experience in public sector, non-government organizations (NGOs), private sector etc., and to experience the work life in the sector, as well as to nurture students’ practical skills. It is recommended that the internship to be conducted in summer holiday, i.e. June to August, after finishing year two studies in the block mode (i.e. 5 days x 8 hours). DSPS Programme will deploy work units, agencies, or organizations that provide internships relevant to the general course objectives. Meanwhile, students are encouraged to explore opportunities of internship to fit their own specific learning needs. However, all self-selected internship must comply with the course requirements, and subjected to the approval of DSPS Programme Director. Guidance and assistance will be provided whenever appropriate.During the internship, each student would be guided and assisted by an academic supervisor. The supervisor offers advice and help whenever necessary during the attachment period. At the same time, each student will be receiving guidance and assistance from his/her agency supervisor. Students will submit self-evaluation report to reflect on the experience in the internship. Academic advice will be provided to help students consolidate their learning in the internship.", "outcome": "By the end of the course, students should be able to: Apply the learnt theories and knowledges into skills and practices in work experience Explore different career alternatives before they graduate Develop good work attitude which is essential to have job success Develop interpersonal skills, critical thinking skills and problem-solving skills which are applicable in both academic and working environment", "syllabus": "To be decided by the instructor and the internship organization", "required_readings": "Nil", "recommended_readings": "-  Nunley, J. M., Pugh, A., Romero, N., & Seals Jr, R. A. (2016). College major, internship experience, and employment opportunities: Estimates from a résumé audit. Labour Economics, 38, 37-46.-  Sweitzer, H. F., & King, M.A. (2019). The successful internship : personal, professional, and civic development in experiential learning. Boston, MA, USA : Cengage.", "terms": {"2022-23 Term 1": {"-P01-PRA (8947)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["No Room Required"], "instructors": ["Dr. WANG Daan"], "meetingDates": ["05/09/2022 - 28/11/2022"]}}, "2022-23 Term 2": {"-P01-PRA (8977)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["No Room Required"], "instructors": ["Dr. WONG Kwong Cheong"], "meetingDates": ["15/01/2023 - 23/04/2023"]}}, "2023-24 Term 1": {"-P01-PRA (7663)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["No Room Required"], "instructors": ["Dr. WONG Kwong Cheong"], "meetingDates": ["04/09/2023 - 27/11/2023"]}}, "2023-24 Term 2": {"-P01-PRA (4598)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["No Room Required"], "instructors": ["Dr. WONG Kwong Cheong"], "meetingDates": ["08/01/2024 - 15/04/2024"]}}}, "assessments": {"Internship or practicum": "80", "Report": "20"}}, {"code": "3802", "title": "Advanced Data Visualization", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "Lecture\nInteractive Tutorial", "campus": "Main Campus", "academic_group": "Data Science & Policy Stud PC", "requirements": "Pre-requisite(s): DSPS2201", "description": "This course is designed to equip students with the skills to convey data-driven insights clearly and effectively. The course begins with an introduction to data visualization and perception principles, followed by an overview of visualization design principles, data preparation and exploration, and advanced visualization techniques.Students will also learn about popular visualization tools (e.g., Tableau), virtual and augmented reality technologies, ethics and bias in data visualization, data storytelling, and data visualization for big data. The course concludes with a final project, where students apply the concepts learned throughout the course to create a high-impact data visualization using advanced technologies.This course is ideal for individuals with prior programming experience interested in exploring advanced data visualization techniques and technologies.", "outcome": "By the end of the course, students should be able to: Create effective data visualizations that convey complex information in a clear and compelling way. Apply design principles and best practices to data visualization, including color theory, typography, and layout. Use advanced visualization techniques such as 3D visualizations, interactive dashboards, and emerging technologies such as virtual and augmented reality (VR/AR). Identify and avoid common pitfalls and biases in data visualization.", "syllabus": " Introduction to Data Visualization and Perception Principles  What is data visualization? The importance of data visualization in decision-making Perception principles and how they affect data visualization   Fundamentals of Visualization Design  Principles of design, including color theory, layout, typography, and chart types Best practices for creating effective visualizations Critique of existing visualizations   Data Preparation and Exploration  Data cleaning, transformation, and aggregation Exploratory data analysis techniques Data preparation and exploration with Python and Tableau   Advanced Visualization Techniques / Tools  Emerging visualization techniques Overview of popular visualization tools such as Tableau, Power BI, and D3.js Comparison of different tools and their capabilities   Virtual Reality (VR) and Augmented Reality (AR) in Data Visualization  Introduction to VR and AR technologies VR and AR applications in data visualization Hands-on experience with VR and AR tools   Visualization Best Practices and Ethics  Best practices for visualizing data and presenting insights effectively Avoiding common visualization pitfalls Ethical considerations and potential biases in data visualization  ", "required_readings": "Dykes, B. (2020). Effective data storytelling : how to drive change with data, narrative, and visuals (1st edition). Wiley. Knaflic, C. N. (2015). Storytelling with data : a data visualization guide for business professionals. Wiley. ", "recommended_readings": "Meier, M., & Baldwin, D. (2021). Mastering Tableau 2021 : implement advanced business intelligence techniques and analytics with tableau (Third edition.). Packt. Murray, J. W. (2020). Building Virtual Reality with Unity and SteamVR. CRC Press.", "terms": {"2022-23 Term 1": {"--LEC (8655)": {"startTimes": ["10:30"], "endTimes": ["12:15"], "days": [1], "locations": ["Hui Yeung Shing Bldg G04"], "instructors": ["Professor CHEUNG Ho Ming"], "meetingDates": ["5/9", "12/9", "19/9", "26/9", "3/10", "10/10", "17/10", "24/10", "31/10", "7/11", "14/11", "21/11", "28/11"]}, "-T01-TUT (9146)": {"startTimes": ["12:30"], "endTimes": ["13:15"], "days": [1], "locations": ["Hui Yeung Shing Bldg G04"], "instructors": ["Professor CHEUNG Ho Ming"], "meetingDates": ["5/9", "12/9", "19/9", "26/9", "3/10", "10/10", "17/10", "24/10", "31/10", "7/11", "14/11", "21/11", "28/11"]}}, "2023-24 Term 1": {"--LEC (6877)": {"startTimes": ["10:30"], "endTimes": ["12:15"], "days": [2], "locations": ["Wong Foo Yuan Bldg 405"], "instructors": ["Dr. KWOK Pak Ki"], "meetingDates": ["5/9", "12/9", "19/9", "26/9", "3/10", "10/10", "17/10", "24/10", "31/10", "7/11", "14/11", "21/11", "28/11"]}, "-T01-TUT (6878)": {"startTimes": ["12:30"], "endTimes": ["13:15"], "days": [2], "locations": ["Wong Foo Yuan Bldg 405"], "instructors": ["Dr. KWOK Pak Ki"], "meetingDates": ["5/9", "12/9", "19/9", "26/9", "3/10", "10/10", "17/10", "24/10", "31/10", "7/11", "14/11", "21/11", "28/11"]}}}, "assessments": {"Homework or assignment": "20", "Project": "40", "Participation": "10", "Test or quiz": "30"}}, {"code": "3803", "title": "AI for Social Good", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "Lecture\nInteractive Tutorial", "campus": "Main Campus", "academic_group": "Data Science & Policy Stud PC", "requirements": "Pre-requisite(s): DSPS3202", "description": "This course introduces students with basic coding skills to modern Artificial Intelligence (AI) and its societal impacts. It focuses on the techniques of deep learning and reinforcement learning, the workhorse of modern data-centric AI technologies and their applications. Ethical challenges and policy implications of these powerful AI technologies and applications are critically discussed and their positive and negative impacts on achieving the United Nations’ Sustainable Development Goals (SDGs) critically evaluated. The main concern of the course is how to ensure that these disruptive modern AI technologies are used to do good, rather than bad, to society. An emphasis is put on the need for dedicated regulatory AI policies, both at the national and international levels.", "outcome": "By the end of the course, students should be able to: Discuss critically the (un)ethical use of AI technologies in society;  Understand the need for dedicated regulatory AI policies;  Appreciate the promising applications of AI technologies in achieving the United Nations’ Sustainable Development Goals;  Apply deep learning techniques to solve AI problems for social good.", "syllabus": " Introduction to Modern AI Technology Deep neural networks and deep learning Reinforcement learning Applications (facial recognition systems, self-driving cars, ChatGPT)  AI for Social Good and the Sustainable Development Goals  AI and the UN’s SDGs  AI and Ethics Ethics for AI AI Ethics Ethical AI  AI Policy ​National AI Strategies", "required_readings": " Coeckelbergh, M. (2020). AI Ethics. The MIT Press. Kelleher, J. D. (2019). Deep Learning. The MIT Press. Tomašev, N., Cornebise, J., Hutter, F., Mohamed, S., Picciariello, A., Connelly, B., ... & Clopath, C. (2020). AI for social good: Unlocking the opportunity for positive impact. Nature Communications, 11: 2468 Vinuesa, R., Azizpour, H., Leite, I., Balaam, M., Dignum, V., Domisch, S., ... & Nerini, F. (2020). The role of artificial intelligence in achieving the Sustainable Development Goals. Nature Communications, 11: 233. Xiao, P. (2022). AI Programming with Python: From Zero to Hero. Wiley.", "recommended_readings": " Boylan, M. & Teays, W. (Eds.). (2022). Ethics in the AI, Technology, and Information Age. Rowman & Littlefield Publishers.  Roberts, H., Cowls, J., Morley, J., Taddeo, M., Wang, V., & Floridi, L. (2021). The Chinese approach to artificial intelligence: An analysis of policy, ethics, and regulation. AI & Society, 36(1), 59-77. 2  Floridi, L., Cowls, J., Beltrametti, M., Chatila, R., Chazerand, P., Dignum, V., ... & Vayena, E. (2018). AI4People—An ethical framework for a good AI society: Opportunities, risks, principles, and recommendations. Minds and machines, 28(4), 689-707.  Floridi, L., Cowls, J., King, T. C., & Taddeo, M. (2020). How to design AI for social good: Seven essential factors. Science and Engineering Ethics, 26(3), 1771-1796.  Loy, J. (2019). Neural Network Projects with Python: The ultimate guide to using Python to explore the true power of neural networks through six projects. Packt.  de Pontves, H. (2019). AI Crash Course: A fun and hands-on introduction to machine learning, reinforcement learning, deep learning, and artificial intelligence with Python. Packt.  Renda, A. (2019). Artificial Intelligence: Ethics, Governance and Policy Challenges. CEPS Monograph. Brussels: Centre for European Policy Studies.  Renda, A. (2020). Europe: toward a policy framework for trustworthy AI. In: Dubber, M. D., Pasquale, F., & Das, S. (Eds.). The Oxford handbook of ethics of AI. Oxford University Press.  Sætra, H. S. (2022). AI for the Sustainable Development Goals. CRC Press.  Silver, D., Singh, S., Precup, D., & Sutton, R. S. (2021). Reward is enough. Artificial Intelligence, 299, 103535.  Taddeo, M., & Floridi, L. (2018). How AI can be a force for good. Science, 361(6404), 751-752.  Véliz, C. (2022). Oxford Handbook of Digital Ethics. Oxford University Press.", "terms": {"2022-23 Term 2": {"--LEC (8952)": {"startTimes": ["10:30"], "endTimes": ["12:15"], "days": [3], "locations": ["Wong Foo Yuan Bldg 405"], "instructors": ["Dr. WONG Kwong Cheong"], "meetingDates": ["11/1", "18/1", "1/2", "8/2", "15/2", "22/2", "1/3", "15/3", "22/3", "29/3", "12/4", "19/4"]}, "-T01-TUT (8953)": {"startTimes": ["12:30"], "endTimes": ["13:15"], "days": [3], "locations": ["Wong Foo Yuan Bldg 405"], "instructors": ["Dr. WONG Kwong Cheong"], "meetingDates": ["11/1", "18/1", "1/2", "8/2", "15/2", "22/2", "1/3", "15/3", "22/3", "29/3", "12/4", "19/4"]}}, "2023-24 Term 2": {"--LEC (7673)": {"startTimes": ["10:30"], "endTimes": ["12:15"], "days": [3], "locations": ["Chen Kou Bun Bldg 108"], "instructors": ["Dr. WONG Kwong Cheong"], "meetingDates": ["10/1", "17/1", "24/1", "31/1", "7/2", "21/2", "28/2", "13/3", "20/3", "27/3", "3/4", "10/4", "17/4"]}, "-T01-TUT (7674)": {"startTimes": ["12:30"], "endTimes": ["13:15"], "days": [3], "locations": ["Chen Kou Bun Bldg 108"], "instructors": ["Dr. WONG Kwong Cheong"], "meetingDates": ["10/1", "17/1", "24/1", "31/1", "7/2", "21/2", "28/2", "13/3", "20/3", "27/3", "3/4", "10/4", "17/4"]}}}, "assessments": {"Homework or assignment": "25", "Project": "30", "Participation": "10", "Test or quiz": "35"}}, {"code": "4203", "title": "Advanced Applications of Data Science in Public Policy", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "Lecture\nInteractive Tutorial", "campus": "Main Campus", "academic_group": "Data Science & Policy Stud PC", "requirements": "Pre-requisite(s): DSPS2201 and DSPS3202", "description": "This is a special-topics course on advanced applications of data science in decision making, visualization, research, analytics and presentation techniques to inform policy decision-making. Topics covered would depend on knowledge and expertise of the instructor, and the latest development and innovations in the field. Students will be equipped with the most advanced capacities and methods to conduct data analytics related to policy decisions.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "4310", "title": "Policy and Programme Evaluation", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "Seminar", "campus": "Main Campus", "academic_group": "Data Science & Policy Stud PC", "requirements": "Pre-requisite(s): DSPS2102", "description": "Policy and programme evaluation has become increasingly important in the face of complex and intractable public problems to ensure a systematic and evidence-based understanding of whether and how current interventions have achieved the desired results. This course introduces the essential concepts, theories and methodological tools of policy and programme evaluation. Through seminars and real-world examples, students will learn why, when and how to design and conduct rigorous evaluations in different policy contexts. Overall, this course aims to equip students with the knowledge and skills to critically assess evaluation studies and develop their own evaluation projects.", "outcome": "By the end of this course, students should be able to: Acquire key concepts and skills for designing, planning and implementing policy and programme evaluation with applications to the public and non-public sectors; Understand the context, purpose, rationale and process of evaluation;  Be familiar with current evaluation methods in local and international settings, including their strengths and limitations;  Critically examine policy and programme evaluation studies; and  Undertake an evaluation exercise and gain experience in designing, planning, implementing and evaluating a policy or programme.", "syllabus": "Week 1: Introduction to Policy and Programme Evaluation; Persona of Evaluation CasesWeek 2: Fundamental Policy and Programme Evaluation DesignWeek 3: Systematic Review in Policy and Programme Evaluation IWeek 4: Systematic Review in Policy and Programme Evaluation II; Programme Evaluation Theory IWeek 5: Programme Evaluation Theory IIWeek 6: Assignment WeekWeek 7: Seminar on mini-evaluation studyWeek 8: Evaluating ComplexityWeek 9: Evaluating Impact IWeek 10: Evaluating Impact IIWeek 11: Student-led Seminar Session; Advanced Topics on Policy and Programme Evaluation IWeel 12: Advanced Topics on Policy and Programme Evaluation IIWeek 13: Mini-evaluation Project Presentation", "required_readings": "Gertler, P. J., Martinez, S., Premand, P., Rawlings, L. B., & Vermeersch, C. M. (2016). Impact evaluation in practice. World Bank Publications.Linfield, K. J., & Posavac, E. J. (2018). Program evaluation: Methods and case studies. Routledge.Mertens, D. M., & Wilson, A. T. (2018). Program evaluation theory and practice. Guilford Publications.Rossi, P. H., Lipsey, M. W., & Henry, G. T. (2018). Evaluation: A systematic approach (8th Ed). Sage publications.", "recommended_readings": "", "terms": {"2022-23 Term 2": {"-S01-SEM (8976)": {"startTimes": ["14:30"], "endTimes": ["17:15"], "days": [4], "locations": ["Hui Yeung Shing Bldg 501"], "instructors": ["Professor CHAN Chee Hon"], "meetingDates": ["12/1", "19/1", "2/2", "9/2", "16/2", "23/2", "2/3", "16/3", "23/3", "30/3", "6/4", "13/4", "20/4"]}}, "2023-24 Term 2": {"-S01-SEM (8778)": {"startTimes": ["14:30"], "endTimes": ["17:15"], "days": [4], "locations": ["Chen Kou Bun Bldg 123"], "instructors": ["Professor CHAN Chee Hon"], "meetingDates": ["11/1", "18/1", "25/1", "1/2", "8/2", "22/2", "29/2", "14/3", "21/3", "28/3", "11/4", "18/4"]}}}, "assessments": {"Homework or assignment": "35", "Presentation": "25", "Project": "30", "Participation": "10"}}, {"code": "4801", "title": "Graduation Capstone Project I", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "Project", "campus": "Main Campus", "academic_group": "Data Science & Policy Stud PC", "requirements": "", "description": "The graduation capstone project is about generating innovative ideas and implementing actionable knowledge to create impactful solutions. It offers students the opportunity to conduct a project on a selected topic under supervision related to data science and policy studies. While students are expected to integrate and apply what they have learned in the courses, internship, overseas exchanges and other learning opportunities, they are expected to address a real-world issue and to formulate feasible solutions and/or policy recommendations for the issue. Students are expected to meet their supervisor regularly, present their findings and exhibit their final product in any formats after developing a mutual consent between students and supervisor.", "outcome": "By the end of this course, students should be able to: Identify a topic with a specific client in mind for generating innovative ideas and implementing actionable knowledge to create impactful solutions Identify previous academic works and innovative projects as references to their topic Consult client on the project topic, concerns and expectation Plan and organize the whole project design Collect and analyse data Present findings and policy recommendations", "syllabus": "1. Identify the topic  2. Literature review 3. Client consultation and expectations assessment 4. Project design  5. Data collection and analysis  6. Presentation of findings and policy implementation", "required_readings": "To be decided by the course teacher concerned based on the topic selected", "recommended_readings": "To be decided by the course teacher concerned based on the topic selected", "terms": {"2022-23 Term 1": {"-J01-PRJ (8232)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["No Room Required"], "instructors": ["Dr. LO Man Fung, \n\nDr. WONG Kwong Cheong, \n\nProfessor CHAN Chee Hon, \n\nProfessor CHEUNG Ho Ming, \n\nProfessor TAM Kam Lan Annie"], "meetingDates": ["05/09/2022 - 28/11/2022"]}}, "2022-23 Term 2": {"-J01-PRJ (8502)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["No Room Required"], "instructors": ["Dr. LO Man Fung, \n\nDr. WONG Kwong Cheong, \n\nProfessor CHAN Chee Hon, \n\nProfessor CHEUNG Ho Ming, \n\nProfessor TAM Kam Lan Annie"], "meetingDates": ["09/01/2023 - 17/04/2023"]}}, "2023-24 Term 1": {"-J01-PRJ (6741)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["No Room Required"], "instructors": ["Dr. KWOK Pak Ki, \n\nDr. LO Man Fung, \n\nDr. WONG Kwong Cheong, \n\nProfessor CHAN Chee Hon, \n\nProfessor TAM Kam Lan Annie, \n\nProfessor WONG Wai Ho"], "meetingDates": ["04/09/2023 - 27/11/2023"]}}, "2023-24 Term 2": {"-J01-PRJ (5523)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["No Room Required"], "instructors": ["Dr. LO Man Fung, \n\nDr. WONG Kwong Cheong, \n\nProfessor CHAN Chee Hon, \n\nProfessor CHEUNG Ho Ming, \n\nProfessor TAM Kam Lan Annie"], "meetingDates": ["08/01/2024 - 15/04/2024"]}}}, "assessments": {"Presentation": "20", "Project": "70", "Participation": "10"}}, {"code": "4802", "title": "Graduation Capstone Project II", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "Project", "campus": "Main Campus", "academic_group": "Data Science & Policy Stud PC", "requirements": "", "description": "The graduation capstone project is about generating innovative ideas and implementing actionable knowledge to create impactful solutions. It offers students the opportunity to conduct a project on a selected topic under supervision related to data science and policy studies. While students are expected to integrate and apply what they have learned in the courses, internship, overseas exchanges and other learning opportunities, they are expected to address a real-world issue and to formulate feasible solutions and/or policy recommendations for the issue. Students are expected to meet their supervisor regularly, present their findings and exhibit their final product in any formats after developing a mutual consent between students and supervisor.", "outcome": "In this course, students are expected to continue to work on the project they have been developed in DSPS4801 and to exhibit their final project product. By the end of this course, students should be able to: Review progress and output in DSPS4801 Fine tune the project’s theoretical framework and structure Maintain continuous consultation and establish communication with clients Execute data analysis and data implication analysis Present findings and policy recommendations Generate a project report which meets the standard requested by the supervisor", "syllabus": "1. Review of progress and output in DSPS4801  2. Revision and redesign amendment of project if necessary 3. Continuous consultation and communication with clients 4. Additional data collection and analysis  5. Presentation of findings and policy implementation", "required_readings": "To be decided by the course teacher concerned based on the topic selected", "recommended_readings": "To be decided by the course teacher concerned based on the topic selected", "terms": {"2022-23 Term 2": {"-J01-PRJ (8542)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["No Room Required"], "instructors": ["Dr. LO Man Fung, \n\nDr. WONG Kwong Cheong, \n\nProfessor CHAN Chee Hon, \n\nProfessor CHEUNG Ho Ming, \n\nProfessor TAM Kam Lan Annie"], "meetingDates": ["09/01/2023 - 17/04/2023"]}}, "2022-23 Summer Session": {"-J01-PRJ (1571)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["No Room Required"], "instructors": ["Dr. WONG Kwong Cheong"], "meetingDates": ["15/05/2023 - 26/06/2023"]}}, "2023-24 Term 1": {"-J01-PRJ (8255)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["No Room Required"], "instructors": ["Professor WONG Wai Ho"], "meetingDates": ["04/09/2023 - 27/11/2023"]}}, "2023-24 Term 2": {"-J01-PRJ (5522)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["No Room Required"], "instructors": ["Dr. KWOK Pak Ki, \n\nDr. LO Man Fung, \n\nDr. WONG Kwong Cheong, \n\nProfessor CHAN Chee Hon, \n\nProfessor TAM Kam Lan Annie, \n\nProfessor WONG Wai Ho"], "meetingDates": ["08/01/2024 - 15/04/2024"]}}}, "assessments": {"Presentation": "20", "Project": "70", "Participation": "10"}}, {"code": "4803", "title": "Selected Topics in Data Science and Policy Studies III", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "Lecture\nInteractive Tutorial", "campus": "Main Campus", "academic_group": "Data Science & Policy Stud PC", "requirements": "", "description": "This course provides an in-depth analysis of important topics in data science and policy studies. The focus of the course may vary according to the area of expertise of the instructor and the interests of the class.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "4804", "title": "Selected Topics in Data Science and Policy Studies IV", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "Lecture\nInteractive Tutorial", "campus": "Main Campus", "academic_group": "Data Science & Policy Stud PC", "requirements": "", "description": "This course provides an in-depth analysis of important topics in data science and policy studies. The focus of the course may vary according to the area of expertise of the instructor and the interests of the class.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}]