[{"code": "1001", "title": "Introduction to Policy Sciences", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "Lecture\nInteractive Tutorial", "campus": "Main Campus", "academic_group": "Data Science & Policy Stud PC", "requirements": "", "description": "This course introduces key concepts, theories and models in the study of policy sciences. To resolve complex and multi-level public problems of a globalized world in ways that help to identify and enhance the common interest, policy sciences provide an integrated and interdisciplinary approach for making good policy decisions. This course also aims to help students understand the process and structure in designing policies. The concerns of this course are integrating theory and practice into actionable social knowledge and apply it to real world problems.", "outcome": "By the end of this course, students should be able to: a. Understand the policy process and its application in real life policies; b. Understand key concepts and theoretical approaches to public sciences and analysis; c. Adopt and apply theories to understand real world problems; d. Formulate their own knowledge system based on the knowledge and concepts introduced.", "syllabus": "1. Introduction to Policy Sciences and public policy  2. Basic concepts & theories in Policy Sciences 3. Key models and frameworks in Policy Analysis  4. Wicked problems & international affairs in the globalized world 5. Integrated and interdisciplinary approach for policy-making 6. Main process and structure in designing and evaluating policies 7. Theories and its application in the context of Hong Kong and comparative contexts", "required_readings": "- Howlett, M., Ramesh, M., & Perl, A. (2009). Studying public policy: Policy cycles and policy subsystems (Vol. 3). Oxford: Oxford University Press. - Sabatier, P. A., & Weible, C. M. (Eds.). (2014). Theories of the policy process. Westview Press.", "recommended_readings": "- Birkland, T. A. (2015). An introduction to the policy process: Theories, concepts, and models of public policy making. Routledge. - Hajer, M., Hajer, M. A., & Wagenaar, H. (Eds.). (2003). Deliberative policy analysis: understanding governance in the network society. Cambridge University Press. - Innes, J. E., & Booher, D. E. (2010). Planning with complexity: An introduction to collaborative rationality for public policy. Routledge.", "terms": {"2024-25 Term 1": {"--LEC (6974)": {"startTimes": ["14:30"], "endTimes": ["17:15"], "days": [3], "locations": ["Lee Shau Kee Archi Bldg G02"], "instructors": ["Professor CHAN Chee Hon"], "meetingDates": ["4/9", "11/9", "25/9", "2/10", "9/10", "16/10", "23/10", "30/10", "6/11", "13/11", "20/11", "27/11"]}}}, "assessments": {"Essay test or exam": "70", "Homework or assignment": "20", "Others": "10"}}, {"code": "1002", "title": "Data Science and Public Policy", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Data Science & Policy Stud PC", "requirements": "", "description": "(UGEC1731 is double-coded with DSPS1002.) This course focuses on the important connection between data science and public policy by identifying and analyzing the policy challenges posed by data science technologies. It assesses what policy options and tools are available to address them and examines what new capacities governments and also citizens must develop in the era of data science. Students would also be introduced to the professional and ethical responsibilities and social, economic, political and legal impacts under the changes and innovations brought by data science.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "1003", "title": "Foundation of Data Science", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "Lecture\nInteractive Tutorial", "campus": "Main Campus", "academic_group": "Data Science & Policy Stud PC", "requirements": "", "description": "This course is intended for students with little or no programming experience. It is designed to provide students with a firm foundation for learning modern data science, which uses computer programming to wrangle and analyze data. Adopting a hands-on approach, this course covers all the basics of programming in Python, as well as general computer programming concepts and techniques, such as branching, looping and inheritance. It also familiarizes students with some of the most useful Python libraries for data science, such as NumPy, pandas and matplotlib. This course plays a foundational role in the data science curriculum.", "outcome": "By the end of the course, students should be able to: Understand the role computation can play in solving problems. Understand the basic programming concepts and techniques. Write programs in Python that allow them to accomplish useful goals.  Use Python libraries to complete simple data science tasks. ", "syllabus": " Values and Variables   Simple Data Types: int, float, string, boolean  Lists  Conditional Statements: if, if-else, if-elif-else  Dictionaries  User Input   Iteration: for loops, while loops  Functions and Modules  Classes and Objects  Files  Exceptions  Python libraries for data science: NumPy, pandas, matplotlib.", "required_readings": " Lacey, N. (2019). Python by Example: Learning to Program in 150 Challenges. Cambridge University Press. Matthes, E. (2023). Python Crash Course: A Hands-On, Project-Based Introduction to Programming (3rd Edition). No Starch Press. Vasiliev, Y. (2022). Python for Data Science: A Hands-On Introduction. No Starch Press.", "recommended_readings": " Deitel, P., & Deitel, H. (2019). Intro to Python for Computer Science and Data Science: Learning to Program with AI, Big Data and the Cloud. Pearson. Milliken, C. P. (2019). Python Projects for Beginners: A Ten-Week Bootcamp Approach to Python Programming. Apress. Shaw, Z. (2017). Learn Python 3 the Hard Way: A Very Simple Introduction to the Terrifyingly Beautiful World of Computers and Code. Addison-Wesley Professional. Stephenson, B. (2019). The Python Workbook: A Brief Introduction with Exercises and Solutions (2nd Edition). Springer. Sweigart, A. (2019). Automate the Boring Stuff with Python: Practical Programming for Total Beginners (2nd Edition). No Starch Press. Sweigart, A. (2021). The Big Book of Small Python Projects: 81 Easy Practice Programs. No Starch Press. Ustun, I. (2018). Learning Python for Data Science. Packt Publishing. [Video]. VanderPlas, J. (2022). Python Data Science Handbook (2nd Edition). O'Reilly Media. Zelle, J. (2016). Python Programming: An Introduction to Computer Science (3rd Edition). Franklin, Beedle & Associates.", "terms": {"2024-25 Term 1": {"A-LEC (5078)": {"startTimes": ["14:30"], "endTimes": ["17:15"], "days": [2], "locations": ["Wong Foo Yuan Bldg UG01"], "instructors": ["Dr. WONG Kwong Cheong"], "meetingDates": ["3/9", "10/9", "17/9", "24/9", "8/10", "15/10", "22/10", "29/10", "5/11", "12/11", "19/11", "26/11"]}}}, "assessments": {"Homework or assignment": "50", "Participation": "10", "Test or quiz": "40"}}, {"code": "1004", "title": "Statistics for Data Science and Policy Studies", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Data Science & Policy Stud PC", "requirements": "", "description": "This course provides an introduction to data science and its applications in policy analysis. Students will learn the fundamental concepts of statistics and probability theory and their role in policy research. Through hands-on exercises and case studies, students will gain practical experience in descriptive statistics, probability distributions, statistical inference, and analysis. Students will also develop skills in communicating statistical results to policy audiences through effective writing and data visualization techniques. By the end of the course, students will have a solid understanding of statistical methods commonly used in policy analysis and be able to apply them to real-world problems in policy studies.", "outcome": "By the end of the course, students should be able to: Analyze and interpret policy data using descriptive statistics and statistical inference techniques. Apply appropriate statistical tests, such as t-tests and ANOVA, to policy data to answer research questions. Demonstrate proficiency in communicating statistical results to policy audiences through effective writing and data visualization techniques. Apply statistical techniques to solve real-world problems in policy analysis and data science.", "syllabus": " Introduction to Data Science, Statistics, and Policy Analysis  Overview of data science and policy analysis Role of statistics in policy analysis   Descriptive Statistics  Measures of central tendency (mean, median, mode) Measures of variability (range, variance, standard deviation) Probability distributions and histograms Box plots and scatter plots   Probability distributions  Basic concepts of probability theory Discrete and continuous probability distributions  Random variables and expected values   Inferential Statistics  Sampling distributions and the central limit theorem Point estimation and interval estimation Hypothesis testing and p-values Statistical power and effect size Type I and Type II errors   Choice of Statistical Tests  For example: T-test, ANOVA, and Chi-square test   Regression and Prediction  Correlation analysis Simple linear regression analysis   Communicating Statistical Results in a Policy Context  Writing statistical reports for policy audiences Creating effective data visualizations for policy audiences Interpreting and communicating statistical results for policy audiences  ", "required_readings": "Bruce, P. C., Bruce, A., & Gedeck, P. (2020). Practical statistics for data scientists : 50+ essential concepts using R and Python (Second edition.). O’Reilly Media, Inc.", "recommended_readings": "Salcedo, J. (2017). Basic Statistics and Data Mining for Data Science (1st edition). Packt Publishing. [Video]Rahman, A. (2020). Statistics for Data Science and Policy Analysis (A. Rahman, Ed.; 1st ed. 2020.). Springer Singapore.", "terms": {"2024-25 Term 2": {"--LEC (8625)": {"startTimes": ["14:30"], "endTimes": ["17:15"], "days": [1], "locations": ["Hui Yeung Shing Bldg 501"], "instructors": ["Dr. KWOK Pak Ki"], "meetingDates": ["6/1", "13/1", "20/1", "27/1", "10/2", "17/2", "24/2", "10/3", "17/3", "24/3", "31/3", "7/4", "14/4"]}}}, "assessments": {"Homework or assignment": "20", "Project": "40", "Participation": "10", "Test or quiz": "30"}}, {"code": "2101", "title": "Research Methods for Policy Studies", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "Lecture\nInteractive Tutorial", "campus": "Main Campus", "academic_group": "Data Science & Policy Stud PC", "requirements": "", "description": "This course introduces major methods used in policy studies research, with both quantitative and qualitative methods as the foci. This course discusses major methodological issues, stages and process of research, the use of appropriate methods, strategies and tools with the objective of enabling students to adopt a multimethod and critical approach to conduct research of public policies and data science. Course contents also include the interpretation and communication of findings to different stakeholders, research ethics and limitations, and using research to generate impact.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "2102", "title": "Statistical Analysis for Policy Decision", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "Lecture\nInteractive Tutorial", "campus": "Main Campus", "academic_group": "Data Science & Policy Stud PC", "requirements": "Pre-requisite(s): DSPS1004", "description": "This course introduces statistical concepts and applications of quantitative social science research and policy analysis. The course serves as a foundation for students who are interested in the interplay of data science, statistics, and policy making. The course provides an understanding on how decisions are made in policy contexts and how data science and statistical analysis inform policy process. The course covers various topics of statistical analysis and its applications in policy decision making. Students are also expected to learn some coding techniques using real-world data for the purpose of informing policy decision making.", "outcome": "By the end of this course, students should be able to: a. Develop the statistical skills for conducting quantitative research; b. Develop the effective skills to perform statistical analysis and evaluation on public policy; c. Establish a solid foundation for data analytics and coding in data science", "syllabus": "1) Introduction in quantitative analysis for policy research (tools and statistical techniques) 2) Statistical knowledge in quantitative analysis and decision-making in policies 3) Basic skills in designing quantitative research (data collection, hypothesis setting and testing, modeling, etc.) 4) Analyzing different kinds of data (e.g., observational data, experimental data) 5) Report of findings and data visualization 6) Major tools and statistical packages in quantitative analysis and data science", "required_readings": "- Agresti, A., Franklin, C. A., Klingenberg, B. (2016). Statistics: The art and science of learning from data. 4th ed. NY: Pearson. - Gorard, S. (2003). Quantitative methods in social science research. NY: Continuum. - Miller, J. D. (2017). Statistics for Data Science. UK: Packt.", "recommended_readings": "- Neuman, W. L. (2013). Social research methods: Qualitative and quantitative approaches. NY: Pearson education. - Punch, K. F. (2013). Introduction to social research: Quantitative and qualitative approaches. CA: Sage. - Thompson, B. (2002). What future quantitative social science research could look like: Confidence intervals for effect sizes. Educational Researcher, 31(3), 25-32. - Black, T. R. (1999). Doing quantitative research in the social sciences: An integrated approach to research design, measurement and statistics. CA: Sage.", "terms": {"2024-25 Term 2": {"--LEC (8629)": {"startTimes": ["14:30"], "endTimes": ["17:15"], "days": [4], "locations": ["Chen Kou Bun Bldg 123"], "instructors": ["Professor CHAN Chee Hon"], "meetingDates": ["9/1", "16/1", "23/1", "6/2", "13/2", "20/2", "27/2", "13/3", "20/3", "27/3", "3/4", "10/4", "17/4"]}}}, "assessments": {"Classwork": "40", "Presentation": "15", "Project": "35", "Participation": "10"}}, {"code": "2104", "title": "Advanced Programming for Data Science", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Data Science & Policy Stud PC", "requirements": "Pre-requisite(s): DSPS1003", "description": "This course is designed for students with prior programming experience interested in learning C# programming and game development. The course covers fundamental programming concepts like object-oriented programming, control structures, collections, and error handling in C#. Students will also learn how to create games with Unity, including working with the Unity editor, physics engine, game assets, and game AI.The course begins with an introduction to C# programming language and control structures and gradually progresses to advanced programming concepts, such as inheritance and polymorphism. Additionally, students will learn how to handle errors and debug code.The second half of the course focuses on Unity game development. Students will learn to use the Unity editor to create game objects, scenes, and gameplay mechanics. They will also learn to work with some of Unity's built-in features, e.g., animations, particle effects, and game AI.By the end of the course, students will have the skills and knowledge necessary to write a C# program and build a fully functional and engaging game with Unity.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "2201", "title": "Data Preprocessing for Data Analytics", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "Lecture\nInteractive Tutorial", "campus": "Main Campus", "academic_group": "Data Science & Policy Stud PC", "requirements": "Pre-requisite(s): DSPS2102 or (DSPS1003 and DSPS1004)", "description": "This course teaches students the major computing applications and coding languages, such as Python, of data analytics and how to apply them in public policy. The emphasis of the course is to apply data analytics to make theory-guided and data-driven policy decisions. With the technical competence provided by the course, students are expected to be both a skillful user of data analytics and an intelligent policymaker informed by data science. This course focuses on the data preprocessing stage in the data science lifecycle and teaches the efficient use of powerful tools for data preprocessing such as pandas.", "outcome": "Students are expected to acquire the basic knowledge of computing applications and coding languages, such as Python, of data analytics and apply it to solve problems in public policy.", "syllabus": "1) Introduction to data analytics for public policy  2) Quantitative research design and basic methods for analysis 3) Understanding the application of major computing applications and coding languages, such as Python 4) Basic knowledge in data collecting, data cleaning and analysis  5) Interpreting research results in different models", "required_readings": "- Chen, D. (2022). Pandas for Everyone: Python Data Analysis (2nd edition). Addison-Wesley.- Dunleavy, P., & Margetts, H. (2015). Design principles for essentially digital governance. - Milan, S., & ten Oever, N. (2017). Coding and encoding rights in internet infrastructure. Internet Policy Review, 6(1). - Raschka, S., & Mirjalili, V. (2017). Python machine learning. Packt Publishing Ltd. - VanderPlas, J. (2016). Python Data Science Handbook. CA: O’Reilly.", "recommended_readings": "- Lane, J. (2016). Big data for public policy: The quadruple helix. Journal of Policy Analysis and Management, 35(3), 708-715. - Gil-Garcia, J. R., Pardo, T. A., & Luna-Reyes, L. F. (2018). Policy Analytics: Definitions, Components, Methods, and Illustrative Examples. In Policy Analytics, Modelling, and Informatics (pp. 1-16). Springer, Cham. - Sun, Y., Song, H., Jara, A. J., & Bie, R. (2016). Internet of things and big data analytics for smart and connected communities. IEEE access, 4, 766-773.", "terms": {"2024-25 Term 2": {"--LEC (8627)": {"startTimes": ["10:30"], "endTimes": ["13:15"], "days": [3], "locations": ["Chen Kou Bun Bldg 706C"], "instructors": ["Dr. WONG Kwong Cheong"], "meetingDates": ["8/1", "15/1", "22/1", "5/2", "12/2", "19/2", "26/2", "12/3", "19/3", "26/3", "2/4", "9/4", "16/4"]}}}, "assessments": {"Homework or assignment": "50", "Participation": "10", "Test or quiz": "40"}}, {"code": "2202", "title": "Database Systems for Data Science", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Data Science & Policy Stud PC", "requirements": "Pre-requisite(s): DSPS1003", "description": "This course covers the fundamental concepts of database systems and their role in data science projects. Students will gain practical experience working with relational databases, as well as learn how to design effective data models and optimize database performance. Topics covered may include SQL basics, entity-relationship modeling, normalization, indexing, and query optimization. This course is ideal for individuals with prior programming experience interested in learning about databases for data science.", "outcome": "By the end of the course, students should be able to: Create effective data models using entity-relationship diagrams and normalization techniques. Write SQL queries to retrieve and manipulate data from relational databases. Evaluate the performance of database systems. Apply database systems to real-world examples.", "syllabus": " Introduction to Databases and Data Management  Overview of database systems and their role in data science Relational databases and their components  Data models, data schemas, and data types SQL basics for data retrieval and manipulation   Data Modeling and Normalization  Entity-relationship modeling and diagramming Normalization and data redundancy Relational database design principles   SQL for Data Science  SELECT statements and basic data retrieval Filtering and sorting data Joins and subqueries Aggregation functions and grouping Data modification statements (INSERT, UPDATE, DELETE)   Advanced Topics and Future Trends in Database Technologies  Database security and data privacy Database administration (e.g., backup and recovery strategies and user management) Database optimization (e.g., indexing, table partitioning and sharding, and query optimization) NoSQL databases and big data systems Data warehousing and business intelligence   Case Studies and Practical Applications  Real-world examples of databases in data science Data governance and ethics  ", "required_readings": "Beaulieu, A. (2020). Learning SQL (Third edition.). O’Reilly.Elmasri, R., & Navathe, S. (2016). Fundamentals of database systems (Seventh edition.). Pearson.", "recommended_readings": "Badia, A. (2020). SQL for data science: data cleaning, wrangling and analytics with relational databases. Springer Nature.Kleppmann, M. (2017). Designing data-intensive applications : the big ideas behind reliable, scalable, and maintainable systems (First edition.). O’Reilly Media.", "terms": {"2024-25 Term 1": {"--LEC (5088)": {"startTimes": ["10:30"], "endTimes": ["13:15"], "days": [4], "locations": ["Hui Yeung Shing Bldg 501"], "instructors": ["Dr. KWOK Pak Ki"], "meetingDates": ["5/9", "12/9", "19/9", "26/9", "3/10", "10/10", "17/10", "24/10", "31/10", "7/11", "14/11", "21/11", "28/11"]}}}, "assessments": {"Homework or assignment": "20", "Project": "40", "Participation": "10", "Test or quiz": "30"}}, {"code": "2301", "title": "Policy Analysis and Design Thinking", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "Lecture\nInteractive Tutorial", "campus": "Main Campus", "academic_group": "Data Science & Policy Stud PC", "requirements": "", "description": "This course integrates public policy analysis and design thinking to give students an integrated and comprehensive approach of resolving public problems. Design thinking, with its key features of being solution-based, user involvement, co-creation of knowledge, co-evolution of solution and problem, complements the economics-based and analytical model of public policy analysis well. Together they strengthen students’ ability in serving the dual role of a capable policy designer and an effective analyst who solve the policy problem and satisfy the diverse concerns of stakeholders.", "outcome": "By the end of this course, students should be able to: a. Understand the process of policy making and steps and theoretical perspectives of design thinking; b. Apply the framework of design thinking in policymaking; c. Analyze policy from different stakeholders’ perspectives in policy design;  d. Have a solid foundation of policy design and analysis.", "syllabus": "1) Basic knowledge in public policy analysis (key concepts, major theories, main methods) 2) Integrated and comprehensive approach in resolving public problem from a design thinking perspective 3) Process of policy making, understanding key factors (e.g., common interest, stakeholders, interest groups, etc.） 4) Understanding actors in policy design, their roles, and interaction dynamics  5) Acquiring knowledge about analytical model of public policy analysis", "required_readings": "- Brown, T. (2009). Change by Design: How Design Thinking Transforms Organizations and Inspires Innovation. NY: Harper Collins. - Dunn, W. N. (2015). Public policy analysis. NY: Routledge. - Weimer, D. L., & Vining, A. R. (2017). Policy analysis: Concepts and practice. NY: Routledge.", "recommended_readings": "- Liedtka, J., King, A., & Bennett, K. (2013). Solving Problems with Design Thinking: Ten Stories of What Works. NY: Columbia Business School - Howlett, M., Ramesh, M., & Perl, A. (2009). Studying public policy: Policy cycles and policy subsystems (Vol. 3). Oxford: Oxford University Press. - Sabatier, P. A., & Weible, C. M. (Eds.). (2014). Theories of the policy process. CA: Westview Press.", "terms": {"2024-25 Term 1": {"--LEC (5304)": {"startTimes": ["14:30"], "endTimes": ["17:15"], "days": [4], "locations": ["Chen Kou Bun Bldg 706C"], "instructors": ["Professor WONG Wai Ho"], "meetingDates": ["5/9", "12/9", "19/9", "26/9", "3/10", "10/10", "17/10", "24/10", "31/10", "7/11", "14/11", "21/11", "28/11"]}}}, "assessments": {"Essay test or exam": "70", "Others": "10", "Project": "20"}}, {"code": "2320", "title": "AI Governance and Public Policy", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Data Science & Policy Stud PC", "requirements": "", "description": "The course offers an insightful and comprehensive exploration of the dynamic landscape surrounding the governance and public policies of artificial intelligence (AI). By focusing on the intersection of AI, governance, and public policy, it empowers students to navigate the multifaceted challenges. Through a combination of theoretical analysis, case studies, and interactive discussions, students will develop a profound understanding of AI strategies and governance frameworks and the formulation of responsible public policies in both national and global contexts. The course will equip students with the knowledge and skills necessary to shape the future of AI in the role of policymaker and major stakeholders in civil society.", "outcome": "By the end of the course, students should be able to:  Develop a comprehensive understanding of AI strategies and governance in both national and global contexts. Analyze and evaluate different AI governance frameworks and strategies, considering their effectiveness and impact on transparency, fairness, accountability, and other important public values. Apply critical thinking skills to assess the potential risks and benefits associated with AI technologies and their implementation, and propose responsible policies to mitigate those risks. Demonstrate knowledge of the competing concerns and dilemmas related to AI such as privacy, data security, economic growth, and ethical considerations, and formulate policies that address them. Engage in interdisciplinary discussions and collaborations to address the complex challenges at the intersection of AI, governance, and public policy.", "syllabus": "1. Introduction to AI Governance and Public Policy Overview of AI technologies and their impact on governance and public policy Role of AI in shaping public policies2. Transparency, Fairness, and Bias in AI Understanding the importance of transparency and explain ability in AI systems Assessing and mitigating biases in AI algorithms and decision-making processes Policies for ensuring fairness and accountability in AI governance3. Ethical Frameworks and Accountability for AI Governance Examination of ethical principles and guidelines in AI governance Ethical considerations in AI decision-making and algorithmic accountability4. Legal and Regulatory Landscape for AI Analysis of existing laws and regulations applicable to AI technologies Privacy concerns in AI applications and data-driven decision-making Policy frameworks for AI regulation and legal challenges in governing AI5. AI Governance in a Global Perspective Major paradigms, models, and approaches in AI governance AI governance in major regions and countries (e.g., China, US, and Europe)6. AI Governance and Public Sector Applications AI deployment in government services and public administration Policy considerations for AI adoption in public sector decision-making7. Stakeholder Engagement and Collaboration in AI Governance Engaging with diverse stakeholders in AI governance processes Multi-stakeholder collaborations for inclusive and participatory decision-making Building partnerships between governments, industry, academia, and civil society8. Future Trends and Emerging Issues in AI Governance Exploring the evolving landscape of AI technologies and their governance challenges Policy implications and strategies for adapting to future AI advancements  ", "required_readings": "- Bradford, A. (2023). The global battle to regulate technology. Oxford University Press.- Gahnberg, C. (2021). What rules? Framing the governance of artificial agency. Policy and Society, 40(2), 194-210.- Galindo, L., Perset, K., and Sheeka, F. (2021). An overview of national AI strategies and policies. OECD Going Digital Toolkit Notes, No. 14, OECD Publishing, Paris.- Gritsenko, D., & Wood, M. (2022). Algorithmic governance: A modes of governance approach. Regulation & Governance, 16(1), 45-62.- Lee, K. F. (2018). AI superpowers: China, Silicon Valley, and the new world order. Houghton Mifflin.- Madan, R., & Ashok, M. (2023). AI adoption and diffusion in public administration: A systematic literature review and future research agenda. Government Information Quarterly, 40(1), 101774.", "recommended_readings": "- Desouza, K. C., Dawson, G. S., & Chenok, D. (2020). Designing, developing, and deploying artificial intelligence systems: Lessons from and for the public sector. Business Horizons, 63(2), 205–213.- Frey, C. B., & Osborne, M. A. (2017). The future of employment: How susceptible are jobs to computerisation?. Technological Forecasting and Social Change, 114, 254-280.- Giest, S. N., & Klievink, B. (2022). More than a digital system: how AI is changing the role of bureaucrats in different organizational contexts. Public Management Review, 1-20.- Gil-Garcia, J. R., Dawes, S. S., & Pardo, T. A. (2018). Digital government and public management research: finding the crossroads. Public Management Review, 20(5), 633-646.- Guenduez, A. A., & Mettler, T. (2023). Strategically constructed narratives on artificial intelligence: What stories are told in governmental artificial intelligence policies?. Government Information Quarterly, 40(1), 101719.- Harding, V. (2023). AI needs you. Princeton University Press.- Kane, G. C., Phillips, A. N., Copulsky, J. R., & Andrus, G. R. (2022). The technology fallacy. MIT Press.- Mindell, D. A., & Reynolds, E. (2022). The work of the future: Building better jobs in an age of intelligent machines. MIT Press.- Wirtz, B. W., & Müller, W. M. (2019). An integrated artificial intelligence framework for public management. Public Management Review, 21(7), 1076-1100.", "terms": {"2024-25 Term 2": {"--LEC (8642)": {"startTimes": ["10:30"], "endTimes": ["13:15"], "days": [4], "locations": ["Hui Yeung Shing Bldg G05"], "instructors": ["Professor WONG Wai Ho"], "meetingDates": ["9/1", "16/1", "23/1", "6/2", "13/2", "20/2", "27/2", "13/3", "20/3", "27/3", "3/4", "10/4", "17/4"]}}}, "assessments": {"Homework or assignment": "25", "Project": "35", "Participation": "10", "Test or quiz": "30"}}, {"code": "2501", "title": "Managing Technology and Policy Innovation", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "Lecture\nInteractive Tutorial", "campus": "Main Campus", "academic_group": "Data Science & Policy Stud PC", "requirements": "", "description": "This course explores the dynamic intersection of technology and policy innovation, delving into theories and practical strategies essential for effective management. The course unfolds in two distinct parts, each addressing pivotal aspects of this interdisciplinary field. Firstly, it examines policy challenges stemming from technological advancements. Secondly, it investigates using policy to foster societal innovation. Students will gain insights into the interplay of technology, institutions, and society, essential for sustainable innovation. This course is ideal for students who are eager to understand and navigate the intricate relationship between technology and policy, and who seek to drive impactful innovation in a rapidly evolving societal landscape.", "outcome": "By the end of this course, students should be able to:  a. Identify and understand key literature and theories on innovation in the public sector  b. Understand the interplay of technology and policy innovation  c. Identify the major factors driving the result and performance of innovation  d. Draw experience from both local and global perspectives in analyzing cases of technology and innovation", "syllabus": "1) Technology and Policy Challenges (e.g., AI and the Future of Work)2) Technology and Societal Impact (e.g., Social Media and Governance)3) Theories and strategies of managing technology and policy innovation  4) Innovation system and innovation policies (e.g., mechanism and process of innovation and diffusion of technology)  5) Case studies in technology innovation and policy innovation", "required_readings": "- Brayne, Sarah. (2017). Big Data Surveillance: The Case of Policing. American Sociological Review, Vol. 82, 5: 977-1008.- Borrás, S., & Edquist, C. (2019). Holistic innovation policy : theoretical foundations, policy problems, and instrument choices (First edition.). Oxford University Press.- Cowley, Robert, Simon Joss, & Youri Dayout. (2018). The Smart City and Its Publics: Insights from Across Six UK Cities. Urban Research and Practices, 11, 1: 53-77.- Höchtl, Johann, Peter Parycek & Ralph Schöllhammer (2016). Big Data in the Policy Cycle: Policy Decision Making in the Digital Era. Journal of Organizational Computing and Electronic Commerce, 26:1-2, 147-169.- Janssen, Marijn, Yannis Charalabidis, and Anneke Zuiderwijk. (2012). Benefits, Adoption Barriers and Myths of Open Data and Open Government. Information Systems Management, Vol. 29, 4: 258-268.- Schonberger M. and Cukier K. (2013). Big Data: A Revolution That Will Transform How We Live, Work, and Think. Boston: Houghton Mifflin Harcourt, Boston. (Chapter 1-3)- Straub, Evan T. (2017) “Understanding Technology Adoption: Theory and Future Directions for Informal Learning.” Review of Educational Research. 79(2), 625-649.", "recommended_readings": "- Block, F. L., & Keller, M. R. (2015). State of innovation: the US government's role in technology development. NY: Routledge. (Chap 10 & 11).- Costantini, V., Crespi, F., Martini, C., & Pennacchio, L. (2015). Demand-pull and technology-push public support for eco-innovation: The case of the biofuels sector. Research Policy, 4(3), 577-595.- Guo, P., Wang, T., Li, D., & Zhou, X. (2016). How energy technology innovation affects transition of coal resource-based economy in China. Energy Policy, 92, 1-6.- Leyden, D. P., & Link, A. N. (2015). Public sector entrepreneurship: US technology and innovation policy. Oxford: OUP.- Mazzucato, M. (2016). From market fixing to market-creating: a new framework for innovation policy. Industry and Innovation, 23(2), 140-156.- Vonorta, N. S., Rouge, P. C., Aridi, A. (2015). Innovation Policy. NY: Springer.- Wallace, D. (2017). Environmental policy and industrial innovation: Strategies in Europe, the USA and Japan. NY: Routledge. (Chap 1, 2, 5 & 7).", "terms": {"2024-25 Term 2": {"--LEC (8626)": {"startTimes": ["10:30"], "endTimes": ["13:15"], "days": [2], "locations": ["Chen Kou Bun Bldg 706C"], "instructors": ["Dr. KWOK Pak Ki"], "meetingDates": ["7/1", "14/1", "21/1", "4/2", "11/2", "18/2", "25/2", "11/3", "18/3", "25/3", "1/4", "8/4", "15/4"]}}}, "assessments": {"Homework or assignment": "20", "Project": "40", "Participation": "10", "Test or quiz": "30"}}, {"code": "2520", "title": "Data Science Project Management", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Data Science & Policy Stud PC", "requirements": "", "description": "Effective project management can lead to heightened efficiency and productivity while also mitigating the risk of failure. However, overseeing data science projects poses unique challenges due to the involvement of stakeholders from multiple teams and the necessity to balance both business and technical objectives. This course provides a comprehensive overview of the intersection between project management and data science. Students will explore how project management principles can enhance the management of data science projects and how data science methodologies can improve project management practices. While no prerequisites are required, this course is ideal for students who possess a basic understanding of data science. It is particularly suitable for students who harbor an interest in effectively managing data science projects and assembling teams.", "outcome": "By the end of the course, students should be able to: Identify and describe fundamental project management knowledge and concepts. Apply project management principles to enhance the efficiency and productivity of data science projects. Explain the value of project management processes, tools and techniques. Critically assess case studies and real-world examples to understand the symbiotic relationship between project management and data science.", "syllabus": " Introduction to Project Management and Data Science. Overview of project management principles Understanding what you can do with data science  Understanding the intersection of project management and data science  Leveraging Project Management for Data Science Projects. Project initiation and planning for data science initiatives Exploring data science team roles and their responsibility Scope definition and requirements gathering in data science projects Risk management and mitigation strategies in data science project planning Resource allocation and scheduling for data science projects  Exploring the common pitfalls of data science projects. Case Studies and Applications Analyzing case studies of successful integration of project management and data science Exploring industry-specific applications and best practices  Future Trends and Emerging Technologies. Emerging trends in project management and data science Utilizing data analytics for project forecasting and trend analysis Impact of artificial intelligence and automation on project management processes Ethical considerations and challenges in the convergence of project management and data science", "required_readings": "•    Dubovikov, K. (2019). Managing Data Science: Effective strategies to manage data science projects and build a sustainable team. Packt Publishing Ltd.", "recommended_readings": "•    Elleh PhD PMP PMI-ACP, D. F. (2023). Project Management Waterfall-Agile-It-Data Science: Great for Pmp and Pmi-Acp Exams Preparation.•    Pinto, J. K. (2022). Project management. (Second edition.). Addison-Wesley Professional. (Video)•    The standard for project management and a guide to the project management body of knowledge (PMBOK guide) (7th ed.). (2021). Project Management Institute.", "terms": {"2024-25 Term 2": {"--LEC (8641)": {"startTimes": ["14:30"], "endTimes": ["17:15"], "days": [3], "locations": ["Chen Kou Bun Bldg 108"], "instructors": ["Dr. KWOK Pak Ki"], "meetingDates": ["8/1", "15/1", "22/1", "5/2", "12/2", "19/2", "26/2", "12/3", "19/3", "26/3", "2/4", "9/4", "16/4"]}}}, "assessments": {"Homework or assignment": "20", "Project": "40", "Participation": "10", "Test or quiz": "30"}}, {"code": "2730", "title": "Linear Algebra for Data Science", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Data Science & Policy Stud PC", "requirements": "Pre-requisite(s): DSPS1003", "description": "This course is designed to provide students with the essential foundational concepts of modern linear algebra for understanding contemporary data science and machine learning techniques. Stressing on intuition from coding rather than traditional mathematical proofs, this course approaches linear algebra from a computational perspective, where linear algebra concepts are implemented in Python code with a focus on applications in data science and machine learning. This course is ideal for students with prior programming experience who are interested in understanding modern linear algebra and its applications in data science and machine learning from a computational perspective.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "2830", "title": "Calculus for Data Science", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Data Science & Policy Stud PC", "requirements": "Pre-requisite(s): DSPS1003", "description": "This course is designed to provide students with the essential foundational concepts of calculus for understanding contemporary machine learning and data science algorithms in which calculus is used as an optimization tool. It approaches calculus, both single-variable and multivariate, from a computational perspective, stressing on intuition from coding rather than traditional mathematical proofs. This course is ideal for students with prior programming experience who are interested in understanding the powerful optimization algorithms used in modern data science and machine learning.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "3190", "title": "Big Data Analytics for Public Policy", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Data Science & Policy Stud PC", "requirements": "Pre-requisite(s): DSPS2202", "description": "This course provides a comprehensive understanding of Big Data computing systems and programming models. Students will gain hands-on experience working with mainstream open-source platforms for Big Data processing and analytics, including Hadoop and Spark. The course covers the architecture and components of Hadoop and Spark, data processing with Spark, and advanced topics such as Spark Streaming, graph processing, and machine learning. Students will learn to develop operational and programming tools for data collection, serialization, migration, and workflow coordination in Big Data pipelines. By the end of the course, students will be able to design and implement solutions to real-world Big Data problems using Hadoop or Spark. This course is ideal for students with prior programming and database experience interested in developing expertise in Big Data computing systems and programming models for processing and analyzing large-scale datasets.", "outcome": "Upon completion of the subject, students will be able to Apply programming models and design patterns to build scalable Big Data systems using Hadoop and Spark. Analyze and evaluate the architecture and resource management of Big Data computing systems for optimal performance. Utilize high-level Big Data query languages and processing systems to extract insights from large, diverse data sets. Develop effective operational and programming tools for data collection, serialization, migration, and workflow coordination in Big Data pipelines. Design and implement solutions to real-world Big Data problems using Hadoop or Spark. ", "syllabus": " Introduction to Big Data  Refreshing students’ knowledge of big data Overview of big data and its challenges Overview of commonly used big data tools Use cases of big data   Distributed Computing and Hadoop  Overview of distributed computing and parallel processing Hadoop architecture and its various components Hadoop Distributed File System (HDFS) and its characteristics MapReduce programming model and its use in processing large datasets    Spark Basics  Overview of Spark architecture and components Resilient Distributed Datasets (RDDs) and their properties Introduction to Spark SQL and DataFrames for data processing   Data Processing with Spark  Data processing concepts for structured and unstructured data Data ingestion and ETL (Extract, Transform, Load) techniques Transformations and actions in Spark for data manipulation Join, aggregation, and grouping operations for data analysis   Spark Programming  Overview of Spark Streaming for real-time data processing Graph processing using Spark GraphX Introduction to machine learning with Spark MLlib Integration with external databases and systems for big data processing   Big Data Ecosystem  Overview of other Big Data technologies and frameworks NoSQL databases and their use cases in big data processing Introduction to Apache Kafka for data streaming Introduction to Apache Cassandra for distributed data storage   Spark Applications in Policy Study  Use cases and examples of Spark in policy analysis and decision-making Developing and optimizing Spark-based solutions for policy-related tasks  ", "required_readings": " Chambers, B., & Zaharia, M. (2018). Spark : the definitive guide : big data processing made simple (First Edition.). O’Reilly Media Inc.  Eadline, D. (2018). Hadoop and Spark Fundamentals (1st edition). Addison-Wesley Professional. (Video) Mendelevitch, O., Stella, C., & Eadline, D. (2017). Practical data science with Hadoop® and Spark: designing and building effective analytics at scale (1st edition). Addison-Wesley Professional.", "recommended_readings": " Aven, J. (2018). Data analytics with Spark using Python (1st edition). Addison-Wesley. Aytas, Y. (2021). Designing big data platforms : how to use, deploy, and maintain big data systems. Wiley. Foster, I., Ghani, R., Jarmin, R. S., Kreuter, F., & Lane, J. (Eds.). (2020). Big Data and social science: Data science methods and tools for research and practice. CRC Press. Koitzsch, K. (2017). Pro Hadoop Data Analytics: Designing and Building Big Data Systems using the Hadoop Ecosystem (1st ed. 2017.). Apress. Needham, M., & Hodler, A. E. (2019). Graph algorithms : practical examples in Apache Spark and Neo4j (First edition.). O’Reilly.", "terms": {"2024-25 Term 1": {"--LEC (8829)": {"startTimes": ["10:30"], "endTimes": ["13:15"], "days": [2], "locations": ["Wong Foo Yuan Bldg 405"], "instructors": ["Dr. KWOK Pak Ki"], "meetingDates": ["3/9", "10/9", "17/9", "24/9", "8/10", "15/10", "22/10", "29/10", "5/11", "12/11", "19/11", "26/11"]}}}, "assessments": {"Homework or assignment": "20", "Project": "40", "Participation": "10", "Test or quiz": "30"}}, {"code": "3202", "title": "Machine Learning for Public Policy", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "Lecture\nInteractive Tutorial", "campus": "Main Campus", "academic_group": "Data Science & Policy Stud PC", "requirements": "Pre-requisite(s): DSPS2201", "description": "This course introduces students to the machine learning concepts and techniques that are relevant to policy analytics. Major topics include linear regression, predictive modeling, classification, resampling methods, dimension reduction techniques, principal component analysis, smoothing splines. Additional topics such as decision trees, support vector machines and clustering methods may also be introduced. Students will learn how to employ these methods to conduct supervised and unsupervised learning for social and policy analytics, and gain hands-on experience with real-life data using data science software.", "outcome": "Students are expected to: Understand the distinction between supervised and unsupervised learning, and identify appropriate tools to address research questions with “big data” Make use of the following supervised learning algorithms: linear and logistic regression, K-nearest neighbors, discriminant analysis, cross-validation and bootstrap, shrinkage estimation, generalized additive models, tree-based methods, and support vector machines in social and policy analysis Apply basic unsupervised procedures including clustering and principal components analysis in social and policy analysis Appreciate the bias-variance tradeoff and apply model selection methods based on cross-validation and bootstrapping to a prediction challenge Analyze real-world dataset using data science software", "syllabus": "Major topics include linear regression, predictive modeling, classification, resampling methods, dimension reduction techniques, principal component analysis, smoothing splines. Additional topics such as decision trees, support vector machines and clustering methods may also be introduced.", "required_readings": "- Shah, C. (2023). A Hands-On Introduction to Machine Learning. Cambridge University Press.- James, G., Witten, D., Hastie, T. and Tibshirani, R (2014). An Introduction to Statistical Learning, 8th printing 2017. New York: Springer.", "recommended_readings": "Magallanes, Jose Manuel (2017). Introduction to Data Science for Social and Policy Research: Collecting and Organizing Data with R and Python. New York: Cambridge University Press.Hastie, T., Tibshirani, R. and Friedman, J (2009). The Elements of Statistical Learning: Data Mining, Inference and Prediction, 2nd Edition.", "terms": {"2024-25 Term 1": {"--LEC (8832)": {"startTimes": ["10:30"], "endTimes": ["12:15"], "days": [1], "locations": ["Chen Kou Bun Bldg 706C"], "instructors": ["Dr. WONG Kwong Cheong"], "meetingDates": ["2/9", "9/9", "16/9", "23/9", "30/9", "7/10", "14/10", "21/10", "28/10", "4/11", "11/11", "18/11", "25/11"]}, "-T01-TUT (8833)": {"startTimes": ["12:30"], "endTimes": ["13:15"], "days": [1], "locations": ["Chen Kou Bun Bldg 706C"], "instructors": ["Dr. WONG Kwong Cheong"], "meetingDates": ["2/9", "9/9", "16/9", "23/9", "30/9", "7/10", "14/10", "21/10", "28/10", "4/11", "11/11", "18/11", "25/11"]}}}, "assessments": {"Examination": "40", "Homework or assignment": "20", "Project": "30", "Participation": "10"}}, {"code": "3310", "title": "Collaborative Governance in a Global Context", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "Lecture\nInteractive Tutorial", "campus": "Main Campus", "academic_group": "Data Science & Policy Stud PC", "requirements": "", "description": "This course aims to provide students with knowledge, skills and applications of collaborative governance in a rapidly changing globalized world. Collaborative governance is broadly defined as the processes and structures of public policy decision making and management that engage people constructively across the boundaries of public, private and civic society for a public purpose that could not otherwise be accomplished. With the increasingly limited role of government in governance, the ability of policymakers to collaborate with non-state actors across levels and boundaries becomes critical for addressing policy challenges. The course focuses on how collaborative governance can build consensus and deliberative purposes of public policy and governance through studying its formats, process, rationales, concepts and outcomes as well as evaluation of its effectiveness and dilemma. The course also intends to nurture students to have a responsible and reflective role in society and to pursue a better governance.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "3320", "title": "Data Science and Regulation", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "Lecture\nInteractive Tutorial", "campus": "Main Campus", "academic_group": "Data Science & Policy Stud PC", "requirements": "", "description": "The course focuses on the regulatory issues and concerns when the governments take data science as a paradigm to enhance the capacity of public policy. Advance in data science radically transforms the way data can be handled and utilized, and inevitably generates new regulatory concerns and debates due to the clash of competing values and interests. For example, while privacy and citizen rights advocates strive to decrease unexpected uses of data, many scientists and institutions may attempt to use data to design and evaluate public policies in order to maximize its effectiveness. This course discusses theoretical approaches to regulations from multidisciplinary and transdisciplinary approaches for the analysis of regulatory institutions, practices and ideas in data regulation as well as the dillemma between utilization of data and its protection, accessibility and transparency.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "3330", "title": "Extended Reality (XR) for Data Visualization and Policy Narratives", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Data Science & Policy Stud PC", "requirements": "Pre-requisite(s): DSPS1003", "description": "In an era of technological advancement, AR/VR transcends traditional media types such as images, videos, text, and audio, offering a new medium for applications in data science and policy studies. This course explores the diverse applications of AR/VR technology in data visualization and policy narratives. Students gain practical skills in creating AR/VR experiences for visualizing complex data, crafting compelling narratives, and communicating policy insights. They will learn about AR/VR systems, principles for immersive experiences, human-centered design for AR/VR, and game development using cutting-edge platforms such as Unity. This course illuminates the potential of AR/VR as a powerful tool for visualizing ideas and communicating information with unparalleled depth and clarity. This course is ideal for students who are interested in exploring innovative applications of emerging technologies in data visualization, idea presentation, and policy communication and seek to harness AR/VR technology to innovate in these domains.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "3340", "title": "Smart Cities and Internet of Things", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Data Science & Policy Stud PC", "requirements": "Pre-requisite(s): DSPS1003", "description": "This course will introduce the concept of Smart Cities and explore how the Internet of Things (IoT) can help address urbanization challenges. Students will gain an understanding of the different components of IoT for Smart Cities, including sensor technologies, communication technologies, big data analytics, and security. The course will cover topics such as devices and communication protocols for IoT networks, big data analytics in the context of the IoT paradigm, IoT-enabled electric vehicles in smart cities, and blockchain technology for security and privacy in IoT. This course is ideal for students who wish to explore the opportunities of IoT in building a smarter city.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "3350", "title": "Computer Simulation for Policymaking", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Data Science & Policy Stud PC", "requirements": "Pre-requisite(s): DSPS1003 and DSPS1004", "description": "This course introduces the fundamentals of systems modeling and simulation, which are increasingly popular tools for developing, implementing, and evaluating public policy. The course will expose students to diverse system modeling and simulation approaches and emphasize their applications in policymaking to equip them with the skills they will need to conduct technically-focused policy analysis. Teaching is conducted through class lectures and tutorials related to simulation software applications (e.g., Anylogic). This course is ideal for individuals with prior programming experience interested in exploring computer simulation’s potential for policy design and analysis.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "3501", "title": "Policy Leadership and Entrepreneurship Workshop", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "Interactive Tutorial\nWorkshop", "campus": "Main Campus", "academic_group": "Data Science & Policy Stud PC", "requirements": "", "description": "This course studies how leadership and entrepreneurship are interrelated to create social and political impacts throughout the policy process, in particular, how leadership acts as an important factor to influence the social environment to nurture entrepreneurial activities. Leadership provides social source of influence and vision that one uses to inspire action taken by others, and to mobilize others to achieve a common goal. Entrepreneurship is the recognition of opportunities by coupling needs, wants, resources, and problems with innovative solutions and make changes to society. With a workshop format, the course provides students more interactive experience to equip them with the mindset, skills, and strategies of policy leadership and entrepreneurship. Policy leaders and entrepreneurs will be invited to serve as guest speakers in order to offer students the opportunities to learn from their practical experience.", "outcome": "By the end of this course, students should be able to: Understand the concepts and theories of leadership and their practice in public policy Understand the concepts and theories of policy entrepreneurship and their practice Understand the relationships between policy leadership and entrepreneurship and how to integrate the two concepts to search for and respond to opportunities to have better results and innovations Apply the framework of policy leadership and entrepreneurship in major cases and policy areas across local and global contexts", "syllabus": " Foundation of policy leadership and entrepreneurship   Policy leadership and entrepreneurship in Hong Kong and major countries  Global governance and network under policy leadership and entrepreneurship  Application of policy leadership and entrepreneurship in major policy areas   Future research and agenda of policy leadership and entrepreneurship", "required_readings": " Harrison, R.T., & Leitch, C.M. (Eds.). (2018). Research Handbook on Entrepreneurship and Leadership. Cheltenham, UK: Edward Elgar Pub. Ho, M-H R., Kennedy, J.C., Uy, M.A., & Chan, K-Y. (2020). Entrepreneurship-Professionalism-Leadership: A Multidimensional Framework for Human Capital and Career Development in the 21st Century. Singapore: Springer Singapore Pte. Limited. Kuratko, D.F., & Morris, M.H. (2013). Entrepreneurship and leadership. Cheltenham, UK: Edward Elgar Publishing Limited.", "recommended_readings": " Eyal, O., & Kark, R. (2004). How do transformational leaders transform organizations?: A study of the relationship between leadership and entrepreneurship. Leadership and policy in schools, 3(3), 211-235. Reid, S. W., Anglin, A.H., Baur, J.E., Short, J.C., & Buckley, M.R. (2018). Blazing new trails or opportunity lost? Evaluating research at the intersection of leadership and entrepreneurship. The Leadership Quarterly, 29(1), 150-164.", "terms": {"2024-25 Term 2": {"-T01-TUT (8618)": {"startTimes": ["10:30"], "endTimes": ["12:15"], "days": [1], "locations": ["Chen Kou Bun Bldg 108"], "instructors": ["Staff"], "meetingDates": ["6/1", "13/1", "20/1", "27/1", "10/2", "17/2", "24/2", "10/3", "17/3", "24/3", "31/3", "7/4", "14/4"]}, "-W01-WKS (8619)": {"startTimes": ["12:30"], "endTimes": ["13:15"], "days": [1], "locations": ["Chen Kou Bun Bldg 108"], "instructors": ["Staff"], "meetingDates": ["6/1", "13/1", "20/1", "27/1", "10/2", "17/2", "24/2", "10/3", "17/3", "24/3", "31/3", "7/4", "14/4"]}}}, "assessments": {"Classwork": "40", "Essays": "30", "Presentation": "20", "Participation": "10"}}, {"code": "3790", "title": "Social Network Analysis for Public Policy", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Data Science & Policy Stud PC", "requirements": "Pre-requisite(s): DSPS2201", "description": "This course is designed to introduce students to the concepts and methods of social network analysis (SNA), including network types, levels of analysis, data collection, descriptive methods and inferential methods, and their applications in public policy, such as policy agenda setting, policy network, advocacy coalition, policy learning and diffusion, and policy implementation. It also familiarizes students with network analysis software (e.g., Python and/or R). This course is ideal for students with basic knowledge of data analytics who are interested in understanding and using SNA in public policy studies.", "outcome": "By the end of the course, students should be able to: Understand the concepts and methods of social network analysis. Describe the applications of social network analysis in public policy. Use network analysis software (e.g., Python and/or R) to do social network analysis.  Apply social network analysis to address actual policy issues and make better policy.", "syllabus": " Basics of Social Network Analysis (SNA) The Social Network and How to Represent It Types of Networks, Network Parts and Levels of Analysis Network as Social Structure and Institution Data Collection  Boundary Specification Data Collection Process Informant Bias and Issue of Reliability Archival Data Descriptive Methods in SNA Graph and Matrix-Social Network Representation Density, Centrality, Centralization, Prestige and Cliques Multidimensional Scaling (MDS) and Dendogram Two-Mode Networks and Bipartite Matrix Inferential Methods in SNA Permutation and QAP (Quadratic Assignment Procedure) Correlation Exponential Random Graph Model (ERGM) Applications of SNA in Public Policy Policy Agenda Setting Policy Network Advocacy Coalition Policy Learning and Diffusion Policy Implementation", "required_readings": " Prell, C. (2011). Social Network Analysis: History, Theory and Methodology. SAGE Publications. Yang, S., Keller, F. B., & Zheng, L. (2017). Social Network Analysis: Methods and Examples. SAGE Publications.  Zhang, W., Zhang, M., Yuan, L., & Fan, F. (2021). Social network analysis and public policy: what’s new?. Journal of Asian Public Policy, 1-31.", "recommended_readings": " Borgatti, S., Everett, M., Johnson, J., & Agneessens, F. (2022). Analyzing Social Networks Using R. SAGE Publications. Chakraborty, T. (2021). Social Network Analysis. Wiley. Knickerbocker, D. (2023). Network Science with Python. Packt Publishing. Light, R. & Moody, J. (2020). The Oxford Handbook of Social Networks. Oxford University Press. Scott, J. (2017). Social Network Analysis (4th Edition). SAGE Publications. Scott, J., Carrington, P. (2011). The SAGE Handbook of Social Network Analysis. SAGE Publications. Wasserman, S. & Faust, K. (1994). Social Network Analysis: Methods and Applications. Cambridge University Press.", "terms": {"2024-25 Term 2": {"--LEC (5239)": {"startTimes": ["14:30"], "endTimes": ["17:15"], "days": [1], "locations": ["Wong Foo Yuan Bldg 405"], "instructors": ["Dr. WONG Kwong Cheong"], "meetingDates": ["6/1", "13/1", "20/1", "27/1", "10/2", "17/2", "24/2", "10/3", "17/3", "24/3", "31/3", "7/4", "14/4"]}}}, "assessments": {"Homework or assignment": "25", "Presentation": "30", "Participation": "10", "Test or quiz": "35"}}, {"code": "3791", "title": "Natural Language Processing for Public Policy", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Data Science & Policy Stud PC", "requirements": "Pre-requisite(s): DSPS3202", "description": "This course is designed to introduce students to some common methods of Natural Language Processing (NLP), including text classification, topic modelling, text summarization, event extraction and text scaling, and their applications in public policy, such as data collection for evidence-based policymaking, interpretation of political decisions, policy communication, and investigation of policy effects. It also familiarizes students with some of the most useful Python libraries for NLP, for example, transformers, stanza and spaCy. Ethical issues are also discussed. This course is ideal for students with basic knowledge of machine learning who are interested in understanding and using NLP tools in data-driven policymaking.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "3801", "title": "Internship", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "Practicum", "campus": "Main Campus", "academic_group": "Data Science & Policy Stud PC", "requirements": "", "description": "The aim of this course is to provide students with practical work experiences in the application of both data science and policy studies learned in DSPS programme. Students will be given opportunities to observe and experience the management operations and to have hands-on experience in public sector, non-government organizations (NGOs), private sector etc., and to experience the work life in the sector, as well as to nurture students’ practical skills. It is recommended that the internship to be conducted in summer holiday, i.e. June to August, after finishing year two studies in the block mode (i.e. 5 days x 8 hours). DSPS Programme will deploy work units, agencies, or organizations that provide internships relevant to the general course objectives. Meanwhile, students are encouraged to explore opportunities of internship to fit their own specific learning needs. However, all self-selected internship must comply with the course requirements, and subjected to the approval of DSPS Programme Director. Guidance and assistance will be provided whenever appropriate.During the internship, each student would be guided and assisted by an academic supervisor. The supervisor offers advice and help whenever necessary during the attachment period. At the same time, each student will be receiving guidance and assistance from his/her agency supervisor. Students will submit self-evaluation report to reflect on the experience in the internship. Academic advice will be provided to help students consolidate their learning in the internship.", "outcome": "By the end of the course, students should be able to: Apply the learnt theories and knowledges into skills and practices in work experience Explore different career alternatives before they graduate Develop good work attitude which is essential to have job success Develop interpersonal skills, critical thinking skills and problem-solving skills which are applicable in both academic and working environment", "syllabus": "To be decided by the instructor and the internship organization", "required_readings": "Nil", "recommended_readings": "-  Nunley, J. M., Pugh, A., Romero, N., & Seals Jr, R. A. (2016). College major, internship experience, and employment opportunities: Estimates from a résumé audit. Labour Economics, 38, 37-46.-  Sweitzer, H. F., & King, M.A. (2019). The successful internship : personal, professional, and civic development in experiential learning. Boston, MA, USA : Cengage.", "terms": {"2024-25 Term 2": {"-P01-PRA (7123)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["No Room Required"], "instructors": ["Dr. WONG Kwong Cheong"], "meetingDates": ["06/01/2025 - 14/04/2025"]}}}, "assessments": {"Internship or practicum": "80", "Report": "20"}}, {"code": "3802", "title": "Advanced Data Visualization", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "Lecture\nInteractive Tutorial", "campus": "Main Campus", "academic_group": "Data Science & Policy Stud PC", "requirements": "Pre-requisite(s): DSPS2201", "description": "This course is designed to equip students with the skills to convey data-driven insights clearly and effectively. The course begins with an introduction to data visualization and perception principles, followed by an overview of visualization design principles, data preparation and exploration, and advanced visualization techniques.Students will also learn about popular visualization tools (e.g., Tableau), virtual and augmented reality technologies, ethics and bias in data visualization, data storytelling, and data visualization for big data. The course concludes with a final project, where students apply the concepts learned throughout the course to create a high-impact data visualization using advanced technologies.This course is ideal for individuals with prior programming experience interested in exploring advanced data visualization techniques and technologies.", "outcome": "By the end of the course, students should be able to: Create effective data visualizations that convey complex information in a clear and compelling way. Apply design principles and best practices to data visualization, including color theory, typography, and layout. Use advanced visualization techniques such as 3D visualizations, interactive dashboards, and emerging technologies such as virtual and augmented reality (VR/AR). Identify and avoid common pitfalls and biases in data visualization.", "syllabus": " Introduction to Data Visualization and Perception Principles  What is data visualization? The importance of data visualization in decision-making Perception principles and how they affect data visualization   Fundamentals of Visualization Design  Principles of design, including color theory, layout, typography, and chart types Best practices for creating effective visualizations Critique of existing visualizations   Data Preparation and Exploration  Data cleaning, transformation, and aggregation Exploratory data analysis techniques Data preparation and exploration with Python and Tableau   Advanced Visualization Techniques / Tools  Emerging visualization techniques Overview of popular visualization tools such as Tableau, Power BI, and D3.js Comparison of different tools and their capabilities   Virtual Reality (VR) and Augmented Reality (AR) in Data Visualization  Introduction to VR and AR technologies VR and AR applications in data visualization Hands-on experience with VR and AR tools   Visualization Best Practices and Ethics  Best practices for visualizing data and presenting insights effectively Avoiding common visualization pitfalls Ethical considerations and potential biases in data visualization  ", "required_readings": "Dykes, B. (2020). Effective data storytelling : how to drive change with data, narrative, and visuals (1st edition). Wiley. Knaflic, C. N. (2015). Storytelling with data : a data visualization guide for business professionals. Wiley. ", "recommended_readings": "Meier, M., & Baldwin, D. (2021). Mastering Tableau 2021 : implement advanced business intelligence techniques and analytics with tableau (Third edition.). Packt. Murray, J. W. (2020). Building Virtual Reality with Unity and SteamVR. CRC Press.", "terms": {"2024-25 Term 1": {"--LEC (8830)": {"startTimes": ["14:30"], "endTimes": ["16:15"], "days": [1], "locations": ["Hui Yeung Shing Bldg G03"], "instructors": ["Dr. KWOK Pak Ki"], "meetingDates": ["2/9", "9/9", "16/9", "23/9", "30/9", "7/10", "14/10", "21/10", "28/10", "4/11", "11/11", "18/11", "25/11"]}, "-T01-TUT (8831)": {"startTimes": ["16:30"], "endTimes": ["17:15"], "days": [1], "locations": ["Hui Yeung Shing Bldg G03"], "instructors": ["Dr. KWOK Pak Ki"], "meetingDates": ["2/9", "9/9", "16/9", "23/9", "30/9", "7/10", "14/10", "21/10", "28/10", "4/11", "11/11", "18/11", "25/11"]}}}, "assessments": {"Homework or assignment": "20", "Project": "40", "Participation": "10", "Test or quiz": "30"}}, {"code": "3803", "title": "AI for Social Good", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "Lecture\nInteractive Tutorial", "campus": "Main Campus", "academic_group": "Data Science & Policy Stud PC", "requirements": "Pre-requisite(s): DSPS3202", "description": "This course introduces students with basic coding skills to modern Artificial Intelligence (AI) and its societal impacts. It focuses on the techniques of deep learning and reinforcement learning, the workhorse of modern data-centric AI technologies and their applications. Ethical challenges and policy implications of these powerful AI technologies and applications are critically discussed and their positive and negative impacts on achieving the United Nations’ Sustainable Development Goals (SDGs) critically evaluated. The main concern of the course is how to ensure that these disruptive modern AI technologies are used to do good, rather than bad, to society. An emphasis is put on the need for dedicated regulatory AI policies, both at the national and international levels.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "4203", "title": "Advanced Applications of Data Science in Public Policy", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "Lecture\nInteractive Tutorial", "campus": "Main Campus", "academic_group": "Data Science & Policy Stud PC", "requirements": "Pre-requisite(s): DSPS2201 and DSPS3202", "description": "This is a special-topics course on advanced applications of data science in decision making, visualization, research, analytics and presentation techniques to inform policy decision-making. Topics covered would depend on knowledge and expertise of the instructor, and the latest development and innovations in the field. Students will be equipped with the most advanced capacities and methods to conduct data analytics related to policy decisions.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "4310", "title": "Policy and Programme Evaluation", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "Seminar", "campus": "Main Campus", "academic_group": "Data Science & Policy Stud PC", "requirements": "Pre-requisite(s): DSPS1004", "description": "Policy and programme evaluation has become increasingly important in the face of complex and intractable public problems to ensure a systematic and evidence-based understanding of whether and how current interventions have achieved the desired results. This course introduces the essential concepts, theories and methodological tools of policy and programme evaluation. Through seminars and real-world examples, students will learn why, when and how to design and conduct rigorous evaluations in different policy contexts. Overall, this course aims to equip students with the knowledge and skills to critically assess evaluation studies and develop their own evaluation projects.", "outcome": "By the end of this course, students should be able to: Acquire key concepts and skills for designing, planning and implementing policy and programme evaluation with applications to the public and non-public sectors; Understand the context, purpose, rationale and process of evaluation;  Be familiar with current evaluation methods in local and international settings, including their strengths and limitations;  Critically examine policy and programme evaluation studies; and  Undertake an evaluation exercise and gain experience in designing, planning, implementing and evaluating a policy or programme.", "syllabus": "Week 1: Introduction to Policy and Programme Evaluation; Persona of Evaluation CasesWeek 2: Fundamental Policy and Programme Evaluation DesignWeek 3: Systematic Review in Policy and Programme Evaluation IWeek 4: Systematic Review in Policy and Programme Evaluation II; Programme Evaluation Theory IWeek 5: Programme Evaluation Theory IIWeek 6: Assignment WeekWeek 7: Seminar on mini-evaluation studyWeek 8: Evaluating ComplexityWeek 9: Evaluating Impact IWeek 10: Evaluating Impact IIWeek 11: Student-led Seminar Session; Advanced Topics on Policy and Programme Evaluation IWeel 12: Advanced Topics on Policy and Programme Evaluation IIWeek 13: Mini-evaluation Project Presentation", "required_readings": "Gertler, P. J., Martinez, S., Premand, P., Rawlings, L. B., & Vermeersch, C. M. (2016). Impact evaluation in practice. World Bank Publications.Linfield, K. J., & Posavac, E. J. (2018). Program evaluation: Methods and case studies. Routledge.Mertens, D. M., & Wilson, A. T. (2018). Program evaluation theory and practice. Guilford Publications.Rossi, P. H., Lipsey, M. W., & Henry, G. T. (2018). Evaluation: A systematic approach (8th Ed). Sage publications.", "recommended_readings": "", "terms": {"2024-25 Term 2": {"-S01-SEM (8628)": {"startTimes": ["14:30"], "endTimes": ["17:15"], "days": [2], "locations": ["Hui Yeung Shing Bldg G03"], "instructors": ["Professor CHAN Chee Hon"], "meetingDates": ["7/1", "14/1", "21/1", "4/2", "11/2", "18/2", "25/2", "11/3", "18/3", "25/3", "1/4", "8/4", "15/4"]}}}, "assessments": {"Fieldwork or field study": "10", "Presentation": "20", "Project": "35", "Participation": "10", "Report": "25"}}, {"code": "4801", "title": "Graduation Capstone Project I", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "Project", "campus": "Main Campus", "academic_group": "Data Science & Policy Stud PC", "requirements": "", "description": "The graduation capstone project is about generating innovative ideas and implementing actionable knowledge to create impactful solutions. It offers students the opportunity to conduct a project on a selected topic under supervision related to data science and policy studies. While students are expected to integrate and apply what they have learned in the courses, internship, overseas exchanges and other learning opportunities, they are expected to address a real-world issue and to formulate feasible solutions and/or policy recommendations for the issue. Students are expected to meet their supervisor regularly, present their findings and exhibit their final product in any formats after developing a mutual consent between students and supervisor.", "outcome": "By the end of this course, students should be able to: Identify a topic with a specific client in mind for generating innovative ideas and implementing actionable knowledge to create impactful solutions Identify previous academic works and innovative projects as references to their topic Consult client on the project topic, concerns and expectation Plan and organize the whole project design Collect and analyse data Present findings and policy recommendations", "syllabus": "1. Identify the topic  2. Literature review 3. Client consultation and expectations assessment 4. Project design  5. Data collection and analysis  6. Presentation of findings and policy implementation", "required_readings": "To be decided by the course teacher concerned based on the topic selected", "recommended_readings": "To be decided by the course teacher concerned based on the topic selected", "terms": {"2024-25 Term 1": {"-J01-PRJ (7484)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["No Room Required"], "instructors": ["Dr. KWOK Pak Ki, \n\nDr. WONG Kwong Cheong, \n\nProfessor CHAN Chee Hon, \n\nProfessor WONG Wai Ho"], "meetingDates": ["02/09/2024 - 25/11/2024"]}}}, "assessments": {"Presentation": "20", "Project": "70", "Participation": "10"}}, {"code": "4802", "title": "Graduation Capstone Project II", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "Project", "campus": "Main Campus", "academic_group": "Data Science & Policy Stud PC", "requirements": "", "description": "The graduation capstone project is about generating innovative ideas and implementing actionable knowledge to create impactful solutions. It offers students the opportunity to conduct a project on a selected topic under supervision related to data science and policy studies. While students are expected to integrate and apply what they have learned in the courses, internship, overseas exchanges and other learning opportunities, they are expected to address a real-world issue and to formulate feasible solutions and/or policy recommendations for the issue. Students are expected to meet their supervisor regularly, present their findings and exhibit their final product in any formats after developing a mutual consent between students and supervisor.", "outcome": "In this course, students are expected to continue to work on the project they have been developed in DSPS4801 and to exhibit their final project product. By the end of this course, students should be able to: Review progress and output in DSPS4801 Fine tune the project’s theoretical framework and structure Maintain continuous consultation and establish communication with clients Execute data analysis and data implication analysis Present findings and policy recommendations Generate a project report which meets the standard requested by the supervisor", "syllabus": "1. Review of progress and output in DSPS4801  2. Revision and redesign amendment of project if necessary 3. Continuous consultation and communication with clients 4. Additional data collection and analysis  5. Presentation of findings and policy implementation", "required_readings": "To be decided by the course teacher concerned based on the topic selected", "recommended_readings": "To be decided by the course teacher concerned based on the topic selected", "terms": {"2024-25 Term 1": {"-J01-PRJ (9264)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["No Room Required"], "instructors": ["Professor CHAN Chee Hon, \n\nProfessor WONG Wai Ho"], "meetingDates": ["02/09/2024 - 25/11/2024"]}}, "2024-25 Term 2": {"-J01-PRJ (7282)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["No Room Required"], "instructors": ["Dr. KWOK Pak Ki, \n\nDr. WONG Kwong Cheong, \n\nProfessor CHAN Chee Hon, \n\nProfessor WONG Wai Ho"], "meetingDates": ["06/01/2025 - 14/04/2025"]}}}, "assessments": {"Presentation": "20", "Project": "70", "Participation": "10"}}, {"code": "4803", "title": "Selected Topics in Data Science and Policy Studies III", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "Lecture\nInteractive Tutorial", "campus": "Main Campus", "academic_group": "Data Science & Policy Stud PC", "requirements": "", "description": "This course provides an in-depth analysis of important topics in data science and policy studies. The focus of the course may vary according to the area of expertise of the instructor and the interests of the class.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "4804", "title": "Selected Topics in Data Science and Policy Studies IV", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "Lecture\nInteractive Tutorial", "campus": "Main Campus", "academic_group": "Data Science & Policy Stud PC", "requirements": "", "description": "This course provides an in-depth analysis of important topics in data science and policy studies. The focus of the course may vary according to the area of expertise of the instructor and the interests of the class.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}]