[{"code": "5001", "title": "Research Frontiers in Earth & Atmospheric Sciences I", "career": "Postgraduate - Research", "units": "3.00", "grading": "Graded", "components": "Lecture\nInteractive Tutorial", "campus": "Main Campus", "academic_group": "Div of Earth & Atmospheric Sci", "requirements": "For students in MPhil-PhD Earth and Atmospheric Sciences", "description": "Recent research methods, experimental, and computational techniques applied in Earth & Atmospheric Sciences. Topics extend over a diversity of research areas in Earth & Atmospheric Sciences, with a consistent theme that many of the operative processes are intertwined and advances in elucidating them hinge on the adoption of an interdisciplinary framework.", "outcome": "1. Students will learn a broad working knowledge of the researches in Earth & Atmospheric Sciences.  2. Students will get familiar with the literature in the researches in Earth & Atmospheric Sciences.  3. Students will get familiar with the analytical and mathematical skills necessary in the researches.  4. Students will develop ability to analyze and synthesize scientific data (observations and modeling) necessary in the researches 5. Students will develop ability to communicate the results in the form of written reports, visual displays, and scientific presentations.", "syllabus": " Introduction to the dynamics of the climate system Climate sensitivity and feedback mechansisms Climate change Surface energy balance and biogeophysical land-atmosphere interactions Global biogeochemical cycles and climate Interactions of ecosystems and agriculture with atmospheric chemistry and climate Advanced topics in the formation mechanisms and control strategy for tropospheric ozone Advanced topics in atmospheric gas-phase oxidation chemistry Advanced topics in sources, formation, and transformation of atmospheric aerosols", "required_readings": "Hartmann, Dennis L.: Global Physical Climatology, Second Edition, Elsevier, 2016Bonan, Gordon: Ecological Climatology: Concepts and Applications, Second Edition, 2015.Seinfeld, J.H. and Pandis, S.N.: Atmospheric Chemistry and Physics: From Air Pollution to Climate Change, Third Edition, 2016.", "recommended_readings": "Refer to the course syllabus distributed in the class.", "terms": {"2024-25 Term 1": {"--LEC (1168)": {"startTimes": ["14:30"], "endTimes": ["17:15"], "days": [5], "locations": ["Mong Man Wai Bldg 302"], "instructors": ["Professor CHAN Man Nin, \n\nProfessor TAI Pui Kuen Amos, \n\nProfessor TAM Chi Yung Francis, \n\nProfessor ZHAI Shixian"], "meetingDates": ["6/9", "13/9", "20/9", "27/9", "4/10", "18/10", "25/10", "1/11", "8/11", "15/11", "22/11", "29/11"]}}}, "assessments": {"Essay test or exam": "50", "Presentation": "50"}}, {"code": "5002", "title": "Research Frontiers in Earth & Atmospheric Sciences II", "career": "Postgraduate - Research", "units": "3.00", "grading": "Graded", "components": "Lecture\nInteractive Tutorial", "campus": "Main Campus", "academic_group": "Div of Earth & Atmospheric Sci", "requirements": "For students in MPhil-PhD Earth and Atmospheric Sciences", "description": "Continuation of EASC5001. Recent research methods, experimental and computational techniques applied in Earth & Atmospheric Sciences. Topics extend over a diversity of research areas in Earth & Atmospheric Sciences, with a consistent theme that many of the operative processes are intertwined and advances in elucidating them hinge on the adoption of an interdisciplinary framework.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "5010", "title": "Solid and Fluid Mechanics", "career": "Postgraduate - Research", "units": "3.00", "grading": "Graded", "components": "Lecture\nInteractive Tutorial", "campus": "Main Campus", "academic_group": "Div of Earth & Atmospheric Sci", "requirements": "For students in MPhil-PhD Earth and Atmospheric Sciences\nNot for students who have taken ESSC3010 or ESSC4010", "description": "This course presents the fundamentals of continuum mechanics illustrated with earth system science applications. Background materials on matrices, vectors and differential operators are first reviewed. The following topics will be covered: tensors and their properties; stress and strain; constitutive equations for Hookean elastic solid and Newtonian viscous fluid; mechanical properties and rheology of geomaterials; Eulerian and Lagrangian kinematics; momentum equations; vorticity and divergence; applications in geomechanics, seismology, atmospheric dynamics, and oceanography.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "5020", "title": "Soil Mechanics and Its Applications", "career": "Postgraduate - Research", "units": "3.00", "grading": "Graded", "components": "Lecture\nInteractive Tutorial", "campus": "Main Campus", "academic_group": "Div of Earth & Atmospheric Sci", "requirements": "For students in MPhil-PhD Earth and Atmospheric Sciences", "description": "A survey of basic concepts of soil mechanics: Classification and physical properties of soil; stress and strain; pore pressure, seepage theory and effective stress; elastic solutions; shear strength and Mohr-Coulomb theory; failure mode and criteria; soil consolidation; lateral earth pressure; slope stability; bearing capacity and foundation designs; pile analyses and designs; soil improvement and soil nailing. Geotechnical applications: shallow and deep foundations; retaining structures; slope instability.", "outcome": " An understanding of the basics of poromechanics: stress and strain, pore pressure and effective stress, shear strength and failure criteria. Knowledge of the classification and physical properties of soil. A basic understanding of the mechanics of soil, soil consolidation and shear failure. An appreciation of the application of soil mechanics to geotechnical designs and engineering.", "syllabus": " A survey of basic concepts of soil mechanics: Classification and physical properties of soil.  Physical properties of soil. Seepage and effective stress, Pore pressure. Stress and strain. Shear strength. Soil consolidation. Geotechnical applications: shallow and deep foundations; retaining structures; slope instability. Laboratory measurement of soil deformation and strength.", "required_readings": " Knappett, J.A. and R.F. Craig, Craig’s Soil Mechanics, 8th edition, Spon Press, 552 pp, 2012. Das, B.M. Principles of Foundation Engineering, 7th and SI edition, Cengage Learning, 794 pp, 2011.", "recommended_readings": "Holtz, R.D., W.D. Kovacs and T.C. Sheahan, An Introduction to Geotechnical Engineering, 2nd edition, Pearson, 853 pp, 2011.", "terms": {"2024-25 Term 2": {"--LEC (1086)": {"startTimes": ["9:30", "9:30"], "endTimes": ["11:15", "10:15"], "days": [4, 5], "locations": ["Y.C. Liang Hall 106", "William M W Mong Eng Bldg 703"], "instructors": ["Professor CHAU Kam Tim", "Professor CHAU Kam Tim"], "meetingDates": ["9/1", "10/1", "16/1", "17/1", "23/1", "24/1", "6/2", "7/2", "13/2", "14/2", "20/2", "21/2", "27/2", "28/2", "13/3", "14/3", "20/3", "21/3", "27/3", "28/3", "3/4", "10/4", "11/4", "17/4"]}, "-T01-TUT (1077)": {"startTimes": ["10:30"], "endTimes": ["11:15"], "days": [5], "locations": ["William M W Mong Eng Bldg 703"], "instructors": ["Professor CHAU Kam Tim"], "meetingDates": ["10/1", "17/1", "24/1", "7/2", "14/2", "21/2", "28/2", "14/3", "21/3", "28/3", "11/4"]}}}, "assessments": {"Examination": "35", "Homework or assignment": "30", "Project": "10", "Test or quiz": "25"}}, {"code": "5040", "title": "Rock Mechanics and Its Applications", "career": "Postgraduate - Research", "units": "3.00", "grading": "Graded", "components": "Field Studies/Field-trip\nLaboratory\nLecture\nInteractive Tutorial", "campus": "Main Campus", "academic_group": "Div of Earth & Atmospheric Sci", "requirements": "For students in MPhil-PhD Earth and Atmospheric Sciences and students should have good background of Mathematics and basic Geology", "description": "A survey of basic concepts of rock mechanics: Classification and index properties of rock; rock strength and failure criteria; measurement of mechanical behavior of rock discontinuity; initial stresses in rocks and their measurement; deformability of rock and their measurement. Geotechnical applications: rock slope engineering; underground openings and foundation engineering. Practical Training: Laboratory techniques and field trip mapping training.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "5101", "title": "Advanced Topics in Geophysics", "career": "Postgraduate - Research", "units": "3.00", "grading": "Graded", "components": "Lecture\nSeminar", "campus": "Main Campus", "academic_group": "Div of Earth & Atmospheric Sci", "requirements": "For students in MPhil-PhD Earth and Atmospheric Sciences", "description": "Recent advances in theoretical and applied geophysics, with focus on geodesy, seismology, geoelectricity, geomagnetism and gravity, and their applications in natural hazard reduction, energy resources and environmental issues.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "5102", "title": "Advanced Topics in Geodynamics", "career": "Postgraduate - Research", "units": "3.00", "grading": "Graded", "components": "Discussion\nLecture", "campus": "Main Campus", "academic_group": "Div of Earth & Atmospheric Sci", "requirements": "For students in MPhil-PhD Earth and Atmospheric Sciences", "description": "Recent advances in physical and chemical geodynamics, with focus on global seismology, mineral physics, rheology and geomagnetism, and their constraints on formulation of dynamic models of the solid Earth.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "5103", "title": "Aerosol Physics and Chemistry", "career": "Postgraduate - Research", "units": "3.00", "grading": "Graded", "components": "Lecture\nInteractive Tutorial", "campus": "Main Campus", "academic_group": "Div of Earth & Atmospheric Sci", "requirements": "For students in MPhil-PhD Earth and Atmospheric Sciences", "description": "Knowledge of aerosol physics and chemistry such as condensation and evaporation; thermodynamics; radiative, hygroscopic properties, and cloud formation potential of aerosols;Recent advances in aerosol physics and chemistry researches; Roles of atmospheric aerosols on the critical environmental issues such as air quality, tropospheric smog, and climate change, with focus on observations, laboratory measurements and modelling.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "5104", "title": "Advanced Topics in Atmospheric Dynamics", "career": "Postgraduate - Research", "units": "3.00", "grading": "Graded", "components": "Lecture\nInteractive Tutorial", "campus": "Main Campus", "academic_group": "Div of Earth & Atmospheric Sci", "requirements": "For students in MPhil-PhD Earth and Atmospheric Sciences", "description": "This course introduces the basics of geophysical fluid dynamics. Topics include fundamental governing equations, scale analyses of geophysical flows in the Earth's atmosphere and ocean, filtered models, waves, vorticity, quasi-geostrophic theory, bartropic and baroclinic instabilities.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "5105", "title": "Advanced Topics in Global Environmental Change", "career": "Postgraduate - Research", "units": "3.00", "grading": "Graded", "components": "Discussion\nLecture\nSeminar", "campus": "Main Campus", "academic_group": "Div of Earth & Atmospheric Sci", "requirements": "For students in MPhil-PhD Earth and Atmospheric Sciences", "description": "This interdisciplinary course presents and discusses recent scientific advances in the fundamental understanding of environmental issues including climate change, changes in ecosystems due to loss of biodiversity, changes in hydrological systems and the supplies of freshwater, land degradation, urbanization, and stresses on food-producing systems.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "5110", "title": "Applied Geophysics", "career": "Postgraduate - Research", "units": "3.00", "grading": "Graded", "components": "Lecture\nInteractive Tutorial", "campus": "Main Campus", "academic_group": "Div of Earth & Atmospheric Sci", "requirements": "For students in MPhil-PhD Earth and Atmospheric Sciences", "description": "This course introduces concepts, principles, and applications of geophysical methods in environmental and engineering studies. It offers an overall survey of various geophysical methods for exploring the shallow subsurface. It provides the technical foundation needed to understand the use and limitations of gravity, seismic, ground penetrating radar, and electromagnetic methods. Demonstration of commonly used methods will be provided in the field along with tutorials of preliminary data analysis techniques. Technical papers published in leading applied geophysics journals will be discussed in reading groups.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "5120", "title": "Petrology", "career": "Postgraduate - Research", "units": "3.00", "grading": "Graded", "components": "Laboratory\nLecture", "campus": "Main Campus", "academic_group": "Div of Earth & Atmospheric Sci", "requirements": "For students in MPhil-PhD Earth and Atmospheric Sciences", "description": "Petrology is an essential subfield of Earth System Science because the rock record is the foundation for interpreting Earth history and internal processes. Petrologic concepts help us understand the Earth system, with connections to related fields such as geochemistry, geophysics, mineralogy, structural geology and geodynamics. This course broadly surveys the formation, distribution, chemical composition, mineral associations, and internal texture and structures in rocks of the earth’s crust and upper mantle, and establishes it relation to global tectonic environments. Class lectures are supplemented by lab exercise, demonstrations and tutorials (e.g. study of rock hand specimens, understand phase rule, use of optical microscope etc.).", "outcome": "Students are expected to gain the following abilities:1. Gain the skills to identify different rock types (igneous and metamorphic basically).2. Good knowledge of typical mineral assemblages of different rocks.3. Use optical polarizing microscope to distinguish: (1) different minerals based on their optical properties, (2) typical igneous and metamorphic micro-textures and structures, (3) featured mineral assemblages corresponding to different P-T conditions. 4. Understand phase equilibrium and phase rule and their applications in understanding the rock forming process.5. Understand different metamorphic facies and their significance of variable tectonic settings.6. Use petrologic concepts and theories to address topics of societal interests, including natural hazards, natural resources, and human health issues.The students will develop: 1) the ability to evaluate an issue critically based on evidence and scientific principle, 2) to acquire knowledge effectively by self-study and using information technology, and to work independently, 3) to work effectively in a team, and 4) to present information in a clear, concise and logical manner. The students also can acquire a responsible attitude in study and work, and have motivation for life-long learning.", "syllabus": " Introduction and practice of Electronic Microscope for Petrologic Study Phase Rule Igneous Petrology Sedimentary Petrology Metamorphic Petrology", "required_readings": "Refer to the course syllabus distributed in the class.", "recommended_readings": "1) John D. Winter; Principles of Igneous and Metamorphic Petrology, 2nd Edition, 2009, Prentice Hall, ISBN-10: 0321592573. 2) Harvey Blatt, Robert Tracy, Brent Owens; Petrology: Igneous, Sedimentary, and Metamorphic; 3rd Edition, 2005, W. H. Freeman, ISBN-10: 0716737434.", "terms": {"2024-25 Term 1": {"--LEC (2090)": {"startTimes": ["13:30", "13:30"], "endTimes": ["14:15", "15:15"], "days": [4, 3], "locations": ["Science Centre 331", "Science Centre 331"], "instructors": ["Dr. TAM Pui Yuk, \n\nProfessor NG Wai Pan", "Dr. TAM Pui Yuk, \n\nProfessor NG Wai Pan"], "meetingDates": ["4/9", "5/9", "11/9", "12/9", "19/9", "25/9", "26/9", "2/10", "3/10", "9/10", "10/10", "16/10", "17/10", "23/10", "24/10", "30/10", "31/10", "6/11", "7/11", "13/11", "14/11", "20/11", "21/11", "27/11", "28/11"]}, "-L01-LAB (2091)": {"startTimes": ["14:30"], "endTimes": ["15:15"], "days": [4], "locations": ["Science Centre 331"], "instructors": ["Dr. TAM Pui Yuk, \n\nProfessor NG Wai Pan"], "meetingDates": ["5/9", "12/9", "19/9", "26/9", "3/10", "10/10", "17/10", "24/10", "31/10", "7/11", "14/11", "21/11", "28/11"]}}}, "assessments": {"Essay test or exam": "40", "Lab reports": "30", "Short answer test or exam": "30"}}, {"code": "5130", "title": "Geomorphology", "career": "Postgraduate - Research", "units": "3.00", "grading": "Graded", "components": "Field Studies/Field-trip\nLaboratory\nLecture", "campus": "Main Campus", "academic_group": "Div of Earth & Atmospheric Sci", "requirements": "For students in MPhil-PhD Earth and Atmospheric Sciences or grant the approval from course coordinator\nPre-requisite: ESSC2010 and ESSC3100 or equivalent courses", "description": "This course is an important part of the core Earth System Sciences Curriculum. It introduces the main concepts in geomorphology with emphasis on understanding the coupling of environments, processes and materials that leads to landform development. Understanding the underlying geological principles of rocks, minerals, structural deformation and geological time are important background knowledge to be enhanced by the study of geomorphology.It discusses the qualitative and quantitative techniques for investigation and research in the field, laboratory, and computer modeling. The application of geomorphology for public safety, engineering problems and development of sustainable solutions will be emphasized. Examples from theory and practice of geomorphology in Hong Kong will be introduced. Practical understanding and skills will be gained from lab exercises and field trips in Hong Kong.Students are suggested to be equipped with basic knowledge of rocks and minerals, structural geology and geological time scale.", "outcome": "Students are expected to gain the following abilities: 1. Understand the relationships between materials, processes and landforms; 2. Use concepts of solid and fluid mechanics to interpret the formation of landforms; 3. Use graphical tools to compile and interpret field and laboratory data; 4. Integrate topics in mineralogy, petrology, structural geology, plate tectonics, climate sciences, biogeosciences, hydrology, remote sensing and geotechnical engineering through survey of scientific literature, case studies, books and textbooks; and 5. Make primary observations in the field and using them to construct and test hypotheses.  Lectures focus on physical and chemical aspects of landform evolution and understanding spatial patterns in landscapes and how humans affect and are impacted by Earth surface processes. Labs use the geological maps, terrain classification maps, aerial photography interpretation, societal consequence assessment, and physical models to illustrate these concepts.  Students are encouraged to ask, follow-up research and lead discussion of questions regarding lecture topics throughout the semester. Field trips in the second half of the semester encourage small-group discussion of observations and interpretations of landscape evolution and human impacts in mountainous and coastal terrains. The students will develop the ability: 1) to evaluate an issue critically based on evidence and scientific principles, 2) to acquire knowledge effectively by self-study and using information technology, and to work independently, 3) to work effectively in a team, and 4) to present information in a clear, concise and logical manner. The students will also be challenged to manage a large amount of reading in short periods of time and to think of their role as a citizen and in society.", "syllabus": "Weeks Contents1  Introduction to Geomorphology + Endogenic Geomorphic Processes2  Physical Properties of Rock, Soil and Water - I    Physical Properties of Rock, Soil and Water - II3  Weathering and Erosion Fluvial landform + Coastal landform4  Volcanic / granitic landform5  Slope and Landslides (3 hrs)6  Lab exercise I + Lab exercise II + pre-trip course to Sai Kung7  Applications of Aerial Photograph Interpretation (3 hrs), 09:30-12:30#1 Field trip to Sai Kung8  Self-study / Discussion Session Structural landform#2 Field trip to Port Island9  Eolian landform10  Self-study / Discussion Session11  Karst landform + Self-study / Discussion Session#3 Landslide study12  Glacial landform + Self-study / Discussion Session13  (Reserve for make-up class)Note: the course contents may vary depending on the speaker’s revised version and the safety concern of the field study.", "required_readings": "1) Ritter, D.F., R.C. Kochel and J.R. Miller (2011) Process Geomorphology, 5th edition. McGraw Hill, NY.  2) Handouts/emails: Scientific articles, textbook extracts, book extracts, etc.", "recommended_readings": "1) Anderson and Anderson, Geomorphology: the Mechanics and Chemistry of Landscapes. First published July 2010.  2) Leopold, Wolman and Miller, 1964. Fluvial Processes in Geomorphology.  3) Anderson, The little book of Geomorphology: Exercising the Principle of Conservation. http://instaar.colorado.edu/~andersrs/The_little_book_010708_web.pdf 4) Burbank & Anderson (2012) Tectonic Geomorphology – 2nd Edition 5) Summerfield, M.A. 1991. Global Geomorphology. Longman Scientific & Technical 6) P. G. Fookes, Mark Lee, J. Griffiths. 2007. Engineering Geomorphology: Theory and Practice, Whittles Publishing  7) P. G. Fookes, E. Mark Lee, , G. Milligan. 2005. Geomorphology for Engineers, Whittles Publishing  8) M. J. Selby, 1993, Hillslope Materials and Processes. Oxford University Press, USA", "terms": {"2024-25 Term 1": {"--LEC (2092)": {"startTimes": ["9:30", "9:30"], "endTimes": ["10:15", "11:15"], "days": [2, 1], "locations": ["Science Centre 331", "Science Centre 331"], "instructors": ["Dr. TAM Pui Yuk, \n\nMr. WONG Ho Yin Dennis, \n\nProfessor NG Wai Pan, \n\nProfessor TANG Lai Kwan Denise", "Dr. TAM Pui Yuk, \n\nMr. WONG Ho Yin Dennis, \n\nProfessor NG Wai Pan, \n\nProfessor TANG Lai Kwan Denise"], "meetingDates": ["2/9", "3/9", "9/9", "10/9", "16/9", "17/9", "23/9", "24/9", "30/9", "7/10", "8/10", "14/10", "15/10", "21/10", "22/10", "28/10", "29/10", "4/11", "5/11", "11/11", "12/11", "18/11", "19/11", "25/11", "26/11"]}, "-L01-LAB (2093)": {"startTimes": ["10:30"], "endTimes": ["11:15"], "days": [2], "locations": ["Science Centre 331"], "instructors": ["Dr. TAM Pui Yuk, \n\nMr. WONG Ho Yin Dennis, \n\nProfessor NG Wai Pan, \n\nProfessor TANG Lai Kwan Denise"], "meetingDates": ["3/9", "10/9", "17/9", "24/9", "8/10", "15/10", "22/10", "29/10", "5/11", "12/11", "19/11", "26/11"]}}}, "assessments": {"Discussion": "25", "Fieldwork or field study": "10", "Presentation": "25", "Report": "40"}}, {"code": "5140", "title": "Seismology", "career": "Postgraduate - Research", "units": "3.00", "grading": "Graded", "components": "Field Studies/Field-trip\nLecture\nInteractive Tutorial", "campus": "Main Campus", "academic_group": "Div of Earth & Atmospheric Sci", "requirements": "For students in MPhil-PhD Earth and Atmospheric Sciences", "description": "This course focuses on the concepts and theory of elastic wave propagation and physics of earthquake. The topics covered include the Earth’s internal structure, material elasticity, travel time tomography, seismic ray theory, ray tracing, and earthquake source parameter. Methods and field practice of seismological survey and programming methods of data processing will also be introduced.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "5150", "title": "Volcanoes", "career": "Postgraduate - Research", "units": "3.00", "grading": "Graded", "components": "Lecture\nSeminar", "campus": "Main Campus", "academic_group": "Div of Earth & Atmospheric Sci", "requirements": "For students in MPhil-PhD Earth and Atmospheric Sciences", "description": "On any given day, ~20 subaerial volcanoes worldwide are erupting. Even more submarine volcanoes are probably erupting without being detected. Volcanic eruptions can have devastating economic and social consequences, but are also the fundamental force that builds the majority of our planet’s surface. Volcanic eruptions and emissions can also affect atmospheric and climate conditions. This course will explore the various techniques used to study volcanoes’ underlying structure as well as their precursory and eruptive activity.", "outcome": "At the completion of this course, the students will understand fundamental concepts related to volcanic systems as well as the various techniques used to monitor and study volcanoes. The students will also be trained to read scientific literature, learn new knowledge from them, and synthesize with existing knowledge. Finally, students will learn how to present scientific information in a clear, succinct, and logical manner in both oral and written form as well as in scientific discourse/debate.", "syllabus": " Overview of Magmatism and Volcanism Magma storage and movement Eruption precursors  Seismic Geodetic + remote sensing Geochemistry   Eruption sizes and styles Volcanic hazards and risks Environmental impacts Large igneous provinces Submarine volcanism", "required_readings": "Refer to the course syllabus distributed in the class.", "recommended_readings": "Volcanic Eruptions and Their Repose, Unrest, Precursors, and Timing, https://www.nap.edu/catalog/24650/volcanic-eruptions-and-their-repose-unrest-precursors-andtiming", "terms": {"2024-25 Term 2": {"--LEC (1080)": {"startTimes": ["9:30"], "endTimes": ["10:15"], "days": [2], "locations": ["Science Centre 331"], "instructors": ["Professor TAN Yen Joe"], "meetingDates": ["7/1", "14/1", "21/1", "4/2", "11/2", "18/2", "25/2", "11/3", "18/3", "25/3", "1/4", "8/4", "15/4"]}, "-S01-SEM (1079)": {"startTimes": ["10:30"], "endTimes": ["12:30"], "days": [2], "locations": ["Science Centre 331"], "instructors": ["Professor TAN Yen Joe"], "meetingDates": ["7/1", "14/1", "21/1", "4/2", "11/2", "18/2", "25/2", "11/3", "18/3", "25/3", "1/4", "8/4", "15/4"]}}}, "assessments": {"Presentation": "30", "Participation": "10", "Report": "40", "Short answer test or exam": "20"}}, {"code": "5160", "title": "Marine Geology and Geophysics", "career": "Postgraduate - Research", "units": "3.00", "grading": "Graded", "components": "Field Studies/Field-trip\nLecture\nInteractive Tutorial", "campus": "Main Campus", "academic_group": "Div of Earth & Atmospheric Sci", "requirements": "For students in MPhil-PhD Earth and Atmospheric Sciences", "description": "This course focuses on the concepts and theory of marine geology and geophysics. Marine geology is distinct from that of continent and is the important foundation to launch Plate Tectonics, the modern unified theory of the Earth. In this course, major components of marine geological settings such as mid-ocean ridges, transform faults, subduction zones, oceanic lithosphere, and etc. will be introduced and discussed in details. Methods of geophysical survey will also be introduced. Field experiments of scientific instruments such as Ocean Bottom Seismometers, marine magnetometer and gravimeter will be conducted. A geological field trip will also be included. This course will be jointly offered with Ocean College, Zhejiang University, as an initiative to develop ocean sciences at CUHK.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "5180", "title": "Earthquake Source Physics", "career": "Postgraduate - Research", "units": "3.00", "grading": "Graded", "components": "Lecture\nInteractive Tutorial", "campus": "Main Campus", "academic_group": "Div of Earth & Atmospheric Sci", "requirements": "For students in MPhil-PhD Earth and Atmospheric Sciences", "description": "This course focuses on the concepts and theory of earthquake source physics. The topics covered include seismic instrumentation, geophysical observations of earthquake source processes, kinematic source representation of earthquakes, dynamic rupture propagation of earthquakes, frictional properties of fault zones, and entire earthquake cycle. Methods and field practice of seismological survey will also be introduced.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "5210", "title": "Land-Atmosphere Interactions and Boundary-Layer Meteorology", "career": "Postgraduate - Research", "units": "3.00", "grading": "Graded", "components": "Lecture\nInteractive Tutorial", "campus": "Main Campus", "academic_group": "Div of Earth & Atmospheric Sci", "requirements": "For students in MPhil-PhD Earth and Atmospheric Sciences", "description": "This course introduces the physical, chemical and biological processes governing the exchange of energy, momentum, water and other chemical materials between the atmosphere and land surface, including a formal introduction into boundary-layer meteorology. Topics covered include the basic equations and concepts of heat, momentum and mass conservation and transfer at the land-atmosphere interface; soil physics and hydrometeorology; temperature, humidity and wind distribution in the atmospheric boundary layer; theories and observations of turbulence; stability and boundary-layer dynamics; biometeorology and ecophysiology of land plants; canopy and ecosystem exchange; and land use change and urbanization. Applications to weather phenomena, air pollution, forestry, agriculture and ecosystem management will be emphasized throughout.", "outcome": "At the completion of this course, the students will be able to 1) Gain knowledge of physical and chemical processes of land-atmosphere interactions and boundary layer dynamics; and 2) Develop the skill and ability to understand climate variability related to land-atmosphere interactions. (Course Outcomes as related to Programme Learning Outcomes) -- The students will develop: 1) the ability to evaluate an issue critically based on evidence and scientific principle, 2) to acquire knowledge effectively by self-study and using information technology, and to work independently, 3) to work effectively in a team, and 4) to present information in a clear, concise and logical manner. The students also can acquire a responsible attitude in study and work, and have motivation for life-long learning.", "syllabus": "Topics:Introduction to land-atmosphere interactions; soil physics I: soil heat transfer and temperature dynamicsHydrological cycle; soil physics II: water movement and infiltration; evapotranspiration; water balanceSurface energy fluxes and balance; soil moisture and atmospheric boundary layerBasic Thermodynamic Relations and Moisture Content in AirStatic Stability & PBL StructureViscous Force and Fundamentals of TurbulenceEddy Flux & Turbulent Kinetic EnergyBasics on Closure TechniquesMore on the Surface & Similarity TheoryAerodynamic conductance; plant biophysics and ecophysiologyPlant canopies; eddy covariance measurementsUrban climatology; air pollution meteorology", "required_readings": "- Bonan, G., 2016: Ecological Climatology: Concepts and Applications (3rd Edition). Cambridge University Press.- Arya, S. P., 2001: Introduction to Micrometeorology (2nd Edition). Academic Press.", "recommended_readings": "- Stull, R. B., 1988: Introduction to Boundary Layer Meteorology. Kluwer Academic Publishers.", "terms": {"2024-25 Term 1": {"--LEC (1046)": {"startTimes": ["11:30", "11:30"], "endTimes": ["12:15", "13:15"], "days": [4, 2], "locations": ["Lady Shaw Bldg C4", "Mong Man Wai Bldg 705"], "instructors": ["Dr. AU-YEUNG Yee Man, \n\nDr. LI Kwan Kit Ronald", "Dr. AU-YEUNG Yee Man, \n\nDr. LI Kwan Kit Ronald"], "meetingDates": ["3/9", "5/9", "10/9", "12/9", "17/9", "19/9", "24/9", "26/9", "3/10", "8/10", "10/10", "15/10", "17/10", "22/10", "24/10", "29/10", "31/10", "5/11", "7/11", "12/11", "14/11", "19/11", "21/11", "26/11", "28/11"]}, "-T01-TUT (1045)": {"startTimes": ["12:30"], "endTimes": ["13:15"], "days": [4], "locations": ["Lady Shaw Bldg C4"], "instructors": ["Dr. AU-YEUNG Yee Man, \n\nDr. LI Kwan Kit Ronald"], "meetingDates": ["5/9", "12/9", "19/9", "26/9", "3/10", "10/10", "17/10", "24/10", "31/10", "7/11", "14/11", "21/11", "28/11"]}}}, "assessments": {"Essay test or exam": "50", "Homework or assignment": "30", "Presentation": "10", "Participation": "10"}}, {"code": "5220", "title": "Tropical Meteorology", "career": "Postgraduate - Research", "units": "3.00", "grading": "Graded", "components": "Lecture\nInteractive Tutorial", "campus": "Main Campus", "academic_group": "Div of Earth & Atmospheric Sci", "requirements": "For students in MPhil-PhD Earth and Atmospheric Sciences", "description": "This course introduces tropical atmospheric circulation and related air-sea coupling at a variety of spatial and temporal scales. The topics covered include the role of the tropics in the global energy and momentum balance, ITCZ, subtropical high, upper-level anticyclones, tropical ocean circulation, tropical weather, climate and atmosphere-ocean interaction phenomena including meso-scale convective systems, tropical waves, the Hadley and the Walker circulation, El Nino-Southern Oscillation, tropical cyclones, Madden Julian Oscillation, and monsoons.", "outcome": "At the completion of this course, the students will be able to 1) Gain the knowledge of various tropical atmospheric motions, 2) Understand physical processes in the tropical atmosphere; and 3) Apply knowledge to understand tropical climate variability. The students will develop: 1) the ability to evaluate an issue critically based on evidence and scientific principle, 2) to acquire knowledge effectively by self-study and using information technology, and to work independently, 3) to work effectively in a team, and 4) to present information in a clear, concise and logical manner. The students also can acquire a responsible attitude in study and work, and have motivation for life-long learning.", "syllabus": " Radiative and convection: Radiative Processes in the Tropics, Surface Energy Balance, Top of the Atmosphere Net Radiation Fluxes, Dry and Moist Stability, Moist Convection General circulation in the tropics: Observed zonally averaged Tropical circulation, Theory of the Hadley Cell, Zonally asymmetric circulation features, seasonal variations, diurnal cycle, Observed aspects of the Intertropical Convergence Zone (ITCZ), ITCZ theory, Gill model, Heat lows, Tropical ocean circulation, ocean waves. Monsoons: Deﬁnition, Differential Heating and the Monsoon, Key Elements of the Asian Summer and Winter Monsoon, Onset and Withdrawal, Breaks in the Indian Monsoon El Nino and Southern Oscillation (ENSO): Observational aspect, air-sea interaction, Bjerknes feedback, teleconnection, ENSO modeling, Indian Ocean Dipole Madden Julian Oscillation (MJO): Observational aspect, Theory of MJO, Westerly wind bursts, Connection with ENSO Tropical Waves and Tropical Depressions (TD): Matsuno wave theory, convective coupled equatorial waves, easterly waves and TD-type disturbances, relationship with Tropical Cyclones (TC) genesis TC: Structure, Genesis, dynamics of TC movement, and intensiﬁcation, modeling and forecasting Tropical Squall Lines and Mesoscale Convective Systems (MCS): Observations of MCS and squall lines, dynamical aspects, Organization of Convection", "required_readings": "Krishnamurti, T.N., Stefanova, Lydia, Misra, Vasubandhu, 2013: Tropical Meteorology- An Introduction. Springer.", "recommended_readings": "Hastenrath, S., 1991: Climate Dynamics of the Tropics. Updated Edition from Climate and Circulation of the Tropics. Springer, Kluwer Academic Publishers. Wang, Bing, 2006: The Asian Monsoon. Springer Praxis Books (Environmental Sciences).", "terms": {"2024-25 Term 2": {"--LEC (1075)": {"startTimes": ["9:30"], "endTimes": ["12:15"], "days": [2], "locations": ["William M W Mong Eng Bldg 407"], "instructors": ["Dr. AU-YEUNG Yee Man, \n\nProfessor TAM Chi Yung Francis"], "meetingDates": ["7/1", "14/1", "21/1", "4/2", "11/2", "18/2", "25/2", "11/3", "18/3", "25/3", "1/4", "8/4", "15/4"]}}}, "assessments": {"Homework or assignment": "50", "Participation": "5", "Selected response test or exam": "45"}}, {"code": "5240", "title": "Air Pollution Science and Engineering", "career": "Postgraduate - Research", "units": "3.00", "grading": "Graded", "components": "Lecture\nInteractive Tutorial", "campus": "Main Campus", "academic_group": "Div of Earth & Atmospheric Sci", "requirements": "For students in MPhil-PhD Earth and Atmospheric Sciences", "description": "This course will cover a variety of topics related to air pollution science and engineering. Topics include: indoor and outdoor air quality (including particulate matters (PM) and gases pollutants); air pollution measurement and statistics; air quality meteorology and dispersion models; principles and challenges of air pollution control and measurement.", "outcome": "1) To understand the physical and chemical principles governing the sources, formation, transport, transformation, health impacts of air pollutants in both indoor and outdoor environments.2) To understand the working principles of various air pollution monitoring instrumentation.3) To apply statistical tools and mathematical models to solve air pollutant dispersion problems.4) To apply various air pollution engineering approaches to solve air pollution issues.5) To gain a better understanding of current air pollution problems and control challenges.", "syllabus": "Background and ReviewTopic 1 Physics of Particulate Matter (PM) (or Aerosols)  and Properties of GasesTopic 2 Transport and Motion of PM in FluidTopic 3 Size Statistics of PMPM and Gases Measurement TechniquesTopic 4 Inertial ImpactorsTopic 5 Light Scattering Fundamentals and Optical Techniques of PMTopic 6 Filtration MethodsTopic 7 Nanoparticle Measurement using Electrical TechniquesTopic 8 Gas Phase Species Measurement TechniquesField MeasurementsTopic 9 Atmospheric PM MeasurementTopic 10 Indoor PM MeasurementTopic 11 Biological Particles Detection and CharacterizationTopic 12 Chemical Characterization and Detection of PMTopic 13 Dispersion ModelsTopic 14 Environmental and Health Impacts of PMAir Quality Engineering and ControlTopic 15-Removal of PM from Gas Streams-Settling Chambers-Cyclone Separators-Electrostatic Precipitation-Wet CollectorsTopic 16-Removal of Gaseous Pollutants -Absorption of Gases by Liquid -Adsorption of Gases on SolidLab Demonstration1. Submicrometer Particle Generation and Measurement2. Micrometer Particle Generation and Measurement3. Condensation Particle Counter 4. Personal PM Sampling", "required_readings": " J.H. Seinfeld and S.N. Pandis: Atmospheric Chemistry and Physics, From Air Pollution to Climate Change,Wiley-Interscience, 1998 (2nd edition: 2006) W.C. Hinds, Aerosol Technology, Wiley-Interscience, 1999 ", "recommended_readings": "Refer to the course syllabus distributed in the class.", "terms": {"2024-25 Term 1": {"--LEC (1089)": {"startTimes": ["14:30"], "endTimes": ["17:15"], "days": [2], "locations": ["Lady Shaw Bldg LT2"], "instructors": ["Professor CHAN Man Nin"], "meetingDates": ["3/9", "10/9", "17/9", "24/9", "8/10", "15/10", "22/10", "29/10", "5/11", "12/11", "19/11", "26/11"]}}}, "assessments": {"Essays": "20", "Essay test or exam": "40", "Homework or assignment": "20", "Presentation": "20"}}, {"code": "5260", "title": "Urban Climatology", "career": "Postgraduate - Research", "units": "3.00", "grading": "Graded", "components": "Laboratory\nLecture", "campus": "Main Campus", "academic_group": "Div of Earth & Atmospheric Sci", "requirements": "For students in MPhil-PhD Earth and Atmospheric Sciences", "description": "Human modifications to the surface of the Earth during urbanisation change most of the elements of climate and weather in the urban atmosphere. This course introduces the fundamentals of urban climatology and the processes caused by the changes in the surface environment, particularly focusing on how urban structures interact with the atmospheric environment. Numerical modelling and field techniques are introduced to understand the underlying processes resulting urban climatic phenomena. It also examines the implications on human comfort and climate-sensitive urban planning and design, as well as the relationship between cities and climate change.", "outcome": "Students are expected to attain the knowledge about how urbanisation affects the local climate and the underlying processes. They should also be able to: 1.  describe the scientific processes and explain the theories of how urbanisation alters local climate; 2.  explain the physical mechanisms governing the formation of urban climatic phenomena; 3.  conduct numerical modelling and field experiments of urban climatic processes; and 4.  understand the practical implications of urban climatology on climate-sensitive urban planning and design.", "syllabus": "Topic and Content/Fundamental concept Week 1 Lecture 1: Introduction to urbanisation and urban climate Week 2 Lecture 2: Fundamentals of urban climatology I •  Urban boundary layer (UBL) and urban canopy layer (UCL) •  Urban climatic processes within UBL and UCL Week 3 Lecture 3: Fundamentals of urban climatology II •  Heterogeneity of urban surface environment •  Atmospheric turbulence and exchange of energy and water Week 4 Lecture 4: Urban energy balance I •  Anthropogenic heat flux •  Urban radiation balance Week 5 Lecture 5: Urban energy balance II •  Urban canopy energy balance •  Urban neighbourhood energy balance Week 6 Lab 1: Urban Multi-scale Environmental Predictor (UMEP): An integrated tool for city-based climate services Week 7 Lecture 6: Urban heat islands – History and physical basis •  Detection of urban heat island: Luke Howard in 1810s •  Determinants of heat island magnitude and structure •  Diversity of urban heat island Week 8 Lecture 7: Monitoring urban heat islands •  Ground-level meteorological measurements •  Mobile measurements •  Land surface temperature Week 9 Lecture 8: Urban heat islands – Examples of different climatic regions •  Tropical climates: Singapore and India •  Sub-tropical climates: Hong Kong and South Africa •  Mediterranean climates: Greece and Spain •  High-latitude climates: Sweden and the United Kingdom Week 10 Lecture 9: Urban climatic mapping •  Urban climatic maps – History, development, and applications •  Local climatic zones – Classification of surface environment Week 11 Lecture 10: Application of urban climatology in climate-sensitive urban planning and design •  Why urban planning and design matters? •  Air Ventilation Assessment System •  Sustainable Building Design Guidelines Week 12 Lab 2: Mapping of local climatic zones using WUDAPT methodology Week 13 Lecture 11: Cities and climate change", "required_readings": "Refer to the course syllabus distributed in the class.", "recommended_readings": "1.  Arnfield AJ, 2003. Two decades of urban climate research: a review of turbulence, exchanges of energy and water, and the urban heat island. International Journal of Climatology 23(1): 1-26.2.  Landsberg HE, 1981. The Urban Climate. Academic Press, New York.3.  Oke TR, 2015. Boundary-layer Climates (2nd Edition). Routledge, United Kingdom.4.  Santamouris M, 2001. Energy and Climate in the Urban Built Environment. Routledge, United Kingdom.", "terms": {"2024-25 Term 1": {"--LEC (1099)": {"startTimes": ["15:30"], "endTimes": ["18:15"], "days": [3], "locations": ["William M W Mong Eng Bldg 401"], "instructors": ["Dr. GAO Kai, \n\nDr. YAO Lingye, \n\nProfessor HE Yueyang"], "meetingDates": ["4/9", "11/9", "25/9", "2/10", "9/10", "16/10", "23/10", "30/10", "6/11", "13/11", "20/11", "27/11"]}}}, "assessments": {"Essay test or exam": "50", "Lab reports": "20", "Project": "30"}}, {"code": "5270", "title": "Cloud Dynamics", "career": "Postgraduate - Research", "units": "3.00", "grading": "Graded", "components": "Lecture\nInteractive Tutorial", "campus": "Main Campus", "academic_group": "Div of Earth & Atmospheric Sci", "requirements": "For students in MPhil-PhD Earth and Atmospheric Sciences", "description": "This course presents an introduction to clouds. We begin with a descriptive cloud classification to introduce the different types of clouds in the Earth’s atmosphere. This is followed by cloud microphysics, describing some of the basic microphysical processes regarding formation, growth, shrinkage, breakup and fallout of cloud and precipitation particles. This will then be linked to cloud dynamics, associated with the fluid motions of the atmosphere. Next, different structures of precipitation and radar cloud sensing shall be presented. These shall then feedback onto our beginning description of clouds on the global climatological level.", "outcome": "Students shall learn about a wide variety of physics and dynamics that control the occurrence, characteristics, and behavior of clouds. They shall understand the processes determining all the types of clouds in our atmosphere, over a wide range of spatial scales from microns to thousands of kilometers. They shall appreciate the importance of cloud to Earth’s climate. There may also be opportunities (e.g. outdoor cloud observations, computer visualization of clouds) where student can practice working effectively in a team, and present information in a clear, concise and logical manner.", "syllabus": "TopicsPart 1: Cloud typesCloud types and precipitating cloud systemsPart 2: Recap of atmospheric dynamics and thermodynamicsAtmospheric flow, instability, and phase transitionPart 3: Aerosols, cloud microphysics and chemistry Aerosol characteristics, cloud droplet formation, microphysical processes of warm and cold clouds, cloud chemistry  Part 4: Precipitation and climatic impactsTypes and structures of precipitation, their radar measurements, and the impacts of clouds on global energy and climateLab 1: cloud identification outdoor activity Lab 2: computer simulation of clouds ", "required_readings": "Lohmann, Luond and Mahrt (2016): An Introduction to Clouds from the Microscale to Climate, First Edition, Cambridge University Press.", "recommended_readings": " Robert A. Houze Jr (2014): Cloud Dynamics, Second Edition, Academic Press. J. Marshall and R. A. Plumb (2007): Atmosphere, Ocean, and Climate Dynamics: An Introductory Text, First Edition, Academic Press.", "terms": {"2024-25 Term 1": {"--LEC (1083)": {"startTimes": ["10:30", "9:30"], "endTimes": ["11:15", "11:15"], "days": [4, 3], "locations": ["Science Centre L3", "Y.C. Liang Hall 106"], "instructors": ["Dr. LI Kwan Kit Ronald, \n\nProfessor LEUNG Wing Mo", "Dr. LI Kwan Kit Ronald, \n\nProfessor LEUNG Wing Mo"], "meetingDates": ["4/9", "5/9", "11/9", "12/9", "19/9", "25/9", "26/9", "2/10", "3/10", "9/10", "10/10", "16/10", "17/10", "23/10", "24/10", "30/10", "31/10", "6/11", "7/11", "13/11", "14/11", "20/11", "21/11", "27/11", "28/11"]}}}, "assessments": {"Essay test or exam": "35", "Homework or assignment": "20", "Lab reports": "20", "Short answer test or exam": "25"}}, {"code": "5510", "title": "Statistical Methods and Data Analysis for Earth and Atmospheric Sciences", "career": "Postgraduate - Research", "units": "3.00", "grading": "Graded", "components": "Lecture\nInteractive Tutorial", "campus": "Main Campus", "academic_group": "Div of Earth & Atmospheric Sci", "requirements": "For students in MPhil-PhD Earth and Atmospheric Sciences", "description": "This course covers the theoretical basis and practical applications of data analysis relevant for earth system science. This course aims to introduce students to Earth and environmental data manipulation, from sampling, reading and writing, to statistical analysis and parameter estimation, to time series analysis, to plotting and visualization. Topics include: digital signal processing, sampling techniques; probability distributions; hypothesis testing; correlation analysis; linear and nonlinear regression; statistical forecasting, harmonic analysis and spectral analysis; principle component analysis; and geostatistics. Tutorials will be based on real geophysical examples including remote sensing and in situ observations, as well as model data. Previous elementary coding experience in Python 3 is recommended.", "outcome": "Students will become knowledgeable about the acquisition, pre-processing and analysis of geophysical and environmental data, including remote sensing, in situ observation and model data. Students will acquire knowledge on techniques for data processing, including visualization methods and statistical analysis, and on the applications of these data and tools to geophysical and environmental problems. The students will develop: 1) the ability to evaluate an issue critically based on evidence and scientific principles, 2) to acquire knowledge effectively by self-study and using information technology, and to work independently, 3) to work effectively in a team, and 4) to present information in a clear, concise and logical manner. The students can also acquire a responsible attitude in study and work, and have motivation for life-long learning.", "syllabus": " Exploratory Data Analysis Correlation Analysis Parametric Probability Distribution : Discrete Parametric Probability Distribution : Continuous Hypothesis Testing Frequentist Statistical Inference: Resampling Methods Statistical Forecasting: Simple Linear Regression Statistical Forecasting: Multiple Linear Regression, Non-Linear Regression Statistical Forecasting: Predictor Selection, Ensemble Forecasting Linear algebra and matrix inverse Quantifying preconceptions: Bayesian inference Quantifying preconceptions: Prior information Detecting periodicities: Sinusoidal functions and Fourier series Detecting periodicities: Complex Fourier series and Fourier transform The past influences the present: Convolution The past influences the present: Filters Cross-correlation Bandpass filters and windowing Filling in missing data Approximation Principal Component Analysis I Time Series Analysis Forecast Verification", "required_readings": "Refer to the course syllabus distributed in the class.", "recommended_readings": "Wilks, D.S., Statistical Methods in the Atmospheric Sciences, 3rd edition, AP, 2011.Menke, W., Environmental Data Analysis with Matlab, 2nd edition, AP, 2016", "terms": {"2024-25 Term 2": {"--LEC (1097)": {"startTimes": ["12:30", "13:30"], "endTimes": ["14:15", "14:15"], "days": [4, 3], "locations": ["Lai Chan Pui Ngong LT", "Mong Man Wai Bldg 707"], "instructors": ["Dr. AU-YEUNG Yee Man, \n\nDr. ZHANG Li", "Dr. AU-YEUNG Yee Man, \n\nDr. ZHANG Li"], "meetingDates": ["8/1", "9/1", "15/1", "16/1", "22/1", "23/1", "5/2", "6/2", "12/2", "13/2", "19/2", "20/2", "26/2", "27/2", "12/3", "13/3", "19/3", "20/3", "26/3", "27/3", "2/4", "3/4", "9/4", "10/4", "16/4", "17/4"]}}}, "assessments": {"Homework or assignment": "60", "Project": "40"}}, {"code": "5520", "title": "Numerical Methods and Modeling for Earth and Atmospheric Sciences", "career": "Postgraduate - Research", "units": "3.00", "grading": "Graded", "components": "Lecture\nInteractive Tutorial", "campus": "Main Campus", "academic_group": "Div of Earth & Atmospheric Sci", "requirements": "For students in MPhil-PhD Earth and Atmospheric Sciences", "description": "This course covers the principles of numerical methods and modeling relevant for earth and atmospheric sciences applications. Topics include: optimization; interpolation; finite differencing; numerical solutions to ordinary and partial differential equations; programming numerical models; filtered models; boundary conditions; subgrid-scale processes; data assimilation; applications in earthquake, climate, air quality, weather forecast and groundwater models. Python will be used in this course.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "5540", "title": "Remote Sensing – Principles and Applications", "career": "Postgraduate - Research", "units": "3.00", "grading": "Graded", "components": "Laboratory\nLecture\nInteractive Tutorial", "campus": "Main Campus", "academic_group": "Div of Earth & Atmospheric Sci", "requirements": "For students in MPhil-PhD Earth and Atmospheric Sciences", "description": "Remote sensing observations are critical for monitoring regional and global changes, determining spatial and temporal variability of the Earth System, and addressing fundamental global issues. This course introduces the basic physical principles of remote sensing, including electromagnetic waves and radiation, optical, microwave, and non-imaging remote sensing. It also presents key concepts and examples on remote sensing applications in Earth system science, such as the (atmosphere, lithosphere, hydrosphere, cryosphere), and global changes. This course also provides computer-based lab exercises that facilitate the understanding of remote sensing principles and the processing of remote sensing data.", "outcome": "This course will contribute to understanding of basic concepts and principles of remote sensing at optical and microwave frequencies from airborne and spaceborne platforms. With the help from laboratory analysis and case studies, remote sensing applications in Earth system science can be further understood. The students will develop: 1) the ability to evaluate an issue critically based on evidence and scientific principle, 2) to acquire knowledge effectively by self-study and using information technology, and to work independently, 3) to work effectively in a team, and 4) to present information in a clear, concise and logical manner. The students also can acquire a responsible attitude in study and work, and have motivation for life-long learning.", "syllabus": "Week   Topics1          Introduction, Remote sensing platforms2          Electromagnetic waves and radiation, Electromagnetic interaction with matters3          Radiative Transfer4          Photogrammetry and stereogrammetry, Structure from Motion5          Optical sensors6          Remote Sensing Data Processing I: ENVI, color compositive, band math7          Passive microwave remote sensing8          Active remote sensing: Radar ranging9          Active remote sensing: LiDAR ranging10        Remote Sensing Data Processing II: data fitting11        Synthetic Aperture Radar, Interferometric SAR12        Remote Sensing Data Processing III: image processing, filtering13        Remote Sensing Data Processing IV: change detection, classification14        Machine learning and deep learning in remote sensing ", "required_readings": "Emery W. and Camps A., Introduction to Satellite Remote Sensing, 1st edition. Elsevier, 2017. Physical principles of remote sensing, 3rd edition, W.G. Rees, Cambridge University Press, 2013.", "recommended_readings": "Sabins, F., Remote Sensing: Principles and Interpretation, 3rd edition, Waveland Pr Inc;, 2007. Mather, Paul M., Computer processing of Remotely-Sensed Images, Wiley, 2011.", "terms": {"2024-25 Term 2": {"--LEC (1022)": {"startTimes": ["15:30"], "endTimes": ["18:15"], "days": [1], "locations": ["Mong Man Wai Bldg 707"], "instructors": ["Professor LIU Lin"], "meetingDates": ["6/1", "13/1", "20/1", "27/1", "10/2", "17/2", "24/2", "10/3", "17/3", "24/3", "31/3", "7/4", "14/4"]}}}, "assessments": {"Lab reports": "50", "Presentation": "30", "Short answer test or exam": "20"}}, {"code": "5550", "title": "Practical Atmospheric Modeling", "career": "Postgraduate - Research", "units": "3.00", "grading": "Graded", "components": "Lecture\nInteractive Tutorial", "campus": "Main Campus", "academic_group": "Div of Earth & Atmospheric Sci", "requirements": "For students in MPhil-PhD Earth and Atmospheric Sciences", "description": "The course introduces the basic principles behind numerical atmospheric modeling and provides hands-on practice to perform numerical simulation on computers. It begins by reviewing the application of basic governing equations for the atmospheric flows in a model and basic modeling techniques. The course examines the three basic processes in atmospheric simulation: pre-processing data, modeling, and post-processing data. The pre-processing process, which is the preparation of data from various sources by different data assimilation techniques such as interpolation, is described. It then covers different options to decide before the actual modeling such as the choice of parameterization schemes, map projection and time step size. For post-processing, this course offers a quick look at different skills in visualization of the post-processed data. It also covers some basic Linux environment commands to perform the main tasks mentioned above. The course mentions model usage in different timescales such as individual tropical cyclone track simulation versus simulated seasonal tropical cyclone activity.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "5601", "title": "Research Seminar in Earth and Atmospheric Sciences", "career": "Postgraduate - Research", "units": "1.00", "grading": "Graded", "components": "Seminar", "campus": "Main Campus", "academic_group": "Div of Earth & Atmospheric Sci", "requirements": "For students in MPhil-PhD Earth and Atmospheric Sciences", "description": "Research seminar series in Earth and Atmospheric Sciences. Students will be exposed to frontier research presented by guest speakers through active participation.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "5602", "title": "Selected Topics in Earth and Atmospheric Sciences", "career": "Postgraduate - Research", "units": "2.00", "grading": "Graded", "components": "Discussion\nLecture", "campus": "Main Campus", "academic_group": "Div of Earth & Atmospheric Sci", "requirements": "For students in MPhil-PhD Earth and Atmospheric Sciences", "description": "Recent research methods, experimental, and computational techniques applied in selected, advanced topics in Earth and Atmospheric Sciences.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "8003", "title": "Thesis Research", "career": "Postgraduate - Research", "units": "3.00", "grading": "Graded", "components": "Thesis Monitoring Course", "campus": "Main Campus", "academic_group": "Div of Earth & Atmospheric Sci", "requirements": "For students in MPhil-PhD Earth and Atmospheric Sciences", "description": "In this course, a student is required to meet with his/her supervisor regularly who provides necessary guidance and supervision to write up a thesis and monitors the student's academic progress.", "outcome": "Development of research skills, including field and/or laboratory studies and data analysis as related to the students' thesis research.", "syllabus": " Research skills Literature review Scientific writing Presentation ", "required_readings": "To be assigned by thesis advisor", "recommended_readings": "To be assigned by thesis advisor", "terms": {"2024-25 Term 1": {"-M01-TMC (2362)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["No Room Required"], "instructors": ["Professor Benoit THIBODEAU, \n\nProfessor CHAN Man Nin, \n\nProfessor CHOW Tat Shing, \n\nProfessor LIU Lin, \n\nProfessor TAI Pui Kuen Amos, \n\nProfessor TAM Chi Yung Francis, \n\nProfessor TAN Yen Joe, \n\nProfessor YANG Hongfeng, \n\nProfessor ZHAI Shixian, \n\nProfessor ZHAN Yan"], "meetingDates": ["02/09/2024 - 25/11/2024"]}}, "2024-25 Term 2": {"-M01-TMC (2210)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["No Room Required"], "instructors": ["Professor Benoit THIBODEAU, \n\nProfessor CHAN Man Nin, \n\nProfessor CHOW Tat Shing, \n\nProfessor LIU Lin, \n\nProfessor TAI Pui Kuen Amos, \n\nProfessor TAM Chi Yung Francis, \n\nProfessor TAN Yen Joe, \n\nProfessor YANG Hongfeng, \n\nProfessor ZHAI Shixian, \n\nProfessor ZHAN Yan"], "meetingDates": ["06/01/2025 - 14/04/2025"]}}}, "assessments": {"Presentation": "40", "Report": "60"}}, {"code": "8006", "title": "Thesis Research", "career": "Postgraduate - Research", "units": "6.00", "grading": "Graded", "components": "Thesis Monitoring Course", "campus": "Main Campus", "academic_group": "Div of Earth & Atmospheric Sci", "requirements": "For students in MPhil-PhD Earth and Atmospheric Sciences", "description": "In this course, a student is required to meet with his/her supervisor regularly who provides necessary guidance and supervision to write up a thesis and monitors the student's academic progress.", "outcome": "Development of research skills, including field and/or laboratory studies and data analysis as related to the students' thesis research.", "syllabus": " Research skills Literature review Scientific writing Presentation", "required_readings": "To be assigned by thesis advisor", "recommended_readings": "To be assigned by thesis advisor", "terms": {"2024-25 Term 1": {"-M01-TMC (2487)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["No Room Required"], "instructors": ["Professor Benoit THIBODEAU, \n\nProfessor CHAN Man Nin, \n\nProfessor CHOW Tat Shing, \n\nProfessor LIU Lin, \n\nProfessor TAI Pui Kuen Amos, \n\nProfessor TAM Chi Yung Francis, \n\nProfessor TAN Yen Joe, \n\nProfessor YANG Hongfeng, \n\nProfessor ZHAI Shixian, \n\nProfessor ZHAN Yan"], "meetingDates": ["02/09/2024 - 25/11/2024"]}}, "2024-25 Term 2": {"-M01-TMC (2347)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["No Room Required"], "instructors": ["Professor Benoit THIBODEAU, \n\nProfessor CHAN Man Nin, \n\nProfessor CHOW Tat Shing, \n\nProfessor LIU Lin, \n\nProfessor TAI Pui Kuen Amos, \n\nProfessor TAM Chi Yung Francis, \n\nProfessor TAN Yen Joe, \n\nProfessor YANG Hongfeng, \n\nProfessor ZHAI Shixian, \n\nProfessor ZHAN Yan"], "meetingDates": ["06/01/2025 - 14/04/2025"]}}}, "assessments": {"Presentation": "40", "Report": "60"}}, {"code": "8012", "title": "Thesis Research", "career": "Postgraduate - Research", "units": "12.00", "grading": "Graded", "components": "Thesis Monitoring Course", "campus": "Main Campus", "academic_group": "Div of Earth & Atmospheric Sci", "requirements": "For students in MPhil-PhD Earth and Atmospheric Sciences", "description": "In this course, a student is required to meet with his/her supervisor regularly who provides necessary guidance and supervision to write up a thesis and monitors the student's academic progress.", "outcome": "Development of research skills, including field and/or laboratory studies and data analysis as related to the students' thesis research.", "syllabus": " Research skills Literature review Scientific writing Presentation   ", "required_readings": "To be assigned by thesis advisor", "recommended_readings": "To be assigned by thesis advisor", "terms": {"2024-25 Term 1": {"-M01-TMC (2486)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["No Room Required"], "instructors": ["Professor Benoit THIBODEAU, \n\nProfessor CHAN Man Nin, \n\nProfessor CHOW Tat Shing, \n\nProfessor LIU Lin, \n\nProfessor TAI Pui Kuen Amos, \n\nProfessor TAM Chi Yung Francis, \n\nProfessor TAN Yen Joe, \n\nProfessor YANG Hongfeng, \n\nProfessor ZHAI Shixian, \n\nProfessor ZHAN Yan"], "meetingDates": ["02/09/2024 - 25/11/2024"]}}, "2024-25 Term 2": {"-M01-TMC (2313)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["No Room Required"], "instructors": ["Professor Benoit THIBODEAU, \n\nProfessor CHAN Man Nin, \n\nProfessor CHOW Tat Shing, \n\nProfessor LIU Lin, \n\nProfessor TAI Pui Kuen Amos, \n\nProfessor TAM Chi Yung Francis, \n\nProfessor TAN Yen Joe, \n\nProfessor YANG Hongfeng, \n\nProfessor ZHAI Shixian, \n\nProfessor ZHAN Yan"], "meetingDates": ["06/01/2025 - 14/04/2025"]}}}, "assessments": {"Presentation": "40", "Report": "60"}}]