[{"code": "2110", "title": "Principles of Curriculum and Instructional Design", "career": "Undergraduate", "units": "2.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Fac Office of Education", "requirements": "", "description": "The course aims at introducing the theories and skills of curriculum and instructional design. The theories include: (1) models of curriculum and instructional design; (2) factors that should be considered in curriculum and instructional design; (3) establishing curriculum aims and instructional objectives; (4) selection of learning opportunities; (5) curriculum and instructional organization; (6) catering for individual differences; and (7) evaluation of student learning. These theories and skills provide learners with a foundation for designing school curricula and classroom instruction.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "2120", "title": "Principles and Implementation of Curriculum and Instructional Design", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "Classwork\nDiscussion\nLecture\nProject", "campus": "Main Campus", "academic_group": "Fac Office of Education", "requirements": "", "description": "The course aims at introducing the theories and skills of curriculum and instructional design. The theories include: 1) models of curriculum and instructional design; 2) factors that should be considered in curriculum and instructional design; 3) curriculum aims and instructional objectives; 4) curriculum organization; 5) curriculum implementation; 6) teaching strategies; 7) learning activities; 8) catering for individual differences;9) assessing the learning of students; and 10) school-based curriculum design and implementation. It is hoped that learners will be able to apply what they have acquired throughout the course to handle curriculum matters and teaching tasks properly in schools.", "outcome": "By the end of this course, students will be able to:  1. obtain a grasp of curriculum design models  2. understand the principles and key concepts underpinning a curriculum design  3. articulate factors influencing curriculum and instructional design 4. comprehend the individual differences of students  5. recognize features characterizing school-based curriculum development and implementation  學生修畢本科後，能夠: 1. 掌握不同的課程設計模式  2. 明白課程設計的原則及概念  3. 理解影响課程與教學設計的因素  4. 了解學生的個別差異  5. 認識校本課程設計與實施的特徵", "syllabus": "For reference only, please refer to the course outline of respective instructor for details 1. models of curriculum and instructional design 2. factors that should be considered in curriculum and instructional design  3. curriculum aims and instructional objectives 4. curriculum organization  5. curriculum implementation  6. teaching strategies 7. learning activities 8. catering for individual differences  9. assessing the learning of students  10. school-based curriculum design and implementation  課題可因應個別導師的科目設計而調校 1. 課程與教學設計模式  2. 設計課程與教學應考慮的要素  3. 課程目的與教學目標  4. 課程組織  5. 課程實施  6. 教學策略  7. 學習活動  8. 照顧個別差異  9. 學生學習評估  10. 校本課程設計與實施", "required_readings": "Required readings (if any) would depend on individual instructors 1. Morris, P. & Adamson, B. (2010), Studying the curriculum. In Curriculum, schooling and society in Hong Kong (pp. 1-15). Hong Kong: Hong Kong University Press.  2. 楊思賢(2013)。〈課程設計的轉變〉。輯於楊思賢、林德成、梁偉倫、羅耀珍《課程改革與創新》(頁 93-126)。香港:香港大學出版社。(英文版:Yeung, S.S.Y. (2012), Change in curriculum design. In S.S.Y. Yeung, J.T.S. Lam, A.W.L. Leung, & Y.C. Lo (Eds.), Curriculum change and innovation (pp. 93-124). Hong Kong: Hong Kong University Press.", "recommended_readings": "Recommended readings would depend on individual instructors 1. Amstrong, D. G. (2003). Curriculum today. Upper Saddle River, MJ: Merrill Prentice Hall. 2. Brady, L. & Kennedy, K. (2003). Curriculum construction. Sydney: Prentice Hall.  3. Borich, G. D. (2004). Effective teaching methods. Upper Saddle River, N.J.: Merrill.  4. Cook, R. E., Klein, M. D., & Chen, D. (2012). Adapting early childhood curricula for children with special needs (8th ed.). Boston: Pearson.  5. Fisher, D., & Frey, N. (2001). Responsive curriculum design in secondary schools: Meeting the diverse needs of students. Lanhma, Md.: Scarecrow Education.  6. Gargiulo, R. M., & Metcalf, D. J. (2013). Teaching in today’s inclusive classrooms: A universal design for learning approach (2nd ed.). Belmont, CA: Wadsworth Cengage Learning.  7. Hlebowitsh, P. S. (2005). Designing the school curriculum. Boston: Pearson/Allyn and Bacon.  8. Kelly, A. V. (2009). The curriculum: Theory and practice (6th ed.). Thousand Oaks, CA: SAGE Publications.  9. Morrison, G. R., Ross, S. M., & Kemp, J. E. (2004). Designing effective instruction (4th ed.). Hoboken, NJ: J. Wiley & Sons.  10. Morse, T. E. (2008). Designing appropriate curriculum for special education students in urban schools. In B. S. Stern & M. L. Kysilka (Eds.), Contemporary readings in curriculum (pp. 255-262). Thousand Oaks, CA: Sage Publications.  11. Peterson, J. M., & Hittie, M. M. (2003). Inclusive teaching: Creating effective schools for all learners. Boston: Allyn and Bacon.  12. Singh, A. (2007). Curriculum and instruction. Delhi, India: Academic Excellence.  13. Tyler, R. W. (1949). Basic principles of curriculum and instruction. Chicago: University of Chicago Press. 14. Wiles, J. & Bondi, J. (2011) Curriculum development: A guide to practice (8th ed.). Boston: Pearson.  15. 李子建主编 (2010)。 校本課程發展, 教師發展與伙伴協作。北京：教育科學出版社。  16. 林智中、陳建生、張爽 (2006)。課程組織。北京：教育科學出版社  17. 楊龍立 (2005)。課程組織 : 理論與實務。台北市 : 高等教育文化事業有限公司。", "terms": {"2024-25 Term 2": {"A-LEC (4799)": {"startTimes": ["10:30"], "endTimes": ["13:15"], "days": [2], "locations": ["Yasumoto Int'l Acad Park 505"], "instructors": ["Dr. WAN Wai Yan"], "meetingDates": ["7/1", "14/1", "21/1", "4/2", "11/2", "18/2", "25/2", "11/3", "18/3", "25/3", "1/4", "8/4", "15/4"]}, "B-LEC (6432)": {"startTimes": ["10:30"], "endTimes": ["13:15"], "days": [2], "locations": ["Sino Building LT2"], "instructors": ["Professor Ronnel Bornasal KING"], "meetingDates": ["7/1", "14/1", "21/1", "4/2", "11/2", "18/2", "25/2", "11/3", "18/3", "25/3", "1/4", "8/4", "15/4"]}}}, "assessments": {"Essays": "50", "Others": "20", "Project": "30"}}, {"code": "2130", "title": "Environmentalism and Environmental Education", "career": "Undergraduate", "units": "2.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Dept of Curriculum & Instruct", "requirements": "", "description": "(UGEC2710 is double-coded with EDUC2130.) The course is aimed at preparing students as global and future citizens who not only have critical understandings of the environmental issues, but also the capabilities and attitudes to take an active role in tackling the issues and educating for the environment. This course is structured around key issues pertaining to environmentalism and environmental education, including climate changes, sustainability, green groups and environmental curriculum and teaching at schools. Using an issue-inquiry approach, course participants will be led to critically reflect on the issues from various perspectives: philosophical, scientific, social and educational. The different approaches to environmental education in the Western and Chinese communities will be explored in the contexts of eastern and western cultures. A field trip is included to provide experiential education in the environment.", "outcome": "  At the end of this course, students will be able to:     understand the complexity of environmental issues as an interplay between science, politics, values, economy, education and social development;    critically understand key environmental issues at both local and global levels;    actively participate in the discourse and actions concerning environmental issues;    recognize different approaches to environmental education and critically analyze their strengths and constraints;    understand the relations between environmental education and cultural differences;    actively participate in environmental education both inside and outside the school systems;    appreciate and to live an environmentally-friendly lifestyle ", "syllabus": "    How do people start to care about the environment - a historical understanding of environmentalism and its definition    A framework for understanding environmental issues    Is climate change a myth or hoax - understanding the science behind and its limitations    Why don’t people take climate change seriously - consequences and solutions of climate change    What’s wrong with the countries – politics and the environment    What’s wrong with our society – modern capitalism and the environment    Is sustainable development a myth?    What’s wrong with human beings – environmental ethics?    What’s wrong with the environmental advocacy groups - myths of some environmental activities?    What's wrong with our education - aims and approaches of environmental education?    How do different countries approach environmental education –Hong Kong, China, Taiwan and others    Overview of issues related to environmental problems and environmental education    Field trip to a site related to current environmental issues in Hong Kong, such as North East development farmland, EcoPark, Fung Yuen butterfly convervation centre. ", "required_readings": "  Speth, J. G. (2008). The bridge at the edge of the world: capitalism, the environment, and crossing from crisis to sustainability. New Haven: Yale University Press. (E book in CU library)   李逆熵 (2011). 喚醒69億隻青蛙. 經濟日報出版社: 香港   樊綱(主編) (2010).世界低碳發展的中國主張. 商務印書館: 香港   李子建, 黄宇, 馬慶堂 (2009) 校本環境教育的設計與实施. 人民教育出版社: 北京   Henson, R. (2006). The rough guide to climate change (1. ed.). New York: Rough Guides.   Lee, J.C.K. & Williams, M. (Eds.) (2006). Environmental and geographical education for sustainability: Cultural contexts. New York: Nova Science Publishers, Inc. (Chapter 3, 5, 6, 11, 13, 16, 20)           Class                                                 Topics                           Readings            1             History of environmentalism in Europe             Timeline of European Environmental History    http://www.eh-resources.org/timeline/timeline.html            2             Understanding the science behind climate change and clarifying some myths        Explaining climate change science & rebutting global warming misinformation    http://www.skepticalscience.com/            3        Consequences and solutions of climate change        喚醒69億隻青蛙,李逆熵 (ch 17-28)                 4        The role of politics in climate change deals between nations        樊綱(主編) (2010).世界低碳發展的中國主張. 商務印書館: 香港 第1-3章            5        Capitalism as the prevalent social values and the environmental issues        The bridge at the edge of the world capitalism (ch 7, 8, 9)                 6        Basic concepts about sustainable development        Basic Principles of Sustainable Development     by Jonathan M. Harris, June 2000                 7        Environmental ethics        Unearthed: the economic roots of environmental crisis, ch14    http://www3.nd.edu/~philinst/energy.html            9        Approaches of environmental education        Lee, J.C.K. & Williams, M. (Eds.) (2006). Environmental and geographical education for sustainability: Cultural contexts.Ch2, 4            10        How do different countries do environmental education –Hong Kong, China, Taiwan and others        Lee, J.C.K. & Williams, M. (Eds.) (2006). Environmental and geographical education for sustainability: Cultural contexts.Ch7,10,11           ", "recommended_readings": "Alma, P. (1993). Environmental concerns. Cambridge: Cambridge University Press. (Chapter 1–Environmental concerns having global impacts; Chapter 2–Environmental concerns having local impacts)Blewitt, J. and Cullingford, C. (Eds.) (2004). The sustainability curriculum: the challenge for higher education. London: Earthscan.Cooper, D. E., and Palmer, A.J. (1992). The environment in question: Ethics and global issues. London: Routledge.Corcocan, P.B. and Wals, A. E.J. (Eds.) (2004). Higher education and the challenge of sustainability: problematics, promise, and practice. Boston: Kluwer Academic Publishers.Chambers, B. (1996). Awareness into action. Sheffield: Geographical Association.Elliott, J. A. (2006). An introduction to sustainable development (3rd ed.). London: Routledge.Environmental Protection Department (2005). Environment Hong Kong. Hong Kong: Environmental Protection Department.Gore, A. (2006). An inconvenient truth: The planetary emergency of global warming and what we can do about it. New York: Rodale Press.Harris, G., and Blackwell, C. (1996). Environmental issues in education. Hants: Arena. (Chapter 1–The nature and purposes of environmental education; Chapter 3–Young people’s ideas about global environmental issues)Hills, P., and Man, C. S. (Eds.) (2003). New directions in environmental education for Hong Kong. Hong Kong: Centre of Urban Planning and Environmental Management, University of Hong Kong.Huckle, J. 及 Sterling, S.主編，王民等譯（2002）。《可持續發展教育》。北京：中國輕工業出版社。Lee, J.C.K. and Williams, M. (Eds.) (2009). Schooling for sustainable development in Chinese Communities: Experience with younger children. The Netherlands: Springer.Kidder, A. (2001). How big is your backyard? Camden, Maine: Institute for Global Ethics.Man, S. W. (1995). The environment. In Cheng, J.Y.S. and S.S.H. Lo (Eds.), From colony to SAR: Hong Kong’s challenge ahead. Hong Kong: Chinese University Press.Munro, D. A. (1991). Caring for the earth: A strategy for sustainable living. Gland, Switzerland: International Union for Conservation of Nature and Natural Resources (IUCN), United Nations Environment Program (UNEP) and World Wide Fund for Nature (WWF).Palmer, J. A. (1998). Environmental education in the 21st century: Theory, practice, progress and promise. London: Routledge. (Part II–The global agenda)Palmer, J., and Neal, P. (1994). The handbook of environmental education. London: Routledge.Postma, D. W. (2006). Why care for nature? In search of an ethical framework for environmental responsibility and education. Dordrecht, The Netherlands: Springer.Reid, A., and Scott, W. (Eds.) (2008). Researching education and the environment: Retrospect and prospect. London: Routledge. (Theme 1–Environmental education and education for sustainable development; Theme 4–environmental learning as process and outcome; Theme 5–Environmental education for …)The World Commission on Environment and Development (WCED) (1987). Our common future. Oxford: Oxford University press.文思慧 (1998)。 《香港綠色難產》。香港 : 香港人文科學出版社。李子建 (1998)。《中小學環境教育理論與實踐 – 邁向可持續發展》。北京：北京師範大學出版社。周兆祥 (1989)。《綠色思想》。 香港 : 明窗出版社。螢火蟲學苑之友 (2005)。《螢火蟲學苑：綠色教育札記》。 香港：藍藍的天。 Useful journalsApplied Environmental Education and CommunicationThe Ecologist [UL: QH540 .E297]Environment [UL: GF75 .E58]Environmental Education Research [CC: GE70 .E5815]Green Teacher [electronic resource]International Journal of Environmental Education & Information [CC: GE70 .E5813]Journal of Environmental Education [UL: S946.E54]Nature and Resources [UL: GB651.N3]《環境》[UL: TD169.H83]《環境教育》[CC: GE70.H783]《環境教育研究》Internet resourceshttp://www.ied.edu.hk/esdweb/http://www.hkbws.org.hk/lvalley/indexc.htmlhttp://www.ecc.org.hk/http://www.foe.org.hk/welcome/gettc.asphttp://www.greenpower.org.hk/http://www.wwf.org.hk/http://www.epd-asg.gov.hk/cindex.phphttp://www.kepu.net.cn/gb/index.htmlhttp://en.wikipedia.org/Video resources綠色未來 [錄像資料] / 編導陳偉棠 ; 監製鄭惠芳 ; 香港電台電視部製作.TD171.5.H6 Z25 2007-0331 VOD綠色新一代 [錄像資料] / 編導葉婉虹 ; 監製伍婉嫻 ; 香港電台電視部製作.DS796.H7 K45 2004-0725 VOD", "terms": {"2024-25 Term 2": {"--LEC (8259)": {"startTimes": ["9:30"], "endTimes": ["11:15"], "days": [1], "locations": ["Yasumoto Int'l Acad Park 503"], "instructors": ["Dr. MA Kwan Ki, \n\nProfessor LAU Kwok Chi"], "meetingDates": ["6/1", "13/1", "20/1", "27/1", "10/2", "17/2", "24/2", "10/3", "17/3", "24/3", "31/3", "7/4", "14/4"]}}}, "assessments": {"Essays": "0", "Others": "0", "Presentation": "0"}}, {"code": "2210", "title": "Education and Society in Hong Kong", "career": "Undergraduate", "units": "2.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Fac Office of Education", "requirements": "Not for students who have taken UGEC2895", "description": "The course is designed to help students to reflect on the social and education system for about 150 years. By applying historical perspective and sociological concepts, the course will analyze the development experience of Hong Kong over the years under the influences of Britain and Modern China. The course will also introduce research findings on Hong Kong society and education which have been accumulated for the last four decades. It is intended to help students to have a broader and more penetrating understanding of Hong Kong society and its educational system.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "2220", "title": "Educational Thought", "career": "Undergraduate", "units": "2.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Fac Office of Education", "requirements": "Not for students who have taken UGED2682", "description": "This course aims to discuss the prominent thoughts directing educational practice and their philosophical origins or foundations. Topics including the meaning and aims of education, content and practice of teaching and learning will be introduced and examined in relation to various fields of philosophical investigation concerning knowledge and value, humanity and society, etc. Traditional and modern, Chinese and Western perspectives on education will be scrutinized.", "outcome": "By the end of this course, students will be able to: 1. gain some basic knowledge of Chinese and English thoughts about education. 2. critically reflect on these educational thoughts in relation to some general problems of education, including nature, aims, values and implied practices of education. 3. reflectively think about one’s own educational life against these educational thoughts.  學生修畢本科後，能夠: 1. 獲得中西教育思想的基本知識。 2. 對應教育的一般問題（包括教育的性質、目的、價值及其引申之實踐）之答問，對這些中西教育思想作出批判反思。 3. 對應這些中西教育思想，對自己個人的教育人生作出反省思考。", "syllabus": "For reference only, please refer to the course outline of respective instructor for details  M1. Enrichment of thought and enhancement (empowerment) of thinking M2. Concept of Education and Ideals of Education M3. Intellectualist perspective on education M4. Moralist perspective on education M5. Autonomist perspective on education M6. Axiology (values) of education M7. Qualitarian perspective on education M8. SQUID Narrative Method for Self-Understanding for the Good Life M9. Intellectual Education M10. Moral Education M11. Spiritual Education M12. Social Education M13. Aesthetic Education  課題可因應個別導師的科目設計而調校 M1. 思想的厚化與思考的強化：教育思想的意義 M2. 教育的概念與教育的理想：何謂教育？ M3. 尚智教育觀 M4. 尚德教育觀 M5. 自主教育觀 M6. 教育價值論 M7. 品育觀 M8.「生命三維敘事法」如何促進自我理解以活出美好人生？ M9. 智育 M10.德育 M11.靈育 M12.群育 M13.美育", "required_readings": "Required readings (if any) would depend on individual instructors   Basic Readings for M1: 1B1: 鄭漢文（2003）〈中大人身分的聚散：香港中文大學的意義〉，載於：《中大四十》下冊頁264至267（香港，中大學生出版委員會出版）；選段載於：《通識的路如何走：通識教育手記一集》頁103-107，題為〈通識教育是教外別傳──《中大人身分的聚散》選段〉，（香港，從心會社，2008）。 1B2: 鄭漢文（1995）〈運用「聽讀寫進思法」（CAROL Method）“集思成文”：聽講讀寫思，學而時習之〉筆記。  Basic Readings for M2: 2B1: 何秀煌（1998）。〈教育畢竟仍是一種良心事業〉，載於：《從通識教育的觀點看──文明教育和人性教育的反思》（台北：東大圖書公司），頁1-5。 2B2: 明報（2004）〈人生何價？──訪問鄭漢文談價值教育的推行〉。《教得樂》（2004年3月9日）頁8至9。  Basic Readings for M3: 3B1: White, J.P. (1995) Problems of the Philosophy of Education, in: T.Honderich (ed) (1995) The Oxford Companion to Philosophy (Oxford, OUP) pp.216-219. 3B2:Cheng, H.-M.R.（1999）Education Requiring Contextualized Epistemology: Restructuring Knowledge-based Education into Quality-based Education in Contexts, Education Journal., Vol.26（2）& Vol.27（1）pp.135-158.  Basic Readings for M4: 4B1: 王國維（1906）〈論教育之宗旨〉，載於：商友敬（編）（1995）《教育古文選》（上海，上海社會科學院出版社）頁211至214。 4B2:石元康（1998）。〈兩種道德觀──試論儒家倫理的形態〉，載於：《從中國文化到現代性：典範轉移》（台北，東大圖書公司），頁105至123。  Basic Readings for M5: 5B1: White, J.P. (1995) Problems of the Philosophy of Education, in: T.Honderich (ed) (1995) The Oxford Companion to Philosophy (Oxford, OUP) pp.216-219. 5B2: White, J.P. (1990) Education for Personal Autonomy, in: Ed. and the Good Life (London, Kogan Page) Ch.5, pp.74-94.  Basic Readings for M6: 6B1: 鄭漢文（2001）〈用才教育與謀財價值的惡性循環〉，載於：《信報》（2001/6/12）。 6B2: Haydon, G. (1996) Aims of Education, in: J.J.Chambliss (ed) Philosophy of Education: An Encyclopedia (New York, Garland Publishing, Inc.,), pp.11-13.  Basic Readings for M7: 7B1: 鄭漢文（1998）〈品育觀下的香港教育：心力並養與群己兼顧的育成人才〉，載於：陳慎慶（編）《香港的遠象》（香港：基督教文藝出版社，1998年），頁203至230。 7B2: Peters, R.S.(1977) The Meaning of Quality in Education, in: Education and the Education of Teachers (London, Boston: Routledge & K. Paul, 1977), Ch.2, pp.22-45.  Basic Readings for M8: 8B1: 鄭漢文（2007）總序及鄭序，載於：鄭漢文、鄧雪貞、吳玉樹合著(2008) 。《尋求美好人生的自我理解》，頁8至15及16至23。香港：香港基督徒學生福音團契。  8B2: 鄭漢文（2011）〈價值散亂而流動的自我得以敘事整合的生命教育〉，宣讀於：《2011兩岸四地生命教育論壇》（2011.12.19）。  Basic Readings for M9: 9B1: 鄭漢文（2001）〈養智的教育需由傳知變為啟思〉，載於：《信報》（2001/3/17）。 9B2: Cheng, H.-M.R. (1999) Education Requiring Contextualized Epistemology: Restructuring Knowledge-based Education into Quality-based Education in Contexts, Education Journal, Vol.26(2) & Vol.27(1) pp.135-158.  Basic Readings for M10: 10B1: Cheng, H.M.R. (2004) Moral Education in Hong Kong: Confucian-parental, Christian-religious and liberal-civic influences, Journal of Moral Education, Vol. 33, No.4, pp. 533-552, December 2004.  10B2: Larrabee, Mary J. (ed.) (1993) Gender and Moral Development, in: An Ethic of Care: Feminist and Interdisciplinary Perspectives (London, Routledge) Ch.1, pp.3-16.   Basic Readings for M11: 11B1: Taylor, C. (1991) Sources of Authenticity, in: The Ethics of Authenticity (Cambridge, Mass., Harvard UP) Ch.3, pp.25-29.  11B2:鄭漢文（2000）〈三態合一的靈性教育〉《思想教育》講稿。  Basic Readings for M12: 12B1: 曾榮光（1995）〈民族教育與公民權責教育之間：過渡期香港公民教育的議論〉，載於：《教育學報》（香港，香港中文大學香港教育研究所）第20卷第2期頁161-172。 12B2: Roger, H.M. Cheng, John, C.K. Lee and Leslie, N.K. Lo (2006). Values Education for Citizens in the New Century: Meaning, Desirability and Practice. In: R.H.M. Cheng, J.C.K. Lee and L.N.K.Lo (eds.) (2006): Values Education for Citizens in the New Century, pp. 1-32. HK Institute of Educational Research, Chinese University of HK: Chinese University Press.   Basic Readings for M13: 13B1: 鄭漢文（1998）〈開心得意的教育：從字到文的美育經驗想起〉，載於：《香港美術教育協會通訊》（香港，香港美術教育協會）第二期，頁4至5。 13B2: Hirst, P.H. (1992) Aesthetic Education, in: D.E.Cooper (ed) (1992) A Companion to Aesthetics (Oxford, Blackwell) pp.127-130.", "recommended_readings": "Recommended readings would depend on individual instructors   Recommended References for M1: 1R1: 杜祖貽（1988）〈教育哲學的觀念、方法與功能〉，載於：杜祖貽、劉述先（編）（1988）《哲學、文化與教育》（香港，香港中文大學出版社）第二章，頁9至35。 1R2: 鄭漢文（1999）〈教育理想與理想教育〉，載於：《九九中大開放日特刊》（香港中文大學開放日籌委會出版部，1999年11月20-21日）第34至35頁（2000年4月4日修訂）。.  Recommended References for M2: 2R1: 嚴元章（1993）〈宗旨論〉，載於：《中國教育思想源流》第二章，頁32至59。 2R2: Peters, R.S. (1965) The Concept of Education, in: Ethics and Education (London, George Allen & Unwin) pp.23-45.  Recommended References for M3: 3R1: 鄭漢文（1998）〈好問〉，載於：《川流》第五期（1998/11），頁20至21。 3R2: Hirst, P.H.(1965) Liberal Education and the Nature of Knowledge, in:（1975）Knowledge and the Curriculum（London, RKP）Ch.3, pp.30-53; also in: R.S.Peters (ed)(1973) The Philosophy of Education (Oxford, OUP) Ch.IV, pp.87-111.  Recommended References for M4: 4R1: 劉國強（1994）〈唐君毅論教育目的與教者意識──傳統的繼承與發展〉，載於：李明輝（編）（1994）《當代新儒家人物論》（台北，文津出版社）頁187至198。 4R2: 葛楚英（1993）〈德與才之間的關係〉，載於：《《三國演義》與人才學》（台北，遠流）頁339至342。  Recommended References for M5: 5R1: 吳梓明等（1997）〈「邁向自主」：一個受過道德教育與宗教教育的人的素質〉，載於：吳梓明（1997）《學校宗教教育的新路向》（香港，基督教文藝出版社）頁86至98。 5R2: Wringe, C. (1997) In Defence of Rational Autonomy as an Educational Goal, in: D.Bridges (ed) (1997) Education, Autonomy and Democratic Citizenship: Philosophy in a Changing World (London, Routledge) Ch.10, pp.115-126.   Recommended References for M6: 6R1: 嚴元章（1993）〈宗旨論〉，載於：《中國教育思想源流》第二章，頁32至59。 6R2: 課程發展議會（2000）〈學生應該學些甚麼〉，載於：《學會學習》第三章，頁23至34。   Recommended References for M7: 7R1: White, J.P. (1982) The Educated Man, in: The Aims of Education Restated (London, RKP) Ch.6, pp.121-139. 7R2: Frankena, W.K. (1964), Aristotle’s Philosophy of Education, in: Three Historical Philosophies of Education: Aristotle, Kant and Dewey (Chicago: Scott, Foresman, 1965), Ch.2, pp.15-54.   Recommended References for M8: 8R1: 鄭漢文、鄧雪貞、吳玉樹合著(2008) 。《尋求美好人生的自我理解》。香港：香港基督徒學生福音團契。  8R2: 鄭漢文（2001）〈善借機緣養心力的老師〉，載於：吳玉樹（編）（2001）《誰改變了我》。（香港，學生福音團契出版社），頁28至35。   Recommended References for M9:  9R1: Pring, R.A. (1995) Liberal and Vocational Education, in: Closing the Gap: Liberal Education and Vocational Preparation (London, Hodder & Stoughton) Ch.8, pp.183-195.  9R2: Hirst, P.H.(1965) Liberal Education and the Nature of Knowledge, in:（1975）Knowledge and the Curriculum（London, RKP）Ch.3, pp.30-53; also in: R.S.Peters (ed)(1973) The Philosophy of Education (Oxford, OUP) Ch.IV, pp.87-111  Recommended References for M10: 10R1:陳特（1988）〈道德哲學與道德教育〉，載於：杜祖貽、劉述先編）（1988）《哲學、文化與教育》（香港，香港中文大學出版 社）第五章，頁91至117。 10R2:Peters, R.S. (1981) Reason and Habit: the Paradox of Moral Education, in: Moral Development and Moral Education (London, Allen & Unwin) Ch.3, pp.45-60.  Recommended References for M11: 11R1:吳梓明等（1997）〈「邁向自主」：一個受過道德教育與宗教教 的人的素質〉，載於：吳梓明（1997）《學校宗教教育的新路向》 （香港，基督教文藝出版社）頁86至98。 11R2: Carr, D. (1996) Rival Conceptions of Spiritual Education, Journal of Philosophy of Education 30(2) 1996, pp.159-178.  Recommended References for M12: 12R1: Heater, D. (1990) Multiple Citizenship, in: Citizenship: The Civic Ideal in World History, Politics and Education (London, Longman) Pt.3: Synthesis, Ch.9, pp.314-45. 12R2: Crittenden, J. (1992) The Disposition of the Self, in: Beyond Individualism: Reconstituting the Liberal Self (Oxford, OUP) Ch.1, pp.13-37.  Recommended References for M13: 13R1: 黃宇鵬（2004）〈從價值論看香港藝術的敘述〉，載於：《如何「看」香港藝術》（How To See”Hong Kong Art）（香港：1aSpace，香港藝術發展局）頁70-75。 13R2: Redfern, H.B. (1986) How is the Aesthetics related to Art? in: Questions in Aesthetic Education (London, Allen & Unwin) Ch.2, pp.14-30.", "terms": {"2024-25 Term 2": {"--LEC (5214)": {"startTimes": ["14:30", "14:30"], "endTimes": ["16:15", "16:15"], "days": [1, 3], "locations": ["Wu Ho Man Yuen Bldg 406", "Wu Ho Man Yuen Bldg 403"], "instructors": ["Professor KWOK Yan Shing Henry", "Professor KWOK Yan Shing Henry"], "meetingDates": ["6/1", "8/1", "13/1", "15/1", "20/1", "22/1", "27/1", "5/2", "10/2", "12/2", "17/2", "19/2", "24/2", "26/2"]}}}}, {"code": "2240", "title": "Understanding Schooling and Education Policy in Hong Kong", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Fac Office of Education", "requirements": "", "description": "This course introduces learners to a structural analysis of schooling: its nature and how it has been shaped and, at the same time, how it contributes to macro social divisions and contradictions along class, gender and racial/ethnic lines. It also sensitizes learners to various aspects of school life at a micro level, in order to see how these are constrained by macro economic, political and social forces on the one hand, and how these forces go into the making of students’ identities and relationships on the other. This course attempts to portray all these macro and micro dynamics in the local context, and at the same time, depicts how these are played out in selected education policies and the process of policy-making itself.", "outcome": "By the end of this course, students will be able to: • to grasp the essence of various critical perspectives – including the application of the relevant theories and concepts – in understanding the operation of schooling • to understand the relationship between education policy and schooling  • to relate the implications of such discussions to their (future) classroom practices", "syllabus": "For reference only, please refer to the course outline of respective instructor for details 1. Introduction: The sociological perspective in education 2. Education and class inequality: cultural capital, symbolic violence, and social closure  3. Education and gender: identities, positioning and schooling outcomes 4. Racial and ethnic minorities and their schooling experience in Hong Kong 5. Language and social selection: the case of post-colonial Hong Kong 6. Globalization and the education reforms in Hong Kong: social polarization and neoliberal practices in schools 7. Policy-making in education in Hong Kong: the limits of civic/professional participation 8. Concluding discussion: education for socialization or for transformation?  課題可因應個別導師的課程設計而作出調校 1. 導言：教育的社會學視角 2. 教育與階級不均等：文化資本、符號暴力和社會壁壘 3. 教育與性別：身份、位置與學習後果 4. 香港少數種族/族裔人士和他們的學校經驗 5. 語文和社會篩選：後殖時期香港的狀況 6. 全球化與香港教育改革：社會兩極化和學校的新自由主義實踐 7. 香港教育政策過程：公民/專業參與的限制 8. 總結：教育目的是「社化」抑或轉化？", "required_readings": "Required readings (if any) would depend on individual instructors  1. 曾榮光《香港特區教育政策分析》，香港，三聯書店（香港）有限公司，香港浸會大學當代中國研究所，2011年 2. 曾榮光《香港教育政策分析：社會學的視域》。香港：三聯書店，1998年 3. 蔡寶瓊、黃家鳴編 <<姨媽姑爹論盡教改>>，香港，進一步多媒體有限公司，2002年 4. 蔡寶瓊、陳潔華編著《教育的性別視角：課堂與教學實證研究》，香港城市大學出版社，2012年 5. 陳潔華、蔡寶瓊編著《性別顯微鏡：教育與個人成長》，香港城市大學出版社，2012年 6. 何強星「教育機會均等狀況」，載謝均才編，《我們的地方，我們的時間：香港社會新編》，2002年，香港，牛津，頁157-188 7. 謝均才《教育機會差異在香港：現狀和研究議題評述》，香港，香港中文大學香港教育研究，1998 8. 謝均才「『教育質素』何價？香港教育改革的矛盾、弔詭和效果」，《香港社會科學學報》，第二十期 2001年秋 ; 頁1-55 9. Tse, Kwan-Choi Thomas, “Civic education and the making of deformed citizenry: From British colony to Chinese SAR”, in Agnes S. Ku and Ngai Pun (eds), Remaking Citizenship in Hong Kong: community, nation and the global city, London and New York, Routledge, 2006, pp. 54-73 10. Ball, Stephen J. “Perfomativities and fabrications in the education economy: towards the performative society”, in Hugh Lauder, Phillip Brown, Jo-Anne Dillabough and A.H. Halsey (eds), Education, Globalization, and Social Change, Oxford, Oxford U Press, 2006, pp. 692-701 11. Choi, Po King, \"'The best students will learn English': ultra-utilitarianism and linguistic imperialism in education in post-1997 Hong Kong\", Journal of Education Policy, Vol.18, no.6, Nov-Dec 2003, p. 673-694 12. Pong, Suet-ling & Tsang, Wing Kwong. 2010. “The Educational Progress of Mainland Chinese Immigrant Students in Hong Kong.” Research in Sociology of Education 17: 201-230. 13. Loper, Kelley (2004).Race and equality: A study of ethnic minorities in Hong Kong’s education system. HK: Centre for Comparative and Public Law, Faculty of Law, U. of HK. 14. Bourdieu, Pierre, “The forms of capital”, in Hugh Lauder, Phillip Brown, Jo-anne Dillabough and A.H. Halsey (eds), Education, Globalization and Social Change, Oxford U. Press, 2006, pp. 105-118 15. Sinikka Aapola, M. Gonick and A. Harris, Young Femininity: Girl Power and Social Changes, New York, Palgrave Macmillan, 2005, chap. 3, “Education, work and self-making ” , pp. 56-78 16. Brown, Phillip, “Cultural capital and social exclusion: some observations on recent trends in education, employment and the labour market, in A.H. Halsey, H. Lauder, P. Brown and A.S. Wells (eds), Education, Culture, Economy and Society, Oxford, Oxford University Press, 1997, pp. 736-74", "recommended_readings": "Recommended readings would depend on individual instructors 1. 何玉芬《流沙上的朝聖者足跡—從教師口述個案看教育承傳與教改》，香港，進一步多媒體有限公司，2006年 2. 吳康寧《教育社會學》，高雄，高雄復文，2002年 3. 林生傳《教育社會學》，台北，巨流，2005年 4. 陳奎熹《教育社會學》，台北，三民書局2001年 5. 陳照雄《當代教育社會學導論》，台北，心理，2006年。 6. Choi Po King, “A Critical Evaluation of Education Reforms in Hong Kong: Counting our Losses to Economic Globalisation”, in international Studies in Sociology of Education, Vol.15, no.3, 2005, pp. 241-261 7. Weiner, Gaby, Madeleine Arnot, and Miriam David, \"Is the future female? Female success, male disadvantage, and changing gender patterns in education\", in A.H. Halsey, Hugh Lauder, Phillip Brown and Amy Stuart Wells (eds), Education: Culture, Economy, and Society, Oxford, Oxford University Press, 1997, pp. 620-630 8. Ringrose, Jessica, “Successful girls? Complicating post-feminist, neoliberal discourses of educational achievement and gender equality”, Gender and Education, Vol. 19, no. 4, July 2007, pp. 471-489 9. Lin, Angel, “Bilingualism or linguistic segregation? Symbolic domination, resistance and code switching in Hong Kong schools”, Linguistics and Education, Vol.8, no.1, pp.49-84; 10. Ballantine, J. H.. Sociology of education: A systematic analysis. Boston: Person, 2001, Chapter 5 11. DeMarrais, K. B. & LeCompte, M. D. The way schools work: A sociological analysis of education. Boston: Pearson, 1999 (中文DeMarrais, K. B. & LeCompte著，林郡雯譯（2007)《教育的社會學分析—學校運作之道》，台北：學富文化事業。", "terms": {"2024-25 Term 1": {"A-LEC (5121)": {"startTimes": ["14:30", "14:30"], "endTimes": ["17:15", "17:15"], "days": [2, 4], "locations": ["Wong Foo Yuan Bldg LT4", "Wu Ho Man Yuen Bldg 507"], "instructors": ["Professor CHEUNG Chi Keung Alan", "Professor CHEUNG Chi Keung Alan"], "meetingDates": ["3/9", "5/9", "10/9", "12/9", "17/9", "19/9", "24/9", "26/9", "3/10", "8/10", "10/10", "15/10", "17/10", "22/10", "24/10"]}}, "2024-25 Term 2": {"B-LEC (5034)": {"startTimes": ["8:30", "8:30"], "endTimes": ["11:15", "11:15"], "days": [1, 3], "locations": ["Wu Ho Man Yuen Bldg 507", "Yasumoto Int'l Acad Park LT9"], "instructors": ["Professor KWOK Yan Shing Henry", "Professor KWOK Yan Shing Henry"], "meetingDates": ["6/1", "8/1", "13/1", "15/1", "20/1", "22/1", "27/1", "5/2", "10/2", "12/2", "17/2", "19/2", "24/2", "26/2"]}}}, "assessments": {"Discussion": "20", "Essays": "50", "Presentation": "30"}}, {"code": "2312", "title": "Child and Adolescent Development", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "Classwork\nDiscussion\nExercise\nLecture\nOthers\nProject", "campus": "Main Campus", "academic_group": "Fac Office of Education", "requirements": "Nor for students who have taken PSYC2540", "description": "This course provides an introduction to major theoretical orientations in understanding human development. The contexts and the motivational foundation of child and adolescent development will be highlighted. The core of the course lies in different aspects of development (e.g., cognitive, moral, aesthetic, social, emotional; and self) in childhood and adolescence, which will be examined from both theoretical and applied perspectives. Issues of current concern (e.g., talent development, special educational needs, and various kinds of psychological disturbances) will also be discussed.", "outcome": "By the end of this course, students will be able to: 1. understand the contexts of child and adolescent development  2. understand the different theoretical perspectives in explaining various domains of child and adolescent development  3. understand the dialectic between theory and practice  4. cultivate their abilities in the application, analysis, synthesis and evaluation of related knowledge by doing homework assignments and a case study assignment 5. enhance their sensitivity to ongoing issues of child and adolescent development  學生修畢本科後，能夠: 1. 了解兒童及青少年發展的環境和動機因素  2. 從不同理論角度了解兒童及青少年在各種範疇的發展  3. 了解理論與實踐的辨證關係  4. 透過研習計劃增進自身在應用、分析、綜合和評估相關知識的能力  5. 提昇自身對當前的兒童及青少年發展議題的敏感度", "syllabus": "For reference only, please refer to the course outline of respective instructor for details 1. Basic concepts and theories 2. Modern theories 3. Emotional development, temperament, and attachment 4. Development of self and social cognition 5. Intelligence and achievement  6. Moral development and aggression 7. Family and school influences on development 8. Media and peer influences on development  *course content and order of topics may differ between Instructors", "required_readings": "Required readings (if any) would depend on individual instructors S. A. Rathus: Childhood and Adolescence: Voyages in Development, 6th Edition  ISBN-10: 1-305-50459-3; ISBN-13: 978-1-305-50459-2", "recommended_readings": "Recommended readings would depend on individual instructors 1. Adams, G. (2000). Adolescent development: The essential readings. Malden, Mass: Blackwell Publishers. 2. Akhtar, S. (2011). The electrified mind: Development, psychopathology, and treatment in the era of cell phones and the internet. Lanham, MD: Jason Aronson.  3. Barry, C. T., Kerig, P. K., Stellwagen, K. K., & Barry, T. M. (Eds.). (2011). Narcissism and machiavellianism in youth: Implications for the development of adaptive and maladaptive behavior. Washington, D.C.: American Psychological Association. 4. Berger, K. S. (2014). The developing person through the life span (9th ed.). New York: Worth Publishers. 5. Berk, L. E. (2013). Child development. Boston: Pearson. 6. Berns, R. M. (2013). Child, family, school, community: Socializing and support (International edition, 9th ed.). CA: Wadsworth, Cengage Learning.  7. Bleach, M. J. (2010). Parental involvement in primary education in Ireland. Dublin: Liffey Press. 8. Boyd, D., & Bee, H. (2015). Lifespan development (7th ed.). Boston: Pearson. 9. Bronfenbrenner, U., & Ceci, S. J. (1994). Nature-nurture reconceptualized in developmental perspective: A bioecological model. Psychological Review, 101(4), 568-586.  10. Castelli, D. M., Centeio, E. E., Hwang, J., Barcelona, J. M., Glowacki, E. M., Calvert, H. G., & Nicksic, H. M. (2014). The history of physical activity and academic performance research: Informing the future. Monographs of the Society for Research in Child Development, 79, 119-148.  11. Coleman, J. (2011). The nature of adolescence. London, New York: Routledge.  12. Conkbayir, M., & Pascal, C. (2014). Early childhood theories and contemporary issues: An introduction. London: Bloomsbury.  13. DeFrates-Densch, N. (2008). Case studies in child and adolescent development for teachers. Boston, Mass: McGraw-Hill Higher Education. 14. Haines, J., & Neumark-Sztainer, D. (2006, December). Prevention of obesity and eating disorders: A consideration of shared risk factors. Health Education Research, 21, 770-782. 15. Harold, R. D., Colarossi, L. G., & Mercier, L. R. (2007). Smooth sailing or stormy waters? Family transitions through adolescence and their implications for practice and policy. Mahwah, N.J.: Lawrence Erlbaum Associates.  16. Harris, B. (2011). Working with distressed young people. Exeter: Learning Matters. 17. Harrison, K., & Hefner, V. (2006, April). Media exposure, current and future body ideals, and disordered eating among preadolescent girls: A longitudinal panel study. Journal of Youth and Adolescence, 35, 153-163. 18. Kassem, D., Murphy, L., & Taylor, E. (Eds.). (2010). Key issues in childhood and youth studies. NY: Routledge. 19. Kirshner, B., O'Donoghue, J. L., & McLaughlin, M. (Eds.). (2002). Youth participation: Improving institutions and communities. San Francisco, CA.: Jossey-Bass. 20. Laser, J. A., & Nicotera, N. (2011). (Eds.). Working with adolescents: A guide for practitioners. New York: Guilford Press. 21. Levin, D. E. (2013). Beyond remote-controlled childhood: Teaching young children in the media age. Washington, DC: National Association for the Education of Young Children.  22. Maholmes, V., & Lomonaco, C. G. (Eds.). (2010). Applied research in child and adolescent development: A practical guide. New York: Psychology Press. 23. National Center for Health Statistics. (2011, Update). Prevalence of overweight among children and adolescents: United States. Hyattsville, MD: U. S. Department of Health and Human Services, Centers for Disease Control and  Prevention. 24. Nicholas, B. A. (Ed.). (2008). Adolescent emotional development and the emergence of depressive disorders. New York: Cambridge University Press. 25. Papalia, D. E., Feldman, R. D., & Martorell, G. (2014). Experience human development (13th ed.). Boston, MA: McGraw-Hill.  26. Rew, L. (2005). Adolescent health: A multidisciplinary approach to theory, research, and intervention. Thousand Oaks, CA: Sage Publications. 27. Scharf, M., & Mayseless, O. (Eds.). (2007). Attachment in adolescence: Reflections and new angles. San Francisco, Calif.: Jossey-Bass. 28. Scully, P. A., Barbour, C., & Roberts-King, H. (2015). Families, schools and communities: Building partnerships for education (6th ed.). Boston: Pearson. 29. Siegler, R., DeLoache, J., Eisenberg, N., & Saffran, J. (2014). How children develop (4th ed.). New York: Worth Publishers. 30. Silbereisen, R. K., & Lerner, R. M. (Eds.). (2007). Approaches to positive youth development. Los Angeles, Calif.: Sage Publications. 31. Spencer, J. M., Zimet, G. D., Aalsma, M. C., & Orr, D. P. (2002). Self-esteem as a predictor of initiation of coitus in early adolescents. Pediatrics, 109, 581-584. 32. Trivette, C. M., Dunst, C. J., & Hamby, D. W. (2010). Influences of family-systems intervention practices on parent-child interactions and child development. Topics in Early Childhood Special Education, 30(1), 3-19.  33. Woolfolk, A., & Perry, N. E. (2012). Child and adolescent development. Upper Saddle River, N.J.: Pearson.", "terms": {"2024-25 Term 1": {"A-LEC (5132)": {"startTimes": ["10:30"], "endTimes": ["13:15"], "days": [2], "locations": ["Esther Lee Bldg LT2"], "instructors": ["Professor CHEN Si"], "meetingDates": ["3/9", "10/9", "17/9", "24/9", "8/10", "15/10", "22/10", "29/10", "5/11", "12/11", "19/11", "26/11"]}, "B-LEC (6453)": {"startTimes": ["10:30"], "endTimes": ["13:15"], "days": [4], "locations": ["Yasumoto Int'l Acad Park LT3"], "instructors": ["Professor CHEN Si"], "meetingDates": ["5/9", "12/9", "19/9", "26/9", "3/10", "10/10", "17/10", "24/10", "31/10", "7/11", "14/11", "21/11", "28/11"]}}}, "assessments": {"Essay test or exam": "60", "Homework or assignment": "15", "Project": "25"}}, {"code": "3110", "title": "School-based Curriculum Development and Implementation", "career": "Undergraduate", "units": "2.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Fac Office of Education", "requirements": "", "description": "The course aims at helping learners investigate the various models of curriculum development (including the highly centralized as well as the school-based models) found in different socio-political environments and, based on this, study the history of the machinery for curriculum development and of curriculum design in Hong Kong. Learners also have the opportunities to examine the major issues of school-based curriculum development and implementation. This course also helps learners to master the basic skills of implementing curriculum change in schools.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "3140", "title": "Curricular Strategies for Tackling Individual Differences", "career": "Undergraduate", "units": "2.00", "grading": "Graded", "components": "Discussion\nLecture\nProject", "campus": "Main Campus", "academic_group": "Fac Office of Education", "requirements": "", "description": "Catering for individual differences is one of the challenges facing classroom teachers. This course aims to help student teachers develop basic understanding of the nature of the problem and means of tackling individual differences through curricular and instructional measures. Strategies such as curriculum adaptation, cooperative learning, mastery learning and assessment for learning will be covered. Student teachers will also acquire practical instructional strategies such as cubing. To make the course directly relevant to practical teaching environment, subject-specific examples and case studies will be widely used.", "outcome": "By the end of this course, students will be able to: 1. apply the principles of differentiated instruction (DI) to design at least one learning activity that matches your learning objective(s) 2. produce a differentiated lesson plan  3. present and reflect upon learning experience in a learning activity  學生修畢本科後，能夠: 1. 運用差異化教學(DI)原則設計至少一項符合學習目標的學習活動 2. 擬定一個有效差異化教學的課程計劃 3. 展示並反思在學習活動中的學習經歷", "syllabus": "For reference only, please refer to the course outline of respective instructor for details • Basic understandings of differentiated instruction  • Principles of a differentiated classroom  • Strategies for managing a differentiated classroom • Learner characteristics  • Differentiated lesson planning  • Differentiation by content • Differentiation by process • Differentiation by product • Differentiation by learning environment • Differentiated assessment practices • Using ICT for differentiated instruction  課題可因應個別導師的科目設計而調校 • 差異化教學的基本理解 • 差異化課堂的原則 • 差異化課堂策略 • 學習者特徵 • 差異化的課程計劃 • 按內容區分的差異化教學 • 按流程區分的差異化教學 • 按產品區分的差異化教學 • 通過學習環境進行差異化教學 • 差異化的評估實踐 • 使用ICT進行差異化教學", "required_readings": "Required readings (if any) would depend on individual instructors Tomlinson, C.A. (2001). How to differentiate instruction in mixed-ability classrooms. Alexandria, VA: ASCD. Tomlinson, C.A. (2014). 能力混合班級的差異化教學。台北市:五南圖書出版股份有限公司 。", "recommended_readings": "Recommended readings would depend on individual instructors Chapman, C. & King, R. (2012). Differentiated assessment strategies: one tool doesn’t fit all. Thousand Oaks, CA: Corwin.", "terms": {"2024-25 Term 1": {"--LEC (4732)": {"startTimes": ["9:30", "9:30"], "endTimes": ["11:15", "11:15"], "days": [1, 3], "locations": ["Esther Lee Bldg 307", "Esther Lee Bldg 307"], "instructors": ["Dr. WAN Wai Yan", "Dr. WAN Wai Yan"], "meetingDates": ["2/9", "4/9", "9/9", "11/9", "16/9", "23/9", "25/9", "30/9", "2/10", "7/10", "9/10", "14/10", "16/10", "21/10", "23/10"]}}}, "assessments": {"Discussion": "20", "Project": "30", "Report": "50"}}, {"code": "3150", "title": "Global Dialogues on Education for Sustainable Development in the Curriculum", "career": "Undergraduate", "units": "2.00", "grading": "Graded", "components": "Debate\nDiscussion\nLecture\nProject\nVisit\nWorkshop", "campus": "Main Campus", "academic_group": "Fac Office of Education", "requirements": "", "description": "The course attempts to promote understanding of the self and transform the ways students view themselves and navigate the world regarding Education for Sustainable Development (ESD) issues. During the course, students can have opportunities to connect, communicate, and interact with “global peers” around the world through “global dialogues”. Global dialogues can help bring together scholars and students from different parts of the world, share their experiences and views upon ESD issues, build a growing network of people with interests in ESD, and make available an accessible body of comparative information and knowledge about current and emerging issues in ESD.", "outcome": "By the end of the course, students are able to:(a) understand the concepts of global dialogue (knowledge)(b) evaluate and make suggestions on learning and teaching strategies in ESD (knowledge)(c) explain and analyze the key concepts of education for sustainable development (e.g. UNESCO Global Citizenship Education, Global Goals for Sustainable Development) (knowledge)(d) engage in an open dialogue with “global peers” and facilitate dialogue for deepening learning in a collective way (skill)(e) listen to self and others, speak openly, and respect others (skill)(f) be self-aware of personal and be open-minded towards the views of “global peers” (attitude) 本科期望學員完成課程後, 能夠：(a) 理解全球對話的概念（知識）(b) 評估可持續發展教育（知識）的學與教策略並提出建議(c) 解釋和分析可持續發展教育的關鍵概念（例如: 聯合國教科文組織全球公民教育、可持續發展全球目標）（知識）(d) 與「全球同伴」進行公開對話，促進對話以集體方式深化學習（技能）(e) 傾聽自己和他人的聲音，開誠佈公，尊重他人（技巧）(f) 有自我意識，對「全球同伴」的觀點持開放態度（態度） ", "syllabus": "For reference only, please refer to the course outline of respective instructor for details. There are five key topics in the course:1. Essentials of global dialogue2. Concepts of Education for Sustainable Development (ESD)3. Contemporary issues and trends in Education for Sustainable Development (ESD)4. Integrating Education for Sustainable Development (ESD) into the school curriculum5. Pedagogies in Education for Sustainable Development (ESD): Approaches and applications 課題可因應個別導師的科目設計而調校課程有五個關鍵課題：1. 全球對話的要點2. 可持續發展教育（ESD）的概念3. 可持續發展教育（ESD）的當代問題和趨勢4. 可持續發展教育（ESD）學校課程整合5. 可持續發展教育（ESD）教學法：方法和應用", "required_readings": "Required reading (if any) would depend on individual instructor.Leicht, A., Heiss, J. & Byun, W. J. (Eds.) (2018). Issues and trends in Education for Sustainable Development. Paris: UNESCO. UNESCO (2020). Education for Sustainable Development A Roadmap. Retrieved from: https://www.gcedclearinghouse.org/sites/default/files/resources/200782eng.pdfEdson, K. L. H., & Islam, M. S. (2018). Sustainable development: Concepts, histories, and paradigms. In M. Y. Merrill, P.  Burkhardt-Holm, C. H. Chang, M. S. Islam, & Y. Chang, (Eds.). Education and Sustainability (pp. 28-42). New York: Routledge.", "recommended_readings": "Recommended readings would depend on individual instructor.Agus, C., Hasanah, N. A. I., Jihad, A. N., Cahyanti, P. A. B., & Sulaiman, M. (2021). Implementing a green co-learning center to support sustainable campus development. In W. L. Filho, A. L. Salvia, & F. Frankenberger (Eds.). Handbook on Teaching and Learning for Sustainable Development (pp. 376-388). Edward Elgar Publishing.Amos, R., & Carvalho, P. (2020). Locating a Course on Environmental Justice in Theories of Environmental Education and Global Citizenship. Journal of Education for Sustainable Development, 14(2), 140-155.Avelar, A. B. A., da Silva-Oliveira, K. D., & da Silva Pereira, R. (2019). Education for advancing the implementation of the Sustainable Development Goals: A systematic approach.  International Journal of Management Education, 17(3), DOI: 10.1016/j.ijme.2019.100322Boström, G. O., Winka, K., & Boström, K. W. (2021). Extra-curricular activities as a way of teaching sustainability. In W. L. Filho, A. L. Salvia, & F. Frankenberger (Eds.). Handbook on Teaching and Learning for Sustainable Development (pp. 323-334). Edward Elgar Publishing.Dawe, G., Jucker, R., & Martin, S. (2005). Sustainable development in higher education: current practice and future developments. A report to the Higher Education Academy. York: HEA.Jiménez-Fontana, R., García-González, E., & Navarrete, A. (2021). The need to build the concept of environment within the framework of the Sustainable Development Goals. In W. L. Filho, A. L. Salvia, & F. Frankenberger (Eds.). Handbook on Teaching and Learning for Sustainable Development (pp. 290-305). Cheltenham: Edward Elgar Publishing. Kerkhoff, S. N. (2017). Designing global futures: A mixed methods study to develop and validate the teaching for global readiness scale. Teaching and Teacher Education, 65, 91-106. Koh, H. L., & Teh, S. Y. (2021). Innovations in curriculum and pedagogy in education for sustainable development. In W. L. Filho, A. L. Salvia, & F. Frankenberger (Eds.). Handbook on Teaching and Learning for Sustainable Development (pp. 219-237). Cheltenham: Edward Elgar Publishing. Kopnina, H. (2014). Education for sustainable development (ESD): Exploring anthropocentric–ecocentric values in children through vignettes. Studies in Educational Evaluation, 41, 124-132.Lee J. C. K., Lam, W. P., Williams, M. (2009). The Education for Sustainable Development Project in Hong Kong. In M. Williams, & J. C. K. Lee (Eds.). Schooling for Sustainable Development in Chinese Communities. Schooling for Sustainable Development (Vol. 1). Dordrecht: Springer, Lehtomäki, E., Moate, J., & Posti-Ahokas, H. (2016). Global connectedness in higher education: student voices on the value of cross-cultural learning dialogue. Studies in Higher Education, 41(11), 2011-2027.Luff, P. (2018). Early childhood education for sustainability: origins and inspirations in the work of John Dewey. Education 3-13, 46(4), 447-455.Hirst, N. (2019). Education for sustainability within early childhood studies: Collaboration and inquiry through projects with children. Education 3-13, 47(2), 233-246.Luo, J. M., Lee, N., & Qiu, H. (2015). Education for sustainable development in Hong Kong: A review of UNESCO Hong Kong’s experimental schools. Public Administration & Policy: An Asia-Pacific Journal, 18(1), 48-61.Mandrikas, A. (2020). Teaching SDGs Using Concept Maps in Primary Teacher Training. Journal of Education for Sustainable Development, 14(2), 205-234.Merrill, M. Y., Burkhardt-Holm, P., Chang, C. H., Islam, M. S., & Chang, Y. (Eds.). (2018). Education and Sustainability: Paradigms, Policies and Practices in Asia. New York: Routledge.Obeng-Odoom, F. (2020). Teaching Sustainability: From Monism and Pluralism to Citizenship. Journal of Education for Sustainable Development, 14(2), 235-252.Otto, D. (2021). Digital storytelling as OER-enabled pedagogy: sustainable teaching in a digital world. In W. L. Filho, A. L. Salvia, & F. Frankenberger (Eds.). Handbook on Teaching and Learning for Sustainable Development (pp.238-251). Cheltenham: Edward Elgar Publishing.Samuelsson, I. P., & Park, E. (2017). How to educate children for sustainable learning and for a sustainable world. International Journal of Early Childhood, 49(3), 273-285.Segovia, V M. (2010). Transforming mindsets through Education for Sustainable Development. In P. Peterson, E. Baker, & B. McGaw (Eds.). International Encyclopedia of Education (pp. 746-752) (Vol. 1) (3rd Ed.). Oxford: Academic Press. Spangenberger, P., Matthes, N., Kruse, L., Draeger, I., Narciss, S., & Kapp, F. (2020). Experiences with a Serious Game Introducing Basic Knowledge About Renewable Energy Technologies: A Practical Implementation in a German Secondary School. Journal of Education for Sustainable Development, 14(2), 253-270.Sund, P., & Gericke, N. (2020). Teaching contributions from secondary school subject areas to education for sustainable development–a comparative study of science, social science and language teachers. Environmental Education Research, 26(6), 772-794.Taylor, N., Quinn, F., Jenkins, K., Miller-Brown, H., Rizk, N., Prodromou, T., ... & Taylor, S. (2019). Education for sustainability in the secondary sector—A review. Journal of Education for Sustainable Development, 13(1), 102-122.Toh, S. (2006). Integrating Education for Sustainable Development & Education for International Understanding: Conceptual issues and pedagogical principles for teacher education to address sustainability. Retrieved from: https://lsf-lst.ca/media/Toh_Swee-Hin_Integrating_Education_for_Sus_Devlpment_pdf_EN.pdfUNESCO (2012). Education for Sustainable Development: Sourcebook. Paris: UNESCO. Retrieved from: https://sustainabledevelopment.un.org/content/documents/926unesco9.pdfUnited Nations Climate Change Learning Partnership [UN CC:Learn] (2013). Resource Guide for Advanced Learning on Integrating Climate Change in Education at Primary and Secondary Level. Geneva: United Nations Institute for Training and Research (UNITAR). Retrieved from: https://www.uncclearn.org/wp-content/uploads/library/resource_guide_on_integrating_cc_in_education_primary_and_secondary_level.pdfWegerif, R., Doney, J., Richards, A., Mansour, N., Larkin, S., & Jamison, I. (2019). Exploring the ontological dimension of dialogic education through an evaluation of the impact of Internet mediated dialogue across cultural difference. Learning, Culture and Social Interaction, 20, 80-89.Weldemariam K. (2017) Challenging and expanding the notion of sustainability within early childhood education: Perspectives from Post-humanism and/or New Materialism. In O. Franck, & C. Osbeck (Eds.). Ethical Literacies and Education for Sustainable Development (pp. 105-126). Cham: Palgrave Macmillan.Zguir, M. F., Dubis, S., & Koç, M. (2021). Embedding Education for Sustainable Development (ESD) and SDGs values in curriculum: A comparative review on Qatar, Singapore and New Zealand. Journal of Cleaner Production, DOI: 10.1016/j.jclepro.2021.128534", "terms": {"2024-25 Term 2": {"--LEC (5245)": {"startTimes": ["16:30", "16:30"], "endTimes": ["18:15", "18:15"], "days": [1, 3], "locations": ["Esther Lee Bldg 203", "Esther Lee Bldg 401"], "instructors": ["Dr. WAN Wai Yan", "Dr. WAN Wai Yan"], "meetingDates": ["6/1", "8/1", "13/1", "15/1", "20/1", "22/1", "27/1", "5/2", "10/2", "12/2", "17/2", "19/2", "24/2", "26/2"]}}}, "assessments": {"Presentation": "40", "Project": "60"}}, {"code": "3200", "title": "Developing Intercultural Competence: Experiential Learning", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Fac Office of Education", "requirements": "", "description": "This course aims to equip students with essential understanding of intercultural concepts and theories for providing effective educational services for people from diverse cultural backgrounds in Hong Kong. Students will be: (a) engaging with placement activities in a range of local social and educational contexts, (b) examining the rationale and policies and modes of social service provisions for ethnic minorities and new arrivals students in Hong Kong in the light of the theories and concepts, (c) analyzing and reflecting problems and shortfalls with the current educational settings, and (d) suggesting possible solutions to the identified problems. An experiential learning approach coupled with a wide range of interactive activities such as group presentation, site-based observations and services will be employed to sharpen the students’ intercultural awareness and sensitivity and to develop their personal perspective on themselves, others and their relations with cultural differences and diversity.", "outcome": "By the end of this course, students will be able to:  (1) Explain key definitions, concepts and theories of interculturalism and ethnicity, with reference to the local context; (2) Critically examine the issues in promoting social and cultural inclusion in global societies in general and in Hong Kong in particular;  (3) Plan and implement a small-scale project using the framework and principles relating to intercultural sensitivity  (4) Reflect on personal perspectives on different theories and personal beliefs in promoting social integration.  學生修畢本科後，能夠: (1) 以香港社會背景作參考，解釋跨文化和民族學的主要定義、概念和理論 (2) 批判性地檢視在全球社會特別是香港社會促進社會及文化包容的議題 (3) 規劃和推行一個應用與跨文化相關之框架和原理的小規模項目 (4) 反思自己對於推動社會融合之各種理論和個人原有信念的看法", "syllabus": "For reference only, please refer to the course outline of respective instructor for details  Major topics covered in this course: (1) Global perspectives on social and educational inclusion (2) Key concepts and theories of interculturalism and multiculturalism and teacher professional development (3) Demographic features and circumstances of Chinese immigrant and ethnic minorities in Hong Kong (4) Educational policies and provisions in relation to ethnic minorities and new immigrants (5) Provision and evaluation of a community-based project on interculturalism", "required_readings": "Required readings (if any) would depend on individual instructors", "recommended_readings": "Recommended readings would depend on individual instructors  (1) Arat, G., Hoang, A.P., Jordan, L.P., Wong, P.W.C.(2016) A systematic review of studies on ethnic minority youth development in Hong Kong: an application of the ecological framework. China Journal of Social Work, 9(3), 218-237.  (2) Banks, J. A. (Ed.) (2017). Citizenship education and global migration: Implications for theory, research and teaching. Washington, W.C. (3) Cheung, C.K. K. (2014). Final report on poverty of ethnic minority children in Hong Kong. Public Policy Research Funding Scheme. (4) Cheung, F., Lai, B.P.Y., Wu, A.M.S., & Ku, L. (2015). Academic and Career Expectations of Ethnic Minority Youth in Hong Kong. The Journal of Early Adolescence, 35, 1092-1107. (5) Chou, K.L., Cheung, K., Lau, M., & Sin, T., (2014). Trends in child poverty in Hong Kong immigrant families. Soc Indic Res., 117: 811-825. (6) Hue, M.T., Kennedy, K.J. (2012). Creation of culturally responsive classrooms: teachers’ conceptualization of a new rationale for cultural responsiveness and management of diversity in Hong Kong secondary schools, Intercultural Education, 23, 119-132. (7) Li, D. C. S., & Chuk, J. Y. P. (2015). South Asian students’ needs for Cantonese and written Chinese in Hong Kong: A linguistic study. International Journal of Multilingualism, 12(2), 210–224. (8) Oxfam Hong Kong. (2014). Survey on the Chinese Learning Challenges South Asian Ethnic Minority Kindergarten Students from Low-Income Families Face. Retrieved from http://www.oxfam.org.hk/filemgr/2639/Oxfam_Surveyon_Dec2.pdf  (9) Shum S. K., Gao F., Tsung, L. & Ki W. W. (2013). South Asian students’ Chinese language learning in Hong Kong: Motivations and strategies. Journal of Multilingual and Multicultural Development, 32(3), 285-297. (10) Yuen, Y. M. C. (2018). Chinese immigrant students and cross-boundary students in Hong Kong: A call for equity through culturally relevant teaching practices. In Y. K. Cha, S. H. Ham, & M.S. Lee (Eds.), Routledge international handbook of multicultural education research in Asia Pacific (pp. 258-271). London: Routledge. (11) Yuen, Y.M.C. (2015). Enhancing Early Childhood Schooling of South Asian Children in Hong Kong: Beliefs and Perceptions of Kindergarten Teachers and Principals. Early Child Development and Care. DOI.10.1080/03004430.2015.1036420. (12) 黎苑姍 (2017). 「公義的顏色 – 王惠芬的平權路」。香港：三聯書店(香港)有限公司。 (13) 袁月梅 (2014). 少數族裔中文教育「中文作為第二語言」的政策配合」王惠芬、葉皓羚編. 『無酵餅』-『中文作為第二語言』教與學初探. 香港：香港融樂會。", "terms": {"2024-25 Term 1": {"--LEC (5317)": {"startTimes": ["14:30", "14:30"], "endTimes": ["17:15", "17:15"], "days": [3, 1], "locations": ["Wu Ho Man Yuen Bldg 502", "Esther Lee Bldg 207"], "instructors": ["Professor LEE Daphnee Hui Lin", "Professor LEE Daphnee Hui Lin"], "meetingDates": ["2/9", "4/9", "9/9", "11/9", "16/9", "23/9", "25/9", "30/9", "2/10", "7/10", "9/10", "14/10", "16/10", "21/10", "23/10"]}}}, "assessments": {"Discussion": "10", "Fieldwork or field study": "40", "Others": "20", "Presentation": "30"}}, {"code": "3201", "title": "Ethics and Professional Standards for Teachers", "career": "Undergraduate", "units": "2.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Fac Office of Education", "requirements": "", "description": "This course provides an overview of professional standards for teachers in Hong Kong, encompassing issues related to law, professional ethics, values and behavior. Case studies are used to illustrate key aspects of T-standard+ and professional code, which include rights and responsibilities of teachers vis-a-vis other major stakeholders like students, employers, colleagues, parents/guardians, and to explicate what values and principles teachers can use to make ethical decisions and take ethical actions. Key legal issues related to professional development are also addressed and examined.", "outcome": "By the end of the course, students will be able to:1. demonstrate competence and broad understanding of the professional standards and basic legal knowledge for teachers in Hong Kong;2. identify moral dilemmas facing teachers and make responsible decisions by considering different ethical perspectives, and finding the best possible way forward for all stakeholders;3. act conscientiously with regard to the professional standards and the law, and collaborate ethically and competently in multi-disciplinary and multi-cultural teams; and4. develop a commitment to the teaching profession and reflect on the professional standards in individual practices.", "syllabus": "For reference only, please refer to the course outline of respective instructor for details • Introduction to ethics and professional standards in Hong Kong and other settings – Why ethics matters in teaching professional and what are the common elements of teacher ethics?• Basic ethical concepts and theories Moral reasoning• Brief introduction to Hong Kong legal system and major legal documents related to civil liabilities, academic freedom, privacy protection, equal opportunities, anti-corruption, national security, etc. that are commonly referred in schooling matters • Rights of children and teachers’ related commitment to students• Rights of teachers and teachers’ related commitment to employers • Rights of teachers and teachers’ related commitment to colleagues• Rights of parents/guardians and teachers’ related commitment• Teachers’ commitment to the community• Teachers’ commitment to the profession; lifelong commitment to professionalism and excellence• Wrapping up: Ethical conduct, response to unethical behavior, handling professional mis-conduct ", "required_readings": "Required readings (if any) would depend on individual instructors1. Advisory Committee on Teacher Education and Qualification (2009). Professional development for beginning teachers: An induction tool kit (5th Edition).2. CPCE. CPC code of professional conduct. [教育人員專業操守議會(1995）。《香港教育專業守則》。香港：政府物流服務署。http://cpc.edb.org.hk/Chinese/download/CPC_Code%20_Chin__3%20May%202011.pdf)3. The Basic Law of the HKSAR. Hong Kong: HKSAR4. Hansen, D. T. (2001). Exploring the moral heart of teaching: Toward a teacher's creed. New York: Teachers College Press. Chapters 1 to 3.5. Infantino, R. L., & Wilke, R. L. (2009). Tough choices for teachers: Ethical challenges in today's schools and classrooms. Lanham: Rowman & Littlefield Education. Chapters 1 & 2.6. Strike, K. A., & Soltis, J. F. (2009). The ethics of teaching (5th ed.). New York: Teachers College. Chapter 1. [K. Strike, K & J. F. Soltis著、林延慧、張振華譯(1999)。《敎學倫理》。臺北: 桂冠圖書股份有限公司。]7. Strike, K. A., & Ternasky, P. L. (1993). Ethics for professionals in education: Perspectives for preparation and practice. New York: Teachers College Press. Chapters 1-4; 13.8. United Nations (1989). United Nations Convention on the Rights of the Child.9. 陳弘毅、陳文敏等(2015) 。《香港法概論》(第三版)。香港：商務。", "recommended_readings": "Recommended readings would depend on individual instructors  1. Biesta, G. (2015). “What is Education For? On Good Education, Teacher Judgement, and Educational Professionalism”. European Journal of Education, 50 (1),75-87.2. Bukhatir, S. (2018). Professionalism in education: An overview. London: London Centre for Leadership in Learning. Available at: http://www.lcll.org.uk/publications.html, accessed 3. Buzzelli, C. & Johnston, B. (2002). The moral dimensions of teaching: language, power, and culture in classroom interaction. London & New York: Routledge. Chapter 3.4. Campbell, E. (2003). Ethical teacher. Buckingham: Open University Press. Chapters 1 to 3.5. Carr, D. (2000). Professionalism and ethics in teaching. London; New York: Routledge. Chapters 2 and 9 [David Carr著、張慧芝、陳延興譯(2003)。《教學倫理》。臺北：韋伯文化。] 6. Fenstermacher, G.D. (1990). Some moral considerations on teaching as a profession. In The moral dimensions of teaching, ed. J.I. Goodlad, R. Soder, and K.A. Sirotnik, 130-151. San Francisco: Jossey-Bass.7. Goodlad, J. I., Sirotnik, K. A., & Soder, R. (1990). The moral dimensions of teaching. San Francisco: Jossey-Bass Publishers. Chapters 1 to 3,7.8. Higgins, C. (2015). Why we need a virtue ethics of teaching. In R. Heilbronn & L. Foreman-Peck (Eds.), Philosophical perspectives on teacher education. Wiley Blackwell, pp. 57-75.9. Johns, B. H., Mathur, S. R., & McGrath, M. Z. (2008). Ethical dilemmas in education: Standing up for honesty and integrity. Lanham, Md.: Rowman & Littlefield Education. Chapter 11.10. Noddings, N. (2003). Caring: a feminine approach to ethics and moral education. Berkeley & London: University of California Press. Chapter 4.11. Palmer, P. J. (2007). The courage to teach: Exploring the inner landscape of a teacher’s life. San Francisco, CA: Jossey-Bass. Chapters 4 & 6. [ Parker J. Palmer著，藍雲、陳世佳譯(2009) 。《教學的勇氣──探索教師生命的內在視界》。臺北：心理出版社。] 12. Pamphlet on Teacher Induction Scheme. https://www.cotap.hk/images/download/TIS_ Pamphlet-Eng.pdf13. Picower, B. (2012). Teacher activism: Enacting a version for social justice. Equity & Excellence in Education, 45 (4), 561-574.14. Rachels, R. & Rachels, S. (2015). The elements of moral philosophy. New York, NY: McGraw-Hill. Chapters 7-8.15. Sockett, H. (1993). The moral base for teacher professionalism. New York: Teachers College Press. Chapters 1-4, 6.16. Stromquist, N. P. (2018). The global status of teachers and the teaching profession. Brussels, Belgium: Education International. http://ei-ie-al.org/sites/default/files/docs/ 2018_ei_research_statusofteachers_eng_final.pdf17. Vaughn, L., & Vaughn, L. (2013). Doing ethics: Moral reasoning and contemporary issues (3rd ed.). New York; New York: Norton; Norton. Chapters 1 to 7.18. 王正平主編(2019)。《教育倫理學》。北京：人民教育出版社。19. 林壽康、余惠萍（2017）。《香港教育法：教師註冊及僱傭合約篇》。香港：印象文字。20. 林壽康、余惠萍（2017）。《香港教育法：疏忽侵權篇》(增訂版)。香港：印象文字。21. 林壽康、余惠萍（2018）。《香港教育法：終止僱傭及解僱訴訟篇》。香港：印象文字。22. 林壽康、余惠萍（2020）。《香港教育法：學生紀律、刑法及刑事程序篇》。香港：印象文字。23. 香港社區組織協會(2003)。《香港公民權益手冊(一) - 公民及政治權利》。香港：香港社區組織協會。24. 香港社區組織協會(2004)。《香港公民權益手冊(二) - 經濟、社會及文化權利 (國籍、居留權與社會福利權)》。香港：香港社區組織協會。25. 香港社區組織協會(2005)。《香港公民權益手冊(三) - 經濟、社會及文化權利 (房屋及勞工權利) 》。香港:香港社區組織協會。26. 莊耀洸(2009)。學校的法律責任與疏忽。吳迅榮和黃炳文(主編) 《廿一世紀的學校領導 : 持續與創新》(頁229-249)。香港: 學術專業圖書中心。27. 陳洪(主編) (2016)。《讀出我權益：教師權益手冊》。香港: 香港教育專業人員協會。28. 黃藿主編(2003)。《教育專業倫理(1) 》。臺北：五南圖書公司。29. 詹棟樑(1997)。《教育倫理學導論》。臺北：五南圖書公司。30. 戴綺蓮、許佩琳、區美寶、莊耀洸和陸潔玲( 2015)。《反性騷擾政策檢視清單—大專院校及中小學研究報告》。31. 羅敏威(2010)。《香港人權法新論》。香港：香港城市大學出版社。 Related websites1. Basic Law Education website https://www.edb.gov.hk/tc/curriculum-development/4-key-tasks/moral-civic/Newwebsite/Basiclaw.html2. Committee on Professional Development of Teachers and Principals (COTAP) https://www.cotap.hk/index.php/en/3. Community Legal Information Centre (CLIC), The University of Hong Kong香港大學社區法網 https://clic.org.hk/tc/4. Council on Professional Conduct in Education https://cpc.edb.org.hk/en/terms_reference.htm5. Equal Opportunities Commission https://www.eoc.org.hk/6. The Hong Kong Legal Information Institute https://www.hklii.hk/about/7. ICAC https://www.icac.org.hk/tc/home/index.html8. Office of the Privacy Commissioner for Personal Data https://www.pcpd.org.hk/9. Qualifications, Training and Development https://www.edb.gov.hk/en/teacher/qualification-training-development/development/index.html  ", "terms": {"2024-25 Term 1": {"A-LEC (5102)": {"startTimes": ["8:30", "8:30"], "endTimes": ["10:15", "10:15"], "days": [4, 2], "locations": ["Wu Ho Man Yuen Bldg 507", "Wu Ho Man Yuen Bldg 505"], "instructors": ["Dr. LAU Ngar Sze", "Dr. LAU Ngar Sze"], "meetingDates": ["3/9", "5/9", "10/9", "12/9", "17/9", "19/9", "24/9", "26/9", "3/10", "8/10", "10/10", "15/10", "17/10", "22/10", "24/10"]}}, "2024-25 Term 2": {"B-LEC (5033)": {"startTimes": ["14:30", "14:30"], "endTimes": ["16:15", "16:15"], "days": [3, 1], "locations": ["Yasumoto Int'l Acad Park LT9", "Esther Lee Bldg LT2"], "instructors": ["Dr. LAU Ngar Sze", "Dr. LAU Ngar Sze"], "meetingDates": ["6/1", "8/1", "13/1", "15/1", "20/1", "22/1", "27/1", "5/2", "10/2", "12/2", "17/2", "19/2", "24/2", "26/2"]}}}, "assessments": {"Presentation": "40", "Report": "40", "Test or quiz": "20"}}, {"code": "3260", "title": "Teacher Development and Leadership", "career": "Undergraduate", "units": "2.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Fac Office of Education", "requirements": "Not for students who have taken EDUC3230 or 3250", "description": "Teachers are expected to play multiple roles in the education reform process. Shifting expectations require teachers to have a firm understanding of how schools operate and how reforms affect their roles both in and outside of the classroom. To effectively reshape their work in line with growing expectations, teachers must understand the current reality of school administration, their own personal weaknesses, commit to career-long professional development and consider strategies for maximizing their effectiveness. This course is designed to help teachers understand and shape their roles in a reform environment. In others words it aims to help teachers become leaders of their own professionalism. It does this in two ways. First, its aims to nurture teachers’ awareness of their own professional growth and how they can maximize the latest opportunities available in this area. Second, it helps teachers understand life in schools undergoing reform and the effect this can have on their professional life. Topics covered in the course are: understanding teachers’ role and the complexity of the school organization, developing personal mastery and personal vision in education, systems thinking and problem solving in the organization and in the classroom, learning shared vision and team learning skills, leading and managing change in school, etc.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "3270", "title": "Engendering Education", "career": "Undergraduate", "units": "2.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Fac Office of Education", "requirements": "Not for students who have taken GDRS2004 or UGEC2672", "description": "Drawing on sociological and socio-psychological perspectives, this course tries to sensitize students to the gender implications underlying educational structures and processes. This course examines how various aspects of education, including its hierarchical structure, the curriculum and school processes, are shaped by the changing needs of capitalism and patriarchy. At the same time, this course will attempt to identify the various contradictions, paradoxes and space for resistance embedded in education. This course sees education as the site for the construction of and contests involving gender and sexualities. It also deconstructs dominant epistemologies, and introduces students to research concerning gender-differentiated modes of learning. The ultimate goal is to enable students to question existing power relationships in patriarchy, as well as concepts and views that are deeply embedded in such relationships, so as to be able to build up a broader intellectual space for themselves.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "3280", "title": "An introduction to Moral and Citizenship Education", "career": "Undergraduate", "units": "2.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Fac Office of Education", "requirements": "", "description": "This course aims to help student-teachers to reflect on their own values and on the ways they teach values, especially those values related to moral education and citizenship education in school. Philosophical, historical, social, psychological and pedagogical foundations on moral education and citizenship education will be explored. Among other important considerations, students are asked whether teachers should or can teach their own values in the classroom, and whether this is indeed inevitable. Taking education as a means aiming at nurturing human qualities for the sake of personal and social well-being, the course examines a range of values such as truth, beauty, goodness and justice as embodied in ‘whole-person education’. Key concepts like human rights, rule of law, democracy, nation-state, and globalization will be compared. How these concepts can be taught and learnt in daily classroom will be discussed. During the course students will discuss the nature of morality and explore various perspectives of moral education, values education and citizenship education. Students will also be asked to reflect upon how they understand their own personal and professional development in relation to values, moral and civic education and how to enact their various roles in the school.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "3290", "title": "Meaning Concerns, Life and Death Education", "career": "Undergraduate", "units": "2.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Fac Office of Education", "requirements": "", "description": "This course aims to help student-teachers to reflect on their attitudes towards death in search for meaning of life and other meaning concerns in life education. It will draw on philosophical, historical, cultural, psychological, pedagogical and religious sources when relevant.　Among other important deliberations, students are helped to reflect on their quest of meaning of life, in which kinds of deaths and their causes (e.g. mental health problems) are explored. Students learn how to cope with suicidal tendency of oneself and others, or sudden deaths of family members or friends. They will also learn how to prepare themselves as teachers in helping their future school pupils to cope with related issues on meaning concerns in death and life education.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "3311", "title": "Psychology Applied to Learning and Teaching", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Fac Office of Education", "requirements": "Not for students who have taken PSYC3550.", "description": "This course provides a general overview on major psychological theories of learning and their implications for teaching. Emphasizing on the application of theories in teaching practice, the following topics are introduced: 1) Behavioral, cognitive, social-cognitive, and socio-cultural theories of learning; 2) Basic cognitive processes: attention and memory; 3) Higher-order cognition and metacognition; 4) Student diversity and special educational needs;5) Cognition and instruction; 6) Classroom management; 7) Learning motivation;8) Design and implementation of classroom assessment", "outcome": "By the end of this course, students will be able to:1. Demonstrate an understanding of major behavioral, cognitive, social-cognitive, and socio-cultural theories of learning and motivation 2. Apply knowledge of basic cognitive processes (attention and memory) to educational settings 3. Describe higher-order cognition and use metacognitive strategies to improve educational practices 4. Describe the characteristics of students with special educational needs5. Analyze the strengths and weaknesses of special education and integrated education6. Devise effective classroom strategies to accommodate individual differences among students 7. Apply effective strategies to foster students' motivation 8. Acquire basic concepts of classroom management and school discipline 9. Develop knowledge of assessment strategies and use them to improve classroom learning and teaching. 學生修畢本科後，能夠:1. 展示對學習及動機各個學派理論（包括行為、認知、社會認知和社會文化）的理解 2. 在教學環境裏，應用他們對基本認知過程（注意力和記憶力）的認識 3. 描述高階認知過程及應用元認知策略以提高教學實踐 4. 描述有特殊教育需要的學生的特徵5. 分析特殊教育及融合教育的優點和缺點6. 設計有效的課堂教學策略，以處理學生的個別差異 7. 應用有效策略以促進學生的學習動機 8. 描述基本課室管理與學校管教概念 9. 建立對課堂評估策略的認識，以改善學習與教學質素。 ", "syllabus": "For reference only, please refer to the course outline of respective instructor for details 1. Behavioral and cognitive theories of learning 2. Basic cognitive processes: attention and memory 3. Higher-order cognition and metacognition 4. Student diversity and special educational needs5. Special education and integrated education6. Cognition and instruction 7. Classroom management 8. Motivation and individual differences 9. Design and implementation of classroom assessment 課題可因應個別導師的科目設計而調校 1. 學習的行為和認知理論 2. 基本認知過程：集中力與記憶 3. 高階認知系統與元認知4. 學生多樣性及特殊學習需要5. 特殊教育及融合教育6. 認知與教學之關係 7. 課室管理 8. 動機和個別差異 9. 課堂評估的設計與實踐", "required_readings": "Required readings (if any) would depend on individual instructors  1. Slavin, R. E. (2021). Educational psychology: Theory and practice (13th ed.). Hoboken, NJ: Pearson.", "recommended_readings": "Recommended readings would depend on individual instructors 1. Cheng, E. C. K., & Chan, J. K. M. (2021). Developing metacognitive teaching strategies through lesson study. UK: Springer.2. Eggen, P., & Kauchak, D. (2020). Using educational psychology in teaching. Hoboken, NJ: Pearson.3. Gonzales, M. (2021). Systems thinking for supporting students with special educational needs and disabilities: A handbook for classroom teachers. UK: Springer.4. Hornby, G., & Greaves, D. (2022). Essential evidence-based teaching strategies: Ensuring optimal academic achievement for students. UK: Springer.5. Martin, J. L., & Torok-Gerard, S. E. (2019). Educational psychology: History, practice, research, and the future. CA: Praeger.6. O’Mahony, K. (2021). The brain-based classroom: Accessing every child’s potential through educational neuroscience. Milton: Eye On Education.7. 林瑞芳（２００４）。《教育心理學實用手冊》。香港：香港心理學會敎育心理學部。   8. 李雅言（２０１１）。 《教學心理學》。香港：商務印書館。   9. 黃振能、李雅言、謝志成、伍斐然、黃桂玲、王茜（２０１２）。《學心理‧識教子──有根有據培育良方》。香港：商務印書館。", "terms": {"2024-25 Term 1": {"A-LEC (5115)": {"startTimes": ["14:30", "14:30"], "endTimes": ["17:15", "17:15"], "days": [3, 1], "locations": ["Wong Foo Yuan Bldg LT4", "Esther Lee Bldg LT4"], "instructors": ["Dr. WONG Pak Ho", "Dr. WONG Pak Ho"], "meetingDates": ["2/9", "4/9", "9/9", "11/9", "16/9", "23/9", "25/9", "30/9", "2/10", "7/10", "9/10", "14/10", "16/10", "21/10", "23/10"]}}, "2024-25 Term 2": {"B-LEC (8820)": {"startTimes": ["10:30", "10:30"], "endTimes": ["13:15", "13:15"], "days": [4, 2], "locations": ["Esther Lee Bldg LT4", "Leung Kau Kui Bldg 101"], "instructors": ["Dr. WONG Pak Ho", "Dr. WONG Pak Ho"], "meetingDates": ["7/1", "9/1", "14/1", "16/1", "21/1", "23/1", "4/2", "6/2", "11/2", "13/2", "18/2", "20/2", "25/2", "27/2"]}}}, "assessments": {"Essay test or exam": "25", "Homework or assignment": "50", "Selected response test or exam": "25"}}, {"code": "3320", "title": "Motivation and Individual Differences", "career": "Undergraduate", "units": "2.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Fac Office of Education", "requirements": "", "description": "Understanding the motivation of and individual differences among students is essential for effective teaching and learning. An integrated approach of theory, research and practice will be adopted in this course. It begins with inviting course participants to explore major theories of motivation for deeper insights into the learning process. Current research findings on psychological constructs related to motivation and de-motivation in school learning will then be discussed. Examples of these constructs are self-concept, self-efficacy, goal orientation, self-regulation, curiosity, interest, flow, learned helplessness, teachers’ expectations and teachers' feedbacks. Individual differences in such aspects as cognitive style, memory, intelligence, creativity, problem solving, prior knowledge and personal epistemology will also be examined. To discuss teaching strategies that would optimize students’ motivational level and to accommodate for their individual differences, we will deliberate on various instructional designs, ranging from classroom strategies to a school-wide approach.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "4030", "title": "Teaching Practice I", "career": "Undergraduate", "units": "5.00", "grading": "Graded", "components": "Field Studies/Field-trip", "campus": "Main Campus", "academic_group": "Fac Office of Education", "requirements": "Not for students who have taken EDUC4010", "description": "The first block of teaching practice provides students with the opportunity to capitalize on the theoretical work provided during their studies. Students will be able to integrate theory and practice in the classroom setting when they are attached to schools to have teaching practice. Students will compile a Teaching Practice Portfolio which promotes reflection and a critical awareness of their teaching. Completion of ‘School Experience’, during which students observe classroom teaching and school life in general, is a prerequisite for this course.", "outcome": "By the end of this course, students will be able to: 1. Integrate and apply knowledge and skills acquired and developed in the programme in designing lessons and teaching these lessons in the classroom;  2. Use language effectively in the classroom for teaching purposes;  3. Analyse critically their performance in teaching;  4. Demonstrate an understanding of the professional roles of a teacher in the classroom and in the school", "syllabus": "For reference only, please refer to the course outline of respective instructor for details", "required_readings": "Required readings (if any) would depend on individual instructors", "recommended_readings": "Recommended readings would depend on individual instructors 1. Adams Bullock, A. and Hawk, P.P. (2001). Developing a teaching portfolio: A guide for preservice and practicing teachers. Upper Saddle River, N.J.: Merrill Prentice Hall.  2. Goethals, M. S, Howard, R. A. and Sanders, M.M. (2004). Student Teaching: A process approach to reflective practice : A guide for preservice and inservice teachers (2nd Edition). Upper Saddle River, N.J.: Pearson/Merrill/Prentice Hall.", "terms": {"2024-25 Term 2": {"AF01-FLD (4800)": {"startTimes": ["8:30", "8:30", "8:30", "8:30", "8:30", "13:30"], "endTimes": ["18:15", "18:15", "18:15", "18:15", "11:15", "18:15"], "days": [2, 1, 3, 4, 5, 5], "locations": ["No Room Required", "No Room Required", "No Room Required", "No Room Required", "No Room Required", "No Room Required"], "instructors": ["Dr. NG Mau Yuen Eric", "Dr. NG Mau Yuen Eric", "Dr. NG Mau Yuen Eric", "Dr. NG Mau Yuen Eric", "Dr. NG Mau Yuen Eric", "Dr. NG Mau Yuen Eric"], "meetingDates": ["3/3", "4/3", "5/3", "6/3", "7/3", "10/3", "11/3", "12/3", "13/3", "14/3", "17/3", "18/3", "19/3", "20/3", "21/3", "24/3", "25/3", "26/3", "27/3", "28/3", "31/3", "1/4", "2/4", "3/4", "4/4", "7/4", "8/4", "9/4", "10/4", "11/4", "14/4", "15/4", "16/4", "17/4", "18/4"]}, "BF01-FLD (4801)": {"startTimes": ["8:30", "8:30", "8:30", "8:30", "8:30", "13:30"], "endTimes": ["18:15", "18:15", "18:15", "18:15", "11:15", "18:15"], "days": [1, 2, 3, 4, 5, 5], "locations": ["No Room Required", "No Room Required", "No Room Required", "No Room Required", "No Room Required", "No Room Required"], "instructors": ["Professor TSANG Wai Chung", "Professor TSANG Wai Chung", "Professor TSANG Wai Chung", "Professor TSANG Wai Chung", "Professor TSANG Wai Chung", "Professor TSANG Wai Chung"], "meetingDates": ["3/3", "4/3", "5/3", "6/3", "7/3", "10/3", "11/3", "12/3", "13/3", "14/3", "17/3", "18/3", "19/3", "20/3", "21/3", "24/3", "25/3", "26/3", "27/3", "28/3", "31/3", "1/4", "2/4", "3/4", "4/4", "7/4", "8/4", "9/4", "10/4", "11/4", "14/4", "15/4", "16/4", "17/4", "18/4"]}, "CF01-FLD (4812)": {"startTimes": ["8:30", "8:30", "8:30", "8:30", "8:30", "13:30"], "endTimes": ["18:15", "18:15", "18:15", "18:15", "11:15", "18:15"], "days": [1, 2, 3, 4, 5, 5], "locations": ["No Room Required", "No Room Required", "No Room Required", "No Room Required", "No Room Required", "No Room Required"], "instructors": ["Staff", "Staff", "Staff", "Staff", "Staff", "Staff"], "meetingDates": ["3/3", "4/3", "5/3", "6/3", "7/3", "10/3", "11/3", "12/3", "13/3", "14/3", "17/3", "18/3", "19/3", "20/3", "21/3", "24/3", "25/3", "26/3", "27/3", "28/3", "31/3", "1/4", "2/4", "3/4", "4/4", "7/4", "8/4", "9/4", "10/4", "11/4", "14/4", "15/4", "16/4", "17/4", "18/4"]}}}}, {"code": "4040", "title": "Teaching Practice II", "career": "Undergraduate", "units": "5.00", "grading": "Graded", "components": "Field Studies/Field-trip", "campus": "Main Campus", "academic_group": "Fac Office of Education", "requirements": "Not for students who have taken EDUC4020", "description": "The second block of teaching practice to be held in the final year of study further enhances students' understanding of school life and their teaching competence. The Teaching Practice Portfolio which students compile documents their professional development as student teachers in addition to developing a critical awareness of their teaching, teaching beliefs and teaching philosophy.", "outcome": "By the end of this course, students will be able to: 1. Integrate and apply knowledge and skills acquired and developed in the programme in designing lessons and teaching these lessons in the classroom;  2. Use language effectively in the classroom for teaching purposes;  3. Analyse critically their performance in teaching;  4. Demonstrate an understanding of the professional roles of a teacher in the classroom and in the school", "syllabus": "For reference only, please refer to the course outline of respective instructor for details", "required_readings": "Required readings (if any) would depend on individual instructors", "recommended_readings": "Recommended readings would depend on individual instructors 1. Adams Bullock, A. and Hawk, P.P. (2001). Developing a teaching portfolio: A guide for preservice and practicing teachers. Upper Saddle River, N.J.: Merrill Prentice Hall.  2. Goethals, M. S, Howard, R. A. and Sanders, M.M. (2004). Student Teaching: A process approach to reflective practice : A guide for preservice and inservice teachers (2nd Edition). Upper Saddle River, N.J.: Pearson/Merrill/Prentice Hall", "terms": {"2024-25 Term 1": {"AF01-FLD (4733)": {"startTimes": ["8:30", "8:30", "8:30", "8:30", "8:30", "13:30"], "endTimes": ["18:15", "18:15", "18:15", "18:15", "11:15", "18:15"], "days": [1, 2, 3, 4, 5, 5], "locations": ["No Room Required", "No Room Required", "No Room Required", "No Room Required", "No Room Required", "No Room Required"], "instructors": ["Dr. NG Mau Yuen Eric", "Dr. NG Mau Yuen Eric", "Dr. NG Mau Yuen Eric", "Dr. NG Mau Yuen Eric", "Dr. NG Mau Yuen Eric", "Dr. NG Mau Yuen Eric"], "meetingDates": ["28/10", "29/10", "30/10", "31/10", "1/11", "4/11", "5/11", "6/11", "7/11", "8/11", "11/11", "12/11", "13/11", "14/11", "15/11", "18/11", "19/11", "20/11", "21/11", "22/11", "25/11", "26/11", "27/11", "28/11", "29/11"]}, "BF01-FLD (4774)": {"startTimes": ["8:30", "8:30", "8:30", "8:30", "8:30", "13:30"], "endTimes": ["18:15", "18:15", "18:15", "18:15", "11:15", "18:15"], "days": [1, 4, 2, 3, 5, 5], "locations": ["No Room Required", "No Room Required", "No Room Required", "No Room Required", "No Room Required", "No Room Required"], "instructors": ["Professor Scott Charles AUBREY", "Professor Scott Charles AUBREY", "Professor Scott Charles AUBREY", "Professor Scott Charles AUBREY", "Professor Scott Charles AUBREY", "Professor Scott Charles AUBREY"], "meetingDates": ["28/10", "29/10", "30/10", "31/10", "1/11", "4/11", "5/11", "6/11", "7/11", "8/11", "11/11", "12/11", "13/11", "14/11", "15/11", "18/11", "19/11", "20/11", "21/11", "22/11", "25/11", "26/11", "27/11", "28/11", "29/11"]}, "CF01-FLD (4794)": {"startTimes": ["8:30", "8:30", "8:30", "8:30", "8:30", "13:30"], "endTimes": ["18:15", "18:15", "18:15", "18:15", "11:15", "18:15"], "days": [1, 2, 3, 4, 5, 5], "locations": ["No Room Required", "No Room Required", "No Room Required", "No Room Required", "No Room Required", "No Room Required"], "instructors": ["Professor NG Oi Lam", "Professor NG Oi Lam", "Professor NG Oi Lam", "Professor NG Oi Lam", "Professor NG Oi Lam", "Professor NG Oi Lam"], "meetingDates": ["28/10", "29/10", "30/10", "31/10", "1/11", "4/11", "5/11", "6/11", "7/11", "8/11", "11/11", "12/11", "13/11", "14/11", "15/11", "18/11", "19/11", "20/11", "21/11", "22/11", "25/11", "26/11", "27/11", "28/11", "29/11"]}}}}, {"code": "4110", "title": "Dynamic Curriculum Development for Innovative Learning Experiences", "career": "Undergraduate", "units": "2.00", "grading": "Graded", "components": "Discussion\nLecture\nProject\nVisit\nWorkshop", "campus": "Main Campus", "academic_group": "Fac Office of Education", "requirements": "Pre-requisite: EDUC2120.", "description": "The course “Dynamic Curriculum Development for Innovative Learning Experiences” immerses students in the realm of curriculum design, emphasizing the creation of dynamic and innovative learning opportunities. Through this course, students will have the opportunity to explore the foundational principles and models that guide curriculum development. They will delve into a wide array of innovative approaches, such as curriculum integration, cooperative learning, experiential learning, project-based learning, and inquiry-based learning. The course will also cover essential aspects of implementing and evaluating dynamic curricula, such as assessing student outcomes and gathering valuable feedback from stakeholders. Students will gain insights into administration and risk management considerations crucial to effectively implementing innovative curriculum designs. By showcasing both local and global best practices, the course offers a comprehensive perspective that equips students with the ability to drive positive change, lead initiatives, employ diversified pedagogical approaches, and evaluate curriculum innovations to optimize student learning outcomes.There are five big questions guiding the course:1. How can we adopt a dynamic approach to curriculum development that fosters innovative learning experiences, captivating, and motivating students?2. How can change agents drive curriculum development and cultivate a culture of innovation in schools to create dynamic and meaningful learning experiences?3. What are the key principles, models, and strategies that drive the development of dynamic curricula?4. What innovative approaches and methodologies, such as integrated curriculum, collaborative learning, project-based, and inquiry-based learning, can be used to enhance student engagement and learning outcomes?5. How can we effectively implement and evaluate dynamic curricula to ensure successful implementation and continuous improvement?", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "4130", "title": "Information Technology in Education", "career": "Undergraduate", "units": "2.00", "grading": "Graded", "components": "Discussion\nLecture\nOthers\nProject", "campus": "Main Campus", "academic_group": "Fac Office of Education", "requirements": "Not for students who have taken EDUC4120.", "description": "The rapid development of information technology brings new educational opportunities to students and teachers. This course aims to equip participants with both pedagogical knowledge and technical skills to integrate IT into the process of learning and teaching in school contexts.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "4131", "title": "e-Learning in Schools", "career": "Undergraduate", "units": "2.00", "grading": "Graded", "components": "Discussion\nLecture\nOthers\nProject", "campus": "Main Campus", "academic_group": "Fac Office of Education", "requirements": "Not for students who have taken EDUC4130.", "description": "The rapid development of information technology (IT) brings new e-Learning opportunities to students. This course aims to develop participants’ ability to apply IT in education and design e-Learning activities in school contexts. Apart from gaining pedagogical knowledge and technological skills for leveraging IT to facilitate face-to-face teaching and self-directed learning, participants will work in groups to innovate inside- and/or outside-the-classroom activities with e-Learning strategies for addressing various educational needs or challenges in schools. The e-Learning strategies to be covered in the course include multimedia-enhanced learning, mobile learning, flipped classroom, computer-supported collaborative learning, as well as web-based inquiry learning.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "4210", "title": "Teachers and the Teaching Profession", "career": "Undergraduate", "units": "2.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Fac Office of Education", "requirements": "", "description": "The course examines two significant themes in teaching – the nature of teaching as work and the actors involved in it. Topics include: the meaning of teacher work, the professionalization of teaching, the contribution of teacher professionalism to improving education, and the cultures of teachers as persons and as professionals.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "4310", "title": "Designing and Implementing Classroom Assessments", "career": "Undergraduate", "units": "2.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Fac Office of Education", "requirements": "", "description": "This course aims to assist students to master the basic knowledge, skills and value judgment that are essential to effective classroom assessment in teaching different school subjects. It starts tracing the historical developments of student assessment and the thoughts behind the changes, particularly in the context of Hong Kong. With the background, the significant concepts and principles of educational assessment and measurement are explicated, including those about validity, reliability, instructional utility, criterion-reference and norm-reference assessment, and formative and summative assessment, relationships between curriculum, assessment, and learning, and teachers’ and students’ roles in classroom assessment. It then evaluates the utilities and the limitations of various assessment formats for assessing student attainments including knowledge, skills and behaviors. The assessment formats include the traditional ones (e.g., multiple-choice questions, short answers, essays), the alternative ones (e.g., portfolios, performance assessments; self and peer assessment, group assessment), and the types of assessment rubrics (holistic or analytic; generalized or task specific) used for evaluating student performance on the alternative assessments.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "4320", "title": "Classroom Management and School Discipline", "career": "Undergraduate", "units": "2.00", "grading": "Graded", "components": "Classwork\nDiscussion\nIndependent Study\nLecture", "campus": "Main Campus", "academic_group": "Fac Office of Education", "requirements": "", "description": "The course is designed to familiarize students with both the theoretical and the practical aspects of classroom management and school discipline. It also aims at assisting teachers to promote an optimum learning environment and to encourage the development of self-discipline among students. Topics include: organizational perspective of discipline, group dynamics, management skills in context, student-teacher relationship, school rules and organization policies, coordination between discipline and guidance, home-school partnership and whole school discipline.", "outcome": "By the end of this course, students will be able to: 1. state the characteristics and purposes of the selected conceptual and theoretical models on classroom management and school discipline; 2. identify the factors affecting the positive student-teacher relationship development in the classroom and in school; 3. be aware of personal strengths and limitations as a teacher in the subject of classroom management; 4. acquire skills to build a strong and positive student-teacher rapport as well as to promote an environment of optimal learning in the classroom; and  5. develop effective strategies to promote self-discipline and positive behaviors among primary students.", "syllabus": "For reference only, please refer to the course outline of respective instructor for details  Topics: Introduction and Reflection Understand your students’ needs   Kounin Model  Rogerian Model  Ginott Model  Dreikurs Model  Glasser Reality Model  Canter Model  You can’t do it alone Continuous development of the “SELF”  Peer-Evaluation in class Resources for expanding horizons  Course Evaluation", "required_readings": "Required readings (if any) would depend on individual instructors Charles, C. M. (1981). Building classroom discipline: from models to practice. New York: Longman. (Also available in Chinese: 金樹人(編譯)。(1994)。《敎室裡的春天 : 敎室管理的科學與藝術》。台北市: 張老師文化事業股份有限公司。)", "recommended_readings": "Recommended readings would depend on individual instructors Kounin Model Kounin, J. (1971, 1977). Discipline and group management in classrooms. New York: Holt, Rinebart and Winston. Kounin, J. & Gump, P. V. (1958). The ripple effect in discipline. The Elementary School Journal. Vol. 59, No.3 (pp.158-162)  Ginott Model Ginott, H. G. (1993). Teacher and child: a book for parents and teachers. New York: Maxwell Macmillan International. (Also available in Chinese: 許麗玉(譯)。(1977)。《老師怎樣跟學生說話》。香港: 光華書局。 许丽玉(译)。(1989)。《敎育孩子的谈话艺朮: 献给敎师和父母》。北京: 世界图书出版公司。 許純欣(譯)。(1992)。《師生之間》。 香港: 基督敎文藝出版社。 許麗美﹑許麗玉(譯)。(2001)。《老師如何跟學生說話: 親師與孩子的溝通技巧》。台北市:心理出版社股份有限公司。) Ginott, H. G. (1969). Between parent and teenager. New York: Macmillan. (Also available in Chinese:  伍惠亞(譯)。(1972)。《了解現代少年》。香港 : 基督教文藝出版社。 張天溥﹑姚宜瑛(譯)。(1994)。《父母怎樣管敎靑少年》。臺北 : 大地出版社。)  Dreikurs Model Dreikurs, R., Cassel, P., & Ferguson, E. D. (2004). Discipline without tears: how to reduce conflict and establish cooperation in the classroom. John Wiley & Sons Canada. Dreikurs, R., Grunwald, B. B. & Pepper, F. C. (1982). Maintaining sanity in the classroom: classroom management techniques. New York: HarperCollins. (Also available in Chinese: 曾端眞﹑曾玲珉(譯)。(2002)。《班級經營與兒童輔導》。台北市: 天馬文化事業有限公司。)  Glasser Model Glasser, W. (1975). Schools without failure. New York: Perennial Library. (Also available in Chinese: 唐曉杰(譯)。(1998)。《沒有失敗的學校》。臺北市: 桂冠圖書股份有限公司。) Glasser, W. (1998a). The quality school: managing students without coercion. New York: HarperPerennial. Glasser, W. (1998b). The quality school teacher: specific suggestions for teachers who are trying to implement the lead-management ideas of the quality school in their classrooms. New York: HarperCollins. Glasser, W. (1998c). Choice theory in the classroom. New York: Harper Perennial. Glasser, W. (2001). Every student can succeed. Chatsworth, CA: William Glasser Incorporated.  Canter Model Canter, L. (1994). Lee Canter's assertive discipline. Teacher's plan book plus. Santa Monica, Calif. : Lee Canter & Associates. Canter, L. (1995). Lee Canter's positive parent involvement kit: strategies for increasing communication and cooperation between teachers and families. Santa Monica, CA: Lee Canter & Associates. Canter, L. (2010). Lee Canter's assertive discipline: positive behavior management for today's classroom. Bloomington, IN: Solution Tree Press. Canter, L., & Canter, M. (1989). Assertive discipline. Resource materials workbook, elementary, K-6. Santa Monica, Calif: Canter and Associates. Canter, L., & Canter, M. (1993a). Succeeding with difficult students [videorecording]: new strategies for reaching your most challenging students. Santa Monica, CA: Lee Canter & Association, Inc. Canter, L., & Canter, M. (1993b). Assertive discipline inservice video package: positive behavior management for today's classroom [videorecording]. Santa Monica, CA: Lee Canter & Associates. Canter, L., & Canter, M. (1993c). Succeeding with difficult students [workbook] : [new strategies for reaching your most challenging students] / Lee Canter and Associates presents. Canter, L., & Canter, M. (1993d). Succeeding with difficult students [Leader’s Manual] : [new strategies for reaching your most challenging students] / Lee Canter and Associates presents. Canter, L., & Canter, M. (1995). Behavior management in the middle school classroom : a teacher's guide to meeting the special challenges of early adolescents. Santa Monica, CA : Canter & Associates. Canter, L., & Canter, M. (2001). Assertive discipline: positive behavior management for today's classroom. Los Angeles, CA: Canter & Associates. Canter, L., & Canter, M. (2001). Parents on your side: a teacher's guide to creating positive relationships with parents. Los Angeles, Calif. : Canter & Associates.  Bianco, A. (2002). One-minute discipline: Classroom management strategies that work. Jossey-Bass A Wiley Company. Cangelosi, J. S. (2004). Classroom management strategies: gaining and maintaining students' cooperation. Hoboken, N.J.: Wiley. Chan, C. C., Chan, K. Y., Cheung, W. M., Ngan, M. Y., & Yeung, V. M. (1992). Primary school teacher self-concept: Its relationship with teacher behaviors and students’ educational outcomes. Journal of Primary Education, 3(1),9-28. Charles, C. M. (2005). Building classroom discipline (8th ed). MA:Boston: Pearson/Allyn and Bacon. Charles, C. M., & Senter, G. W. (2005). Elementary classroom management (4th ed.). Boston: Pearson/Allyn and Bacon. Charles, C. M. (2014). Building classroom discipline (11th ed). Pearson Education, Inc. Charney, R. S. (1991). Teaching children to care: management in the responsive classroom. Greenfield, MA: Northeast Foundation for Children. Charney, R. S. (2002). Teaching children to care : classroom management for ethical and academic growth, K-8. Greenfield, MA : Northeast Foundation for Children. (Also available in Chinese: 辛蒂。查妮(譯) 。(2005) 。《教孩子關心 : 美德和學業成長的課室管理K-8》。郭妙芳台北縣中和市 : 光佑文化事業股份有限公司。) Denti L.G. (2012). Proactive classroom management, K-8 : a practical guide to empower students and teachers. Thousand Oaks, Calif. : Corwin. Evertson, C. M., Emmer, E. T., & Worsham, M. E. (2006). Classroom management for elementary teachers (7th ed.). Boston: Pearson/Allyn and Bacon. Fontana, D. (1994). Managing classroom behaviour. Leicester, United Kingdom: British Psychological Society. (Also available in Chinese: 李彥(譯)。(2000)。《課室管理技巧》。香港：中文大學出版社。) Glasgow, N. A., & Hicks, C.D. (2008). What successful teachers do: 91 research-based classroom strategies for new and veteran teachers. (Also available in Chinese: 杜宜展(譯)。(2008) 。《如何成為成功的教師 : 以研究為基礎的91個班級經營策略》。台北市 : 心理出版社股份有限公司。) Gordon, T. (1980). Teaching children self-discipline--at home and at school. New York: Times Books. Gordon, T. (1994). T.E.T.: Teacher effectiveness training. New York: Peter H. Wyden. (Also available in Chinese: 歐申談(譯)。(1993)。《教師效能訓練》。三重: 新雨出版社。) Henley M. (2000). Classroom management : a proactive approach (2nd ed).. Boston : Pearson Hook P. & Vass A. (2000a). Confident classroom leadership. London : David Fulton.  Hook P. & Vass A. (2000b). Creating winning classrooms. London : David Fulton. Hue, M. K., & Li, W. S. (2008). Classroom management: creating a positive learning environment. Hong Kong University Press. Jones, V. F., & Jones, L. S. (1981). Responsible classroom discipline : creating positive learning environments and solving problems. Boston: Allyn and Bacon. Jones, V. F., & Jones, L.S. (2010). Comprehensive classroom management: creating communities of support and solving problems (9th ed). Upper Saddle River, N.J.: Merrill. Katafiasz, K. (1997). Teacher therapy. St. Meinrad, Ind.: One Caring Place. (Also available in Chinese: 林鶯(譯)。(1998)。《寶貝你的學生》。台灣：台灣張老師出版社。) Kauffman, J.M. (2011). Managing classroom behavior: a reflective case-based approach (5th ed.).Upper Saddle River, N.J.: Pearson Education. Levin, J., & Nolan, J. F. (2010). Principles of classroom management: a professional decision-making model (6th ed.). Boston: Pearson. Manning, M. L., & Bucher, K. T. (2003). Classroom management: models, applications, and cases. Upper Saddle River, N.J.: Merrill. Nelsen, J., Lott, L., & Glenn, H. S. (2000). Positive discipline in the classroom: developing mutual respect, cooperation, and responsibility in your classroom. Rooseville, Calif.: Prima Pub.  Petty, R. (2001). Classroom management: a resource manual for frontline teachers. Lanham, MD: Scarecrow Press. Phifer, S. J. (2002). Setting up and facilitating student-centered classrooms. Lanham, Md.: Scarecrow Education. Pierangelo, R., & Giuliani, G. (2008). Classroom management techniques for students with ADHD. Thousand Oaks, CA: Corwin Press. Rogers, C.R., & Freiberg, H. J. (1994). Freedom to learn (3rd ed.). New York: Merrill; Toronto: Maxwell Macmillan Canada. Wolfgang, C.H. (2009). Solving discipline and classroom management problems: methods and models for today's teachers (7th ed.). Hoboken, NJ: John Wiley & Sons. Wong, H.K., & Wong, R.T. (1998). The first days of school: how to be an effective teacher. Mountainview, CA: Harry K. Wong Publications. 洪進華, 彭可兒著。(2007)。《70個教學實務錦囊》。香港：匯智出版有限公司。 何仲廉。(2008)。《告別混亂課室：行為心理學與課室秩序》。香港：文林出版有限公司。 何仲廉, 梁展鵬著。(2000)。《課室行為改造ABC》。香港：出版者不詳。 林孟平。(1984)。〈師生關係：學校教育的關鍵〉。《香港中文大學教育學報》。十二卷二期，頁18-23。 周朱瑞華。(1996)。《有效課室管理70式》。香港：香港教育圖書公司。 趙志成﹑陳漢森。(1996)。《教師加油站》。香港：香港教育圖書公司。 龐念安。(1996)。《情濃訓導室》。香港：突破出版社。 冼權鋒編。(1999)。《營建融洽有序的學習環境：課室管理 — 建立常規》。香港：仁濟醫院﹑教育評議會。 吳仰明編。(1999)。《營建融洽有序的學習環境：課室管理 — 奬賞有方》。香港：仁濟醫院﹑教育評議會。 李立志編。(1999)。《營建融洽有序的學習環境：課室管理 —懲罰有道》。香港：仁濟醫院﹑教育評議會。 冼權鋒﹑吳仰明﹑李立志合編。(1999)。《教師語態調查報告》。香港：仁濟醫院﹑教育評議會。 蕭寧波。(2000)。〈五個印花可以換甚麼？〉。《亞洲輔導學報》。第七卷一期，頁53-63。 蕭寧波。(2002)。〈懲罰以外〉。《亞洲輔導學報》。第九卷一及二期，頁69-81。 阿濃。(2000) 。《新愛的敎育》。香港 : 突破出版社。 簡女貞。(2007) 。《老師的十二樣見面禮》。台北縣中和市 : 印刻出版有限公司。 許明得﹑李偉成。(2008)。《有效課堂管理 : 營造積極學習氣氛》。香港 : 香港大學出版社。  Useful Website: http://www.educationworld.com/a_curr/archives/classmanagement.shtml", "terms": {"2024-25 Term 1": {"--LEC (4800)": {"startTimes": ["8:30", "8:30"], "endTimes": ["10:15", "10:15"], "days": [4, 2], "locations": ["Esther Lee Bldg 307", "Esther Lee Bldg 401"], "instructors": ["Dr. CHEUNG Wing Shan", "Dr. CHEUNG Wing Shan"], "meetingDates": ["3/9", "5/9", "10/9", "12/9", "17/9", "19/9", "24/9", "26/9", "3/10", "8/10", "10/10", "15/10", "17/10", "22/10", "24/10"]}}}, "assessments": {"Essays": "50", "Others": "20", "Presentation": "20", "Participation": "10"}}, {"code": "4330", "title": "School Guidance and Counselling", "career": "Undergraduate", "units": "2.00", "grading": "Graded", "components": "Classwork\nDiscussion\nExercise\nLaboratory\nLecture\nInteractive Tutorial", "campus": "Main Campus", "academic_group": "Fac Office of Education", "requirements": "", "description": "The course aims to explore different kinds of guidance services and their functions, and to promote guidance activities in schools in Hong Kong. The course content includes: (1) history and aims of guidance; (2) what is guidance and counselling?; (3) major dimensions in school guidance; (4) the importance of teacher counsellor as a person; (5) basic counselling theories, attitudes and techniques; (6) individual and group counselling; (7) coordination of guidance and discipline; (8) whole school approach to guidance; (9) home-school partnership; and (10) referral counselling and consultation services.", "outcome": "By the end of this course, students will be able to: 1. Demonstrate an understanding of the basic objectives of school guidance and counseling. 2. Identify various roles and functions of teachers in school guidance and counseling. 3. Gain knowledge of major counseling theories and use them as a guide to understand the social and emotional needs of students.  4. Apply basic counselling skills and interventions to work with students and their families in dealing with students’ socioemotional issues. 5. Improve self-awareness and self-care as a person to engage in more reflective and effective teaching and helping.", "syllabus": "For reference only, please refer to the course outline of respective instructor for details Basic counselling skills, major theories of counselling, roles and functions of teachers, assessment and types of student concerns, objectives of student guidance and counselling.", "required_readings": "Required readings (if any) would depend on individual instructors Kottler, J.A., & Kottler, E. (2007). Counseling skills for teachers (2nd ed.). Thousand Oaks, CA: Corwin Press. (Reissued in 2015 by Skyhorse publishing) Also available in Chinese: 孫守湉、林秀玲(譯),許維素(校)(2011) 。教師諮商技巧 (第二版)。 台灣：心理出版社。", "recommended_readings": "Recommended readings would depend on individual instructors Chen, P.-W. (2009). A counseling model for self-relation coordination for Chinese clients with interpersonal conflicts. The Counseling Psychologist, 37, 987-1009. Gysbers, N. C. (2000). Implementing a whole school approach to guidance through a comprehensive guidance system. Asian Journal of Counselling, 7 (2), 5-17. Hill, C. E. (2014). Helping skills: Facilitating exploration, insight, and action (4th ed.). Washington DC: American Psychological Association. Hue, M.-T. (2007) The relationships between school guidance and discipline: critical contrasts in two Hong Kong secondary schools, Educational Review, 59(3), 343-361. Luk-Fong, P. Y. Y. & Lee-Man, Y.C. (2011). School guidance and counseling: Trends and practices. HKU Press. (also available in Chinese: 陸方鈺儀、李文玉清 (2011)。學校輔導 – 趨勢與實務。 香港 : 香港大學出版社。) Note: The electronic version is available online at CUHK library. Rogers, C. R. (1995). On becoming a person: a therapist's view of psychotherapy. Boston: Houghton Mifflin. Yuen, M. T. (2006). School counseling in Hong Kong: History, policy, current implementation status, and future directions. In C. H. So (ed.), School counseling and career guidance (pp.44-70). University of Macau Faculty of Education. Yuen, M., Chan R.M.C., Lau, P. S.Y., Gysbers, N.C., & Shea, P.M.K. (2007). Comprehensive guidance and counselling programmes in the primary schools of Hong Kong: Teachers’ perceptions and involvement. Pastoral Care in Education: An International Journal of Personal, Social and Emotional Development, 25(4), 17-24. Yuen, M., Chan, R., Lau, P. S.Y., Yu, L., Chan R.M.C., Gysbers, N.C., & Shea, P. M.K. [袁文得､陳子康､劉兆瑛､于璐､陳茂釗､余文基](2010). Implementing the comprehensive guidance and counseling program in Hong Kong: High school teachers’ perspectives [全方位輔導計畫在香港的推行：高中老師的觀感]. Asian Journal of Counselling, 17(1-2), 61-79. 林孟平 (2012). 輔導與心理治療 (修訂版)。 香港：商務印書館。", "terms": {"2024-25 Term 2": {"--LEC (8071)": {"startTimes": ["9:30", "9:30"], "endTimes": ["11:15", "11:15"], "days": [3, 1], "locations": ["Esther Lee Bldg 401", "Esther Lee Bldg 203"], "instructors": ["Professor LAM Yu Hin", "Professor LAM Yu Hin"], "meetingDates": ["6/1", "8/1", "13/1", "15/1", "20/1", "22/1", "27/1", "5/2", "10/2", "12/2", "17/2", "19/2", "24/2", "26/2"]}}}, "assessments": {"Essays": "30", "Participation": "10", "Report": "30", "Short answer test or exam": "15", "Selected response test or exam": "15"}}, {"code": "4340", "title": "Supporting Students with Special Educational Needs", "career": "Undergraduate", "units": "2.00", "grading": "Graded", "components": "Discussion\nLecture\nProject", "campus": "Main Campus", "academic_group": "Fac Office of Education", "requirements": "Not for students who have taken LDTE4300.", "description": "This course aims to provide students with theoretical foundations of selected areas of special needs and help them to understand possible learning difficulties children with these special needs would encounter. These areas of special needs include: 1) learning disabilities; 2) giftedness and talents; 3) autism spectrum disorder; 4) attention deficit hyperactivity disorder; and 5) emotional and behavioral disorders. For each kind of special need, students will learn its characteristics, causes, and provision of special education in Hong Kong. Besides, this course will also prepare students for developing essential intervention strategies and techniques to help children with learning difficulties. Students will also work in small groups, under the supervision of the instructor, to conduct case studies in order to strengthen their knowledge of the learning difficulties of selected groups of children.", "outcome": "By the end of this course, students will be able to: 1. acquire basic principles of identification and education of various types of special-needs children  2. have an understanding of provision of special education in Hong Kong  3. critically evaluate current issues related to the education of students with special educational needs 4. develop relevant intervention strategies to facilitate student development and enhance learning in primary school years", "syllabus": "For reference only, please refer to the course outline of respective instructor for details", "required_readings": "Required readings (if any) would depend on individual instructors Hallahan, D., Kauffman, J., Pullen, P.C. (2018). Exceptional learners: An introduction to Special Education (Fourteenth Edition). Pearson (ISBN: 978-0133570724).  林寶貴策畫主編；王欣宜、王淑娟、吳亭芳、沈慶盈、林寶貴、邱滿艷、陳明聰、黃志雄、廖華芳、蔣明珊、簡明建著 (2016).　特殊教育理論與實務（第五版）. 心理出版社.", "recommended_readings": "Recommended readings would depend on individual instructors Carpenter, B., Egerton, J., Cockbill, B., Bloom, T., Fotheringham, J., Rawson, H., & Thistlethwaite, J. (2015). Engaging learners with complex learning difficulties and disabilities: a resource book for teachers and teaching assistants. Abingdon, Oxon ; New York, NY : Routledge 2015 Chan, D. W. (2003). Assessing adjustments problems of gifted students in Hong Kong: The development of the student adjustment problems inventory. Gifted Child Quarterly, 47(2), 107-117. Clark, B. (1997). Growing up gifted (5th Edition). Columbus: Merrill Publishing Company. DuPaul, G.J. & Stoner, G. (2014). ADHD in the schools: assessment and intervention strategies. New York: The Guilford Press. Hirschland, D. (2015). When young children need help: understanding and addressing emotional, behavioral, and developmental challenges. St. Paul, MN : Redleaf Press. Ravet, J. (2015). Supporting change in autism services: bridging the gap between theory and practice. Abingdon, Oxon; New York: Routledge  張慧如 (2014)。大哥哥、大姐姐，請看看：我們很棒！：14個特殊教育的心路故事點亮社會的角落。 林瑞芳﹙編﹚﹙2004﹚。《教育心理學實用手冊》。香港：香港心理學會敎育心理學部。 李震梅(2008)《不一樣的孩子﹣﹣認識及培養學習差異兒童 》 。香港：中文大學出版社。 石丹理﹙編﹚﹙2004﹚。《華人社會青少年院護及特殊敎育服務》。香港：商務。 李憲嚴 (2013)。過度活躍專注力及自閉-從大腦解決。星島 / 星文社 / 星島教育 何定邦﹙2005﹚。《四點鐘的驚恐：探討兒童過度活躍症》。香港：花千樹。 蔡美馨 (2007)。《過動兒的教養妙方》。台北﹕新苗文化有限公司。 瑪麗．福樂（Mary Fowler)著，何善欣譯。2005。《我不是不聽話！》。台北：新手父母出版。 黎程正家(2003)，《如鷹展翅─提高低成就學生之學習動機及學習能力，教師資源手冊》，香港：冬青樹圖書制作公司。 劉佳蕙,鄭淨勻(2005).亞斯伯格症在融合教育的成功策略. 台北市: 心理出版社 藍瑋琛 編著(2010)《自閉症學生教學策略》。臺北市立教育大學特殊教育中心 陳錦鴻(2014)。《我和兒子的每一步》。世界出版社 資優教育概論 (2012)。GARY A. DAVIS。華騰文化股份有限公司　  Websites: (香港) 特殊教育資源中心網站Special Education Resource Centre http://www.edb.gov.hk/serc (香港) 特殊學習困難專業教育發展小組Teacher Development for Student with Specific Learning Difficulties http://www.fed.cuhk.edu.hk/~tdspld/ 香港特殊學習障礙協會 Hong Kong Association for Specific Learning Disabilities http://www.asld.org.hk 專注力不足/過度活躍症(香港)協會Hong Kong Association for AD/HD http://www.adhd.org.hk (香港) 專注力促進會ADHD Foundation http://www.adhd.hk/ (香港) 努力試中心Louis Program Training Centre (for autistic children) http://www.lp.org.hk/ (香港) 特殊教育學會網站Special Education Society of Hong Kong http://www.seshk.org.hk/ (香港) 特殊學習需要與融合教育中心Centre for Special Needs and Studies in Inclusive Education  http://www.ied.edu.hk/csnsie (香港) 特殊教育研究發展中心Centre for Advancement in Special Education http://www.hku.hk/case 香港中文大學語言學及現代語言系手語及聾人研究中心 Centre for Sign Linguistics & Deaf Studies http://www.cuhk.edu.hk/cslds/ (台灣) 有愛無障網站http://www.daleweb.org (台灣) 中華民國學習障礙協會http://ald.daleweb.org 國際閱讀障礙症協會 International Dyslexia Association http://www.interdys.org Pyramid Educational Consultants. (2007). What is PECS? – PECS Autism. http://www.pecs.org.uk/general/what.htm 香港教育學院 (2005)，蕊展計劃，擷取自2012年11月5日http://www.ied.edu.hk/aspire/aspire_2_21.html 協康會(2005)，協康會：自閉症及亞氏保加症，擷取自2012年11月5日http://www.heephong.org/webprod/cht/child-development-and-training/autism-and-asperger-syndrome# 賴鶴明(2009)， 識別自閉症及亞氏保加症兒童，擷取自2012年11月5日http://blog.yahoo.com/_QYE5PQCFXBMHKIXCYP2XT7KRA4/articles/57689", "terms": {"2024-25 Term 1": {"A-LEC (5103)": {"startTimes": ["9:30", "9:30"], "endTimes": ["11:15", "11:15"], "days": [3, 1], "locations": ["Wu Ho Man Yuen Bldg 507", "Chen Kou Bun Bldg LT3"], "instructors": ["Professor SO Wing Chee", "Professor SO Wing Chee"], "meetingDates": ["2/9", "4/9", "9/9", "11/9", "16/9", "23/9", "25/9", "30/9", "2/10", "7/10", "9/10", "14/10", "16/10", "21/10", "23/10"]}}, "2024-25 Term 2": {"B-LEC (8149)": {"startTimes": ["16:30", "16:30"], "endTimes": ["18:15", "18:15"], "days": [1, 3], "locations": ["Wu Ho Man Yuen Bldg 507", "Wong Foo Yuan Bldg LT4"], "instructors": ["Professor SO Wing Chee", "Professor SO Wing Chee"], "meetingDates": ["6/1", "8/1", "13/1", "15/1", "20/1", "22/1", "27/1", "5/2", "10/2", "12/2", "17/2", "19/2", "24/2", "26/2"]}}}, "assessments": {"Essays": "40", "Homework or assignment": "30", "Presentation": "30"}}, {"code": "4350", "title": "Personal Development of Teachers", "career": "Undergraduate", "units": "2.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Fac Office of Education", "requirements": "", "description": "This course promotes the personal development of students in a teacher education programme context. Specially, it will discuss teachers’ physical and mental health and other related issues. Through experiential learning activities, students can raise their self-awareness and understanding of their professional and personal development. Examples of topics include teachers’ self-concept, effective communication, social support and interpersonal relationships, stress and burnout and possible physical hazards resulting from teaching, and so on. Students’ abilities to self-reflect and evaluate are particularly important.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}]