[{"code": "1001", "title": "Exploring Earth and Environmental Sciences", "career": "Undergraduate", "units": "2.00", "grading": "Graded", "components": "Field Studies/Field-trip\nLecture\nProject\nVisit", "campus": "Main Campus", "academic_group": "Dept of Earth & Environ Sci", "requirements": "Not for students who have taken ESSC1000.", "description": "(UGEB1870 is double-coded with EESC1001.) The course provides an interdisciplinary study of the Earth Systems, including natural phenomena in the atmosphere, hydrosphere, geosphere, cryosphere, and biosphere. The mechanism of these systems, associated dynamics and anthropogenic impacts will be introduced and discussed. The course also serves as a platform to understand and critically assess global environmental change, natural hazards, biodiversity loss, and the water-energy-food nexus, and explore potential technological and policy solutions to these problems. These objectives align strongly with the understanding and pursuit of the United Nations Sustainable Development Goals, especially SDG#7 Affordable and Clean Energy, SDG#13 Climate Action, SDG#14 Life Below Water, and SDG#15 Life on Land. In addition to attending lectures, students will visit the Jockey Club Museum of Climate Change where it displays the way scientists examine past and current climate and the factors leading to current global temperature change. A geological field excursion will be another highlight of the course to demonstrate the scientific concepts applied to reveal Earth’s tectonic history, evolution and interaction among various spheres. With diverse scientific topics in Earth’s systems, the course shows students how each Earth’s system is interlocking with other spheres and, hence raise the awareness in the importance of sustainability.", "outcome": "  Describe and explain how the atmosphere, hydrosphere, geosphere, cryosphere, and biosphere interact and how feedback mechanisms operate among the Earth systems.  Develop an interdisciplinary approach for investigating Earth system dynamics.   Discuss the anthropogenic influences, as well as scientific and technical challenges related to global environmental changes, natural hazards, and the food-water-energy nexus critically.  Recognize the complexity of linkages between environmental pressures and human responses related to contemporary sustainable development challenges, contributing to the understanding and pursuit of SDG#7 Affordable and Clean Energy, SDG#13 Climate Action, SDG#14 Life below Water, and SDG#15 Life on Land.  Communicate effectively about Earth system and environmental issues in an appropriate science format (i.e. scientific poster and QnA) through working independently and collaboratively.", "syllabus": "      Lectures: To provide students basic concepts of different spheres, background information about present environmental phenomena and scientific approaches to study the Earth system  Tutorial: To guide students critically think about Earth system and related issues to our environment.  Visit: To show students how professional field works to understand our Earth  Field trip: To facilitate students observe the environment and interpret and discuss related environmental problems   Note: Students are expected to attend all lectures, and participate in all tutorials, the visit and the field trip. Meeting with academic advisors can be arranged upon request.     Course Syllabus (English) (Tentative)  The course content will be divided into three parts:     Part I: Geosphere and Cryosphere (Week 1-5)  This component focuses on studying the solid Earth using gravity, electromagnetic and seismic methods. Students will be introduced to the solid physical foundations of the solid Earth, as well as an overview of the structure and composition of the Earth, its materials and constituents, dynamics of its internal and external processes.     Part II: Atmosphere and Climate (Week 7-9)  This compenent covers an integrated introduction to the climate system and the dynamics and chemistry of the atmosphere. Students will learn to explain the history, current state and future projection of weather and climate, natural hazards, and global climate change in the context of natural variability and anthropogenic influence.     Part III: Ecosystem Interactions (Week 10-12)  This compenent covers the interactions of the terrestrial and marine biosphere with the atmosphere, hydrosphere, and geosphere. Students will be introduced to the physical and chemical processes governing the exchange of energy and matter between the biosphere and the environment, addressing related issues such as habitat decline, biodiversity loss, and environmental pollution.             Week    Topics      1    Course Introduction + The Birth of the Earth           Geosphere and Plate Tectonics      2    Marine Geology and Geophysics           Tutorial      3    Hong Kong Geology           Tutorial           Weekend Field Study Group A           Weekend Field Study Group B      4    Volcanoes           Tutorial      5    Cryosphere in A Warming Climate           Tutorial      6    English advising talk           Tutorial      7    Atmospheric Chemistry           Tutorial      8    Global Environmental Change and GHG Emission           Tutorial      9    Dynamics of the Earth’s Climate System           Tutorial      10    Ecosystem, Climate and (Air) Pollution           Tutorial      11    Environmental Biogeochemistry /  Environmental toxicology or chemistry           Tutorial      12    Oceanography           Tutorial           Poster Presentation         Note:   No exam  Corresponding teachers will decide the format and the whether a tutorial session is needed.  Compulsory activities:    Museum visit  Geological field trip (Understanding HK’s past and present environment; 9 hrs)             ", "required_readings": " Refer to the course syllabus distributed in the class. Introductory reading:  Brian J. Skinner & Barbara W. Murch, 2011. The Blue Planet-An Introduction to Earth System Science, 3rd  Edition. Wiley, ISBN: 9780471236436. (Ch.1, 10-13, 15)   Geosphere and Cryosphere:  Stephen Marshak, 2012. Essentials of Geology, 4th Edition. W. W. Norton & Company, ISBN-13: 860-1401249887. (Ch. 1-2)  IPCC, 2019. Special Report on the Ocean and Cryosphere in a Changing Climate. Website: https://www.ipcc.ch/srocc/   Atmosphere and Climate:  Dennis Hartmann, 2015. Global Physical Climatology2nd Edition. Elsevier. eBook ISBN: 9780080918624 / Hardcover ISBN: 9780123285317. (Ch. 9, 12, 13)  Brian J. Skinner & Barbara W. Murch, 2011. The Blue Planet-An Introduction to Earth System Science, 3rd  Edition. Wiley, ISBN: 9780471236436. (Ch.10)  Richard Wolfson, 2017. Energy, Environment and Climate. W.W. Norton & Company. ISBN: 978-0-393-64347-3.  Syukuro Manabe, Anthony J. Broccoli, 2020. Beyond Global Warming: How Numerical Models Revealed the Secrets of Climate Change. Princeton University Press. ISBM: 9780691058863 (Ch. 1-3)   Ecosystem Interactions:  Dennis Hartmann, 2015. Global Physical Climatology 2nd Edition. Elsevier. eBook ISBN: 9780080918624 / Hardcover ISBN: 9780123285317.  G. Bonan, 2015. Ecological Climatology: Concepts and Applications, 3rd Edition. Cambridge University Press, ISBN: 9781107339200. (Ch. 1, 13)  Donald W. Sparling, 2017. Basics of Ecotoxicology. CRC Press. ISBN 9781138031715. (Ch. 1-3)   Case study for Hong Kong:  Chan L. S., 2014. Geological Heritage of Hong Kong, Aristo Educational Press Ltd.ISB:9789888243655  Bernie Owen & Raynor Shaw, 2011. Hong Kong Geopark, Lions Nature Education Foundation, ISBN: 9789882113961  ", "recommended_readings": " Geosphere and Cryosphere: National Academies of Sciences, Engineering, and Medicine 2017. Volcanic Eruptions and Their Repose, Unrest, Precursors, and Timing. Washington, DC: The National Academies Press. https://doi.org/10.17226/24650. Pps 9-25.   Atmosphere and Climate: Daniel J. Jacob, 1999. Global Tropospheric Chemistry, Introduction to Atmospheric Chemistry. Princeton University Press. (Ch. 11)  ", "terms": {"2024-25 Term 1": {"--LEC (5172)": {"startTimes": ["14:30"], "endTimes": ["16:15"], "days": [1], "locations": ["Science Centre L1"], "instructors": ["Dr. AU-YEUNG Yee Man, \n\nDr. LAU Yee Wai, \n\nDr. TAM Pui Yuk, \n\nDr. ZHANG Li, \n\nProfessor Benoit THIBODEAU, \n\nProfessor CHAN Man Nin, \n\nProfessor CHOW Tat Shing, \n\nProfessor LIU Lin, \n\nProfessor TAI Pui Kuen Amos, \n\nProfessor TAM Chi Yung Francis, \n\nProfessor TAN Yen Joe, \n\nProfessor YANG Hongfeng"], "meetingDates": ["2/9", "9/9", "16/9", "23/9", "30/9", "7/10", "14/10", "21/10", "28/10", "4/11", "11/11", "18/11", "25/11"]}}}, "assessments": {"Fieldwork or field study": "20", "Others": "10", "Project": "30", "Test or quiz": "40"}}, {"code": "1009", "title": "Introductory Practical Course in Earth and Environmental Sciences", "career": "Undergraduate", "units": "1.00", "grading": "Graded", "components": "Field Studies/Field-trip", "campus": "Main Campus", "academic_group": "Dept of Earth & Environ Sci", "requirements": "", "description": "The Introductory Practical Course in Earth and Environmental Sciences is a project-based learning experience designed to introduce freshmen to Earth and Environmental Sciences through direct field observation and hands-on project work. This course will be led by 3 instructors in Geology and Geophysics, Atmospheric Sciences and Environmental Sciences. By exploring the geology beneath our feet, the atmospheric currents above us, and the environmental issues that surround us, students will gain a holistic understanding of our planet.", "outcome": "1. Introduction to Hong Kong Geology: Able to read the basic information from a geological map Gain a brief understanding in major rock types in Hong Kong  Understanding the geological history of Hong Kong Able to correlate the map information, outcrop properties and the landscape 2. Atmospheric Science - Earth’s Rotation and Weather: Describe the basic principles of Earth's rotation and the Coriolis effect and their influence on global weather patterns. Evaluate the impact of the Coriolis effect on weather systems, including the rotation of tropical cyclones, using meteorological data. Design and conduct laboratory experiments to apply theoretical knowledge of atmospheric science to simulate and analyze real-world weather phenomena. 3. Environmental Science - Water Quality: Summarize the key indicators of water quality and discuss their implications for ecosystem health and human well-being. Design and perform experiments to collect and assess water samples, measuring parameters such as pH, turbidity, and pollutants to determine water quality. Assess the sources and consequences of water pollution and propose viable solutions for improving water quality based on scientific evidence.", "syllabus": " Introduction to Hong Kong Geology: This field study takes students to a geologically interesting field area in Hong Kong, providing an outdoor classroom to understand geological processes. Students will learn practical field skills in identifying the rocks, reading geological maps, and understanding how the Earth’s processes shape the landscape.  Atmospheric Science - Earth’s Rotation and Weather: This part is designed to introduce students to the fundamental concepts of Earth's rotation and the Coriolis effect, and their impact on our weather such as the rotation of tropical cyclones. Through a combination of theoretical lectures and laboratory experiments, students will gain a comprehensive understanding of these phenomena.   Environmental Science - Water Quality: This practical study immerses students in the field of environmental science with a focus on water quality. Students will collect and analyze water samples from various sources, testing for parameters like pH, turbidity, and presence of pollutants. This project will underscore the importance of clean, healthy water for ecosystems and human societies, illustrating environmental challenges and potential solutions.", "required_readings": "Introduction to Hong Kong Geology: Chan L. S., 2014. Geological Heritage of Hong Kong. Aristo Educational Press Ltd. ISBN:9789888243655 Bernie Owen & Raynor Shaw, 2011. Hong Kong Geopark. Lions Nature Education Foundation. ISBN: 9789882113961 Atmospheric Science - Earth’s Rotation and Weather: Woollings, T., 2020. Jet Stream: A Journey Through Our Changing Climate. Oxford University Press. eBook ISBN: 9780191867002, print ISBN 9780198828518. (Ch. 1-3) Environmental Science - Water Quality: Brezonik, P. L. & Arnold, W. A., 2022. Water chemistry: the chemical processes and composition of natural and engineered aquatic systems. 2nd edition. Oxford University Press. eBook ISBN: 9780197604731, print ISBN: 9780197604700. (Ch. 2, 7, 18)", "recommended_readings": " Skinner, B. J. & Murck, B. W., 2011. The blue planet: an introduction to earth system science. 3rd edition. Wiley. ISBN: 9780471236436. (Ch.1, 10-13, 15) Marshak, S., 2019. Essentials of Geology, 6th Edition. W. W. Norton & Company. ISBN: 9780393644456. (Ch. 1-2) Stull, R. B., 2017. Practical Meteorology: An Algebra-based Survey of Atmospheric Science. University of British Columbia. ISBN: 9780888652836. (Ch. 10) https://www.eoas.ubc.ca/books/Practical_Meteorology/  Cunningham, W. P. & Cunningham, M. A., 2021. Environmental science: A global concern. 15th edition. McGraw-Hill Education. ISBN: 1-260-59056-9. (Ch. 17, 18)", "terms": {"2024-25 Term 1": {"-F01-FLD (8772)": {"startTimes": ["13:30"], "endTimes": ["14:15"], "days": [1], "locations": ["William M W Mong Eng Bldg 703"], "instructors": ["Dr. LI Kwan Kit Ronald, \n\nDr. TAM Pui Yuk, \n\nDr. ZHANG Li"], "meetingDates": ["2/9", "9/9", "16/9", "23/9", "30/9", "7/10", "14/10", "21/10", "28/10", "4/11", "11/11", "18/11", "25/11"]}}}, "assessments": {"Attendance": "10", "Fieldwork or field study": "60", "Lab reports": "30"}}, {"code": "2009", "title": "Fundamental Earth and Environmental Field Study", "career": "Undergraduate", "units": "1.00", "grading": "Graded", "components": "Field Studies/Field-trip\nLecture\nProject\nInteractive Tutorial", "campus": "Main Campus", "academic_group": "Dept of Earth & Environ Sci", "requirements": "Not for students who have taken EESC2110 or ESSC2110.", "description": "EESC2009 is a fundamental field-based course introducing elementary concepts of past Earth’s processes and environmental changes. It also covers important aspects of plate tectonics, different rock types, geological deformation, geomorphology and environmental changes, natural hazards and human impacts. The principal goal of this course is to let students understand how the present geological records and landforms reveal the past tectonic movements and affect the human urban planning. Students are trained to observe, describe and discuss field features, with the help of field tools (e.g. compasses-clinometer and GPS receiver). Basic skills of field techniques, interpreting geologic maps and making field notes are introduced to assist students acquiring field data and discuss possible geologic processes. A field report from each group is required to summarize the field study logically. Field locations of this course may change from year to year. All students are welcome, but priority will be given to students who have taken EESC1001.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "2010", "title": "Solid Earth Dynamics", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "Lecture\nInteractive Tutorial", "campus": "Main Campus", "academic_group": "Dept of Earth & Environ Sci", "requirements": "Not for students who have taken ESSC2010.", "description": "This course presents an integrated introduction to the solid earth system stressing the geological, chemical, physical, and biological interactions among the lithosphere, hydrosphere and cryosphere. The course applies basic scientific and mathematical concepts to explain the history and behaviour of the solid earth system. Geophysical and geochemical techniques for probing the interior of the earth are reviewed. Plate tectonics is introduced as a unifying theme to understand geodynamic processes. The course includes discussions of topics that are relevant to society, resources and sustainability, such as the physical and chemical basis of natural hazards (earthquakes, tsunami, landslides) and their mitigation, and the impact of geological processes on the global environment.", "outcome": "This course will contribute to the understanding of the dynamics of the solid Earth system, specifically the lithosphere, hydrosphere and cryosphere, as well as their interaction. The students should be able to: 1) describe and use the scientific process, explain how theories are built upon earth system observations, and how both are tested and revised; 2) explain how fundamental physical, chemical, and biological principles govern specific earth system processes; 3) participate knowledgeably and intelligently in discussions of public policy related to earth system science, particularly with respect to natural hazards, resources, environment and sustainable development; 4) work effectively in a team, and present information in a clear, concise and logical manner.", "syllabus": "TopicsIntroduction and Earth in the universePlate TectonicsEarth material: MineralsLab 1: MineralsEarth material: RocksLab 2 and Lab 3: RocksCrustal deformation and mountain buildingGeochronologyEarthquakes and TsunamiGeologic Field Trip to Tung Ping ChauGeophysics: Global SeismologyVolcanosGeophysics: Global SeismologyGeophysics: Gravity and geomagnetic fieldsGlaciersGlobal changes", "required_readings": "Stephen Marshak, Essencials of geology (4th eds), New York : W W Norton, 2013", "recommended_readings": " Brian J. Skinner & Barbara W. Murck (3rd Eds.). The Blue Planet: An Introduction to Earth System Science, John Wiley & Sons Inc., New York (2009). John Grotzinger , Thomas H. Jordan , Frank Press & Raymond Siever (6th Eds.). Understanding Earth, W.H. Freeman, San Francisco (2010). Stephen Marshak (3rd Eds.) Earth: Portrait of a Planet, W.W. Norton, New York (2007).", "terms": {"2024-25 Term 2": {"--LEC (7778)": {"startTimes": ["9:30", "9:30"], "endTimes": ["10:15", "11:15"], "days": [3, 1], "locations": ["Institute of Chin Studies L1", "Fung King Hey Bldg Swire Hall1"], "instructors": ["Dr. TAM Pui Yuk, \n\nProfessor ZHAN Yan", "Dr. TAM Pui Yuk, \n\nProfessor ZHAN Yan"], "meetingDates": ["6/1", "8/1", "13/1", "15/1", "20/1", "22/1", "27/1", "5/2", "10/2", "12/2", "17/2", "19/2", "24/2", "26/2", "10/3", "12/3", "17/3", "19/3", "24/3", "26/3", "31/3", "2/4", "7/4", "9/4", "14/4", "16/4"]}, "-T01-TUT (7792)": {"startTimes": ["10:30"], "endTimes": ["11:15"], "days": [3], "locations": ["Institute of Chin Studies L1"], "instructors": ["Dr. TAM Pui Yuk, \n\nProfessor ZHAN Yan"], "meetingDates": ["8/1", "15/1", "22/1", "5/2", "12/2", "19/2", "26/2", "12/3", "19/3", "26/3", "2/4", "9/4", "16/4"]}}}, "assessments": {"Essay test or exam": "30", "Lab reports": "30", "Presentation": "10", "Short answer test or exam": "30"}}, {"code": "2020", "title": "Climate System Dynamics", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "Lecture\nInteractive Tutorial", "campus": "Main Campus", "academic_group": "Dept of Earth & Environ Sci", "requirements": "Not for students who have taken ESSC2020.", "description": "This course presents an integrated introduction to the climate system, stressing the dynamics of the atmosphere and its physical and chemical interactions with the hydrosphere, biosphere and geosphere. The course applies basic scientific and mathematical principles to explain the history, current state and future projection of weather and climate, natural hazards (e.g., typhoons, floods), and global climate change in the context of natural variability and anthropogenic influence. Topics include Earth’s energy balance, climate feedback, convection and clouds, general circulation of the atmosphere and ocean, biogeochemistry and global carbon cycle, roles of vegetation and ecosystems, and historical and future climate change. Student taking this course are expected to have taken PHYS1111, CHEM1070 and MATH1010 or equivalent.", "outcome": "This course will contribute to the understanding of the dynamics of the climate system, specifically the atmosphere, hydrosphere, biosphere and solid earth, as well as their interactions. The students should be able to: 1) describe and use the scientific processes, explain how theories are built upon earth system observations, and how both are tested and revised; 2) explain how fundamental physical and chemical principles govern specific climate system processes; 3) participate knowledgeably and intelligently in discussions of public policy related to earth system science, particularly with respect to extreme weather events, global climate change and sustainable development; 4) work effectively in a team, and present information in a clear, concise and logical manner.", "syllabus": "TopicsIntroduction; overview of the climate systemPart I: Energy Balance of the EarthBasic radiation physics; energy balance of the Earth; greenhouse effectSimple climate model; radiative forcing, climate sensitivity and climate feedbackLab 1: Climate sensitivity and feedback in a simple climate modelClimate variability and climate change; roles of aerosols; meridional structure of the atmospherePart II: Dynamics of the AtmosphereVertical structure of the atmosphere; Newton’s second law; pressure and hydrostatic balance; barometric lawConvection; first law of thermodynamics; dry adiabatic lapse rate; atmospheric stabilityPotential temperature; water content in air; moist convection and cloud formationLab 2: Conservation of angular momentum on a rotating EarthCoriolis force; pressure gradient force; horizontal momentum equations; geostrophic balanceThermal wind balance; atmospheric fronts and jet stream; surface friction and ageostrophic flowGeneral circulation of the atmosphere; Hadley circulation in the tropics; baroclinic eddies and midlatitude weather systemsLab 3: Introduction to weather analysis and forecastField trip to Hong Kong ObservatoryPart III: Ocean and ClimateOverview of ocean circulation; Ekman transport and wind-driven circulationEffect of Ekman transport on the interior ocean; western boundary currents; thermohaline circulationOcean heat buffer and transport; El Niño-Southern Oscillation; tropical cyclonesPart IV: Ecosystems and ClimateFluxes in biosphere-atmosphere interactions; surface energy balance; evapotranspiration and photosynthesis; biogeophysical feedbacksBiogeochemical reservoirs and residence times; carbon and nutrient cycling in ecosystems; geological carbon cycleContemporary carbon cycle; marine carbonate chemistry; biological bump; ocean biogeochemical feedbacksLab 4: Global carbon cycleGlobal carbon budget; terrestrial carbon sink and biogeochemical feedbacksPart V: Past, Present and Future ClimateClimate throughout Earth’s history; atmosphere of the early Earth; from Cretaceous to ice ages; recent 20,000 yearsRecent climate change: observations and attributionFuture climate projections; impacts of climate change; where do we go from here?", "required_readings": "J. Marshall and R.A. Plumb (2007): Atmosphere, Ocean, and Climate Dynamics: An Introductory Text, First Edition, Academic Press.", "recommended_readings": " M.E. McElroy (2002): The Atmospheric Environment: Effects of Human Activity, First Edition, Princeton University Press. J.M. Wallace and P.V. Hobbs (2006): Atmospheric Science: An Introductory Survey, Second Edition, Academic Press.  ", "terms": {"2024-25 Term 1": {"--LEC (6677)": {"startTimes": ["13:30", "13:30"], "endTimes": ["15:15", "14:15"], "days": [2, 4], "locations": ["Lady Shaw Bldg C3", "Fung King Hey Bldg Swire Hall1"], "instructors": ["Dr. LI Kwan Kit Ronald, \n\nProfessor TAI Pui Kuen Amos", "Dr. LI Kwan Kit Ronald, \n\nProfessor TAI Pui Kuen Amos"], "meetingDates": ["3/9", "5/9", "10/9", "12/9", "17/9", "19/9", "24/9", "26/9", "3/10", "8/10", "10/10", "15/10", "17/10", "22/10", "24/10", "29/10", "31/10", "5/11", "7/11", "12/11", "14/11", "19/11", "21/11", "26/11", "28/11"]}, "-T01-TUT (8298)": {"startTimes": ["14:30"], "endTimes": ["15:15"], "days": [4], "locations": ["Fung King Hey Bldg Swire Hall1"], "instructors": ["Dr. LI Kwan Kit Ronald, \n\nProfessor TAI Pui Kuen Amos"], "meetingDates": ["5/9", "12/9", "19/9", "26/9", "3/10", "10/10", "17/10", "24/10", "31/10", "7/11", "14/11", "21/11", "28/11"]}}}, "assessments": {"Essay test or exam": "35", "Homework or assignment": "20", "Lab reports": "15", "Presentation": "5", "Short answer test or exam": "25"}}, {"code": "2030", "title": "Computational Earth and Environmental Sciences", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "Lecture\nInteractive Tutorial", "campus": "Main Campus", "academic_group": "Dept of Earth & Environ Sci", "requirements": "Not for students who have taken CSCI1040, CSCI2040 or ESSC2030.", "description": "This course covers basic computation skills which are important to modern Earth and Environmental Sciences research and data analysis. Topics include the basic Python language syntax; programming flow control; usage of functions; file input/output modules; data visualisation; atmospheric science applications; geoscience applications and basic machine learning applications in earth and environmental sciences. Python 3 will be used throughout the course. Examples and tutorials will be based on various problems in Earth and Environmental Sciences using actual observational or in-situ data.", "outcome": "Students will obtain basic skills in coding for the tasks in different earth science problems. This includes data acquisition, selection and manipulation in geophysical and environmental problems. They will also learn specific Python modules in science applications.", "syllabus": " Installation and Basics Methods, Functions, and Numpy Booleans, If-then-else Statement For Loop and While Loop, Try-except Self-defined Functions, Programming Style File IO with Pandas and Xarray Data Visualization with Matplotlib Scientific Computing with Scipy", "required_readings": "Refer to the course syllabus distributed in the class.", "recommended_readings": "These are some recommended reference, https://docs.python.org/3.8/tutorial/ https://www.earthdatascience.org/courses/intro-to-earth-data-science/ https://www.colorado.edu/earthlab/learn-python-free-online-earth-data-science-tutorials", "terms": {"2024-25 Term 2": {"--LEC (7233)": {"startTimes": ["11:30", "14:30"], "endTimes": ["13:15", "15:15"], "days": [1, 2], "locations": ["Mong Man Wai Bldg 705", "Mong Man Wai Bldg 705"], "instructors": ["Dr. AU-YEUNG Yee Man", "Dr. AU-YEUNG Yee Man"], "meetingDates": ["6/1", "7/1", "13/1", "14/1", "20/1", "21/1", "27/1", "4/2", "10/2", "11/2", "17/2", "18/2", "24/2", "25/2", "10/3", "11/3", "17/3", "18/3", "24/3", "25/3", "31/3", "1/4", "7/4", "8/4", "14/4", "15/4"]}, "-T01-TUT (7793)": {"startTimes": ["15:30"], "endTimes": ["16:15"], "days": [2], "locations": ["Mong Man Wai Bldg 705"], "instructors": ["Dr. AU-YEUNG Yee Man"], "meetingDates": ["7/1", "14/1", "21/1", "4/2", "11/2", "18/2", "25/2", "11/3", "18/3", "25/3", "1/4", "8/4", "15/4"]}}}, "assessments": {"Examination": "30", "Homework or assignment": "60", "Participation": "10"}}, {"code": "2110", "title": "Geoscience Field Study", "career": "Undergraduate", "units": "1.00", "grading": "Graded", "components": "Field Studies/Field-trip\nLecture\nProject\nInteractive Tutorial", "campus": "Main Campus", "academic_group": "Dept of Earth & Environ Sci", "requirements": "Not for students who have taken ESSC2110.", "description": "EESC2110 is a fundamental field-based course introducing elementary concepts of past Earth’s processes and environmental changes. It also covers important aspects of plate tectonics, different rock types, geological deformation, geomorphology and environmental changes, natural hazards and human impacts. The principal goal of this course is to let students understand how the present geological records and landforms reveal the past tectonic movements and affect the human urban planning. Students are trained to observe, describe and discuss field features, with the help of field tools (e.g. compasses-clinometer and GPS receiver). Basic skills of field techniques, interpreting geologic maps and making field notes are introduced to assist students acquiring field data and discuss possible geologic processes. A field report from each group is required to summarize the field study logically. Field locations of this course may change from year to year. All students are welcome, but priority will be given to students who have taken EESC1001.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "2119", "title": "Intermediate Earth and Environmental Field Study I", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "Field Studies/Field-trip\nLecture\nOthers\nInteractive Tutorial", "campus": "Main Campus", "academic_group": "Dept of Earth & Environ Sci", "requirements": "Not for students who have taken EESC2120, EESC2130, ESSC2120 or ESSC2130. Pre-requisite: EESC2010 or ESSC2010.", "description": "Field study of current landform and geological features is the key to reveal past Earth’s processes and environmental changes. This also provides data for further studies on natural hazards. EESC2119 is an intermediate level, field-based course of the Earth and Environmental Sciences Programme. It covers important aspects of atmospheric sciences, plate tectonics, volcanoes, deformation structures, sedimentology, coastal features, earthquakes and associated present-day infrastructures. The principal goal of this course is to let students study major atmospheric sciences, geological features and understand how tectonic movement and atmospheric phenomenon contribute to the current different landforms, disasters and urban planning. Students are trained to observe, describe and discuss field features. Basic skills of using field tools (e.g. compasses-clinometer), studying geologic maps and making field notes are introduced to help students acquire field data and analyze possible atmospheric phenomenon and geologic processes. A field report is required to summarize the field study logically. The field location and term of offer of this course may change from year to year. Due to limited quota, priority will be given to students who have taken EESC2010 and passed the pre-enrolment quiz.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "2120", "title": "Integrated Geoscience Field Study", "career": "Undergraduate", "units": "2.00", "grading": "Graded", "components": "Field Studies/Field-trip\nLecture\nOthers\nInteractive Tutorial", "campus": "Main Campus", "academic_group": "Dept of Earth & Environ Sci", "requirements": "Not for students who have taken ESSC2120. Pre-requisite: (EESC2010 or ESSC2010) and (EESC2020 or ESSC2020).", "description": "Field study of current landform and geological features is the key to reveal past Earth’s processes and environmental changes. This also provides data for further studies on natural hazards. EESC2120 is a fundamental level, field-based course of the Earth and Environmental Sciences Programme. It covers important aspects of atmospheric sciences, plate tectonics, volcanoes, deformation structures, sedimentology, coastal features, earthquakes and associated present-day infrastructures. The principal goal of this course is to let students study major atmospheric sciences, geological features and understand how tectonic movement and atmospheric phenomenon contributes to the current different landforms, disasters and urban planning. Students are trained to observe, describe and discuss field features. Basic skills of using field tools (e.g. compasses-clinometer), studying geologic maps and making field notes are introduced to help students acquire field data and analyze possible atmospheric phenomenon and geologic processes. A field report is required to summarize the field study logically. The field location and term of offer of this course may change from year to year. Due to limited quota, priority will be given to students who have taken EESC2010 and will enroll in EESC3110.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "2129", "title": "Intermediate Earth and Environmental Field Study II", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "Field Studies/Field-trip\nLecture", "campus": "Main Campus", "academic_group": "Dept of Earth & Environ Sci", "requirements": "Pre-requisite: (EESC2010 or ESSC2010) and passed a Quiz, or with course coordinator's approval.", "description": "EESC2129 is designed to provide students with fundamental geological field techniques and the application of geological and environmental concepts specific to the region of Hong Kong. The course aims to deepen students' understanding of the local geology, including its formation processes, tectonic history, and its relationship with the environment. By the end of the course, students will have acquired a solid background in local geology and geomorphology. The course emphasizes hands-on training and practical skills development. Students will learn essential geological field techniques, including map reading, gathering geological data, making field observations, and jotting geological field notes. They will also develop critical thinking skills through the analysis and interpretation of geological data. Additionally, the course includes training in life-saving skills to ensure students' safety during fieldwork. EESC2129 consists of a 10-day local field study and five pre-trip lectures. The field study provides an immersive experience where students will directly apply the knowledge and techniques learned in the classroom to real geological settings in Hong Kong. The pre-trip lectures serve as a preparatory phase, covering relevant theoretical concepts, field methodologies, and safety protocols. Following the field study, two post-trip discussions will provide an opportunity for students to share their findings, and engage in further analysis and interpretation. Successful completion of EESC2129 requires continuous teamwork and independent assignments. Students will be expected to collaborate with their peers during fieldwork, share responsibilities, and contribute to group discussions. Additionally, independent assignments will be assigned to reinforce students' understanding of the course material and encourage individual exploration of specific geological topics.Note: This course may involve physical activities and fieldwork in outdoor environments. Students are advised to comply with safety guidelines, follow instructions from instructors, and maintain appropriate fitness levels to ensure a safe and enriching learning experience.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "2130", "title": "Fundamental Geoscience Fieldwork", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "Field Studies/Field-trip\nLecture\nOthers\nInteractive Tutorial", "campus": "Main Campus", "academic_group": "Dept of Earth & Environ Sci", "requirements": "Not for students who have taken ESSC2130. Pre-requisite: EESC2010 or ESSC2010.", "description": "Field study of current landform and geological features is the key to reveal past Earth’s processes and environmental changes. This also provides data for further studies on natural hazards. EESC2130 is a fundamental level, field-based course of the Earth and Environmental Sciences Programme. It covers important aspects of atmospheric sciences, plate tectonics, volcanoes, deformation structures, sedimentology, coastal features, earthquakes and associated present-day infrastructures. The principal goal of this course is to let students study major atmospheric sciences, geological features and understand how tectonic movement and atmospheric phenomenon contribute to the current different landforms, disasters and urban planning. Students are trained to observe, describe and discuss field features. Basic skills of using field tools (e.g. compasses-clinometer), studying geologic maps and making field notes are introduced to help students acquire field data and analyze possible atmospheric phenomenon and geologic processes. A field report is required to summarize the field study logically. The field location and term of offer of this course may change from year to year. Due to limited quota, priority will be given to students who have taken EESC2010 and passed the pre-enrolment quiz.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "2270", "title": "Introduction to Environmental Science", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Dept of Earth & Environ Sci", "requirements": "Not for students who have taken ENSC2270.", "description": "This course deals with the relationships between living organisms, resources and environment. The basic multidisciplinary concepts of sustainable development, human population and health risk, conservation of resources, climate change, environmental degradation, pollution control, biodiversity, solid waste and waste water management, etc, will be introduced. Concepts of think globally, act locally will be introduced the importance of acting as a global citizen to help solving environmental problems with an innovative mind to design new policy or technology. Case studies and field trips are included to illustrate various environmental issues using a multidisciplinary approach with emphasis on how modern technology can have significant societal impacts and responsibility.", "outcome": "The students shall be able to understand the basic knowledge in current environmental problems, including natural conservation, pollution control, waste management and problems arisen from environmental deterioration, sustainable development, after taking this course.", "syllabus": " Sustainable Development Population and Resources Climate Change and Energy Policy Environmental Pollution & Health Group Presentations on RESOURCES Environmental Monitoring & Assessment Water Quality Control Sewage Treatment Green Chemistry Biodiversity Conservation Environmental Protection (I): Solid Waste Treatment Environmental Protection (II): Air Pollution and Control Environmental Remediation and Biotechnology", "required_readings": " Cunningham WP, Cunningham MA, Saigo B (2008) Environmental Science-A Global Concern. 10th ed., McGraw-Hill, 618p. GE105.C86 2008 (RESERVED at UL) Cunningham WP, Cunningham MA (2009) Environmental Science-A Global Concern. 11th ed., McGraw-Hill, 618p. (Available from university bookstore)  ", "recommended_readings": " Masters GM, Ela WP (2007) Introduction to Environmental Engineering and Science, 3rd ed. Prentice Hall, 720p. 145.M33 1998 (second edition available from UL, RESERVED) Miller Jr. GT, Spoolman SE (2009) Living in the Environment. Principles, Connections and Solutions. 16th ed., Brooks/Cole, Belmont, CA, USA GE105.M547 2009 (RESERVED at UL) Spiro, TG, Stigliani WM (2003) Chemistry of the Environment, 2nd Ed., Prentice Hall, New Jersey, 489p. TD193.S7 2003 (RESERVED at UL)", "terms": {"2024-25 Term 2": {"--LEC (7234)": {"startTimes": ["8:30"], "endTimes": ["11:15"], "days": [5], "locations": ["Y.C. Liang Hall G04"], "instructors": ["Dr. CHAN Ka Long Donald, \n\nDr. LAU Yee Wai, \n\nDr. ZHANG Li"], "meetingDates": ["10/1", "17/1", "24/1", "7/2", "14/2", "21/2", "28/2", "14/3", "21/3", "28/3", "11/4"]}}}, "assessments": {"Fieldwork or field study": "5", "Homework or assignment": "15", "Report": "20", "Short answer test or exam": "50", "Selected response test or exam": "10"}}, {"code": "2515", "title": "Environmental Chemistry", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Dept of Earth & Environ Sci", "requirements": "Not for students who have taken ENSC2515. Pre-requisite: EESC2270 or ENSC2270 or permission of the instructor.", "description": "This is a foundation course designed to equip students with a proper understanding of the fundamental aspects of environmental chemistry. It introduces the basic concept of chemical equilibrium and kinetics, the nature and characteristics of various common types of air and water pollution arising from industrial, agricultural and domestic sources. It outlines the principles of measurement for various parameters commonly used for air and water pollution studies, their significance and limitations. It also examines various types of aerial emission arising from combustion and industrial processes, and vehicles, and their chemical interaction leading to various global environmental issues such as the formation of photochemical smog, depletion of ozone layer and global warming effects.", "outcome": "Students who have finished this course are expected to understand: some basic concepts in chemistry ranging from atomic structure and chemical bonding to the basic principle of coordination chemistry of the transition metals, and thermodynamics and kinetics. aquatic chemistry which includes solubility, acid-base reactions, complexation equilibria, and redox reactions. the chemistry of common pollutants in natural water systems. atmospheric chemistry with emphasis on chemical and photochemical processes occurring in the atmosphere. the chemistry of common air pollutants. the chemistry of soil including its composition, essential nutrients in soil, the chemistry of fertilizers, and acid-base and ion-exchange reactions in soil.Student will understand key ideas on these topics and understand various local and global environmental problems through a case-study approach.", "syllabus": "  Some basic concepts in chemistry  Aquatic chemistry  Water pollution  Atmospheric chemistry  Air pollution  Environmental Geochemistry", "required_readings": " Cunningham WP, Cunningham MA, Saigo B (2008) Environmental Science-A Global Concern. 10th ed., McGraw-Hill, 618p. GE105.C86 2008 (RESERVED at UL) Cunningham WP, Cunningham MA (2009) Environmental Science-A Global Concern. 11th ed., McGraw-Hill,618p. (Available from university bookstore)", "recommended_readings": " Masters GM, Ela WP (2007) Introduction to Environmental Engineering and Science, 3rd ed. Prentice Hall,720p. 145.M33 1998 (second edition available from UL, RESERVED) Miller Jr. GT, Spoolman SE (2009) Living in the Environment. Principles, Connections and Solutions. 16th ed., Brooks/Cole, Belmont, CA, USA GE105.M547 2009 (RESERVED at UL) Spiro, TG, Stigliani WM (2003) Chemistry of the Environment, 2nd Ed., Prentice Hall, New Jersey, 489p. TD193.S7 2003 (RESERVED at UL)", "terms": {"2024-25 Term 1": {"--LEC (7538)": {"startTimes": ["8:30"], "endTimes": ["11:15"], "days": [3], "locations": ["T.C. Cheng Bldg 201"], "instructors": ["Professor LEE Hung Kay"], "meetingDates": ["4/9", "11/9", "25/9", "2/10", "9/10", "16/10", "23/10", "30/10", "6/11", "13/11", "20/11", "27/11"]}}}, "assessments": {"Homework or assignment": "15", "Short answer test or exam": "50", "Selected response test or exam": "35"}}, {"code": "2517", "title": "Environmental Chemistry Laboratory", "career": "Undergraduate", "units": "2.00", "grading": "Graded", "components": "Laboratory", "campus": "Main Campus", "academic_group": "Dept of Earth & Environ Sci", "requirements": "Not for students who have taken ENSC2517. Co-requisite: EESC2515 or ENSC2515 or permission of the instructor.", "description": "This is a foundation chemistry laboratory course designed to accompany EESC2515. This course illustrates the fundamental principles and basic techniques in general environmental chemistry. Laboratory work covers a range of experiments, including acid-base reactions, chemical thermodynamics and kinetics, complexation equilibria, coordination chemistry of the transition metals, and analysis of air pollutants. Students who finish this course are expected to be familiar with the general techniques in conducting chemistry experiments and the use of simple instruments such as IR and UV–Vis spectrophotometers. They will also learn how to design of experiments and report experimental data in scientific reports. The assessment scheme of this course is based on students' performance in conducting experiments and report writing.", "outcome": "Students who have finished this course are expected to: be familiar with the general techniques in conducting chemistry experiments; be familiar with the use of common instruments such as IR and UV-Vis spectrophotometers; learn how to report and analyze scientific data, and write up scientific reports; understand some basic principles of chemistry ranging from acid-base reactions, thermodynamics and kinetics, complexation equilibria, to coordination chemistry of the transition metals; learn how to design and plan experiments, acquire hands-on experience in analyzing common environmental pollutants.", "syllabus": "Experiment List: Synthesis of Alum Crystals from Scrap Metal Rates of Chemical Reactions Alkalinity of Water Total Phosphorus Content in Polluted Water Determination of the Iron Content in a Vitamin Tablet (a) Tyndall Effect in Starch and Gelatin Colloids, (b) Infra-Red Analysis of CuC12-DMSO Complex Determination of Total Aldehydes in Indoor Environment with Impinger Sampling Sampling of NOx (NO+NO2) and Particulates", "required_readings": " S. E. Manahan, Environmental Chemistry, 7th Ed., Lewis publishers, Boca Raton, 2000. N. J. Bunce, Introduction to Environmental Chemistry, Wuerz Publishing, Winnipeg, 1993. P. E. Buell and J. E. Girard, Chemistry: An Environmental Perspective, Prentice Hall, Englewood Cliffs, 1994.", "recommended_readings": "Refer to the course syllabus distributed in the class.", "terms": {"2024-25 Term 1": {"-L01-LAB (6164)": {"startTimes": ["14:30"], "endTimes": ["18:15"], "days": [1], "locations": ["Science Centre 257"], "instructors": ["Dr. LO Chui Man"], "meetingDates": ["2/9", "9/9", "16/9", "23/9", "30/9", "7/10", "14/10", "21/10", "28/10", "4/11", "11/11", "18/11", "25/11"]}}}}, {"code": "2520", "title": "Elementary Methods for Earth and Environmental Sciences", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "Lecture\nInteractive Tutorial", "campus": "Main Campus", "academic_group": "Dept of Earth & Environ Sci", "requirements": "Pre-requisite: (MATH1520 or MATH1010) or permission of instructor.", "description": "The course provides a survey of elementary analytical quantitative and qualitative methods commonly used in earth and environmental sciences, with applications in geophysics, geophysical/environmental fluid dynamics, as well as related aspects in thermodynamics and wave physics. Teaching aided by numerical programming is adopted and emphasized, in addition to analytical understanding of these methods. Typical examples include heat conduction on earth surface, seismic and ocean waves, air pollution, geodynamics, and atmospheric dynamics.", "outcome": " An understanding of elementary quantitative methods used in earth and environmental sciences. Appreciation of how physical principles in earth and environmental sciences are formulated quantitatively,  Knowledge of the application of elementary methods in solving problems in earth and environmental sciences. ", "syllabus": " Basic solid Mechanics: Equation of motions of solid, Hooke’s law, plane strain and plane stress problems, Airy stress function (biharmonic equations), bending of beam and plates (nonhomogeneous biharmonic equation), Solution method of elasticity, Helmholtz decomposition theorem for displacement field, use of gradient, divergence and curl in formulating Lame strain potential and Love’s potential.  Geodynamics: Heat conduction in earth, Fourier law of heat conduction, error functions, instantaneous cooling of the half-space, age of the earth; lithospheric bending and folding.    Seismicity: single degree of oscillator, response spectrum, Helmholtz decomposition for velocity vectors, use of gradient, divergence and curl in formulating compression and shear wave equations. Rayleigh wave as surface wave; 2-D waves versus 3-D waves; Analysis of seismic signals using Fourier transforms, physical meaning of phase shift, physical meaning of Fourier transform magnitude. Basic fluid Mechanics: Circulation and vorticity, Helmholtz theorem, Kelvin circulation theorem and their implications, conservation of mass, derivation of Navier-Stokes equation, stream function for potential flow theory; Geophysical flows: Coriolis force as function of latitude, geophysical scaling, Rossby number, Ekman number, and Reynold’s number; turbulent diffusion in fluids and atmosphere, Duhamel integral for time varying boundary condition, Taylor’s point source solution (1-D, 2-D and 3-D cases), pollutant diffusion in river, ocean, and atmosphere; Ogata-Banks solution; Gaussian plume model for smoke diffusion; Kelvin-Helmholtz instability. Atmospheric flows: vortex models, maximum wind speed in tornadoes, maximum wind speed in typhoons, eyewall dynamics, buoyance instability in atmosphere; Taylor-Proudman theorem; radiative transfer equation (integro-differentiation equation) and climate change, use of radiative transfer model in remote sensing data assimilation and numerical weather forecast.   Ocean waves: Perturbation theory and Stokes wave theory, stream functions, Airy’s wave theory, shallow water and deep- water limits, dispersion relation, shallow water equation, conical theory for ocean waves, solitary wave or solitons. storm surges (inverse barometer effect, moving depression effect, wind-induced surge).  ", "required_readings": " Chau K.T. (2013). Analytic Methods in Geomechanics. CRC Press, Boca Raton.  Chau K.T. (2018). Theory of Differential Equations in Engineering and Mechanics, CRC Press, Boca Raton.   Chau K.T. (2019). Applications of Differential Equations in Engineering and Mechanics, CRC Press, Boca Raton.", "recommended_readings": " K.T. Chau, Theory of Differential Equations in Mechanics and Engineering (CRC Press, 2017). K.T. Chau, Applications of Differential Equations in Mechanics and Engineering (CRC Press, 2019). M. L. Boas, Mathematical Methods in the Physical Sciences (3rd ed.,Wiley, 2005) E. Kreyszig, Advanced Engineering Mathematics (9th ed., Wiley, 2006). S. J .Farlow, Partial Differential Equations for Scientists and Engineers (Wiley, 1983). R.V. Church and J.W. Brown, Fourier Series and Boundary Value Problems (7th ed., McGraw-Hill, 2008).  W.E. Boyce and R.C. DiPrima, Elementary Differential Equations and Boundary Value Problems (10th ed., Wiley 2012).    E. Kreyszig, Advances Engineering Mathematics (9th ed., Wiley, 2006).", "terms": {"2024-25 Term 1": {"--LEC (7474)": {"startTimes": ["11:30", "11:30"], "endTimes": ["13:15", "12:15"], "days": [1, 3], "locations": ["Mong Man Wai Bldg 704", "Mong Man Wai Bldg 706"], "instructors": ["Professor CHAU Kam Tim", "Professor CHAU Kam Tim"], "meetingDates": ["2/9", "4/9", "9/9", "11/9", "16/9", "23/9", "25/9", "30/9", "2/10", "7/10", "9/10", "14/10", "16/10", "21/10", "23/10", "28/10", "30/10", "4/11", "6/11", "11/11", "13/11", "18/11", "20/11", "25/11", "27/11"]}, "-T01-TUT (8306)": {"startTimes": ["12:30"], "endTimes": ["13:15"], "days": [3], "locations": ["Mong Man Wai Bldg 706"], "instructors": ["Professor CHAU Kam Tim"], "meetingDates": ["4/9", "11/9", "25/9", "2/10", "9/10", "16/10", "23/10", "30/10", "6/11", "13/11", "20/11", "27/11"]}}}, "assessments": {"Examination": "50", "Homework or assignment": "20", "Test or quiz": "30"}}, {"code": "2701", "title": "Elementary Topics in Earth and Environmental Sciences", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Dept of Earth & Environ Sci", "requirements": "", "description": "State-of-the-art research methods, experimental, and computational techniques applied in elementary topics in Earth and Environmental Sciences.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "2800", "title": "Introduction to Environmental Engineering", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "Lecture\nInteractive Tutorial", "campus": "Main Campus", "academic_group": "Dept of Earth & Environ Sci", "requirements": "Not for students who have taken ESSC2800. Pre-requisite: MATH1010 or 1510 or 1520.", "description": "This is a multidisciplinary course introducing the fundamental physical, chemical and biological principles necessary for understanding the natural and built environments, with an emphasis on reliable water and food supplies, pollution mitigation, waste management, energy resources, climate change, and sustainable development. Examples of engineering solutions to tackle some of these resource and environmental issues are presented. Field trips are included to illustrate interesting case studies. Topics include: conservation principles for mass, energy and momentum in the environmental systems; basic environmental chemistry, hydrology and ecology; risk assessment; and basic principles of water resource engineering, solid waste treatment, noise pollution, air pollution control, climate change adaptation and mitigation, and the interplay between energy consumption and the environment.", "outcome": " Understand the basic physical, chemical and biological principles governing the various resource and environmental issues of our society. Be able to use basic mathematical methods to assess environmental risks and the feasibility of various engineering solutions to resource and environmental problems. Be able to participate knowledgeably and intelligently in discussion of public policy related to global and regional resource and environmental issues including the food-water-energy crisis, water and air pollution, global climate change, and hazardous wastes. Be able to work effectively in a team, and present information in a clear, concise and logical manner.  ", "syllabus": "Part I: Physical and Chemical Fundamentals1.    Mass transport and balance (2 lecture-hours)2.    Energy transport, balance and thermodynamics (3 lecture-hours)3.    Basic environmental chemistry and chemical kinetics (3 lecture-hours)4.    Ecosystem and population dynamics (3 lecture-hours)5.    Risk assessment tools (3 lecture-hours)Part II: Water Resources and Pollution6.    Basic hydrology (2 lecture-hours)7.    Water resources management and optimization (3 lecture-hours)8.    Water pollution: principles (2 lecture-hours)9.    Water pollution: control measures (3 lecture-hours)Part III: Solid Waste Management and Noise Pollution10.    Principles and measures of solid waste management (3 lecture-hours)11.    Principles and measures of noise pollution (2 lecture-hours)Part IV: Air Pollution and Climate Change12.    Atmospheric chemical composition and processes (3 lecture-hours)13.    Air pollution control measures (2 lecture-hours)14.    Climate change: principles, observations and projections (3 lecture-hours)15.    Climate change adaptation and mitigation (2 lecture-hours)", "required_readings": "Gilbert M. Masters and Wendell P. Ela (2007): Introduction to Environmental Engineering and Science (3rd Edition), Prentice Hall.", "recommended_readings": "Mackenzie Davis and David Cornwell (2012): Introduction to Environmental Engineering (5th Edition), McGraw-Hill Education.", "terms": {"2024-25 Term 1": {"--LEC (7233)": {"startTimes": ["15:30", "15:30"], "endTimes": ["17:15", "16:15"], "days": [2, 4], "locations": ["William M W Mong Eng Bldg 407", "Humanities Building 115"], "instructors": ["Dr. AU-YEUNG Yee Man", "Dr. AU-YEUNG Yee Man"], "meetingDates": ["3/9", "5/9", "10/9", "12/9", "17/9", "19/9", "24/9", "26/9", "3/10", "8/10", "10/10", "15/10", "17/10", "22/10", "24/10", "29/10", "31/10", "5/11", "7/11", "12/11", "14/11", "19/11", "21/11", "26/11", "28/11"]}, "-T01-TUT (8311)": {"startTimes": ["16:30"], "endTimes": ["17:15"], "days": [4], "locations": ["Humanities Building 115"], "instructors": ["Dr. AU-YEUNG Yee Man"], "meetingDates": ["5/9", "12/9", "19/9", "26/9", "3/10", "10/10", "17/10", "24/10", "31/10", "7/11", "14/11", "21/11", "28/11"]}}}, "assessments": {"Essays": "10", "Essay test or exam": "40", "Homework or assignment": "30", "Selected response test or exam": "20"}}, {"code": "2909", "title": "Environmental Sciences Field Study I", "career": "Undergraduate", "units": "1.00", "grading": "Graded", "components": "Field Studies/Field-trip", "campus": "Main Campus", "academic_group": "Dept of Earth & Environ Sci", "requirements": "Pre-requisite: EESC2270.", "description": "This intensive 1-2 week, 1 credit course provides a unique opportunity for students to go on a comprehensive field trip to Southeast Asia or Belt and Road countries. The journey is designed to offer students a firsthand understanding of environmental sciences and the pressing issues that are currently shaping its discourse. Students will engage in an immersive ecotour, visiting diverse ecosystems, conservation sites, and areas grappling with environmental challenges. The trip aims to expose students to the realities of environmental science, allowing them to witness the dynamic interplay of ecological, socio-political, and economic factors that influence environmental policies and practices.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "3020", "title": "Analytical Methods for Earth and Environmental Sciences", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "Lecture\nInteractive Tutorial", "campus": "Main Campus", "academic_group": "Dept of Earth & Environ Sci", "requirements": "Not for students who have taken ESSC3020. Pre-requisite: (EESC2010 or ESSC2010) and (EESC2020 or ESSC2020), and (MATH2550), and (PHYS1001 or 1002 or 1111 or 1113), or permission of instructor.", "description": "The course provides a survey of various analytical techniques commonly employed in solving problems encountered in earth and environmental sciences. Typical examples include heat conduction on earth surface, seismic and ocean waves, air pollution, geodynamics, and atmospheric dynamics.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "3100", "title": "Structural Geology", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "Field Studies/Field-trip\nLaboratory\nLecture", "campus": "Main Campus", "academic_group": "Dept of Earth & Environ Sci", "requirements": "Not for students who have taken ESSC3100. Pre-requisite: EESC2010 or ESSC2010 or permission of instructor.", "description": "This course is an important part of the core Earth and Environmental Sciences Curriculum. It introduces the processes and products of rock deformation in three dimensions, ranging from micro- (micron) to macro- (kilometer) scales. It discusses geometries and mechanism of faults, folds, structural features of igneous, sedimentary and metamorphic rocks, and superposed deformations and introduces regional deformational history and tectonics. Structural geology in the field of resource exploration (petroleum and mineral deposits) is also introduced. Class lectures are supplemented by lab exercise and demonstrations as well as field trips to local or overseas outcrops.", "outcome": "Students are expected to gain the following abilities:1.  Understand the geometry of different geological structures2.  Use concepts of solid mechanics to interpret the kinematics and geometries of geological structure formation3.  Use graphical tools to compile and interpret structural data4.  Integrate topics in structural geology and plate tectonics through survey of scientific literatures5.  Make primary observations in the field and using them to construct and test structural hypothesesLectures focus on geometric, kinematic, and mechanical analysis of geological structures. Labs use geological maps, computers, stereonets, and physical analogs to illustrate these concepts. Students are encouraged to lead discussion of leading geological topics spread throughout the semester, each of which integrates recent class topics with large-scale active tectonics. Field trips in the second half of the semester encourage small-group discussion of observations and interpretations of deformational history of the field working area. The students will develop: 1) the ability to evaluate an issue critically based on evidence and scientific principle, 2) to acquire knowledge effectively by self-study and using information technology, and to work independently, 3) to work effectively in a team, and 4) to present information in a clear, concise and logical manner. The students also can acquire a responsible attitude in study and work, and have motivation for life-long learning.", "syllabus": "Refer to the course syllabus distributed in the class.", "required_readings": "Refer to the course syllabus distributed in the class.", "recommended_readings": " Haakon Fossen, Structural Geology, 2010, Cambridge University Press, ISBN-13: 9780521516648.  Ben A. van der Pluijm & Stephen Marshak, Earth Structure – An Introduction to Structural Geology and Tectonics, 2004, W. W. Norton & Company Inc., ISBN0-393-92467-X. Robert J. Twiss & Eldridge M. Moores, Structural Geology, Second Edition, 2006, W.H.Freeman & Co. Ltd., ISBN 13: 9780716749516. John Suppe, Principles of Structural Geology, 1985, Prentice-Hall, Inc., Englewood Cliffs, New Jersey 07362. ISBN: 0-13-710500-2. Passchier C.W.& Trouw R.A.J., Microtectonics, Second Edition, 2006, Springer. ISBN: 978-3-540-64003-5 (print) & 978-3-540-29359-0 (Online).", "terms": {"2024-25 Term 2": {"--LEC (5424)": {"startTimes": ["16:30", "13:30"], "endTimes": ["17:15", "15:15"], "days": [2, 1], "locations": ["Science Centre 331", "Science Centre 331"], "instructors": ["Dr. TAM Pui Yuk, \n\nProfessor ZHAN Yan", "Dr. TAM Pui Yuk, \n\nProfessor ZHAN Yan"], "meetingDates": ["6/1", "7/1", "13/1", "14/1", "20/1", "21/1", "27/1", "4/2", "10/2", "11/2", "17/2", "18/2", "24/2", "25/2", "10/3", "11/3", "17/3", "18/3", "24/3", "25/3", "31/3", "1/4", "7/4", "8/4", "14/4", "15/4"]}, "-L01-LAB (5715)": {"startTimes": ["17:30"], "endTimes": ["18:15"], "days": [2], "locations": ["Science Centre 331"], "instructors": ["Dr. TAM Pui Yuk, \n\nProfessor ZHAN Yan"], "meetingDates": ["7/1", "14/1", "21/1", "4/2", "11/2", "18/2", "25/2", "11/3", "18/3", "25/3", "1/4", "8/4", "15/4"]}}}, "assessments": {"Essay test or exam": "35", "Fieldwork or field study": "20", "Lab reports": "20", "Short answer test or exam": "25"}}, {"code": "3110", "title": "Geoscience Field Course", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "Field Studies/Field-trip\nLecture\nProject\nInteractive Tutorial", "campus": "Main Campus", "academic_group": "Dept of Earth & Environ Sci", "requirements": "Not for students who have taken ESSC3110. Pre-requisite: (EESC2010 or ESSC2010), and (EESC3100 or ESSC3100) or (EESC4120 or ESSC4120) or by instructor’s approval.", "description": "Understanding of Earth processes and environmental changes over geological time is highly dependent upon the experience and capabilities gained through doing fieldwork. EESC3110 is an intermediate level course of the Earth and Environmental Sciences Programme. It covers important aspects of field geology, including sedimentary, igneous and metamorphic petrology, tectonics, geophysics and surficial processes. The principal goal of this course is to train students to recognize different lithological units and their geometries in three dimensions, and understand the related tectonic environment and formation mechanism. Class lectures introduce basic skills of reading and interpreting geological maps, using geological equipment (i.e. Compass-clinometer, GPS receiver), and producing field notes and reports. Field projects include field observation and description, techniques of field data acquisition and analysis, sample collection, and geological map compilation. Field projects also focus on surficial processes (relatively occurring on short geological time scale), which are of environmental and ecological importance. The field location (either in mainland of China or overseas) may change from year to year.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "3120", "title": "Physics of the Earth", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "Lecture\nInteractive Tutorial", "campus": "Main Campus", "academic_group": "Dept of Earth & Environ Sci", "requirements": "Not for students who have taken ESSC3120. Pre-requisite: EESC 2010 or ESSC2010 or permission of instructor.", "description": "This course focuses on the concepts of the physics of the Earth to understand how the solid Earth works. Since 1960s, plate tectonics has been developed to explain observations on Earth such as mountain building, occurrence of earthquakes and volcanoes, as well as deposition of natural resources. The discovery of plate tectonics requires understanding of geophysical methods, which will be covered in this course. The topics covered include the Earth’s gravitational and magnetic fields, earthquake seismology, internal structure of the Earth, thermal and electrical properties, as well as geodynamics. Methods of geophysical survey will also be introduced.", "outcome": "At the completion of this course, the students will be able to know about Earth’s inner structure, composition, and thermal and electrical properties, understand principles of seismic wave propagation and earthquake physics, gain knowledge of gravity and geomagnetism, and have the ability to analyze the observation data for explanation of geophysical processes. The students will develop: 1) the ability to evaluate an issue critically based on evidence and scientific principle, 2) to acquire knowledge effectively by self-study and using information technology, and to work independently, 3) to work effectively in a team, and 4) to present information in a clear, concise and logical manner. The students also can acquire a responsible attitude in study and work, and have motivation for life-long learning.", "syllabus": "Plate tectonics: Magnetic field, Paleomagnetism, Plate motion and rotationSeismology: Earthquakes and plate boundaries, Earthquake location and magnitude, Earthquake energy andfocal mechanism, Wave propagation, Refraction and reflection seismologyGravity: Gravity and geoid, Gravity corrections, Gravity anomaly, IsostasyHeat: Heat flow, Heat conduction, Heat convection ", "required_readings": "Refer to the course syllabus distributed in the class.", "recommended_readings": " C. M. R. Fowler, 2005, The Solid Earth: An introduction to global geophysics, 2nd edition, 685 pp, Cambridge University Press.  D. L. Turcotte and G. Schubert, 2002, Geodynamics, 2nd edition, 472 pp, Cambridge University Press.", "terms": {"2024-25 Term 1": {"--LEC (7122)": {"startTimes": ["15:30", "15:30"], "endTimes": ["17:15", "16:15"], "days": [2, 4], "locations": ["Y.C. Liang Hall 106", "Mong Man Wai Bldg 705"], "instructors": ["Professor YANG Hongfeng", "Professor YANG Hongfeng"], "meetingDates": ["3/9", "5/9", "10/9", "12/9", "17/9", "19/9", "24/9", "26/9", "3/10", "8/10", "10/10", "15/10", "17/10", "22/10", "24/10", "29/10", "31/10", "5/11", "7/11", "12/11", "14/11", "19/11", "21/11", "26/11", "28/11"]}, "-T01-TUT (8124)": {"startTimes": ["16:30"], "endTimes": ["17:15"], "days": [4], "locations": ["Mong Man Wai Bldg 705"], "instructors": ["Professor YANG Hongfeng"], "meetingDates": ["5/9", "12/9", "19/9", "26/9", "3/10", "10/10", "17/10", "24/10", "31/10", "7/11", "14/11", "21/11", "28/11"]}}}, "assessments": {"Essay test or exam": "30", "Homework or assignment": "30", "Presentation": "20", "Short answer test or exam": "20"}}, {"code": "3130", "title": "Introduction to Seismic Data Processing", "career": "Undergraduate", "units": "3.00", "grading": "Pass (P)/Fail (U)", "components": "Project", "campus": "Main Campus", "academic_group": "Dept of Earth & Environ Sci", "requirements": "", "description": "This course that will be offered in the summer term aims to develop the students’ knowledge, skills, and interest in seismology, scientific computing, and seismic data processing. Topics include introduction to Linux command line, shell scripting, and Generic Mapping Tools (GMT); introduction to Seismic Analysis Code (SAC); how to use the various Incorporated Research Institutions for Seismology (IRIS) tools for data request and initial data exploration; and various methods to model and visualize seismic waveforms for earthquake and velocity structure studies.", "outcome": "Students will obtain basic skills in seismic data acquisition, processing, visualizing, and modeling that are fundamental to the field of seismology.", "syllabus": "Each week, a learning module will be assigned to the students for completion. This includes watching pre-recorded lectures and completing specific assignments to demonstrate their grasp of the lecture materials. There will be a final project where students will integrate what they have learnt throughout the semester to gain new scientific insights from analyzing seismic data. Linux command line Shell scripting Generic Mapping Tools (GMT) for plotting seismicity and velocity models Seismic Analysis Code (SAC) for seismic data visualization, processing, and analysis Incorporated Research Institutions for Seismology (IRIS) tools for data request and initial data exploration Seismic data visualization and modelling for earthquake source and velocity structure studies ObsPy: Python toolbox for seismology Jupyter Notebooks for code and results sharing", "required_readings": "Refer to the course syllabus distributed in the class.", "recommended_readings": "Refer to the course syllabus distributed in the class.", "terms": {"2024-25 Term 1": {"-J01-PRJ (7460)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["No Room Required"], "instructors": ["Professor TAN Yen Joe, \n\nProfessor YANG Hongfeng"], "meetingDates": ["02/09/2024 - 25/11/2024"]}}}, "assessments": {"Homework or assignment": "60", "Project": "40"}}, {"code": "3200", "title": "Atmospheric Dynamics", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "Lecture\nInteractive Tutorial", "campus": "Main Campus", "academic_group": "Dept of Earth & Environ Sci", "requirements": "Not for students who have taken ESSC3200. Pre-requisite: (EESC2020 or ESSC2020) and MATH2550, or permission of instructor.", "description": "This course introduces observations of and physical principles governing the circulation of the Earth’s atmosphere in relation to weather and climate. The topics covered include atmospheric composition and structure, convection, fundamentals of atmospheric motions, and the basic principles for weather and climate modeling. Physical principles covered include basic conservation laws, balanced flows, atmospheric thermodynamics, circulation and vorticity, atmospheric waves, and theories for various weather systems.", "outcome": "At the completion of this course, the students will be able to1) Gain fundamental concepts of atmospheric thermodynamics;2) Understand fundamental motions in the atmosphere;3) Develop the ability to analyze and explain observed atmospheric phenomena. (Course outcomes as related to Programme Learning Outcomes) -- The students will develop: 1) the ability to evaluate an issue critically based on evidence and scientific principle, 2) to acquire knowledge effectively by self-study and using information technology, and to work independently, 3) to work effectively in a team, and 4) to present information in a clear, concise and logical manner. The students also can acquire a responsible attitude in study and work, and have motivation for life-long learning.", "syllabus": " Basic conservation laws  Fundamental forces, rotating frame, spherical coordinate, continuity equation, thermodynamic equation   Elementary applications of basics equations  Scale analysis, hydrostatic approximation, isobaric coordinates   Thermodynamics,  Gas laws, 1st and 2nd laws of thermodynamics, convection   Circulation and vorticity  Kevin circulation theorem, vorticity, Ertel potential vorticity   Atmospheric waves  Perturbation method, gravity waves, Rossby waves   Qusai-geostrophic theory   Qusai-geostrophic approximation, baroclinic disturbances   Weather systems  Extratropical cyclones  ", "required_readings": "  J. R. Holton and G. J. Hakim, 2012: An Introduction to Dynamic Meteorology. Fifth Edition, Academic Press.", "recommended_readings": " Wallace, J. M., and P. V. Hobbs, 2006: Atmospheric Science: An Introductory Survey. Second Edition, Academic Press. J. Marshall and A. Plumb, 2008:  Atmosphere, Ocean and Climate Dynamics, An Introductory Text, First Edition, Academic Press.", "terms": {"2024-25 Term 1": {"--LEC (7192)": {"startTimes": ["13:30", "13:30"], "endTimes": ["15:15", "14:15"], "days": [2, 4], "locations": ["Mong Man Wai Bldg 705", "William M W Mong Eng Bldg 703"], "instructors": ["Professor TAM Chi Yung Francis", "Professor TAM Chi Yung Francis"], "meetingDates": ["3/9", "5/9", "10/9", "12/9", "17/9", "19/9", "24/9", "26/9", "3/10", "8/10", "10/10", "15/10", "17/10", "22/10", "24/10", "29/10", "31/10", "5/11", "7/11", "12/11", "14/11", "19/11", "21/11", "26/11", "28/11"]}, "-T01-TUT (8125)": {"startTimes": ["14:30"], "endTimes": ["15:15"], "days": [4], "locations": ["William M W Mong Eng Bldg 703"], "instructors": ["Professor TAM Chi Yung Francis"], "meetingDates": ["5/9", "12/9", "19/9", "26/9", "3/10", "10/10", "17/10", "24/10", "31/10", "7/11", "14/11", "21/11", "28/11"]}}}, "assessments": {"Essay test or exam": "30", "Homework or assignment": "20", "Project": "20", "Short answer test or exam": "30"}}, {"code": "3220", "title": "Atmospheric Chemistry", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "Lecture\nInteractive Tutorial", "campus": "Main Campus", "academic_group": "Dept of Earth & Environ Sci", "requirements": "Not for students who have taken ESSC3220. Pre-requisite: CHEM1070 or CHEM1072 or CHEM1280 or permission of instructor.", "description": "This course introduces the physical and chemical processes determining the composition for the atmosphere and its implications for climate, ecosystems, air pollution and human welfare. Topics covered include atmospheric structure, atmospheric chemistry models, atmospheric transport, chemical kinetics, stratospheric and tropospheric chemistry, chemistry of aerosols, biogeochemical cycles, as well as critical environmental issues including stratospheric ozone depletion, acid rain, photochemical smog, and climate change.", "outcome": "At the completion of this course, the students will be able to1)  Gain fundamental concepts of atmospheric chemistry;2)  Understand the physical and chemical principles related to natural and pollution aspects of the atmosphere;3)  Develop the ability to analyze and explain observed atmospheric phenomena and environmental change;4)  Acquire the basics of atmospheric modeling used for air quality and climate projections.(Course outcomes as related to Programme Learning Outcomes) -- The students will develop: 1) the ability to evaluate an issue critically based on evidence and scientific principle, 2) to acquire knowledge effectively by self-study and using information technology, and to work independently, 3) to work effectively in a team, and 4) to present information in a clear, concise and logical manner. The students also can acquire a responsible attitude in study and work, and have motivation for life-long learning.", "syllabus": "TopicsIntroduction and overviewMeasures of atmospheric compositionVertical structure of the atmosphere; chemical thermodynamicsChemical kineticsAtmospheric photochemistryAtmospheric lifetime; box and puff modelsStratospheric chemistry: Chapman mechanismStratospheric chemistry: HOx  catalytic loss cyclesStratospheric chemistry: NOx  catalytic loss cyclesStratospheric chemistry: ClOx  and BrOx  catalytic loss cyclesStratospheric chemistry: polar ozone holeStratospheric chemistry: polar ozone hole recoveryOxidizing power of the troposphereTropospheric ozoneTropospheric ozone pollutionAtmospheric gas-phase chemistryAerosol sources and formationAerosol physics and thermodynamicsAerosol measurement techniquesAerosol – cloud formationChemistry of atmospheric aqueous phase and precipitationAcid rain", "required_readings": "Jacob, D.J.: Introduction to Atmospheric Chemistry, Princeton University Press, 1999.", "recommended_readings": "Seinfeld, J.H. and Pandis, S.N.: Atmospheric Chemistry and Physics: From Air Pollution to Climate Change, 2006.", "terms": {"2024-25 Term 2": {"--LEC (6827)": {"startTimes": ["12:30", "11:30"], "endTimes": ["14:15", "12:15"], "days": [2, 3], "locations": ["Mong Man Wai Bldg 705", "Science Centre L3"], "instructors": ["Professor CHAN Man Nin", "Professor CHAN Man Nin"], "meetingDates": ["7/1", "8/1", "14/1", "15/1", "21/1", "22/1", "4/2", "5/2", "11/2", "12/2", "18/2", "19/2", "25/2", "26/2", "11/3", "12/3", "18/3", "19/3", "25/3", "26/3", "1/4", "2/4", "8/4", "9/4", "15/4", "16/4"]}, "-T01-TUT (7794)": {"startTimes": ["12:30"], "endTimes": ["13:15"], "days": [3], "locations": ["Science Centre L3"], "instructors": ["Professor CHAN Man Nin"], "meetingDates": ["8/1", "15/1", "22/1", "5/2", "12/2", "19/2", "26/2", "12/3", "19/3", "26/3", "2/4", "9/4", "16/4"]}}}, "assessments": {"Essay test or exam": "40", "Homework or assignment": "25", "Presentation": "10", "Short answer test or exam": "25"}}, {"code": "3230", "title": "Principles of Environmental Protection and Pollution Control", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Dept of Earth & Environ Sci", "requirements": "Not for students who have taken ENSC3230 or GRMD3202. Pre-requisite: EESC2270 or ENSC2270 or permission of the instructor.", "description": "This course discusses from a multidisciplinary viewpoint the anthropogenic causes of environmental degradation and the various approaches to environmental protection and pollution control. Students are introduced the concept of sustainability in environmental protection, economic measures and voluntary approach in environmental management, control and treatment technologies, and their comparative effectiveness in the abatement of various types of pollution. Management programmes and control strategies in tackling local environmental problems are illustrated.", "outcome": "Students are expected to understand the multidisciplinary nature of environmental management, learn the various measures (regulatory, economic, technological) available, and aware of different stakeholders' needs and the constraints in environmental protection.Students should be able to: understand the socio-economic causes of environmental problems; view environment as a site for conflict and environmental solutions for conflict resolution; sustainability as the core conceptual principle of environmental protection; appreciate that environmental protection can be achieved by changes in environmental attitudes and ethics; sole use of technologies cannot eliminate environmental problems, but integration of technical and nontechnical measures (incl voluntary corporate environmental management) in environmental protection; environmental protection strategies and their inadequa cies in tackling local environmental problems.", "syllabus": " Environmental crises – Trends and causes Sustainable development Environmental management – Elements and approaches Air pollution control Water pollution control Solid waste management Hazardous waste management", "required_readings": " Wright, R.T. and Boorse, D.F. (2017) Environmental Science. Towards a Sustainable Future (13th Ed.). Pearson Prentice Hall, Upper Saddle River, New Jersey. Enger, E.D. & Smith, B.F. (2013) Environmental Science: A Study of Interrelationships (13th Ed.). McGraw-Hill, Dubuque. Withgott, J & Brennan, S. (2014) Environment. The Science Behind the Stories (5th Ed.). Benjamin Cummings, Boston.", "recommended_readings": " Cunningham, W.P. & Cunningham, M.A. (2015) Environmental Science: A Global Concern (13th Ed.). McGraw-Hill, Boston. Chiras, D.D. (2010) Environmental Science. Creating a Sustainable Future (8th Ed.). Jones and Barlett Publishers, Sudbury. Davis, M.L. & Masten, S.J. (2014) Principles of Environmental Engineering and Science (3rd Ed.). McGraw Hill, New York. Mines, R.O. Jr. (2014) Environmental Engineering: Principles and Practice. Wiley Blackwell, Hoboken, NJ. Weiner, R.F. and Matthews, R.A. (2003) Environmental Engineering (4th Ed.). Butterworth- Heinemann, Amsterdam. Mtchell, B. (2002) Resource and Environmental Management (2nd Ed.). Longman, Harlow. O'Riordan, T. (2000) Environmental Science for Environmental Management (2nd Ed.). Prentice Hall, Essex. Dryzek, J.S. & Schlosberg, D. (2005) Debating the Earth – The Environmental Politics Reader (2nd Ed.). Oxford University Press, Oxford. Selected articles from webs", "terms": {"2024-25 Term 2": {"--LEC (7831)": {"startTimes": ["10:30", "11:30"], "endTimes": ["12:15", "12:15"], "days": [2, 4], "locations": ["Lee Shau Kee Building 515", "William M W Mong Eng Bldg 703"], "instructors": ["Dr. LAU Yee Wai, \n\nProfessor TSUI Tsz Ki Martin", "Dr. LAU Yee Wai, \n\nProfessor TSUI Tsz Ki Martin"], "meetingDates": ["7/1", "9/1", "14/1", "16/1", "21/1", "23/1", "4/2", "6/2", "11/2", "13/2", "18/2", "20/2", "25/2", "27/2", "11/3", "13/3", "18/3", "20/3", "25/3", "27/3", "1/4", "3/4", "8/4", "10/4", "15/4", "17/4"]}}}, "assessments": {"Homework or assignment": "10", "Others": "10", "Presentation": "10", "Short answer test or exam": "40", "Selected response test or exam": "30"}}, {"code": "3300", "title": "Oceanography", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "Lecture\nInteractive Tutorial", "campus": "Main Campus", "academic_group": "Dept of Earth & Environ Sci", "requirements": "Not for students who have taken ESSC3300. Pre-requisite: (EESC2010 or ESSC2010) and (EESC2020 or ESSC2020), or permission of instructor.", "description": "This course will investigate the characteristics and dynamics of the ocean. Specific topics include ocean floor, marine sediments, oceanic plate, seawater, air-sea interaction, ocean circulation, waves, El Niño-Southern Oscillation, and the roles of the ocean in climate and climate variability.", "outcome": "At the completion of this course, the students will 1) Gain knowledge of the physical, chemical and biological process associated with the ocean, 2) Understand fundamental physic of phenomena related to the ocean,3) Develop ability to analyze and explain observed oceanic phenomena.(Course outcomes as related to Programme Learning Outcomes) -- The students will develop: 1) the ability to evaluate an issue critically based on evidence and scientific principle, 2) to acquire knowledge effectively by self-study and using information technology, and to work independently, 3) to work effectively in a team, and 4) to present information in a clear, concise and logical manner. The students also can acquire a responsible attitude in study and work, and have motivation for life-long learning.", "syllabus": " Ocean floor and seafloor mapping Oceanic plate and crust Mid-ocean ridges and seismic reflection imaging Marine sediments  Properties of sea water, mixed layer and thermocline Ocean general circulation, ocean heat transport Geostrophic and hydrostatic balance, vorticity Wind-driven circulation, western boundary current, Sverdrup theory Thermohaline circulation Inertial oscillations, surface waves, Rossby waves, Kelvin waves, Climate variability, El Nino-Southern Oscillation, Paleoclimate  ", "required_readings": "Refer to the course syllabus distributed in the class.", "recommended_readings": " Talley, L.D., G.L. Pickard, W.J. Emery, and J.H. Swift, 2011, Descriptive Physical Oceanography, An introduction, 6th edition, Academic Press.  Stewart, R.H., 2008, Introduction to Physical Oceanography.  Trujillo, A.P., and H.V. Thurman, 2019, Essentials of Oceanography, 13th edition, Pearson.  Jones, E.J.W. 1999, Marine Geophysics, Wiley.  ", "terms": {"2024-25 Term 2": {"--LEC (6826)": {"startTimes": ["13:30", "16:30"], "endTimes": ["15:15", "17:15"], "days": [1, 2], "locations": ["William M W Mong Eng Bldg 804", "William M W Mong Eng Bldg 401"], "instructors": ["Dr. LI Kwan Kit Ronald, \n\nProfessor Benoit THIBODEAU, \n\nProfessor TAN Yen Joe", "Dr. LI Kwan Kit Ronald, \n\nProfessor Benoit THIBODEAU, \n\nProfessor TAN Yen Joe"], "meetingDates": ["6/1", "7/1", "13/1", "14/1", "20/1", "21/1", "27/1", "4/2", "10/2", "11/2", "17/2", "18/2", "24/2", "25/2", "10/3", "11/3", "17/3", "18/3", "24/3", "25/3", "31/3", "1/4", "7/4", "8/4", "14/4", "15/4"]}, "-T01-TUT (7866)": {"startTimes": ["17:30"], "endTimes": ["18:15"], "days": [2], "locations": ["William M W Mong Eng Bldg 401"], "instructors": ["Dr. LI Kwan Kit Ronald, \n\nProfessor Benoit THIBODEAU, \n\nProfessor TAN Yen Joe"], "meetingDates": ["7/1", "14/1", "21/1", "4/2", "11/2", "18/2", "25/2", "11/3", "18/3", "25/3", "1/4", "8/4", "15/4"]}}}, "assessments": {"Essay test or exam": "35", "Homework or assignment": "20", "Lab reports": "25", "Short answer test or exam": "20"}}, {"code": "3320", "title": "Hydrogeology", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "Lecture\nInteractive Tutorial", "campus": "Main Campus", "academic_group": "Dept of Earth & Environ Sci", "requirements": "Not for students who have taken ESSC3320. Pre-requisite: EESC 2010 or ESSC2010 or permission of instructor.", "description": "This course introduces the physical and chemical principles of hydrogeology. Concepts of surface and groundwater hydrology, as well as quantitative modelling of groundwater flow and contaminant transport are covered. Special topics on the coupling of hydrologic and geologic processes will also be addressed, with examples from tectonics, petroleum geology, geothermics, and global change.", "outcome": "Students will acquire basic concepts in relation to the physical chemical processes of water circulations in the various components of the Earth system. The students will appreciate the interaction between the hydrosphere and geosphere, and its impact on natural resources and the environment. The students will develop: 1) the ability to evaluate an issue critically based on evidence and scientific principle, 2) to acquire knowledge effectively by self-study and using information technology, and to work independently, 3) to work effectively in a team, and 4) to present information in a clear, concise and logical manner. The students also can acquire a responsible attitude in study and work, and have motivation for life-long learning.", "syllabus": "Refer to the course syllabus distributed in the class.", "required_readings": "Fetter, C. W., Applied Hydrogeology (4th edition), Pearson, 612 pp., 2014.", "recommended_readings": " Hornberger, G.M., Wiberg, P.L., Raffensperger, J.P. and P. D'Odorico, Elements of Physical Hydrology, 2nd edition, John Hopkins UP, 378 pp., 2014. Fitts, C.R., Groundwater Science, 2nd edition, Academic Press, 672 pp., 2013. Mays, L. W., Ground and Surface Water Hydrology, John Wiley & Sons, 640 pp., 2011. Schwartz, F. W. and H. Zhang, Fundamentals of Ground Water, John Wiley & Sons, 583 pp., 2003.", "terms": {"2024-25 Term 1": {"--LEC (7151)": {"startTimes": ["8:30"], "endTimes": ["11:15"], "days": [5], "locations": ["Y.C. Liang Hall 106"], "instructors": ["Professor TAN Yen Joe"], "meetingDates": ["6/9", "13/9", "20/9", "27/9", "4/10", "18/10", "25/10", "1/11", "8/11", "15/11", "22/11", "29/11"]}}}, "assessments": {"Essay test or exam": "30", "Homework or assignment": "30", "Selected response test or exam": "40"}}, {"code": "3330", "title": "Biogeochemistry", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Dept of Earth & Environ Sci", "requirements": "Not for students who have taken ENSC3330. Pre-requisite: (EESC2270 or ENSC2270) and [(EESC2020 or ESSC2020) or GRMD2209], or permission of the instructors.", "description": "This course aims to take students to explore recent advances in biogeochemistry of different elements in both terrestrial and aquatic ecosystems. The course will include basic concepts of watershed processes, elemental cycling, hydrological transport, atmospheric processes, and oceanic transformation. The applications of the knowledge on environmental pollution and environmental health will be discussed, different cutting-edge techniques and hands-on field approaches will be covered in this course, with an emphasis on aquatic habitats.", "outcome": "After completing this course, students are expected to: understand the key processes regulating elemental cycling in the environment. understand the basic concepts and recent development in environmental biogeochemistry and its relationships to major global environmental problems. know how to design and conduct simple investigation of elemental cycling in the environment know how to communicate with the general public with a scientific understanding of biogeochemistry.", "syllabus": "This course presents the recent understanding and advancements in global biogeochemistry. The lectures are on a range of topics, covering major elemental cycles in forest, streams, groundwater, wetlands, inland waters, oceans, and atmosphere. Advanced concepts of application of biogeochemistry will further be discussed with an emphasis on environmental pollution and health, and global climate change. The fundamentals of major elemental cycles like carbon, nitrogen, phosphorus, oxygen, sulphur, mercury and silicate will also be covered.   Week 1 Introduction; overview of global environmental problems and key elements; basics of environmental chemistry Tsui   Week 2 Watershed processes: forests, streams, groundwater, wetlands, and inland waters Tsui   Week 3 Carbon cycling in forests and inland waters Tsui   Week 4 Nutrient cycling in forests and inland waters Tsui   Week 5 Sulphur and mercury cycling in terrestrial and freshwater environment Tsui   Week 6 Biogeochemistry and its applications to study environmental pollution Tsui   Week 7 Review and midterm exam     Week 8 Notions of oceanography Thibodeau   Week 9 Biogeochemical air-sea interface Thibodeau   Week 10 Organic matter production, export, remineralization and burial Thibodeau   Week 11 The oceanic carbon, silicate and calcium carbonate cycles Thibodeau   Week 12 Linkages between nutrient and oxygen cycles in the oceans Thibodeau   Week 13 Ocean biogeochemistry and climate Thibodeau  ", "required_readings": "Refer to the course syllabus distributed in the class.", "recommended_readings": "Lecture handout for each of the topics will be uploaded to the accompanied Blackboard site. Extra reading materials are expected to change every year to reflect the latest development in the research field in biogeochemistry. Additional reading materials such as journal articles will be provided by individual instructors.  Sarmiento JL and Gruber N. 2006. Ocean Biogeochemical Dynamics, Academic Press (Paperback ISBN: 9780691017075)   Chapin III FS, Matson PA and Vitousek PM. 2011. Principles of Terrestrial Ecosystem Ecology 2nd ed., Springer (Paperback ISBN: 978-1-4419-9503-2) (eBook ISBN: 978-1-4419-9504-9)  Schlesinger WH and Bernhardt E. 2020. Biogeochemistry: An Analysis of Global Change 4th ed., Academic Press (Paperback ISBN: 9780128146088) (eBook ISBN: 9780128146095)   ", "terms": {"2024-25 Term 2": {"--LEC (7867)": {"startTimes": ["14:30"], "endTimes": ["17:15"], "days": [4], "locations": ["Mong Man Wai Bldg 715"], "instructors": ["Dr. ZHANG Li, \n\nProfessor Benoit THIBODEAU"], "meetingDates": ["9/1", "16/1", "23/1", "6/2", "13/2", "20/2", "27/2", "13/3", "20/3", "27/3", "3/4", "10/4", "17/4"]}}}, "assessments": {"Essay test or exam": "30", "Homework or assignment": "20", "Project": "20", "Short answer test or exam": "30"}}, {"code": "3415", "title": "Environmental Instrumentation Techniques", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Dept of Earth & Environ Sci", "requirements": "Not for students who have taken CHEM2400 or CHEM3410 or ENSC3415. Pre-requisite: EESC2515 or ENSC2515.", "description": "This course aims to provide students with a basic understanding of the operational principles and applications of various instrumental techniques commonly used for the studies of air and water pollution. It is designed to cover atomic and molecular absorption and emission spectroscopy, mass spectrometry, gas chromatography, high-performance liquid chromatography, and electrochemical methods. Emphasis will be placed on the application of such techniques for pollution monitoring and preventive detection systems, especially with reference to the identification and determination of trace levels of toxic heavy metals, organic and organometallic compounds.", "outcome": " To allow students to gain fundamental knowledge of the principles of instrumental techniques. To allow students to gain fundamental knowledge of mathematical techniques required in treatment of analytical data. To allow students to gain the ability of recognizing key factors and applying appropriate assumption to formulate solutions for environmental analysis. To allow students to acquire problem solving skills including ability to identify key issues and formulate feasible solutions of problems based on logical analysis and critical thinking. To develop students' critical evaluation of issues based on evidence and scientific logic. To allow students to gain ability of analyzing issues quantitatively with the sense of level of uncertainty and reliability. To enhance students' awareness of impacts of instrumental analysis in environmental, social, economic, industrial, and technological aspects. To enhance students' confidence in ability of solving problems.", "syllabus": "This course will be divided into the following parts: Treatment of Analytical Data Spectroscopic Techniques (UV-VIS, IR, AAS, ICP, MS and XRF) Electrochemical Methods (Potentiometry, Coulometry and Voltammetry) Chromatographic Techniques (GC and HPLC)  Environmental Sampling and Analysis", "required_readings": "D.A. Skoog, F. J. Holler and T. A. Nieman: Principles of Instrumental Analysis, 6th ed. Thomson, 2006.", "recommended_readings": "  R. Reeve: Introduction to Environmental Analysis, Wiley, 2002.  G. Christian: Analytical Chemistry, 6th ed., Wiley, 2004.", "terms": {"2024-25 Term 2": {"--LEC (7883)": {"startTimes": ["8:30"], "endTimes": ["11:15"], "days": [4], "locations": ["Y.C. Liang Hall G04"], "instructors": ["Professor LI Hung Wing"], "meetingDates": ["9/1", "16/1", "23/1", "6/2", "13/2", "20/2", "27/2", "13/3", "20/3", "27/3", "3/4", "10/4", "17/4"]}}}, "assessments": {"Homework or assignment": "30", "Short answer test or exam": "40", "Selected response test or exam": "30"}}, {"code": "3417", "title": "Environmental Instrumentation Techniques Laboratory", "career": "Undergraduate", "units": "2.00", "grading": "Graded", "components": "Laboratory", "campus": "Main Campus", "academic_group": "Dept of Earth & Environ Sci", "requirements": "Not for students who have taken ENSC3417. Co-requisite: EESC3415 or ENSC3415 or permission of the instructor.", "description": "This laboratory course provides students with hands-on experience in applying and operating various instrumental techniques that are commonly used in environmental analysis. In addition, this course also provides practical training to students in collecting, handling and treating the samples.", "outcome": " To allow students to gain experience on understanding and analyzing specified goals. To allow students to gain experience on carrying out appropriate experiments for specified goals. To allow students to be familiar with the use of resources of chemical literature and databases. To develop students' convergent thinking and convergent thinking. To allow students to acquire experimental skills in different disciplines of analytical chemistry. To allow students to strengthen their analytical chemistry background through performing experiments. To allow students to gain experience on applying analytical chemistry knowledge onto experimental works. To stimulate students' creativity to solve for difficulties encountered in experiments, to suggest possible causes for undesirable results, and to summarize and analyze raw data for conclusions. To enhance students' written skills in presenting conclusion from raw data. To enhance students' professional communication skills with colleagues and supervisors. To enhance students' skills to collaborate with other people.", "syllabus": "This course aims to provide students with hands-on experience in applying different types of instrumental techniques in environmental analysis including spectroscopic, electrochemical and chromatographic techniques.", "required_readings": "D.A. Skoog, F. J. Holler and T. A. Nieman: Principles of Instrumental Analysis, 6th ed., Saunders, 2006.", "recommended_readings": "Please refer to the laboratory manual for the references of each experiment.", "terms": {"2024-25 Term 2": {"-L01-LAB (7375)": {"startTimes": ["14:30"], "endTimes": ["18:15"], "days": [3], "locations": ["Science Centre 130A"], "instructors": ["Dr. CHAN Ka Long Donald"], "meetingDates": ["8/1", "15/1", "22/1", "5/2", "12/2", "19/2", "26/2", "12/3", "19/3", "26/3", "2/4", "9/4", "16/4"]}}}, "assessments": {"Lab reports": "60", "Others": "40"}}, {"code": "3510", "title": "Environmental Microbiology", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Dept of Earth & Environ Sci", "requirements": "Pre-requisite: LSCI1002 or LSCI1012 or EESC2270, or permission of the instructor.", "description": "Environmental Microbiology is an interdisciplinary course that explores the fascinating world of microorganisms and their impact on the environment. This comprehensive course covers both the scientific fundamentals and practical applications in the field of Environmental Microbiology. This course will begin with an introduction to the field by covering topics such as the formation of the biosphere, and the science of cell biology. Then the course goes beyond theory and delves into the methods used in environmental microbiology to study microorganisms in their natural habitats. They will also examine the applications of environmental microbiology, such as studying the role of bacteria in climate change, biodegradation, and bioremediation. These practical applications highlight how microorganisms can be harnessed to address environmental challenges and contribute to a sustainable future.", "outcome": "By the end of the course, students would be able to: Demonstrate knowledge of the formation of the biosphere and the role of microorganisms in shaping ecosystems. Describe the basic cellular structures, metabolic processes, and adaptation strategies of microorganisms in various environments in scientific terms. Recognize appropriate methods and techniques for studying microorganisms in their natural habitats, including sample collection, isolation, and community analysis. Evaluate the application of biodegradation, bioremediation technologies and microbial consortia in environmental cleanup and restoration. Apply knowledge and practical insights from environmental microbiology to address real-world environmental challenges and contribute to sustainability efforts.", "syllabus": " Introduction to Environmental Microbiology Formation of the Biosphere Microorganisms: Cell Biology Microorganisms: Nutrition and Growth Microorganisms: Microbial Diversity Methods in Environmental Microbiology Microbial Habitats: Soil and Water Microbial Habitats: Life in extreme environments Application: Bacteria and climate change Application: Biodegradation Application: Bioremediation", "required_readings": " Madsen, E. L., 2016. Environmental microbiology : from genomes to biogeochemistry. 2nd edition. Blackwell Publishing. ISBN: 9781118439586", "recommended_readings": " Reineke, W. & Schlömann, M., 2023. Environmental Microbiology. 3rd edition. Springer. eBook ISBN: 9783662665473 Dong, H. and Lu, A., 2012. Mineral–microbe interactions and implications for remediation. Elements, 8(2), pp.95-100. ISBN for the journal: 18115209", "terms": {"2024-25 Term 1": {"--LEC (8770)": {"startTimes": ["13:30", "13:30"], "endTimes": ["14:15", "15:15"], "days": [2, 4], "locations": ["Basic Med Sci Bldg Rm2", "Basic Med Sci Bldg Rm1"], "instructors": ["Dr. ZHANG Li", "Dr. ZHANG Li"], "meetingDates": ["3/9", "5/9", "10/9", "12/9", "17/9", "19/9", "24/9", "26/9", "3/10", "8/10", "10/10", "15/10", "17/10", "22/10", "24/10", "29/10", "31/10", "5/11", "7/11", "12/11", "14/11", "19/11", "21/11", "26/11", "28/11"]}}}, "assessments": {"Classwork": "30", "Examination": "50", "Presentation": "20"}}, {"code": "3520", "title": "Ecotoxicology and Environmental Management", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Dept of Earth & Environ Sci", "requirements": "Not for students who have taken ENSC3520. Pre-requisite: EESC2515 and LSCI1002, or permission of the instructor.", "description": "The course introduces various types of chemical contaminants and their adverse effects on animals, humans and ecosystems, and environmental management strategies. It provides an overview of ecotoxicology principles, sources, chemical nature, fate of contaminants, and their interaction and impacts with the ecosystem, and the living organisms in the environment. It also relates ecotoxicology to risk assessment including assessment, monitoring, management and protection of the environment from toxicants.Students will gain insights into the impacts of pollutants on aquatic and terrestrial ecosystems. They will also delve into sustainable environmental management strategies, including pollution prevention, remediation, and ecological risk assessments.", "outcome": " Explain the major concepts in ecotoxicology study, including hazard identification, exposure assessment, dose-response assessment. Discuss the attributes, characteristics, and fate of major classes of toxicants. Interpret the mechanisms of interaction and impacts of toxicants at multiple levels of the ecosystem. Analyze environmental toxicants in ecotoxicology research. Assess and evaluate environmental risks associated with toxicants.", "syllabus": "Part I: Approaches and Methods General Principle of Ecotoxicology 1,5,6,7 Contaminant Uptake and Bioaccumulation1,6,7 Detection Methods: Analytical and Bioassay 1,3,7 Ecotoxicological Studies Models 2,3 Part II: Toxicity of individual substances Heavy Metals 1,5,7 Organic Compounds 1.7 Pesticides 1,4,5,6 Ionizing Radiation1,4,7 Natural Toxins 1 Part III: Environmental Management  Environmental Epidemiology 1 Regulatory Ecological Risk Assessment 1,6,7,8 Recovery of Contaminated Sites 7", "required_readings": " Cockerham, L. G., and Barbara S. Shane. Basic Environmental Toxicology. Boca Raton: Routledge, 2018.  Gruiz, Katalin, T. (Tamas) Meggyes, and Eva Fenyvesi, eds. Environmental Toxicology. London: Taylor & Francis Group, 2015.  Abal, Paula et al. Environmental Toxicology. Ed. Luis M. Botana. Berlin: De Gruyter, 2018.  Jindal, Tanu., ed. New Frontiers in Environmental Toxicology. 1st ed. Cham: Springer International Publishing, 2022. Rose, John. Environmental Toxicology: Current Developments. Amsterdam: Gordon and Breach Science Pub., 1998.  Yu, M.-H., Tsunoda, H., & Tsunoda, M.. Environmental Toxicology: Biological and Health Effects of Pollutants, Third Edition (3rd ed.). 2012. https://doi.org/10.1201/b11677 Campbell, Peter G. C. et al. Ecotoxicology. Cambridge: Cambridge University Press, 2022.", "recommended_readings": " Levin, Simon A. et al., eds. Ecotoxicology: Problems and Approaches. 1st ed. 1989. New York, NY: Springer New York, 1989.  Lu, Yonglong, Pei Wang, and Jingjing Yuan. Ecological Risks of Emerging Pollutants in Urbanizing Regions. Singapore: Springer Singapore Pte. Limited, 2023.", "terms": {"2024-25 Term 1": {"--LEC (7536)": {"startTimes": ["13:30", "13:30"], "endTimes": ["14:15", "15:15"], "days": [1, 3], "locations": ["Mong Man Wai Bldg 715", "Science Centre L2"], "instructors": ["Dr. LAU Yee Wai", "Dr. LAU Yee Wai"], "meetingDates": ["2/9", "4/9", "9/9", "11/9", "16/9", "23/9", "25/9", "30/9", "2/10", "7/10", "9/10", "14/10", "16/10", "21/10", "23/10", "28/10", "30/10", "4/11", "6/11", "11/11", "13/11", "18/11", "20/11", "25/11", "27/11"]}}}, "assessments": {"Classwork": "20", "Examination": "40", "Project": "30", "Test or quiz": "10"}}, {"code": "3522", "title": "Environmental and Biochemical Toxicology Laboratory", "career": "Undergraduate", "units": "2.00", "grading": "Graded", "components": "Laboratory", "campus": "Main Campus", "academic_group": "Dept of Earth & Environ Sci", "requirements": "Not for students who have taken ENSC3820. Co-requisite: EESC3520 or ENSC3520.", "description": "Students will conduct practical work including multiple cytotoxicity assay, DNA damage assay, and biomarker assays in laboratory. The practical lab helps students understand the lecture taught in EESC3520. Students will also be introduced with internationally recognized methods to study how chemicals can have biochemical and ecological impacts as a global citizen. Students are also encouraged to use innovative ideas to design new methods to test chemical toxicity.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "3530", "title": "Environmental Microbiology & Ecotoxicology Laboratory", "career": "Undergraduate", "units": "2.00", "grading": "Graded", "components": "Laboratory", "campus": "Main Campus", "academic_group": "Dept of Earth & Environ Sci", "requirements": "Co-requisite: EESC3510 or EESC3520.", "description": "The Environmental Microbiology & Ecotoxicology Laboratory is a hands-on, project-based laboratory course designed to complement the theoretical knowledge gained in the courses EESC3510 Environmental Microbiology and EESC3520 Ecotoxicology and Environmental Management. This lab course will provide students with direct, practical experience in understanding the role, diversity, and behavior of microorganisms in environmental contexts, also develop practical skills in conducting ecotoxicological tests, including sample preparation, exposure experiments, and data collection techniques.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "3540", "title": "Environmental Quality Monitoring and Analysis", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "Lecture\nInteractive Tutorial", "campus": "Main Campus", "academic_group": "Dept of Earth & Environ Sci", "requirements": "Pre-requisite: (CHEM1070 or CHEM1072) or (EESC2515 or ENSC2515) or permission of the instructor.", "description": "This course provides a comprehensive introduction to the principles and practices of environmental quality monitoring and analysis. Students will develop a solid understanding of the key parameters that affect air, water, and soil quality, learn various monitoring and sampling techniques, and analyze environmental quality conditions and trends. The course will cover theoretical concepts as well as practical application to real-world environmental management scenarios.", "outcome": "By the end of the course, students will be able to: Identify and describe the major environmental parameters and pollutants that impact environmental quality. Explain the regulatory frameworks and standards related to environmental quality monitoring and compliance. Demonstrate proficiency in sampling techniques and laboratory analysis methods for environmental quality monitoring. Analyze and interpret environmental quality data using statistical and graphical tools. Evaluate the effectiveness of environmental management strategies based on monitoring and analysis results.", "syllabus": "Module 1: Introduction to Environmental Quality Monitoring Overview of environmental quality monitoring and its significance in environmental management Introduction to key environmental parameters and pollutants Module 2: Air Quality Monitoring and Analysis Sampling techniques and analysis methods for air quality monitoring Interpretation of air quality data and identification of pollutants Module 3: Water Quality Monitoring and Analysis Sampling techniques and analysis methods for water quality monitoring Evaluation of water quality parameters and their impact on ecosystems and human health Module 4: Soil Quality Monitoring and Analysis Sampling techniques and analysis methods for soil quality monitoring Assessment of soil contamination and its implications for environmental sustainability Module 5: Environmental Quality Data Visualization and Analysis (Using R) Statistical analysis of water quality data Analysis of Variance (ANOVA) Regression analysis Trend analysis and Analysis of Covariance (ANCOVA) Principal Component Analysis (PCA) Interpretation of data for decision-making Module 6: Environmental Management and Compliance Evaluation of environmental management strategies based on monitoring and analysis results Understanding regulatory frameworks and standards for environmental quality monitoring", "required_readings": " Artiola, Janick F., Ian L. Pepper, and Mark L. Brusseau. Environmental Monitoring and Characterization. Burlington, MA: Elsevier Academic Press, 2004. Wiersma, G. B. Environmental Monitoring. Boca Raton: CRC Press, 2004. Essington, Michael E. Soil and Water Chemistry : An Integrative Approach. Second edition. Boca Raton: CRC Press, Taylor & Francis Group, 2015. Jadhav, H. V., and S. H. Purohit. Global Pollution and Environmental Monitoring. 1st ed. Mumbai: Himalaya Pub. House, 2008.", "recommended_readings": " Denis, Daniel J. Univariate, Bivariate, and Multivariate Statistics Using R: Quantitative Tools for Data Analysis and Data Science. 1st edition. Newark: Wiley, 2020. Li, Yuncong, and Kati W Migliaccio. Water Quality Concepts, Sampling, and Analyses. 1st ed. Boca Raton, FL: CRC Press, 2010.", "terms": {"2024-25 Term 1": {"--LEC (8771)": {"startTimes": ["11:30", "11:30"], "endTimes": ["12:15", "13:15"], "days": [4, 2], "locations": ["Mong Man Wai Bldg 702", "Science Centre L3"], "instructors": ["Professor CHOW Tat Shing", "Professor CHOW Tat Shing"], "meetingDates": ["3/9", "5/9", "10/9", "12/9", "17/9", "19/9", "24/9", "26/9", "3/10", "8/10", "10/10", "15/10", "17/10", "22/10", "24/10", "29/10", "31/10", "5/11", "7/11", "12/11", "14/11", "19/11", "21/11", "26/11", "28/11"]}}}, "assessments": {"Homework or assignment": "20", "Presentation": "20", "Project": "20", "Short answer test or exam": "40"}}, {"code": "3600", "title": "Ecosystems and Climate", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "Lecture\nInteractive Tutorial", "campus": "Main Campus", "academic_group": "Dept of Earth & Environ Sci", "requirements": "Not for students who have taken ESSC3600 or EESC3601 or ESSC3601. Pre-requisite: EESC2020 or ESSC2020 or permission of instructor.", "description": "This course introduces the physical, chemical and biological principles governing the functioning of terrestrial and marine ecosystems, and their roles in shaping the Earth’s climatic and geological environments. Topics include: basic hydrology and surface energy balance; energy, momentum, water and chemical exchange between ecosystems and the atmosphere; cycling of water, carbon and other nutrients in soil, vegetation and ocean; survival strategies of different life forms (especially plants and microorganisms); ecosystem structures and functions; landscapes, disturbances and ecosystem dynamics; human perturbations of biogeochemical cycles via pollution, greenhouse gas emissions and land use; responses and evolution of terrestrial and marine ecosystems under global climate change. This course serves as a comprehensive introduction to ecological climatology, biogeochemistry and ecosystem ecology, and requires basic mathematical operations. This version of the course includes an integrated set of computer laboratory sessions.", "outcome": " Students will understand fundamental concepts in the physical and chemical principles governing the structures and functions of ecosystems; Students will understand how ecosystems are impacted by natural processes and humans activities; Students will learn to search for information and data from the literature; Students will acquire mathematical skills required to conduct ecosystem and climate analysis, as well as presentation and writing skills. Students will develop the responsibility in study and work. Student will have motivation for life-long learning.", "syllabus": " Topic 1: Ecosystems, global plant biogeography and climate Topic 2: Plant ecophysiology: photosynthesis and transpiration Topic 3: Surface energy balance and biogeophysical climate-vegetation interactions Topic 4: Soil and plant biogeochemistry Topic 5: Global carbon cycle and biogeochemical feedbacks Topic 6: Marine and wetland ecosystems and biogeochemistry Topic 7: Nitrogen, aerosols and atmospheric chemistry Topic 8: Sustainable ecosystem management", "required_readings": " Bonan, G.B. (2016): Ecological Climatology: Concepts and Applications (3rd edition). Cambridge University Press. Schlesinger, W.H., Bernhardt, E.S. (2013): Biogeochemistry: An Analysis of Global Change (3rd edition). Academic Press.", "recommended_readings": " Schimel, D. (2013): Climate and Ecosystems. Princeton University Press. Chapin (III), F.S., Matson, P.A., Vitousek, P.M. (2012): Principles of Terrestrial Ecosystem Ecology (2nd edition). Springer. Valiela, I. (2016): Marine Ecological Processes (3rd edition). Springer.", "terms": {"2024-25 Term 2": {"--LEC (6825)": {"startTimes": ["11:30", "14:30"], "endTimes": ["13:15", "15:15"], "days": [1, 2], "locations": ["Mong Man Wai Bldg 702", "Y.C. Liang Hall 101"], "instructors": ["Dr. LI Kwan Kit Ronald, \n\nProfessor TAI Pui Kuen Amos", "Dr. LI Kwan Kit Ronald, \n\nProfessor TAI Pui Kuen Amos"], "meetingDates": ["6/1", "7/1", "13/1", "14/1", "20/1", "21/1", "27/1", "4/2", "10/2", "11/2", "17/2", "18/2", "24/2", "25/2", "10/3", "11/3", "17/3", "18/3", "24/3", "25/3", "31/3", "1/4", "7/4", "8/4", "14/4", "15/4"]}, "-T01-TUT (7882)": {"startTimes": ["15:30"], "endTimes": ["16:15"], "days": [2], "locations": ["Y.C. Liang Hall 101"], "instructors": ["Dr. LI Kwan Kit Ronald, \n\nProfessor TAI Pui Kuen Amos"], "meetingDates": ["7/1", "14/1", "21/1", "4/2", "11/2", "18/2", "25/2", "11/3", "18/3", "25/3", "1/4", "8/4", "15/4"]}}}, "assessments": {"Essay test or exam": "60", "Homework or assignment": "5", "Lab reports": "30", "Participation": "5"}}, {"code": "3601", "title": "Principles of Ecosystems and Climate", "career": "Undergraduate", "units": "2.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Dept of Earth & Environ Sci", "requirements": "Not for students who have taken ESSC3601 or EESC3600 or ESSC3600. Pre-requisite: EESC2020 or ESSC2020 or permission of instructor.", "description": "This course introduces the physical, chemical and biological principles governing the functioning of terrestrial and marine ecosystems, and their roles in shaping the Earth’s climatic and geological environments. Topics include: basic hydrology and surface energy balance; energy, momentum, water and chemical exchange between ecosystems and the atmosphere; cycling of water, carbon and other nutrients in soil, vegetation and ocean; survival strategies of different life forms (especially plants and microorganisms); ecosystem structures and functions; landscapes, disturbances and ecosystem dynamics; human perturbations of biogeochemical cycles via pollution, greenhouse gas emissions and land use; responses and evolution of terrestrial and marine ecosystems under global climate change. This course serves as a comprehensive introduction to ecological climatology, biogeochemistry and ecosystem ecology, and requires basic mathematical operations. This course is the same as and meets with EESC3600, except without the integrated computer laboratory sessions and exercises.", "outcome": " Students will understand fundamental concepts in the physical and chemical principles governing the structures and functions of ecosystems; Students will understand how ecosystems are impacted by natural processes and humans activities; Students will learn to search for information and data from the literature; Students will acquire mathematical skills required to conduct ecosystem and climate analysis, as well as presentation and writing skills. Students will develop the responsibility in study and work. Student will have motivation for life-long learning.  ", "syllabus": " Topic 1: Ecosystems, global plant biogeography and climate Topic 2: Plant ecophysiology: photosynthesis and transpiration Topic 3: Surface energy balance and biogeophysical climate-vegetation interactions Topic 4: Soil and plant biogeochemistry Topic 5: Global carbon cycle and biogeochemical feedbacks Topic 6: Marine and wetland ecosystems and biogeochemistry Topic 7: Nitrogen, aerosols and atmospheric chemistry Topic 8: Sustainable ecosystem management", "required_readings": " Bonan, G.B. (2016): Ecological Climatology: Concepts and Applications (3rd edition). Cambridge University Press. Schlesinger, W.H., Bernhardt, E.S. (2013): Biogeochemistry: An Analysis of Global Change (3rd edition). Academic Press.", "recommended_readings": " Schimel, D. (2013): Climate and Ecosystems. Princeton University Press. Chapin (III), F.S., Matson, P.A., Vitousek, P.M. (2012): Principles of Terrestrial Ecosystem Ecology (2nd edition). Springer. Valiela, I. (2016): Marine Ecological Processes (3rd edition). Springer.", "terms": {"2024-25 Term 2": {"--LEC (7887)": {"startTimes": ["11:30"], "endTimes": ["13:15"], "days": [1], "locations": ["Mong Man Wai Bldg 702"], "instructors": ["Dr. LI Kwan Kit Ronald, \n\nProfessor TAI Pui Kuen Amos"], "meetingDates": ["6/1", "13/1", "20/1", "27/1", "10/2", "17/2", "24/2", "10/3", "17/3", "24/3", "31/3", "7/4", "14/4"]}}}, "assessments": {"Essay test or exam": "80", "Homework or assignment": "10", "Participation": "10"}}, {"code": "3701", "title": "Intermediate Topics in Earth and Environmental Sciences", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Dept of Earth & Environ Sci", "requirements": "", "description": "State-of-the-art research methods, experimental, and computational techniques applied in intermediate topics in Earth and Environmental Sciences.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "3800", "title": "Global Environmental Change", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "Lecture\nInteractive Tutorial", "campus": "Main Campus", "academic_group": "Dept of Earth & Environ Sci", "requirements": "Not for students who have taken ESSC3800.", "description": "This course includes the science behind the global warming issue, how the public views the issue and the critical thinking needed to analyze the evidence seen in the media/articles from the point of view of scientists. The world energy use, which is considered to be the cause of global warming, and the impacts are discussed in the course. In this course, students will learn about the radiation budgets/balance in the atmosphere, possible climate forcings that can upset the energy balance, how the earth’s global average temperature is measured, why global warming is described as “the biggest hoax” in human history, observations from the ocean and cryosphere and popular environmental issues/arguments discussed in the mainstream media. Newest observations from the Intergovernmental Panel on Climate Change (IPCC) report are included throughout the course.This course actively incorporates elements of innovation, design, global citizenship and social enterprisingness by asking the students to think innovatively but critically about possible solutions to adapt to and combat climate change and the global energy/health crisis. Different options including their pros and cons are actively discussed in class. Students are encouraged to think creatively about the problem from different angles, e.g., by standing in the shoes of climate skeptics – evaluating their “data”, how they present them, the arguments put forth by them – in order to develop a strategic approach to best communicate the issues to a variety of stakeholders. Project assignments will allow students to focus on one particular environmental issue in other part of the world, attempting to address the issue in the very different geographical, cultural, economic and political contexts from that of the students. Example projects can be “How to use geoengineering to combat climate change?”, “How can Sub-Saharan Africa secure its future food supply under the threat of climate change?”, etc. In the course, students will define and understand the problem. They shall form groups and discuss their own point of views and search information on the evidence of the corresponding arguments. They will present their ideas in class and write a self-reflection report. Each of the group will have to make an “infographic”- a layout of science knowledge learnt in the project that is easy enough for the public to understand but at the same time informative. Good infographics will be used in our OpenDay.", "outcome": "At the completion of this course, the students will be able to gain understanding of basic climate science behind the global warming issue, including how Earth’s global temperature has been measured by scientists and how the global average temperature is calculated study observations from different components of Earth besides the atmosphere, such as ocean and cryosphere observations, and how these components are affected by the human activities study how the scientific problem is presented and perceived in the society and learn how to use one’s scientific knowledge to identify possible solutionsThe active incorporation of elements of innovation and design in the course is critical in allowing the students to develop a keen scientific mindset and logic flow to understand the complexity of the climate change and energy issues (Learning Outcome #1), and to dissect the reasons behind contradictory arguments in a society (Learning Outcome #3). Critical evaluation of the arguments from both sides (climate alarmists vs. skeptics) will ultimately allow them to develop their own stance in the issue, and think critically about the ways to move the world forward towards sustainability (Learning Outcome #3). The incorporation of global citizenship and social enterprisingness is also crucial for students to develop a keen awareness of how environmental issues affect people in a huge variety of geographical and cultural contexts (Learning Outcome #2), and think critically about what kinds of solutions best fit a certain region (Learning Outcome #3).", "syllabus": "•L01 Changing Planet (2 lecture-hours)•L02 Energy: A Closer Look (2 lecture-hours)•L03 Energy and Heat (2 lecture-hours)•L04 Fossil Energy (2 lecture-hours)•L05 Impacts of Fossil Fuels (2 lecture-hours)•L06 Nuclear Energy (2 lecture-hours)•Documentary Quiz: Pandora Promise (1.5 hour of video quiz)•L07 Energy from Earth and Moon (2 lecture-hours)•L08 Direct from the Sun: Solar Energy (2 lecture-hours)•Documentary: Minimalism (1.5 hour of video)•L09 Basic Climate Science (2 lecture-hours)•L10 Climate Forcing (2 lecture-hours)•Documentary Quiz: Merchants of Doubt (1.5 hour of video quiz)•L11 Tropical Cyclone and Climate Change (2 lecture-hours)•L12 Ocean Observations (2 lecture-hours)•Documentary: Mission Blue (1.5 hour of video)•L13 Cryosphere (2 lecture-hours)•Documentary: Chasing Ice (1.5 hour of video)•L14 Future Climate (2 lecture-hours)•L15 Energy and Climate: Breaking the Link (2 lecture-hours)", "required_readings": "Refer to the course syllabus distributed in the class.", "recommended_readings": " Wolfson, Richard, and B. F. Wissler. Energy, environment, and climate (Second Edition). WW Norton & Company, Inc., 2011. McKibben, Bill. The global warming reader: a century of writing about climate change. Penguin, 2012.", "terms": {"2024-25 Term 1": {"--LEC (7194)": {"startTimes": ["11:30", "11:30"], "endTimes": ["13:15", "12:15"], "days": [1, 3], "locations": ["Mong Man Wai Bldg 703", "Esther Lee Bldg 403"], "instructors": ["Professor ZHAI Shixian", "Professor ZHAI Shixian"], "meetingDates": ["2/9", "4/9", "9/9", "11/9", "16/9", "23/9", "25/9", "30/9", "2/10", "7/10", "9/10", "14/10", "16/10", "21/10", "23/10", "28/10", "30/10", "4/11", "6/11", "11/11", "13/11", "18/11", "20/11", "25/11", "27/11"]}, "-T01-TUT (8130)": {"startTimes": ["12:30"], "endTimes": ["13:15"], "days": [3], "locations": ["Esther Lee Bldg 403"], "instructors": ["Professor ZHAI Shixian"], "meetingDates": ["4/9", "11/9", "25/9", "2/10", "9/10", "16/10", "23/10", "30/10", "6/11", "13/11", "20/11", "27/11"]}}}, "assessments": {"Classwork": "10", "Homework or assignment": "30", "Participation": "20", "Report": "20", "Test or quiz": "20"}}, {"code": "3810", "title": "Corporate Sustainability and Certified ESG Planner", "career": "Undergraduate", "units": "2.00", "grading": "Distinction/Pass/Failure", "components": "Lecture", "campus": "Main Campus", "academic_group": "Dept of Earth & Environ Sci", "requirements": "", "description": "This course aims to provide a comprehensive foundation and holistic view on corporate sustainability and the essential skills needed to become a Certified ESG (Environmental, Social, and Governance) Planner. Students will explore various aspects of sustainability, ESG practices, CEPAR approach and their integration into corporate strategies for long-term value creation. Students who have successfully completed this course are eligible to apply for membership of International Chamber of Sustainable Development (ICSD) and gain the authorization to use the trademark designation: Certified ESG Planner CEP® (optional and annual fee applies)Details: https://www.icsd-global.org/certified-esg-planner", "outcome": " Define the principles and practices of Sustainable Development Goals (SDGs), corporate sustainability and ESG. Describe the history, benefits, and mandatory requirements of ESG reporting. Relate green finance and Fintech to corporate sustainability with consideration on corporate strategy and competitiveness. Discuss the CEPAR five-step approach and its application in ESG integration investment analysis approach. Evaluate and analyze material ESG and sustainability issues among companies.", "syllabus": "Module 1: Corporate Sustainability Foundation (Sessions 1 to 2) Corporate sustainability defined and the basics of sustainability Introduction to green finance CEPAR five-step approach Current practices of ESG and future trend Module 2: ESG Reporting (Sessions 2 to 3) Brief history and benefits of ESG reporting Mandatory requirements of ESG reporting Case study Module 3: Sustainable business model & long-term value creation (Sessions 4 to 5) Explain why and how companies should connect sustainability to their business model Explain how companies should connect sustainability to their competitive position intangible assets, and corporate strategy Module 4: ESG Investment and CEPAR (Sessions 5 to 6) Type and history of sustainable and responsible investment: mutual funds green bonds, green loans ESG indexes and scores Performance of sustainable and responsible mutual funds and selecting the funds Introduction to ESG integration investment analysis approach CEPAR in details Module 5: Introduction to Information Technology and Fintech Application to Sustainable Development (Session 7) Fintech & benefits to sustainable finance Sustainable development applications in banking/ insurance/ investing", "required_readings": " Esty, Daniel C., and Todd. Cort, eds. Values at Work : Sustainable Investing and ESG Reporting. 1st ed. 2020. Cham: Springer International Publishing, 2020.  Read, Colin. Understanding Sustainability Principles and ESG Policies : A Multidisciplinary Approach to Public and Corporate Responses to Climate Change. 1st ed. 2023. Cham: Springer International Publishing, 2023.  Ziolo, Magdalena, Beata Zoﬁa Filipiak, and Blanka Tundys. Sustainability in Bank and Corporate Business Models: The Link Between ESG Risk Assessment and Corporate Sustainability. 1st ed. Cham: Springer International Publishing AG, 2021. ", "recommended_readings": " Spataro, Luca, Maria Cristina Quirici, and Gabriella Iermano. ESG Integration and SRI Strategies in the EU: Challenges and Opportunities for Sustainable Development. 1st ed. 2023. Cham: Palgrave Macmillan, 2023. ", "terms": {"2024-25 Term 1": {"--LEC (8852)": {"startTimes": ["14:30"], "endTimes": ["17:15"], "days": [1], "locations": ["Chen Kou Bun Bldg 123"], "instructors": ["Dr. HUI Shun Fuk, \n\nDr. YIP Wing Hang"], "meetingDates": ["2/9", "9/9", "16/9", "23/9", "30/9", "7/10", "14/10", "21/10", "28/10", "4/11", "11/11", "18/11", "25/11"]}}}, "assessments": {"Presentation": "60", "Test or quiz": "40"}}, {"code": "3900", "title": "Internship", "career": "Undergraduate", "units": "3.00", "grading": "Distinction/Pass/Failure", "components": "Practicum", "campus": "Main Campus", "academic_group": "Dept of Earth & Environ Sci", "requirements": "Not for students who have taken ESSC3900. Pre-requisite: (EESC2010 or ESSC2010) and (EESC2020 or ESSC2020), and have taken at least one course from (EESC3100/ 3120/ 3200/ 3220/ 3300/ 3320) or (ESSC3100/ 3120/ 3200/ 3220/ 3300/ 3320).", "description": "This course aims to let students apply their Earth and Environmental Sciences knowledge in, and gain hands-on experience from workplace. Students are expected to gain practical experience from various internship opportunities such as CUHK units, government or private companies. The internship can be held through local fieldwork, guided tours, workshops or other related tasks, depending on the requests from different units. Students are required to serve at least 320 hours during the internship and will be evaluated based upon biweekly progress reports, final written report, presentation and the evaluation from the supervisor(s)/course coordinator (subject to their supervisors).Advisory: For year 2 or above Earth and Environmental Sciences major students.Note: Allowance may vary each year for the internships depending on the needs of students.", "outcome": "Students are expected to gain the following abilities: Acquire hands-on experience related to various fields in Earth Sciences through participating in fieldwork, guided tours, summer workshop or other related tasks Apply concepts and knowledge in atmospheric sciences and geology/geophysics in science education and/or workplace Initiate students’ motivation to learn Earth Sciences knowledge from workplace Develop students’ project management skills through organizing activities and handling project(s) independently", "syllabus": "(I)    Pre-internship training (if applicable)●    Students will need to participate in pre-internship training (if any) provided by the respective units.(II)    Tentative schedule:●    2-month internship held locally or overseas by the respective units●    On-job training by respective supervisor(s)●    Biweekly progress reports, individual written report and final presentation are required.", "required_readings": "Refer to the course syllabus distributed in the class.", "recommended_readings": "Refer to the course syllabus distributed in the class.", "terms": {"2024-25 Term 1": {"-P01-PRA (7251)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["No Room Required"], "instructors": ["Dr. AU-YEUNG Yee Man, \n\nDr. TAM Pui Yuk"], "meetingDates": ["02/09/2024 - 25/11/2024"]}}}, "assessments": {"Essays": "30", "Presentation": "20", "Project": "30", "Report": "20"}}, {"code": "4010", "title": "Solid and Fluid Mechanics", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "Lecture\nInteractive Tutorial", "campus": "Main Campus", "academic_group": "Dept of Earth & Environ Sci", "requirements": "Not for students who have taken ESSC3010 or 4010.", "description": "This course presents the fundamentals of continuum mechanics illustrated with earth and environmental sciences applications. Background materials on matrices, vectors and differential operators are first reviewed. The following topics will be covered: tensors and their properties; stress and strain; constitutive equations for Hookean elastic solid and Newtonian viscous fluid; mechanical properties and rheology of geomaterials; Eulerian and Lagrangian kinematics; momentum equations; vorticity and divergence; applications in geomechanics, seismology, atmospheric dynamics, and oceanography.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "4020", "title": "Soil Mechanics and Its Applications", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "Lecture\nInteractive Tutorial", "campus": "Main Campus", "academic_group": "Dept of Earth & Environ Sci", "requirements": "Not for students who have taken ESSC4020. Pre-requisite: (MATH1010 or 1030 or 1510 or 1520), (PHYS1001 or 1002 or 1111 or 1113) and (EESC2010 or ESSC2010), or permission of instructor.", "description": "A survey of basic concepts of soil mechanics: Classification and physical properties of soil; stress and strain; pore pressure, seepage theory and effective stress; elastic solutions; shear strength and Mohr-Coulomb theory; failure mode and criteria; soil consolidation; lateral earth pressure; slope stability; bearing capacity and foundation designs; pile analyses and designs; soil improvement and soil nailing. Geotechnical applications: shallow and deep foundations; retaining structures; slope instability.", "outcome": " An understanding of the basics of poromechanics: stress and strain, pore pressure and effective stress, shear strength and failure criteria. Knowledge of the classification and physical properties of soil. A basic understanding of the mechanics of soil, soil consolidation and shear failure. An appreciation of the application of soil mechanics to geotechnical designs and engineering. ", "syllabus": " A survey of basic concepts of soil mechanics: Classification and physical properties of soil.  Physical properties of soil. Seepage and effective stress, Pore pressure. Stress and strain. Shear strength. Soil consolidation. Geotechnical applications: shallow and deep foundations; retaining structures; slope instability. Laboratory measurement of soil deformation and strength.", "required_readings": "Knappett, J.A. and R.F. Craig, Craig’s Soil Mechanics, 8th edition, Spon Press, 552 pp, 2012. Das, B.M. Principles of Foundation Engineering, 7th and SI edition, Cengage Learning, 794 pp, 2011.", "recommended_readings": "Holtz, R.D., W.D. Kovacs and T.C. Sheahan, An Introduction to Geotechnical Engineering, 2nd edition, Pearson, 853 pp, 2011.", "terms": {"2024-25 Term 2": {"--LEC (6866)": {"startTimes": ["9:30", "9:30"], "endTimes": ["11:15", "10:15"], "days": [4, 5], "locations": ["Y.C. Liang Hall 106", "William M W Mong Eng Bldg 703"], "instructors": ["Professor CHAU Kam Tim, \n\nProfessor ZHAN Yan", "Professor CHAU Kam Tim, \n\nProfessor ZHAN Yan"], "meetingDates": ["9/1", "10/1", "16/1", "17/1", "23/1", "24/1", "6/2", "7/2", "13/2", "14/2", "20/2", "21/2", "27/2", "28/2", "13/3", "14/3", "20/3", "21/3", "27/3", "28/3", "3/4", "10/4", "11/4", "17/4"]}, "-T01-TUT (7894)": {"startTimes": ["10:30"], "endTimes": ["11:15"], "days": [5], "locations": ["William M W Mong Eng Bldg 703"], "instructors": ["Professor CHAU Kam Tim, \n\nProfessor ZHAN Yan"], "meetingDates": ["10/1", "17/1", "24/1", "7/2", "14/2", "21/2", "28/2", "14/3", "21/3", "28/3", "11/4"]}}}, "assessments": {"Examination": "35", "Homework or assignment": "40", "Test or quiz": "25"}}, {"code": "4030", "title": "Engineering Geology", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "Lecture\nInteractive Tutorial", "campus": "Main Campus", "academic_group": "Dept of Earth & Environ Sci", "requirements": "Not for students who have taken ESSC4030. Pre-requisite: (EESC2130 or ESSC2130), (EESC3100 or ESSC3100), (EESC3110 or ESSC3110), (EESC4020 or ESSC4020) and EESC4040, or permission of instructor.", "description": "To introduce ground investigation application and practice for urban development as well as field skill performed by the practicing engineering geologists. A review of selected case histories will be provided to illustrate the use of these concepts and skills.Topics include the factors controlling site selection for a development, desk study and walkover survey, the use of aerial photographic interpretation, ground investigation technology and awareness of site safety, brief introduction of common field and laboratory test methods for soil and rock, introduction of soil and rock description and classification, borehole logging techniques of soil samples and rock types. The content of the course also touches on the basic knowledge of design, management practice of GI works and different roles and responsibilities of GI project personnel.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "4040", "title": "Rock Mechanics and Its Applications", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "Field Studies/Field-trip\nLaboratory\nLecture\nInteractive Tutorial", "campus": "Main Campus", "academic_group": "Dept of Earth & Environ Sci", "requirements": "Pre-requisite: (MATH1010 or 1030 or 1510 or 1520), (EESC2130 or ESSC2130) and (EESC3100 or ESSC3100), or permission of instructor.", "description": "A survey of basic concepts of rock mechanics: Classification and index properties of rock; rock strength and failure criteria; measurement of mechanical behavior of rock discontinuity; initial stresses in rocks and their measurement; deformability of rock and their measurement. Geotechnical applications: rock slope engineering; underground openings and foundation engineering. Practical Training: Laboratory techniques and field trip mapping training.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "4110", "title": "Applied Geophysics", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "Lecture\nInteractive Tutorial", "campus": "Main Campus", "academic_group": "Dept of Earth & Environ Sci", "requirements": "Not for students who have taken ESSC4110. Pre-requisite: (EESC2010 or ESSC2010) and (EESC3120 or ESSC3120).", "description": "This course introduces concepts, principles, and applications of geophysical methods in environmental and engineering studies. It offers an overall survey of various geophysical methods for exploring the shallow subsurface. It provides the technical foundation needed to understand the use and limitations of gravity, seismic, ground penetrating radar, and electromagnetic methods. Demonstration of commonly used methods will be provided in the field along with tutorials of preliminary data analysis techniques.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "4119", "title": "Advanced Earth and Environmental Field Study I", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "Field Studies/Field-trip\nLecture\nProject\nInteractive Tutorial", "campus": "Main Campus", "academic_group": "Dept of Earth & Environ Sci", "requirements": "Not for students who have taken EESC3110 or ESSC3110. Pre-requisite: (EESC2010 or ESSC2010) and [(EESC3100 or ESSC3100) or (EESC4120 or ESSC4120)], or by instructor’s approval.", "description": "Understanding Earth processes and environmental changes over geological time requires the experience and skills gained from fieldwork. EESC4119 is an advanced-level course of the Earth and Environmental Sciences Programme. It covers important aspects of field geology, including petrology, structural geology, tectonics, geophysics, and surficial processes. The principal goal of this course is to train students to recognize different lithological units and their spatial relationship in three dimensions, and to understand the related tectonic environment and formation mechanisms. Class lectures introduce basic skills of reading and interpreting geological maps, using geological equipment (i.e., compass-clinometer, GPS receiver), and producing field notes and reports. Field projects include field observation and description, techniques for field data acquisition and analysis, sample collection, and geological map compilation. Field projects also focus on surficial processes, which occur over relatively short geological timescales but play important roles in environment and ecology. The field location, whether in mainland China or overseas, may change from year to year.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "4120", "title": "Petrology", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "Laboratory\nLecture", "campus": "Main Campus", "academic_group": "Dept of Earth & Environ Sci", "requirements": "Not for students who have taken ESSC4120. Pre-requisite: EESC2010 or ESSC2010.", "description": "Petrology is an essential subfield of Earth and Environmental Sciences because the rock record is the foundation for interpreting Earth history and internal processes. Petrologic concepts help us understand the Earth system, with connections to related fields such as geochemistry, geophysics, mineralogy, structural geology and geodynamics. This course broadly surveys the formation, distribution, chemical composition, mineral associations, and internal texture and structures in rocks of the earth’s crust and upper mantle, and establishes it relation to global tectonic environments. Class lectures are supplemented by lab exercise, demonstrations and tutorials (e.g. study of rock hand specimens, understand phase rule, use of optical microscope etc.).", "outcome": "Students are expected to gain the following abilities: Gain the skills to identify different rock types (igneous and metamorphic basically). Good knowledge of typical mineral assemblages of different rocks. Use optical polarizing microscope to distinguish: (1) different minerals based on their optical properties, (2) typical igneous and metamorphic micro-textures and structures, (3) featured mineral assemblages corresponding to different P-T conditions. Understand phase equilibrium and phase rule and their applications in understanding the rock forming process. Understand different metamorphic facies and their significance of variable tectonic settings. Use petrologic concepts and theories to address topics of societal interests, including natural hazards, natural resources, and human health issues. The students will develop: 1) the ability to evaluate an issue critically based on evidence and scientific principle, 2) to acquire knowledge effectively by self-study and using information technology, and to work independently, 3) to work effectively in a team, and 4) to present information in a clear, concise and logical manner. The students also can acquire a responsible attitude in study and work, and have motivation for life-long learning.", "syllabus": " Introduction and practice of Electronic Microscope for Petrologic Study Phase Rule Igneous Petrology Sedimentary Petrology Metamorphic Petrology", "required_readings": "Refer to the course syllabus distributed in the class.", "recommended_readings": " John D. Winter; Principles of Igneous and Metamorphic Petrology, 2nd Edition, 2009, Prentice Hall, ISBN-10: 0321592573.  Harvey Blatt, Robert Tracy, Brent Owens; Petrology: Igneous, Sedimentary, and Metamorphic; 3rd Edition, 2005, W. H. Freeman, ISBN-10: 0716737434.  ", "terms": {"2024-25 Term 1": {"--LEC (8643)": {"startTimes": ["13:30", "13:30"], "endTimes": ["15:15", "14:15"], "days": [3, 4], "locations": ["Science Centre 331", "Science Centre 331"], "instructors": ["Dr. TAM Pui Yuk, \n\nProfessor NG Wai Pan", "Dr. TAM Pui Yuk, \n\nProfessor NG Wai Pan"], "meetingDates": ["4/9", "5/9", "11/9", "12/9", "19/9", "25/9", "26/9", "2/10", "3/10", "9/10", "10/10", "16/10", "17/10", "23/10", "24/10", "30/10", "31/10", "6/11", "7/11", "13/11", "14/11", "20/11", "21/11", "27/11", "28/11"]}, "-L01-LAB (8642)": {"startTimes": ["14:30"], "endTimes": ["15:15"], "days": [4], "locations": ["Science Centre 331"], "instructors": ["Dr. TAM Pui Yuk, \n\nProfessor NG Wai Pan"], "meetingDates": ["5/9", "12/9", "19/9", "26/9", "3/10", "10/10", "17/10", "24/10", "31/10", "7/11", "14/11", "21/11", "28/11"]}}}, "assessments": {"Essay test or exam": "40", "Lab reports": "30", "Short answer test or exam": "30"}}, {"code": "4130", "title": "Geomorphology", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "Field Studies/Field-trip\nLaboratory\nLecture", "campus": "Main Campus", "academic_group": "Dept of Earth & Environ Sci", "requirements": "Not for students who have taken ESSC4130. Pre-requisite: EESC3100 or ESSC3100.", "description": "This course is an important part of the core Earth and Environmental Sciences Curriculum. It introduces the main concepts in geomorphology with emphasis on understanding the coupling of environments, processes and materials that leads to landform development. Understanding the underlying geological principles of rocks, minerals, structural deformation and geological time are important background knowledge to be enhanced by the study of geomorphology.It discusses the qualitative and quantitative techniques for investigation and research in the field, laboratory, and computer simulation. The application of geomorphology for public safety, engineering problems and development of sustainable solutions will be emphasized. Examples from theory and practice of geomorphology in Hong Kong will be introduced. Practical understanding and skills will be gained from lab exercises and field trips in Hong Kong.Students are suggested to be equipped with basic knowledge of rocks and minerals, structural geology and geological time scale.", "outcome": "Students are expected to gain the following abilities: Understand the relationships between materials, processes and landforms; Use concepts of solid and fluid mechanics to interpret the formation of landforms; Use graphical tools to compile and interpret field and laboratory data; Integrate topics in mineralogy, petrology, structural geology, plate tectonics, climate sciences, biogeosciences, hydrology, remote sensing and geotechnical engineering through survey of scientific literature, case studies, books and textbooks; and Make primary observations in the field and using them to construct and test hypotheses. Lectures focus on physical and chemical aspects of landform evolution and understanding spatial patterns in landscapes and how humans affect and are impacted by Earth surface processes. Labs use the geological maps, terrain classification maps, aerial photography interpretation, societal consequence assessment, and physical models to illustrate these concepts.Students are encouraged to ask, follow-up research and lead discussion of questions regarding lecture topics throughout the semester. Field trips in the second half of the semester encourage small-group discussion of observations and interpretations of landscape evolution and human impacts in mountainous and coastal terrains.The students will develop the ability:1)to evaluate an issue critically based on evidence and scientific principles;2)to acquire knowledge effectively by self-study and using information technology, and to work independently;3)to work effectively in a team, and 4)to present information in a clear, concise and logical manner. The students will also be challenged to manage a large amount of reading in short periods of time and to think of their role as a citizen and in society. ", "syllabus": "   Weeks Contents   1 Opening semester ceremony (morning off)Introduction to Geomorphology + Endogenic Geomorphic Processes   2 Physical Properties of Rock, Soil and Water - IPhysical Properties of Rock, Soil and Water - II   3 Weathering and ErosionFluvial landform   4 Coastal landformVolcanic / granitic landformSlope and Landslides (3 hrs), 09:30-12:30   5 National DayOFF   6 Lab exercise ILab exercise II + pre-trip course to Sai KungApplications of Aerial Photograph Interpretation (3 hrs), 09:30-12:30   7 OFFChung Yeung Festival#1 Field trip to Sai Kung   8 Self-study / Discussion SessionStructural landform#2 Field trip to Port Island   9 Eolian landformSelf-study / Discussion Session#3 Landslide mapping introduction   10 Karst landformSelf-study / Discussion Session#4 Landslide mapping   11 Glacial landformSelf-study / Discussion Session   12 Revision(Reserve for make-up class)   13 (Reserve for make-up class) (Reserve for make-up class)  ", "required_readings": " Ritter, D.F., R.C. Kochel and J.R. Miller, 2011. Process Geomorphology, 5th edition. McGraw Hill, NY. Handouts/emails: Scientific articles, textbook extracts, book extracts, etc.", "recommended_readings": " Anderson, R.S. & Anderson, S. P., 2011. Geomorphology: the Mechanics and Chemistry of Landscapes, Fifth Edition.Waveland Press. Inc. Leopold, L. B., Wolman, M. G. and Miller, J. P., 1964. Fluvial Processes in Geomorphology. Dover Publications. Burbank, D. W. & Anderson R. S., 2011. Tectonic Geomorphology, 2nd Edition. Wiley-Blackwell. Summerfield, M.A., 1991. Global Geomorphology. Longman Scientific & Technical. Fookes, P. G., Lee, M., Griffiths, J., 2007. Engineering Geomorphology: Theory and Practice, Whittles Publishing. Fookes, P. G., Lee, M., Milligan, G., 2005. Geomorphology for Engineers, Whittles Publishing. Selby, M. J., 1993. Hillslope Materials and Processes. Oxford University Press, USA. Bierman, P. R. & Montgomery, D. R., 2014. Key Concepts in Geomorphology. W.H. Freeman and Company Publishers. Anderson, R. The little book of Geomorphology: Exercising the Principle of Conservation. http://instaar.colorado.edu/~andersrs/The_little_book_010708_web.pdf", "terms": {"2024-25 Term 1": {"--LEC (8645)": {"startTimes": ["9:30", "9:30"], "endTimes": ["11:15", "10:15"], "days": [1, 2], "locations": ["Science Centre 331", "Science Centre 331"], "instructors": ["Dr. TAM Pui Yuk, \n\nMr. WONG Ho Yin Dennis, \n\nProfessor NG Wai Pan, \n\nProfessor TANG Lai Kwan Denise", "Dr. TAM Pui Yuk, \n\nMr. WONG Ho Yin Dennis, \n\nProfessor NG Wai Pan, \n\nProfessor TANG Lai Kwan Denise"], "meetingDates": ["2/9", "3/9", "9/9", "10/9", "16/9", "17/9", "23/9", "24/9", "30/9", "7/10", "8/10", "14/10", "15/10", "21/10", "22/10", "28/10", "29/10", "4/11", "5/11", "11/11", "12/11", "18/11", "19/11", "25/11", "26/11"]}, "-L01-LAB (8644)": {"startTimes": ["10:30"], "endTimes": ["11:15"], "days": [2], "locations": ["Science Centre 331"], "instructors": ["Dr. TAM Pui Yuk, \n\nMr. WONG Ho Yin Dennis, \n\nProfessor NG Wai Pan, \n\nProfessor TANG Lai Kwan Denise"], "meetingDates": ["3/9", "10/9", "17/9", "24/9", "8/10", "15/10", "22/10", "29/10", "5/11", "12/11", "19/11", "26/11"]}}}, "assessments": {"Essay test or exam": "40", "Fieldwork or field study": "10", "Homework or assignment": "35", "Report": "15"}}, {"code": "4140", "title": "Seismology", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "Field Studies/Field-trip\nLecture\nInteractive Tutorial", "campus": "Main Campus", "academic_group": "Dept of Earth & Environ Sci", "requirements": "Not for students who have taken ESSC4140. Pre-requisite: (EESC3120 or ESSC3120) or ESSC3010.", "description": "This course focuses on the concepts and theory of elastic wave propagation and physics of earthquake. The topics covered include the Earth’s internal structure, material elasticity, travel time tomography, seismic ray theory, ray tracing, and earthquake source parameter. Methods and field practice of seismological survey will also be introduced.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "4150", "title": "Volcanoes", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "Lecture\nSeminar", "campus": "Main Campus", "academic_group": "Dept of Earth & Environ Sci", "requirements": "", "description": "On any given day, ~20 subaerial volcanoes worldwide are erupting. Even more submarine volcanoes are probably erupting without being detected. Volcanic eruptions can have devastating economic and social consequences, but are also the fundamental force that builds the majority of our planet’s surface. Volcanic eruptions and emissions can also affect atmospheric and climate conditions. This course will explore the various techniques used to study volcanoes’ underlying structure as well as their precursory and eruptive activity.", "outcome": "At the completion of this course, the students will understand fundamental concepts related to volcanic systems as well as the various techniques used to monitor and study volcanoes. The students will also be trained to read scientific literature, learn new knowledge from them, and synthesize with existing knowledge. Finally, students will learn how to present scientific information in a clear, succinct, and logical manner in both oral and written form as well as in scientific discourse/debate.", "syllabus": " Overview of Magmatism and Volcanism Magma storage and movement Eruption precursors  Seismic Geodetic + remote sensing Geochemistry   Eruption sizes and styles Volcanic hazards and risks Environmental impacts Large igneous provinces Submarine volcanism", "required_readings": "Refer to the course syllabus distributed in the class.", "recommended_readings": "Volcanic Eruptions and Their Repose, Unrest, Precursors, and Timing, https://www.nap.edu/catalog/24650/volcanic-eruptions-and-their-repose-unrest-precursors-andtiming", "terms": {"2024-25 Term 2": {"--LEC (8506)": {"startTimes": ["9:30"], "endTimes": ["10:15"], "days": [2], "locations": ["Science Centre 331"], "instructors": ["Professor TAN Yen Joe"], "meetingDates": ["7/1", "14/1", "21/1", "4/2", "11/2", "18/2", "25/2", "11/3", "18/3", "25/3", "1/4", "8/4", "15/4"]}, "-S01-SEM (8509)": {"startTimes": ["10:30"], "endTimes": ["12:15"], "days": [2], "locations": ["Science Centre 331"], "instructors": ["Professor TAN Yen Joe"], "meetingDates": ["7/1", "14/1", "21/1", "4/2", "11/2", "18/2", "25/2", "11/3", "18/3", "25/3", "1/4", "8/4", "15/4"]}}}, "assessments": {"Presentation": "30", "Participation": "10", "Report": "40", "Short answer test or exam": "20"}}, {"code": "4160", "title": "Marine Geology and Geophysics", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "Field Studies/Field-trip\nLecture\nProject\nInteractive Tutorial", "campus": "Main Campus", "academic_group": "Dept of Earth & Environ Sci", "requirements": "Not for students who have taken ESSC4160. Pre-requisite: (EESC3120 or ESSC3120) or ESSC3010 or (EESC4010 or ESSC4010).", "description": "This course focuses on the concepts and theory of marine geology and geophysics. Marine geology is distinct from that of continent and is the important foundation to launch Plate Tectonics, the modern unified theory of the Earth. In this course, major components of marine geological settings such as mid-ocean ridges, transform faults, subduction zones, oceanic lithosphere, and etc. will be introduced and discussed in details. Methods of geophysical survey will also be introduced. Field experiments of scientific instruments such as Ocean Bottom Seismometers, marine magnetometer and gravimeter will be conducted. A geological field trip will also be included. This course will be jointly offered with Ocean College, Zhejiang University, as an initiative to develop ocean sciences at CUHK.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "4170", "title": "Geodynamics", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "Lecture\nSeminar\nInteractive Tutorial", "campus": "Main Campus", "academic_group": "Dept of Earth & Environ Sci", "requirements": "Pre-requisite: EESC2010 or ESSC2010.", "description": "What is the mechanism of plate tectonics and a variety of geological phenomena, such as seafloor spreading, mountain building, volcanoes, earthquakes, faulting? Geodynamics is going to answer those questions through observations and models of the large-scale behaviors of the solid Earth. The goal of the course is to develop a thorough understanding of physical processes, such as lithospheric deformation, heat transfer, and mantle flow. Lectures, paper discussions, and tutorials will help you to understand the principle of geodynamics, learn how to develop simple but useful models, and explain how the Earth evolves.", "outcome": " Understand the fundamental geodynamics principles. Know how to find and process geophysical data, such as topography, gravity, and earthquakes. Able to build and solve geodynamic models and use the model results to explain a variety of geological phenomena. Acquire the ability to read and summarize literatures effectively and efficiently.  Develop critical thinking on the previous studies.", "syllabus": " Overview of Geodynamics Plate Tectonics Stress & Strain Flexure Heat Transfer Fluid Mechanics Mantle Convection Rock Rheology & Faulting", "required_readings": " Turcotte, D.L. & Schubert, G. Geodynamics, 3rd Edition. Cambridge University Press, 623 pp., 2014.  Literatures refer to the course syllabus", "recommended_readings": " Jaeger, J.C., Cook, N.G.W., & Zimmerman, R. Fundamentals of Rock Mechanics, 4th Edition. Wiley, 488 pp., 2007.  Gabriele Morra. Pythonic Geodynamics: Implementations for Fast Computing. Springer Cham, 227 pp., 2018.", "terms": {"2024-25 Term 1": {"--LEC (8773)": {"startTimes": ["11:30", "11:30"], "endTimes": ["13:15", "12:15"], "days": [2, 4], "locations": ["William M W Mong Eng Bldg 703", "Y.C. Liang Hall 106"], "instructors": ["Professor ZHAN Yan", "Professor ZHAN Yan"], "meetingDates": ["3/9", "5/9", "10/9", "12/9", "17/9", "19/9", "24/9", "26/9", "3/10", "8/10", "10/10", "15/10", "17/10", "22/10", "24/10", "29/10", "31/10", "5/11", "7/11", "12/11", "14/11", "19/11", "21/11", "26/11", "28/11"]}, "-T01-TUT (8774)": {"startTimes": ["12:30"], "endTimes": ["13:15"], "days": [4], "locations": ["Y.C. Liang Hall 106"], "instructors": ["Professor ZHAN Yan"], "meetingDates": ["5/9", "12/9", "19/9", "26/9", "3/10", "10/10", "17/10", "24/10", "31/10", "7/11", "14/11", "21/11", "28/11"]}}}, "assessments": {"Discussion": "30", "Homework or assignment": "30", "Project": "30", "Short answer test or exam": "10"}}, {"code": "4180", "title": "Earthquake Source Physics", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "Lecture\nInteractive Tutorial", "campus": "Main Campus", "academic_group": "Dept of Earth & Environ Sci", "requirements": "Not for students who have taken ESSC4180. Pre-requisite: (EESC3120 or ESSC3120) or (EESC4010 or ESSC4010) or (EESC4140 or ESSC4140).", "description": "This course focuses on the concepts and theory of earthquake source physics. The topics covered include seismic instrumentation, geophysical observations of earthquake source processes, kinematic source representation of earthquakes, dynamic rupture propagation of earthquakes, frictional properties of fault zones, and entire earthquake cycle. Methods and field practice of seismological survey will also be introduced.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "4210", "title": "Land-Atmosphere Interactions and Boundary-Layer Meteorology", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "Lecture\nInteractive Tutorial", "campus": "Main Campus", "academic_group": "Dept of Earth & Environ Sci", "requirements": "Not for students who have taken ESSC4210. Pre-requisite: (EESC2020 or ESSC2020) or (EESC3200 or ESSC3200) or permission of instructor.", "description": "This course introduces the physical, chemical and biological processes governing the exchange of energy, momentum, water and other chemical materials between the atmosphere and land surface, including a formal introduction into boundary-layer meteorology. Topics covered include the basic equations and concepts of heat, momentum and mass conservation and transfer at the land-atmosphere interface; soil physics and hydrometeorology; temperature, humidity and wind distribution in the atmospheric boundary layer; theories and observations of turbulence; boundary layer dynamics; biometeorology and ecophysiology of land plants; canopy and ecosystem exchange; and land use change and urbanization. Applications to weather phenomena, air pollution, forestry, agriculture and ecosystem management will be emphasized throughout.", "outcome": "At the completion of this course, the students will be able to 1) Gain knowledge of physical, chemical and biological processes of land-atmosphere interactions and boundary layer dynamics; and 2) Develop the skill and ability to understand weather and climate variability related to land-atmosphere interactions. (Course Outcomes as related to Programme Learning Outcomes) -- The students will develop: 1) the ability to evaluate an issue critically based on evidence and scientific principle, 2) to acquire knowledge effectively by self-study and using information technology, and to work independently, 3) to work effectively in a team, and 4) to present information in a clear, concise and logical manner. The students also can acquire a responsible attitude in study and work, and have motivation for life-long learning.", "syllabus": "TopicsIntroduction to land-atmosphere interactions; soil physics I: soil heat transfer and temperature dynamicsHydrological cycle; soil physics II: water movement and infiltration; evapotranspiration; water balanceSurface energy fluxes and balance; soil moisture and atmospheric boundary layerBasic Thermodynamic Relations and Moisture Content in AirStatic Stability & PBL StructureViscous Force and Fundamentals of TurbulenceEddy Flux & Turbulent Kinetic EnergyBasics on Closure TechniquesMore on the Surface & Similarity TheoryAerodynamic conductance; plant biophysics and ecophysiologyPlant canopies; eddy covariance measurementsUrban climatology; air pollution meteorology ", "required_readings": " Bonan, G., 2016: Ecological Climatology: Concepts and Applications (3rd Edition). Cambridge University Press. Arya, S. P., 2001: Introduction to Micrometeorology (2nd Edition). Academic Press.", "recommended_readings": " Stull, R. B., 1988: Introduction to Boundary Layer Meteorology. Kluwer Academic Publishers.", "terms": {"2024-25 Term 1": {"--LEC (7149)": {"startTimes": ["11:30", "11:30"], "endTimes": ["13:15", "12:15"], "days": [2, 4], "locations": ["Mong Man Wai Bldg 705", "Lady Shaw Bldg C4"], "instructors": ["Dr. AU-YEUNG Yee Man, \n\nDr. LI Kwan Kit Ronald", "Dr. AU-YEUNG Yee Man, \n\nDr. LI Kwan Kit Ronald"], "meetingDates": ["3/9", "5/9", "10/9", "12/9", "17/9", "19/9", "24/9", "26/9", "3/10", "8/10", "10/10", "15/10", "17/10", "22/10", "24/10", "29/10", "31/10", "5/11", "7/11", "12/11", "14/11", "19/11", "21/11", "26/11", "28/11"]}, "-T01-TUT (8131)": {"startTimes": ["12:30"], "endTimes": ["13:15"], "days": [4], "locations": ["Lady Shaw Bldg C4"], "instructors": ["Dr. AU-YEUNG Yee Man, \n\nDr. LI Kwan Kit Ronald"], "meetingDates": ["5/9", "12/9", "19/9", "26/9", "3/10", "10/10", "17/10", "24/10", "31/10", "7/11", "14/11", "21/11", "28/11"]}}}, "assessments": {"Essay test or exam": "60", "Homework or assignment": "30", "Participation": "10"}}, {"code": "4220", "title": "Tropical Meteorology", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "Lecture\nInteractive Tutorial", "campus": "Main Campus", "academic_group": "Dept of Earth & Environ Sci", "requirements": "Not for students who have taken ESSC4220. Pre-requisite: EESC3200 or ESSC3200.", "description": "This course introduces tropical atmospheric circulation and related air-sea coupling at a variety of spatial and temporal scales. The topics covered include the role of the tropics in the global energy and momentum balance, ITCZ, subtropical high, upper-level anticyclones, tropical ocean circulation, tropical weather, climate and atmosphere-ocean interaction phenomena including meso-scale convective systems, tropical waves, the Hadley and the Walker circulation, El Nino-Southern Oscillation, tropical cyclones, Madden Julian Oscillation, and monsoons.", "outcome": "At the completion of this course, the students will be able to 1) Gain the knowledge of various tropical atmospheric motions, 2) Understand physical processes in the tropical atmosphere; and 3) Apply knowledge to understand tropical climate variability. The students will develop: 1) the ability to evaluate an issue critically based on evidence and scientific principle, 2) to acquire knowledge effectively by self-study and using information technology, and to work independently, 3) to work effectively in a team, and 4) to present information in a clear, concise and logical manner. The students also can acquire a responsible attitude in study and work, and have motivation for life-long learning.", "syllabus": " Radiative and convection: Radiative Processes in the Tropics, Surface Energy Balance, Top of the Atmosphere Net Radiation Fluxes, Dry and Moist Stability, Moist Convection General circulation in the tropics: Observed zonally averaged Tropical circulation, Theory of the Hadley Cell, Zonally asymmetric circulation features, seasonal variations, diurnal cycle, Observed aspects of the Intertropical Convergence Zone (ITCZ), ITCZ theory, Gill model, Heat lows, Tropical ocean circulation, ocean waves. Monsoons: Deﬁnition, Differential Heating and the Monsoon, Key Elements of the Asian Summer and Winter Monsoon , Onset and Withdrawal, Breaks in the Indian Monsoon El Nino and Southern Oscillation (ENSO): Observational aspect, air-sea interaction, Bjerknes feedback, teleconnection, ENSO modeling, Indian Ocean Dipole Madden Julian Oscillation (MJO): Observational aspect, Theory of MJO, Westerly wind bursts, Connection with ENSO Tropical Waves and Tropical Depressions (TD): Matsuno wave theory, convective coupled equatorial waves, easterly waves and TD-type disturbances, relationship with Tropical Cyclones (TC) genesis TC: Structure, Genesis, dynamics of TC movement, and intensiﬁcation, modeling and forecasting Tropical Squall Lines and Mesoscale Convective Systems (MCS): Observations of MCS and squall lines, dynamical aspects, Organization of Convection", "required_readings": "Krishnamurti, T.N., Stefanova, Lydia, Misra, Vasubandhu, 2013: Tropical Meteorology- An Introduction. Springer.", "recommended_readings": " Hastenrath, S., 1991: Climate Dynamics of the Tropics. Updated Edition from Climate and Circulation of the Tropics. Springer, Kluwer Academic Publishers. Wang, Bing, 2006: The Asian Monsoon. Springer Praxis Books (Environmental Sciences).", "terms": {"2024-25 Term 2": {"--LEC (6887)": {"startTimes": ["9:30"], "endTimes": ["12:15"], "days": [2], "locations": ["William M W Mong Eng Bldg 407"], "instructors": ["Dr. AU-YEUNG Yee Man, \n\nProfessor TAM Chi Yung Francis"], "meetingDates": ["7/1", "14/1", "21/1", "4/2", "11/2", "18/2", "25/2", "11/3", "18/3", "25/3", "1/4", "8/4", "15/4"]}}}, "assessments": {"Homework or assignment": "50", "Participation": "5", "Short answer test or exam": "45"}}, {"code": "4230", "title": "Introduction to the Physics and Chemistry of Aerosol", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "Lecture\nInteractive Tutorial", "campus": "Main Campus", "academic_group": "Dept of Earth & Environ Sci", "requirements": "Not for students who have taken ESSC4230. Pre-requisite: EESC2020 or ESSC2020 or permission of instructor.", "description": "Fundamentals of aerosol physics and chemistry; condensation and evaporation; thermodynamics; nucleation, diffusion, coagulation; radiative, hygroscopic properties, and cloud formation potential of aerosols; aerosol phase oxidation reactions; heterogeneous oxidative processes.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "4240", "title": "Air Pollution Science and Engineering", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "Lecture\nInteractive Tutorial", "campus": "Main Campus", "academic_group": "Dept of Earth & Environ Sci", "requirements": "Not for students who have taken ESSC4240.", "description": "This course will cover a variety of topics related to air pollution science and engineering. Topics include: indoor and outdoor air quality (including particulate matters (PM) and gases pollutants); air pollution measurement and statistics; air quality meteorology and dispersion models; principles and challenges of air pollution control and measurement.", "outcome": " To understand the physical and chemical principles governing the sources, formation, transport, transformation, health impacts of air pollutants in both indoor and outdoor environments. To understand the working principles of various air pollution monitoring instrumentation.  To apply statistical tools and mathematical models to solve air pollutant dispersion problems.  To apply various air pollution engineering approaches to solve air pollution issues. To gain a better understanding of current air pollution problems and control challenges. ", "syllabus": "     Background and Review   Topic 1 Physics of Particulate Matter (PM) (or Aerosols)  and Properties of Gases   Topic 2 Transport and Motion of PM in Fluid   Topic 3 Size Statistics of PM     PM and Gases Measurement Techniques   Topic 4 Inertial Impactors   Topic 5 Light Scattering Fundamentals and Optical Techniques of PM   Topic 6 Filtration Methods   Topic 7 Nanoparticle Measurement using Electrical Techniques   Topic 8 Gas Phase Species Measurement Techniques     Field Measurements   Topic 9 Atmospheric PM Measurement   Topic 10 Indoor PM Measurement   Topic 11 Biological Particles Detection and Characterization   Topic 12 Chemical Characterization and Detection of PM   Topic 13 Dispersion Models   Topic 14 Environmental and Health Impacts of PM     Air Quality Engineering and Control   Topic 15 Removal of PM from Gas StreamsSettling ChambersCyclone SeparatorsElectrostatic PrecipitationWet Collectors   Topic 16 Removal of Gaseous PollutantsAbsorption of Gases by LiquidAdsorption of Gases on Solid     Lab Demonstration     1. Submicrometer Particle Generation and Measurement2. Micrometer Particle Generation and Measurement3. Condensation Particle Counter4. Personal PM Sampling  ", "required_readings": " J.H. Seinfeld and S.N. Pandis: Atmospheric Chemistry and Physics, From Air Pollution to Climate Change, Wiley-Interscience, 1998 (2nd edition: 2006)  W.C. Hinds, Aerosol Technology, Wiley-Interscience, 1999", "recommended_readings": "Refer to the course syllabus distributed in the class.", "terms": {"2024-25 Term 1": {"--LEC (7196)": {"startTimes": ["14:30"], "endTimes": ["17:15"], "days": [2], "locations": ["Lady Shaw Bldg LT2"], "instructors": ["Professor CHAN Man Nin"], "meetingDates": ["3/9", "10/9", "17/9", "24/9", "8/10", "15/10", "22/10", "29/10", "5/11", "12/11", "19/11", "26/11"]}}}, "assessments": {"Essay test or exam": "40", "Homework or assignment": "40", "Presentation": "20"}}, {"code": "4250", "title": "Advanced Topics in Atmospheric Dynamics", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "Lecture\nInteractive Tutorial", "campus": "Main Campus", "academic_group": "Dept of Earth & Environ Sci", "requirements": "Not for students who have taken ESSC4250. Pre-requisite: EESC3200 or ESSC3200 or permission of instructor.", "description": "This course introduces the basics of geophysical fluid dynamics. Topics include fundamental governing equations, scale analyses of geophysical flows in the Earth's atmosphere and ocean, filtered models, waves, vorticity, quasi-geostrophic theory, bartropic and baroclinic instabilities.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "4260", "title": "Urban Climatology", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "Laboratory\nLecture", "campus": "Main Campus", "academic_group": "Dept of Earth & Environ Sci", "requirements": "Not for students who have taken ESSC4260. Pre-requisite: EESC2020 or ESSC2020.", "description": "Human modifications to the surface of the Earth during urbanisation change most of the elements of climate and weather in the urban atmosphere. This course introduces the fundamentals of urban climatology and the processes caused by the changes in the surface environment, particularly focusing on how urban structures interact with the atmospheric environment. Numerical modelling and field techniques are introduced to understand the underlying processes resulting urban climatic phenomena. It also examines the implications on human comfort and climate-sensitive urban planning and design, as well as the relationship between cities and climate change", "outcome": "Students are expected to attain the knowledge about how urbanisation affects the local climate and the underlying processes. They should also be able to: 1.  describe the scientific processes and explain the theories of how urbanisation alters local climate; 2.  explain the physical mechanisms governing the formation of urban climatic phenomena; 3.  conduct numerical modelling and field experiments of urban climatic processes; and 4.  understand the practical implications of urban climatology on climate-sensitive urban planning and design.", "syllabus": "Topic and Content/Fundamental concept Week 1 Lecture 1: Introduction to urbanisation and urban climate Week 2 Lecture 2: Fundamentals of urban climatology I •    Urban boundary layer (UBL) and urban canopy layer (UCL) •    Urban climatic processes within UBL and UCL Week 3 Lecture 3: Fundamentals of urban climatology II •    Heterogeneity of urban surface environment •    Atmospheric turbulence and exchange of energy and water Week 4 Lecture 4: Urban energy balance I •    Anthropogenic heat flux •    Urban radiation balance Week 5 Lecture 5: Urban energy balance II •    Urban canopy energy balance •    Urban neighbourhood energy balance Week 6 Lab 1: Urban Multi-scale Environmental Predictor (UMEP): An integrated tool for city-based climate services Week 7 Lecture 6: Urban heat islands – History and physical basis •    Detection of urban heat island: Luke Howard in 1810s •    Determinants of heat island magnitude and structure •    Diversity of urban heat island Week 8 Lecture 7: Monitoring urban heat islands •    Ground-level meteorological measurements •    Mobile measurements •    Land surface temperature Week 9 Lecture 8: Urban heat islands – Examples of different climatic regions •    Tropical climates: Singapore and India •    Sub-tropical climates: Hong Kong and South Africa •    Mediterranean climates: Greece and Spain •    High-latitude climates: Sweden and the United Kingdom Week 10 Lecture 9: Urban climatic mapping •    Urban climatic maps – History, development, and applications •    Local climatic zones – Classification of surface environment Week 11 Lecture 10: Application of urban climatology in climate-sensitive urban planning and design •    Why urban planning and design matters? •    Air Ventilation Assessment System •    Sustainable Building Design Guidelines Week 12 Lab 2: Mapping of local climatic zones using WUDAPT methodology Week 13 Lecture 11: Cities and climate change", "required_readings": "Refer to the course syllabus distributed in the class.", "recommended_readings": " Arnfield AJ, 2003. Two decades of urban climate research: a review of turbulence, exchanges of energy and water, and the urban heat island. International Journal of Climatology 23(1): 1-26. Landsberg HE, 1981. The Urban Climate. Academic Press, New York. Oke TR, 2015. Boundary-layer Climates (2nd Edition). Routledge, United Kingdom. Santamouris M, 2001. Energy and Climate in the Urban Built Environment. Routledge, United Kingdom.  ", "terms": {"2024-25 Term 1": {"--LEC (7150)": {"startTimes": ["15:30"], "endTimes": ["18:15"], "days": [3], "locations": ["William M W Mong Eng Bldg 401"], "instructors": ["Dr. GAO Kai, \n\nDr. YAO Lingye, \n\nProfessor HE Yueyang"], "meetingDates": ["4/9", "11/9", "25/9", "2/10", "9/10", "16/10", "23/10", "30/10", "6/11", "13/11", "20/11", "27/11"]}}}, "assessments": {"Essay test or exam": "50", "Lab reports": "20", "Project": "30"}}, {"code": "4270", "title": "Cloud Dynamics", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "Lecture\nInteractive Tutorial", "campus": "Main Campus", "academic_group": "Dept of Earth & Environ Sci", "requirements": "Pre-requisite: EESC2020 or ESSC2020.", "description": "This course presents an introduction to clouds. We begin with a descriptive cloud classification to introduce the different types of clouds in the Earth’s atmosphere. This is followed by cloud microphysics, describing some of the basic microphysical processes regarding formation, growth, shrinkage, breakup and fallout of cloud and precipitation particles. This will then be linked to cloud dynamics, associated with the fluid motions of the atmosphere. Next, different structures of precipitation and radar cloud sensing shall be presented. These shall then feedback onto our beginning description of clouds on the global climatological level. Student taking this course are expected to have taken EESC2020 or ESSC2020.", "outcome": "Students shall learn about a wide variety of physics and dynamics that control the occurrence, characteristics, and behavior of clouds. They shall understand the processes determining all the types of clouds in our atmosphere, over a wide range of spatial scales from microns to thousands of kilometers. They shall appreciate the importance of cloud to Earth’s climate. There may also be opportunities (e.g. outdoor cloud observations, computer visualization of clouds) where student can practice working effectively in a team, and present information in a clear, concise and logical manner.", "syllabus": "TopicsPart 1: Cloud typesCloud types and precipitating cloud systemsPart 2: Recap of atmospheric dynamics and thermodynamicsAtmospheric flow, instability, and phase transitionPart 3: Aerosols, cloud microphysics and chemistry Aerosol characteristics, cloud droplet formation, microphysical processes of warm and cold clouds, cloud chemistry  Part 4: Precipitation and climatic impactsTypes and structures of precipitation, their radar measurements, and the impacts of clouds on global energy and climate Lab 1: cloud identification outdoor activity Lab 2: computer simulation of clouds ", "required_readings": "Lohmann, Luond and Mahrt (2016): An Introduction to Clouds from the Microscale to Climate, First Edition, Cambridge University Press.", "recommended_readings": " Robert A. Houze Jr (2014): Cloud Dynamics, Second Edition, Academic Press. J. Marshall and R. A. Plumb (2007): Atmosphere, Ocean, and Climate Dynamics: An Introductory Text, First Edition, Academic Press. ", "terms": {"2024-25 Term 1": {"--LEC (7148)": {"startTimes": ["9:30", "10:30"], "endTimes": ["11:15", "11:15"], "days": [3, 4], "locations": ["Y.C. Liang Hall 106", "Science Centre L3"], "instructors": ["Dr. LI Kwan Kit Ronald, \n\nProfessor LEUNG Wing Mo", "Dr. LI Kwan Kit Ronald, \n\nProfessor LEUNG Wing Mo"], "meetingDates": ["4/9", "5/9", "11/9", "12/9", "19/9", "25/9", "26/9", "2/10", "3/10", "9/10", "10/10", "16/10", "17/10", "23/10", "24/10", "30/10", "31/10", "6/11", "7/11", "13/11", "14/11", "20/11", "21/11", "27/11", "28/11"]}}}, "assessments": {"Essay test or exam": "35", "Homework or assignment": "20", "Lab reports": "20", "Short answer test or exam": "25"}}, {"code": "4280", "title": "Practical Meteorology", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "Lecture\nInteractive Tutorial", "campus": "Main Campus", "academic_group": "Dept of Earth & Environ Sci", "requirements": "Pre-requisite: EESC2020 or ESSC2020.", "description": "Practical Meteorology is an advanced undergraduate course designed to provide students with a comprehensive understanding of various aspects of meteorology and their practical applications. The course will cover synoptic and mesoscale meteorology, satellite and radar meteorology, radiative transfer, lidar meteorology, aviation meteorology, and atmospheric instrumentation. Through a combination of lectures and case studies using instrument data, students will gain hands-on experience in analyzing and interpreting meteorological data.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "4325", "title": "Advanced Environmental Chemistry", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Dept of Earth & Environ Sci", "requirements": "Not for students who have taken ENSC4525. Pre-requisite: EESC2515 or ENSC2515 or permission of the instructor.", "description": "This course is designed to extend students' understanding of and develop their ability in the application of various aspects of environmental chemistry in relation to the major types of air and water pollution associated with industrial and vehicle emissions. It outlines the basic processes in bleaching and dyeing, electroplating and food processing that give rise to water pollution and application of physico-chemical techniques in controlling such pollution. It also examines combustion processes and the associated applications and limitations of the absorption, adsorption, oxidation-reduction and catalytic conversion techniques in relation to aerial emissions from furnaces and vehicles. Site visits will be arranged where possible to enhance students' ability in application.", "outcome": "Students will become familiar with air and water pollution associated with industrial and vehicle emissions. They will be able to evaluate the basic pollution control and prevention approaches in bleaching and dyeing, electroplating and food processing industries.", "syllabus": " Clean Production Metal Finishing Industry Electronics Industry Textile Industry Field Trips HKPC Air Pollution The Energy Industry", "required_readings": "Refer to the course syllabus distributed in the class.", "recommended_readings": " Cleaner Production for a better environment, http://www.hkpc.org/hkcpc/; National Pollution Prevention Roundtable, http://www.p2.org;", "terms": {"2024-25 Term 1": {"--LEC (8133)": {"startTimes": ["10:30"], "endTimes": ["13:15"], "days": [3], "locations": ["Basic Med Sci Bldg LT"], "instructors": ["Dr. CHAN Ka Long Donald"], "meetingDates": ["4/9", "11/9", "25/9", "2/10", "9/10", "16/10", "23/10", "30/10", "6/11", "13/11", "20/11", "27/11"]}}}, "assessments": {"Homework or assignment": "20", "Short answer test or exam": "50", "Selected response test or exam": "30"}}, {"code": "4335", "title": "Chemical Treatment Processes", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Dept of Earth & Environ Sci", "requirements": "Not for students who have taken ENSC4535. Pre-requisite: EESC2515 or ENSC2515 or permission of the instructor.", "description": "This course introduces the principles and applications of various chemical and physiochemical processes applicable for treatment and control of air and water pollution. It studies the processes of neutralization, oxidation-reduction, chemical precipitation, coagulation, flocculation, physical separation, absorption, adsorption, filtration, chemical disinfection, solvent extraction, fractional distillation and incineration. It also examines the applicabilities and limitations of such processes with reference to the treatment and recovery of toxic and hazardous chemical wastes. Site visits will be arranged to enhance students' ability in application.", "outcome": "Students will become familiar with various chemical and physico-chemical processes applicable for treatment and control of air and water pollution. They will be able to evaluate the applicabilities and limitations of such processes with reference to the treatment and recovery of toxic and hazardous chemical wastes.", "syllabus": " Toxic Waste in Love Canal, New York Chemical Contamination in Penny's Bay, Hong Kong Hong Kong Dioxin Studies Treatment of Dioxins Emerging Technologies Gas-Phase Chemical Reduction Solvated Molten Salt Oxidation Field Trip to Chemical Waste Treatment Centre Overview of Technologies Water Treatment Advanced Oxidation Treatment Nanotech Energy and Environment", "required_readings": "Refer to the course syllabus distributed in the class.", "recommended_readings": "  APEC Virtual Center for Environmental Technology Exchange, http://www.apec_vc.or.jp/e/  Federal Remediation Technologies Roundtable, http://www.frtr.gov", "terms": {"2024-25 Term 2": {"--LEC (7349)": {"startTimes": ["8:30"], "endTimes": ["11:15"], "days": [2], "locations": ["Science Centre L5"], "instructors": ["Dr. CHAN Ka Long Donald"], "meetingDates": ["7/1", "14/1", "21/1", "4/2", "11/2", "18/2", "25/2", "11/3", "18/3", "25/3", "1/4", "8/4", "15/4"]}}}, "assessments": {"Homework or assignment": "20", "Short answer test or exam": "50", "Selected response test or exam": "30"}}, {"code": "4340", "title": "Environmental Impact Assessment", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Dept of Earth & Environ Sci", "requirements": "Not for students who have taken ENSC4240. Pre-requisite: (EESC2270 or ENSC2270) and BIOL2210.", "description": "This course discusses the techniques and procedures of evaluating environmental consequences arising from human activities, with focus on their application in Hong Kong as prescribed under the Hong Kong Environmental Impact Assessment Ordinance, and its Technical Memorandum. Students are encouraged to take the laboratory course (EESC4342) together with the lecture in order to have a better integration of theories and practical experiences on the subject.", "outcome": "Students completing this course are expected to: understand the theory and principles behind the methods and techniques used in environmental impact assessment (EIA); appreciate the processes and requirements of EIA in Hong Kong; become familiar with the protocols and procedures of EIA in Hong Kong.", "syllabus": " Environmental Impact Assessment (EIA) – Principles and Concepts  Origin and Development of EIA   Overview of EIA in Hong Kong  EIA Ordinance EIA Technical Memorandum   Procedure and Processes of EIA  Methods of Impact Analysis Desirable Properties of EIA Methods   Methods for Identification of Impacts  Checklist and Matrix Geographical Information System (GIS)   Methods for Prediction of Impacts  Simulation and Computer Modeling Statistical and Environmental Data Analysis   Methods for Evaluation of Impacts  Cost-Benefit Analysis Environmental Risk Assessment   Detailed Procedure and Requirements in Hong Kong EIA  Description of the Environmental Setting Prediction, Evaluation and Mitigation of the Impact  i.          Air qualityii.         Noise qualityiii.        Water qualityiv.        Waste managementv.         Ecologyvi.        Fisheriesvii.       Visual and landscapeviii.      Cultural Heritageix.        Socio-economic Presentation and Review Public Participation in EIA Environmental Monitoring and Auditing Strategic Environmental Assessment Cumulative Impact Analysis", "required_readings": "Hong Kong EIA Ordinance and Technical Memoradum, Environment Protection Department, Hong Kong SAR Government", "recommended_readings": " Carroll Barbara, Turpin Trevor. 2002. Environmental Impact Assessment Handbook: A Practical Guide for Planners, Developers and Communities Thomas Telford, London. [TD194.68.G7 C377 2002] Glasson John, Therivel Riki, Chadwick Andrew. 1999. Introduction to Environmental Impact Assessment: principles and procedures, process, practice and prospects. 2nd ed.UCL Press Limited, London. 342 pp. ISBN 1-85728-118-7 [TD 194.68 G7 G58 1999] Hanna, Kevin S. (ed.) 2005. Environmental Impact Assessment: Practice and Participation. Oxford University press, Don Mills, Ont.; New York. [TD194.68.C3E55 2005] Morris Peter, Therivel Riki. (eds). 2001. Methods of Environmental Impact Assessment. 2nd ed. Spon Press, London and New York. [TD194.68 G7 M48 2001] P. 4 Pastorok, Robert A.et al. (eds) 2002. Ecological modeling in Risk Assessment: Chemical Effects on Populations, Ecosystems, and Landscapes. Lewis Publishers,Boca Raton, Fla. [QH545.A1 E277] Sadar, M.H. 1996. Environmental Impact Assessment. 2nd Ed. Carlton University Press, Ottawa. [TD194.6 S33 1996] Suter, Glenn W. (ed.). 2007. Ecological Risk Assessment. CRC press/Taylor & Francis, Boca Raton. [QH541.15.R57 E25 2007] Wood Christopher. 1995. Environmental Impact Assessment. A Comparative Review. Longman Scientific & Technical, Essex. ISBN 0-582-23696-7 [TD 194.6 W66 1995]", "terms": {"2024-25 Term 1": {"--LEC (6425)": {"startTimes": ["9:30", "8:30"], "endTimes": ["10:15", "10:15"], "days": [1, 5], "locations": ["Leung Kau Kui Bldg 101", "Science Centre LG23"], "instructors": ["Dr. LAW Man Suet Michelle", "Dr. LAW Man Suet Michelle"], "meetingDates": ["2/9", "6/9", "9/9", "13/9", "16/9", "20/9", "23/9", "27/9", "30/9", "4/10", "7/10", "14/10", "18/10", "21/10", "25/10", "28/10", "1/11", "4/11", "8/11", "11/11", "15/11", "18/11", "22/11", "25/11", "29/11"]}}}, "assessments": {"Short answer test or exam": "60", "Selected response test or exam": "40"}}, {"code": "4342", "title": "Environmental Impact Assessment Laboratory", "career": "Undergraduate", "units": "2.00", "grading": "Graded", "components": "Laboratory", "campus": "Main Campus", "academic_group": "Dept of Earth & Environ Sci", "requirements": "Not for students who have taken ENSC4242. Co-requisite: EESC4340 or ENSC4240.", "description": "This laboratory course accompanies the lecture course EESC4340 and provides hands-on exercises on selected techniques used in environmental impact assessment (EIA). Students will critically review a current EIA report with respect to its soundness in the application of EIA methodologies and the evaluation of assessment results. They will also gain first-hand experience on how to carry out an EIA by working on a small scale EIA project focusing on specific components of impact assessment.", "outcome": "Students completing this course are expected to: obtain a first hand understanding of how Environmental Impact Assessment (EIA) works in Hong Kong by reviewing and critically evaluating existing Hong Kong EIA reports; gain hands-on experiences on how some EIA protocols are carried out; develop the practical skills of doing an EIA by getting involved in actual preparation of a project profile, study brief and by actually carrying out a small scale EIA project; learn from the experiences of front-line practitioners of EIA in Hong Kong by engaging in sharing and discussion with them during guest presentations; strengthen their communication skills through oral presentation and report writing.", "syllabus": " Review of Hong Kong EIA Reports Preparation of Project Profile and Study Brief Methods of EIA: Landscape and Visual Impact Assessment Methods of EIA: Use of Statistics Methods of EIA: Ecological Impact Assessment Methods of EIA: Noise Impact Assessment Methods of EIA: Air Impact Assessment Field Trip: Ecological site of conservation value Guest Speakers on various topics, including but not limited to Ecological Impact Assessment /Fisheries Impact Assessment, Water Quality Impact Assessment, Noise Impact Assessment, Environmental Monitoring and Audit, Public Engagement in Hong Kong EIA Small scale EIA project, complete with oral presentation and EIA report writing. Course Syllabus (Chinese)", "required_readings": " S.E. Manahan, Environmental Chemistry, 7th Ed., Lewis publishers, Boca Raton, 2000. N.J. Bunce, Introduction to Environmental Chemistry, Wuerz Publishing, Winnipeg, 1993. P.E. Buell and J.E. Girard, Chemistry: An Environmental Perspective, Prentice Hall, Englewood Cliffs, 1994.", "recommended_readings": "Suggested on a case to case basis.", "terms": {"2024-25 Term 1": {"-L01-LAB (6426)": {"startTimes": ["14:30"], "endTimes": ["18:15"], "days": [2], "locations": ["Lai Chan Pui Ngong LT"], "instructors": ["Dr. LAW Man Suet Michelle"], "meetingDates": ["3/9", "10/9", "17/9", "24/9", "8/10", "15/10", "22/10", "29/10", "5/11", "12/11", "19/11", "26/11"]}}}, "assessments": {"Attendance": "10", "Lab reports": "90"}}, {"code": "4350", "title": "Environmental Health", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Dept of Earth & Environ Sci", "requirements": "Not for students who have taken ENSC4250. Pre-requisite: EESC3520 or ENSC3520.", "description": "This course introduces the contemporary problems and issues in environmentally dependent aspects of health. Broad coverage of health effects of foodborne, airborne and waterborne pollutants, pesticides, and consumer product are considered.", "outcome": "This course is designed to give students an overview of the sources, modes of action, and health effects of the global and local important pollutants including pesticides, food additives, transgenes in genetically modified foods, environmental tobacco smoke, indoor air pollutants, water pollutants, peroxisome proliferators, environmental estrogens, and benzene. After the study, the student should be able to: Describe the sources of the pollutants Understand the modes of action of the pollutants Familiar with the symptoms and human health effects resulting from exposure to the pollutants Discuss ways to reduce our exposure to the pollutants", "syllabus": " Pesticides Food additives Genetic modified foods Environmental tobacco smoke Indoor air pollutants Drinking water quality and health Peroxisome proliferators Environmental estrogens Occupational chemical hazards", "required_readings": "Refer to the course syllabus distributed in the class.", "recommended_readings": "Pesticides: F. P. Kaloyanova and M. A. El Batawi (eds.). Human Toxicology of Pesticides. CRC Press. 1991. (WA240K2781991) K. A. Hassall (ed.). The Biochemistry & Uses of Pesticides. 2nd ed. Macmillan Press. 1990. (SB951H2771990) M. A. Kamrin (ed.). Pesticides Profiles: Toxicity, Environmental Impact, and Fate. CRC Press. 1997. (SB951P3761997) S. R. Baker and C. F. Wilkinson (eds.). The Effect of Pesticides on Human Health. Vol XVIII. Princeton Scientific Publishing Co., Inc. 1990. (WA670A38v.18c.2)Food additives and contaminants: J. M. Concon. Food Toxicology: Part B. Contaminants and Additives. Marcel Dekker Inc., New York. 1988. (WA712.066.ptB) L. M. Crawford and D. A. Franco (eds.). Animal Drugs and Human Health. Technomic Publishing Co. Inc., Lancaster. 1994. (WA707.A55.1994) C. S. Creaser and R. Purchase (eds.). Food Contaminants: Sources and Surveillance. The Royal Society of Chemistry, Cambridge. 1991. (TX531.F56.1991) J. A. Maga and A. T. Tu (eds.). Food Additive Toxicology. Marcel Dekker Inc., New York. 1995. (TX553.A3F563.1995)Genetically modified foods: K. Roseboro (ed.). Genetically Altered Foods and Your Health. Basic health Publications, North Bergen, New Jersey. 2004. (WA695.R67.2004) F. E. Ahmed (ed.). Testing of Genetically Modified Organisms in Foods. Food Products Press, New York. 2004. (WA701.T45.2004)Environmental tobacco smoke: E. L. Wynder and J. Garland (eds.). The Biologic Effects of Tobacco. Little Brown and Company. Boston. 1995. (QP981.T6W9) N. L. Benowitz (ed). Nicotine Safety and Toxicity. Oxford University Press, New York.1998. (QV137N551998) W. R. Martin, G. R. Van Loon, E. T. Iwamoto and L. Davis (eds.) Tobacco Smoking and Nicotine: A Neurobiological Approach. Plenum Press, New York and London. 1987. (QV137T62)Indoor air pollutants: D. J. Hansen (ed.). The Work Environment. Vol. 3. Indoor Health Hazards. Ch. 3.Lewis Publishers, BoCa Ration. 1994. (WA400W671994). J. E. Craig. Indoor Air Quality and Pollution. Ch. 3. In Pathology of Environmental and Occupational Diseases. Mosby, St. Louis. 1995. (WA30C761995). H. Koren (ed.). Handbook of Environmental Health and Safety. Principles and Practices. Vol. II. 2nd ed. Lewis Publishers. National Environmental Health Association. 1991. (WA30K671991v.2). A. M. Pope and D. P. Rall (eds.). Environmental Medicine: Integrating a Missing Element into Medical Education. National Academy Press. Washington, DC. 1995. (WA. 510.I567.1995)Drinking water quality and health: W. Viessman, Jr. and M. J. Hammer (eds.). Water Supply and Pollution Control. 6th ed. Addison-Wesley Longman, Inc. California. 1998. (TD353V541998) G. A. McFeters (ed.). Drinking Water Microbiology. Springer-Verlag. New York.1990. (TD384D75) J. E. Craighead. Pathology of Environmental and Occupational Disease. Mosby, St. Louis. 1995. (WA30C761995) Guidelines for Drinking-Water Quality. 2nd ed. Vol. 2. World Health Organization. Geneva. 1996. (TD215W671993.v.2)Peroxisome proliferators: S. S. T. Lee, T. Pineau, J. Drago, E. J. Lee, Jennie W. Owens, D. L. Kroetz, P. M. Fernandez-Salguero, H. Westphal and F. J. Gonzalez. Targeted Disruption of the Alpha Isoform of the Peroxisome Proliferator-Activated Receptor Gene in Mice Results in Abolishment of the Pleiotropic Effects of Peroxisome Proliferators. Molec. Cell. Biol.15:3012-3022, 1995. H. Keller, A. Mahfoudi, C. Dreyer, A. K. Hihi, J. Medin, K. Ozato and W. Wahli. Peroxisome Proliferator-Activated Receptors and Lipid Metabolism. Annals New York Academy of Sciences. 304:157-173, 1990. J. K. Reddy, T. Suga, G. P. Mannaerts, P. B. Lazarow and S. Subramani (eds.). Peroxisomes: Biology and Role in Toxicology and Disease. Annals of the New York Academy of Sciences. New York. Volume 804. 1996. J. M. Peters, R. C. Cattley and F. J. Gonzalez. Role of PPAR in the Mechanism of Action of the Nongenotoxic Carcinogen and Peroxisome Proliferator Wy 14,643. Carcinogenesis 18:2029-2033, 1997.Environmental estrogens: J. A. McLachlan. Estrogens in the Environment. Elsevier/North-Holland. New York. 1979. (QV600.D48.v.5) D. L. Davis, H. L. Bradlow, M. Wolff, T. Woodruff, D. G. Hoel and H. Anton-Culver. Medical hypothesis: Xenoestrogens as Preventable Causes of Breast Cancer. Environ. Health Perspect. 101:323-377, 1993. S. H. Safe. Environmental and Dietary Estrogens and Human Health: Is Tthere a Problem? Environ. Health Perspect. 103:346-351, 1995. J. A. McLachlan and S. F. Arnold. Environmental estrogens. American Scientist 84:452 461, 1996. (LJ.SB502. cc)Occupational chemical hazards - benzene: M. Lippmann (ed.). Environmental Toxicants: Human Exposures and their Health Effects. Van Nostrand Reinhold, Mew York. 1992. (WA671E615) A. Hricko. Rings of Controversy Around Benzene. Environmental Health Perspectives. 102:276-281, 1994. J. E. Craighead. Pathology of Environmental and Occupational Disease. Mosby, St. Louis. 1995. (MDWA30C761995) B. S. Levy and D. H. Wegman. Occupational Health: Recognizing and Preventing Work-Related Disease. 3rd ed. Little, Brown and Company, New York. 1995. (WA4400221995)", "terms": {"2024-25 Term 2": {"--LEC (7895)": {"startTimes": ["14:30"], "endTimes": ["17:15"], "days": [3], "locations": ["William M W Mong Eng Bldg 804"], "instructors": ["Professor Benoit THIBODEAU"], "meetingDates": ["8/1", "15/1", "22/1", "5/2", "12/2", "19/2", "26/2", "12/3", "19/3", "26/3", "2/4", "9/4", "16/4"]}}}, "assessments": {"Homework or assignment": "15", "Short answer test or exam": "45", "Selected response test or exam": "40"}}, {"code": "4510", "title": "Statistical Methods and Data Analysis for Earth and Environmental Sciences", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "Lecture\nInteractive Tutorial", "campus": "Main Campus", "academic_group": "Dept of Earth & Environ Sci", "requirements": "Not for students who have taken ESSC4510. Pre-requisite: (STAT1011 or 1012), and ((EESC2030 or ESSC2030) or PHYS2061).", "description": "This course covers the theoretical basis and practical applications of data analysis relevant for earth and environmental sciences. This course aims to introduce students to Earth and environmental data manipulation, from sampling, reading and writing, to statistical analysis and parameter estimation, to time series analysis, to plotting and visualization. Topics include: digital signal processing, sampling techniques; probability distributions; hypothesis testing; correlation analysis; linear and nonlinear regression; statistical forecasting, harmonic analysis and spectral analysis; principle component analysis; and geostatistics. Tutorials will be based on real geophysical examples including remote sensing and in situ observations, as well as model data.Previous elementary coding experience in Python 3 is recommended.", "outcome": "Students will become knowledgeable about the acquisition, pre-processing and analysis of geophysical and environmental data, including remote sensing, in situ observation and model data. Students will acquire knowledge on techniques for data processing, including visualization methods and statistical analysis, and on the applications of these data and tools to geophysical and environmental problems. The students will develop: 1) the ability to evaluate an issue critically based on evidence and scientific principles, 2) to acquire knowledge effectively by self-study and using information technology, and to work independently, 3) to work effectively in a team, and 4) to present information in a clear, concise and logical manner. The students can also acquire a responsible attitude in study and work, and have motivation for life-long learning.", "syllabus": " Exploratory Data Analysis Correlation Analysis Parametric Probability Distribution : Discrete Parametric Probability Distribution : Continuous Hypothesis Testing Frequentist Statistical Inference: Resampling Methods Statistical Forecasting: Simple Linear Regression Statistical Forecasting: Multiple Linear Regression, Non-Linear Regression Statistical Forecasting: Predictor Selection, Ensemble Forecasting Linear algebra and matrix inverse Quantifying preconceptions: Bayesian inference Quantifying preconceptions: Prior information Detecting periodicities: Sinusoidal functions and Fourier series Detecting periodicities: Complex Fourier series and Fourier transform The past influences the present: Convolution The past influences the present: Filters Cross-correlation Bandpass filters and windowing Filling in missing data Approximation Principal Component Analysis I Time Series Analysis Forecast Verification", "required_readings": "Refer to the course syllabus distributed in the class.", "recommended_readings": " Wilks, D.S., Statistical Methods in the Atmospheric Sciences, 3rd edition, AP, 2011. Menke, W., Environmental Data Analysis with Matlab, 2nd edition, AP, 2016", "terms": {"2024-25 Term 2": {"--LEC (6885)": {"startTimes": ["13:30", "12:30"], "endTimes": ["14:15", "14:15"], "days": [3, 4], "locations": ["Mong Man Wai Bldg 707", "Lai Chan Pui Ngong LT"], "instructors": ["Dr. AU-YEUNG Yee Man, \n\nDr. ZHANG Li", "Dr. AU-YEUNG Yee Man, \n\nDr. ZHANG Li"], "meetingDates": ["8/1", "9/1", "15/1", "16/1", "22/1", "23/1", "5/2", "6/2", "12/2", "13/2", "19/2", "20/2", "26/2", "27/2", "12/3", "13/3", "19/3", "20/3", "26/3", "27/3", "2/4", "3/4", "9/4", "10/4", "16/4", "17/4"]}}}, "assessments": {"Homework or assignment": "60", "Project": "40"}}, {"code": "4520", "title": "Numerical Methods and Modeling for Earth and Environmental Sciences", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "Lecture\nInteractive Tutorial", "campus": "Main Campus", "academic_group": "Dept of Earth & Environ Sci", "requirements": "Not for students who have taken ESSC4520. Pre-requisite: (MATH1010 or 1030 or 1520), and ((EESC2030 or ESSC2030) or PHYS2061).", "description": "This course covers the principles of numerical methods and modeling relevant for earth and environmental sciences applications. Topics include: optimization; interpolation; finite differencing; numerical solutions to ordinary and partial differential equations; programming numerical models; filtered models; boundary conditions; subgrid-scale processes; data assimilation; applications in earthquake, climate, air quality, weather forecast and groundwater models. Python will be used in this course.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "4540", "title": "Remote Sensing – Principles and Applications", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "Lecture\nInteractive Tutorial", "campus": "Main Campus", "academic_group": "Dept of Earth & Environ Sci", "requirements": "Not for students who have taken ESSC4540. Pre-requisite: (EESC2010 or ESSC2010) &(EESC2020 or ESSC2020) & (MATH1010 or 1030 or 1510 or 1520) & (PHYS1001 or 1002 or 1111 or 1113) & ((EESC2030 or ESSC2030) or PHYS2061), or permission of instructor.", "description": "Remote sensing observations are critical for monitoring regional and global changes, determining spatial and temporal variability of the Earth System, and addressing fundamental global issues. This course introduces the basic physical principles of remote sensing, including electromagnetic waves and radiation, optical, microwave, and non-imaging remote sensing. It also presents key concepts and examples on remote sensing applications in Earth system science (such as atmosphere, lithosphere, hydrosphere, cryosphere) and global changes. This course also provides computer-based lab exercises that facilitate the understanding of remote sensing principles and the processing of remote sensing data.", "outcome": "This course will contribute to understanding of basic concepts and principles of remote sensing at optical and microwave frequencies from airborne and spaceborne platforms. With the help from laboratory analysis and case studies, remote sensing applications in Earth system science can be further understood. The students will develop: 1)   the ability to evaluate an issue critically based on evidence and scientific principle, 2)   to acquire knowledge effectively by self-study and using information technology, and to work independently, 3)   to work effectively in a team, and 4)   to present information in a clear, concise and logical manner. The students also can acquire a responsible attitude in study and work, and have motivation for life-long learning.", "syllabus": "Week              Topics     Introduction, Remote sensing platforms     Electromagnetic waves and radiation, Electromagnetic interaction with matters     Radiative Transfer     Photogrammetry and stereogrammetry, Structure from Motion     Optical sensors     Remote Sensing Data Processing I: ENVI, color compositive, band math     Passive microwave remote sensing     Active remote sensing: Radar ranging     Active remote sensing: LiDAR ranging     Remote Sensing Data Processing II: data fitting     Synthetic Aperture Radar, Interferometric SAR     Remote Sensing Data Processing III: image processing, filtering     Remote Sensing Data Processing IV: change detection, classification     Machine learning and deep learning in remote sensing ", "required_readings": "Emery W. and Camps A., Introduction to Satellite Remote Sensing, 1st edition. Elsevier, 2017.    Physical principles of remote sensing, 3rd edition, W.G. Rees, Cambridge University Press, 2013", "recommended_readings": "Sabins, F., Remote Sensing: Principles and Interpretation, 3rd edition, Waveland Pr Inc;, 2007.Mather, Paul M., Computer processing of Remotely-Sensed Images, Wiley, 2011.", "terms": {"2024-25 Term 2": {"--LEC (6884)": {"startTimes": ["15:30"], "endTimes": ["18:15"], "days": [1], "locations": ["Mong Man Wai Bldg 707"], "instructors": ["Professor LIU Lin"], "meetingDates": ["6/1", "13/1", "20/1", "27/1", "10/2", "17/2", "24/2", "10/3", "17/3", "24/3", "31/3", "7/4", "14/4"]}}}, "assessments": {"Examination": "20", "Lab reports": "60", "Presentation": "5", "Report": "15"}}, {"code": "4550", "title": "Practical Atmospheric Modeling", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "Lecture\nInteractive Tutorial", "campus": "Main Campus", "academic_group": "Dept of Earth & Environ Sci", "requirements": "Pre-requisite: (EESC2020 or ESSC2020) and (MATH2550 or EESC2520 or PHYS2051) and (PHYS1001 or 1002 or 1111 or 1113), or permission of instructor.", "description": "This course introduces the basic principles of atmospheric modeling and provides hands-on practice to perform numerical simulations on University computing cluster. It begins with the concept of model and reviewing of physical and chemical processes in the atmosphere. After that, this course will cover introduction and hands-on practice of the three basic processes in atmospheric simulation: pre-processing data, modeling, and post-processing data. The pre-processing process refers to the preparation of data from various sources by different techniques such as the generation of emission inventories for atmospheric chemistry modeling. It then introduces numerical modeling basics such as “model equations and numerical approaches”. For post-processing, this course offers different skills in visualization of the model output and evaluation of model output against real-world observations. This course also introduces advanced knowledge in “model coupling” and “inverse modeling”. Finally, this course provides hands-on practice on simple model development experiments. During the course, we will cover basic Linux environment commands to perform the main tasks mentioned above. Overall, students can anticipate grasping basic modeling concepts and skills from this course, which are of great value to their future careers in both academia and industry.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "4601", "title": "Research Seminar in Earth and Environmental Sciences", "career": "Undergraduate", "units": "1.00", "grading": "Graded", "components": "Seminar", "campus": "Main Campus", "academic_group": "Dept of Earth & Environ Sci", "requirements": "Not for students who have taken ESSC4601.", "description": "Research seminar series in Earth and Environmental Sciences. Students will be exposed to frontier research presented by guest speakers through active participation.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "4602", "title": "Selected Topics in Earth and Environmental Sciences", "career": "Undergraduate", "units": "2.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Dept of Earth & Environ Sci", "requirements": "Not for students who have taken ESSC4602.", "description": "Recent research methods, experimental, and computational techniques applied in selected topics in Earth and Environmental Sciences.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "4603", "title": "Advanced Topics in Earth and Environmental Sciences", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Dept of Earth & Environ Sci", "requirements": "Not for students who have taken ESSC4603.", "description": "State-of-the-art research methods, experimental, and computational techniques applied in advanced topics in Earth and Environmental Sciences.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "4810", "title": "Senior Project I", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "Project\nInteractive Tutorial", "campus": "Main Campus", "academic_group": "Dept of Earth & Environ Sci", "requirements": "Not for students who have taken ESSC4810 or PHYS4610. Pre-requisite: Permission of project advisor.", "description": "A project in earth and environmental sciences, either focusing more on research or on reviewing the literature. The project may be combined with EESC4820 to form a more substantial project. Students should seek prior permission of project advisor before enrolment.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "4820", "title": "Senior Project II", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "Project\nInteractive Tutorial", "campus": "Main Campus", "academic_group": "Dept of Earth & Environ Sci", "requirements": "Not for students who have taken ESSC4820 or PHYS4620. Pre-requisite: Permission of project advisor.", "description": "A project in earth and environmental sciences, either focusing more on research or on reviewing the literature. The project may be combined with EESC4810 to form a more substantial project. Students should seek prior permission of project advisor before enrolment.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "4909", "title": "Environmental Sciences Field Study II", "career": "Undergraduate", "units": "1.00", "grading": "Graded", "components": "Field Studies/Field-trip", "campus": "Main Campus", "academic_group": "Dept of Earth & Environ Sci", "requirements": "Pre-requisite: (EESC3230 or ENSC3230) or EESC3510 or (EESC3520 or ENSC3520) or EESC3530 or EESC3540 or (EESC4340 or ENSC4240) or (EESC4350 or ENSC4250) or permission of the instructor.", "description": "This course gives students an opportunity to supplement what they have learnt from the major courses in the format of a local or overseas field trip during summer. Students are required to submit a proposal, participate actively in all activities throughout the field trip, submit an individual report and present a seminar for assessment. The field trip must be approved by the Programme.Students will learn as a global citizen how to learn from other countries’ experiences to act locally in environmental management and protection with innovative ideas and social responsibility. Students will also learn from social enterprise or non-government organizations how to work together with government officials and regular citizens to enhance conservation and environmental protection.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}]