[{"code": "1001", "title": "Exploring Earth and Environmental Sciences", "career": "Undergraduate", "units": "2.00", "grading": "Graded", "components": "Field Studies/Field-trip\nLecture\nProject\nVisit", "campus": "Main Campus", "academic_group": "Earth & Environmental Sci PC", "requirements": "Not for students who have taken ESSC1000.", "description": "(UGEB1870 is double-coded with EESC1001.) The course provides an interdisciplinary study of the Earth Systems, including natural phenomena in the atmosphere, hydrosphere, geosphere, cryosphere, and biosphere. The mechanism of these systems, associated dynamics and anthropogenic impacts will be introduced and discussed. The course also serves as a platform to understand and critically assess global environmental change, natural hazards, biodiversity loss, and the water-energy-food nexus, and explore potential technological and policy solutions to these problems. These objectives align strongly with the understanding and pursuit of the United Nations Sustainable Development Goals, especially SDG#7 Affordable and Clean Energy, SDG#13 Climate Action, SDG#14 Life Below Water, and SDG#15 Life on Land. In addition to attending lectures, students will visit the Jockey Club Museum of Climate Change where it displays the way scientists examine past and current climate and the factors leading to current global temperature change. A geological field excursion will be another highlight of the course to demonstrate the scientific concepts applied to reveal Earth’s tectonic history, evolution and interaction among various spheres. With diverse scientific topics in Earth’s systems, the course shows students how each Earth’s system is interlocking with other spheres and, hence raise the awareness in the importance of sustainability.", "outcome": "  Describe and explain how the atmosphere, hydrosphere, geosphere, cryosphere, and biosphere interact and how feedback mechanisms operate among the Earth systems.  Develop an interdisciplinary approach for investigating Earth system dynamics.   Discuss the anthropogenic influences, as well as scientific and technical challenges related to global environmental changes, natural hazards, and the food-water-energy nexus critically.  Recognize the complexity of linkages between environmental pressures and human responses related to contemporary sustainable development challenges, contributing to the understanding and pursuit of SDG#7 Affordable and Clean Energy, SDG#13 Climate Action, SDG#14 Life below Water, and SDG#15 Life on Land.  Communicate effectively about Earth system and environmental issues in an appropriate science format (i.e. scientific poster and QnA) through working independently and collaboratively.", "syllabus": "      Lectures: To provide students basic concepts of different spheres, background information about present environmental phenomena and scientific approaches to study the Earth system  Tutorial: To guide students critically think about Earth system and related issues to our environment.  Visit: To show students how professional field works to understand our Earth  Field trip: To facilitate students observe the environment and interpret and discuss related environmental problems   Note: Students are expected to attend all lectures, and participate in all tutorials, the visit and the field trip. Meeting with academic advisors can be arranged upon request.     Course Syllabus (English) (Tentative)  The course content will be divided into three parts:     Part I: Geosphere and Cryosphere (Week 1-5)  This component focuses on studying the solid Earth using gravity, electromagnetic and seismic methods. Students will be introduced to the solid physical foundations of the solid Earth, as well as an overview of the structure and composition of the Earth, its materials and constituents, dynamics of its internal and external processes.     Part II: Atmosphere and Climate (Week 7-9)  This compenent covers an integrated introduction to the climate system and the dynamics and chemistry of the atmosphere. Students will learn to explain the history, current state and future projection of weather and climate, natural hazards, and global climate change in the context of natural variability and anthropogenic influence.     Part III: Ecosystem Interactions (Week 10-12)  This compenent covers the interactions of the terrestrial and marine biosphere with the atmosphere, hydrosphere, and geosphere. Students will be introduced to the physical and chemical processes governing the exchange of energy and matter between the biosphere and the environment, addressing related issues such as habitat decline, biodiversity loss, and environmental pollution.             Week    Topics      1    Course Introduction + The Birth of the Earth           Geosphere and Plate Tectonics      2    Marine Geology and Geophysics           Tutorial      3    Hong Kong Geology           Tutorial           Weekend Field Study Group A           Weekend Field Study Group B      4    Volcanoes           Tutorial      5    Cryosphere in A Warming Climate           Tutorial      6    English advising talk           Tutorial      7    Atmospheric Chemistry           Tutorial      8    Global Environmental Change and GHG Emission           Tutorial      9    Dynamics of the Earth’s Climate System           Tutorial      10    Ecosystem, Climate and (Air) Pollution           Tutorial      11    Environmental Biogeochemistry /  Environmental toxicology or chemistry           Tutorial      12    Oceanography           Tutorial           Poster Presentation         Note:   No exam  Corresponding teachers will decide the format and the whether a tutorial session is needed.  Compulsory activities:    Museum visit  Geological field trip (Understanding HK’s past and present environment; 9 hrs)             ", "required_readings": " Refer to the course syllabus distributed in the class. Introductory reading:  Brian J. Skinner & Barbara W. Murch, 2011. The Blue Planet-An Introduction to Earth System Science, 3rd  Edition. Wiley, ISBN: 9780471236436. (Ch.1, 10-13, 15)   Geosphere and Cryosphere:  Stephen Marshak, 2012. Essentials of Geology, 4th Edition. W. W. Norton & Company, ISBN-13: 860-1401249887. (Ch. 1-2)  IPCC, 2019. Special Report on the Ocean and Cryosphere in a Changing Climate. Website: https://www.ipcc.ch/srocc/   Atmosphere and Climate:  Dennis Hartmann, 2015. Global Physical Climatology2nd Edition. Elsevier. eBook ISBN: 9780080918624 / Hardcover ISBN: 9780123285317. (Ch. 9, 12, 13)  Brian J. Skinner & Barbara W. Murch, 2011. The Blue Planet-An Introduction to Earth System Science, 3rd  Edition. Wiley, ISBN: 9780471236436. (Ch.10)  Richard Wolfson, 2017. Energy, Environment and Climate. W.W. Norton & Company. ISBN: 978-0-393-64347-3.  Syukuro Manabe, Anthony J. Broccoli, 2020. Beyond Global Warming: How Numerical Models Revealed the Secrets of Climate Change. Princeton University Press. ISBM: 9780691058863 (Ch. 1-3)   Ecosystem Interactions:  Dennis Hartmann, 2015. Global Physical Climatology 2nd Edition. Elsevier. eBook ISBN: 9780080918624 / Hardcover ISBN: 9780123285317.  G. Bonan, 2015. Ecological Climatology: Concepts and Applications, 3rd Edition. Cambridge University Press, ISBN: 9781107339200. (Ch. 1, 13)  Donald W. Sparling, 2017. Basics of Ecotoxicology. CRC Press. ISBN 9781138031715. (Ch. 1-3)   Case study for Hong Kong:  Chan L. S., 2014. Geological Heritage of Hong Kong, Aristo Educational Press Ltd.ISB:9789888243655  Bernie Owen & Raynor Shaw, 2011. Hong Kong Geopark, Lions Nature Education Foundation, ISBN: 9789882113961  ", "recommended_readings": " Geosphere and Cryosphere: National Academies of Sciences, Engineering, and Medicine 2017. Volcanic Eruptions and Their Repose, Unrest, Precursors, and Timing. Washington, DC: The National Academies Press. https://doi.org/10.17226/24650. Pps 9-25.   Atmosphere and Climate: Daniel J. Jacob, 1999. Global Tropospheric Chemistry, Introduction to Atmospheric Chemistry. Princeton University Press. (Ch. 11)  ", "terms": {"2023-24 Term 1": {"--LEC (6652)": {"startTimes": ["9:30"], "endTimes": ["11:15"], "days": [2], "locations": ["Lee Shau Kee Building LT3"], "instructors": ["Dr. AU-YEUNG Yee Man, \n\nDr. LAU Ching Ching, \n\nDr. TAM Pui Yuk, \n\nDr. ZHANG Li, \n\nProfessor Benoit THIBODEAU, \n\nProfessor CHAN Man Nin, \n\nProfessor CHOW Tat Shing, \n\nProfessor LIU Lin, \n\nProfessor TAI Pui Kuen Amos, \n\nProfessor TAM Chi Yung Francis, \n\nProfessor TAN Yen Joe, \n\nProfessor YANG Hongfeng"], "meetingDates": ["5/9", "12/9", "19/9", "26/9", "3/10", "10/10", "17/10", "24/10", "31/10", "7/11", "14/11", "21/11", "28/11"]}}}, "assessments": {"Fieldwork or field study": "20", "Others": "10", "Project": "30", "Test or quiz": "40"}}, {"code": "2010", "title": "Solid Earth Dynamics", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "Lecture\nInteractive Tutorial", "campus": "Main Campus", "academic_group": "Earth & Environmental Sci PC", "requirements": "Not for students who have taken ESSC2010.", "description": "This course presents an integrated introduction to the solid earth system stressing the geological, chemical, physical, and biological interactions among the lithosphere, hydrosphere and cryosphere. The course applies basic scientific and mathematical concepts to explain the history and behaviour of the solid earth system. Geophysical and geochemical techniques for probing the interior of the earth are reviewed. Plate tectonics is introduced as a unifying theme to understand geodynamic processes. The course includes discussions of topics that are relevant to society, resources and sustainability, such as the physical and chemical basis of natural hazards (earthquakes, tsunami, landslides) and their mitigation, and the impact of geological processes on the global environment.", "outcome": "This course will contribute to the understanding of the dynamics of the solid Earth system, specifically the lithosphere, hydrosphere and cryosphere, as well as their interaction. The students should be able to: 1) describe and use the scientific process, explain how theories are built upon earth system observations, and how both are tested and revised; 2) explain how fundamental physical, chemical, and biological principles govern specific earth system processes; 3) participate knowledgeably and intelligently in discussions of public policy related to earth system science, particularly with respect to natural hazards, resources, environment and sustainable development; 4) work effectively in a team, and present information in a clear, concise and logical manner.", "syllabus": "TopicsIntroduction and Earth in the universePlate TectonicsEarth material: MineralsLab 1: MineralsEarth material: RocksLab 2 and Lab 3: RocksCrustal deformation and mountain buildingGeochronologyEarthquakes and TsunamiGeologic Field Trip to Tung Ping ChauGeophysics: Global SeismologyVolcanosGeophysics: Global SeismologyGeophysics: Gravity and geomagnetic fieldsGlaciersGlobal changes", "required_readings": "Stephen Marshak, Essencials of geology (4th eds), New York : W W Norton, 2013", "recommended_readings": " Brian J. Skinner & Barbara W. Murck (3rd Eds.). The Blue Planet: An Introduction to Earth System Science, John Wiley & Sons Inc., New York (2009). John Grotzinger , Thomas H. Jordan , Frank Press & Raymond Siever (6th Eds.). Understanding Earth, W.H. Freeman, San Francisco (2010). Stephen Marshak (3rd Eds.) Earth: Portrait of a Planet, W.W. Norton, New York (2007).", "terms": {"2023-24 Term 2": {"--LEC (6515)": {"startTimes": ["9:30", "9:30"], "endTimes": ["11:15", "10:15"], "days": [1, 3], "locations": ["Esther Lee Bldg 203", "Wu Ho Man Yuen Bldg 306"], "instructors": ["Dr. TAM Pui Yuk, \n\nProfessor ZHAN Yan", "Dr. TAM Pui Yuk, \n\nProfessor ZHAN Yan"], "meetingDates": ["8/1", "10/1", "15/1", "17/1", "22/1", "24/1", "29/1", "31/1", "5/2", "7/2", "19/2", "21/2", "26/2", "28/2", "11/3", "13/3", "18/3", "20/3", "25/3", "27/3", "3/4", "8/4", "10/4", "15/4", "17/4"]}, "-T01-TUT (7539)": {"startTimes": ["10:30"], "endTimes": ["11:15"], "days": [3], "locations": ["Wu Ho Man Yuen Bldg 306"], "instructors": ["Dr. TAM Pui Yuk, \n\nProfessor ZHAN Yan"], "meetingDates": ["10/1", "17/1", "24/1", "31/1", "7/2", "21/2", "28/2", "13/3", "20/3", "27/3", "3/4", "10/4", "17/4"]}}}, "assessments": {"Essay test or exam": "30", "Lab reports": "30", "Presentation": "10", "Short answer test or exam": "30"}}, {"code": "2020", "title": "Climate System Dynamics", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "Lecture\nInteractive Tutorial", "campus": "Main Campus", "academic_group": "Earth & Environmental Sci PC", "requirements": "Not for students who have taken ESSC2020.", "description": "This course presents an integrated introduction to the climate system, stressing the dynamics of the atmosphere and its physical and chemical interactions with the hydrosphere, biosphere and geosphere. The course applies basic scientific and mathematical principles to explain the history, current state and future projection of weather and climate, natural hazards (e.g., typhoons, floods), and global climate change in the context of natural variability and anthropogenic influence. Topics include Earth’s energy balance, climate feedback, convection and clouds, general circulation of the atmosphere and ocean, biogeochemistry and global carbon cycle, roles of vegetation and ecosystems, and historical and future climate change. Student taking this course are expected to have taken PHYS1111, CHEM1070 and MATH1010 or equivalent.", "outcome": "This course will contribute to the understanding of the dynamics of the climate system, specifically the atmosphere, hydrosphere, biosphere and solid earth, as well as their interactions. The students should be able to: 1) describe and use the scientific processes, explain how theories are built upon earth system observations, and how both are tested and revised; 2) explain how fundamental physical and chemical principles govern specific climate system processes; 3) participate knowledgeably and intelligently in discussions of public policy related to earth system science, particularly with respect to extreme weather events, global climate change and sustainable development; 4) work effectively in a team, and present information in a clear, concise and logical manner.", "syllabus": "TopicsIntroduction; overview of the climate systemPart I: Energy Balance of the EarthBasic radiation physics; energy balance of the Earth; greenhouse effectSimple climate model; radiative forcing, climate sensitivity and climate feedbackLab 1: Climate sensitivity and feedback in a simple climate modelClimate variability and climate change; roles of aerosols; meridional structure of the atmospherePart II: Dynamics of the AtmosphereVertical structure of the atmosphere; Newton’s second law; pressure and hydrostatic balance; barometric lawConvection; first law of thermodynamics; dry adiabatic lapse rate; atmospheric stabilityPotential temperature; water content in air; moist convection and cloud formationLab 2: Conservation of angular momentum on a rotating EarthCoriolis force; pressure gradient force; horizontal momentum equations; geostrophic balanceThermal wind balance; atmospheric fronts and jet stream; surface friction and ageostrophic flowGeneral circulation of the atmosphere; Hadley circulation in the tropics; baroclinic eddies and midlatitude weather systemsLab 3: Introduction to weather analysis and forecastField trip to Hong Kong ObservatoryPart III: Ocean and ClimateOverview of ocean circulation; Ekman transport and wind-driven circulationEffect of Ekman transport on the interior ocean; western boundary currents; thermohaline circulationOcean heat buffer and transport; El Niño-Southern Oscillation; tropical cyclonesPart IV: Ecosystems and ClimateFluxes in biosphere-atmosphere interactions; surface energy balance; evapotranspiration and photosynthesis; biogeophysical feedbacksBiogeochemical reservoirs and residence times; carbon and nutrient cycling in ecosystems; geological carbon cycleContemporary carbon cycle; marine carbonate chemistry; biological bump; ocean biogeochemical feedbacksLab 4: Global carbon cycleGlobal carbon budget; terrestrial carbon sink and biogeochemical feedbacksPart V: Past, Present and Future ClimateClimate throughout Earth’s history; atmosphere of the early Earth; from Cretaceous to ice ages; recent 20,000 yearsRecent climate change: observations and attributionFuture climate projections; impacts of climate change; where do we go from here?", "required_readings": "J. Marshall and R.A. Plumb (2007): Atmosphere, Ocean, and Climate Dynamics: An Introductory Text, First Edition, Academic Press.", "recommended_readings": " M.E. McElroy (2002): The Atmospheric Environment: Effects of Human Activity, First Edition, Princeton University Press. J.M. Wallace and P.V. Hobbs (2006): Atmospheric Science: An Introductory Survey, Second Edition, Academic Press.  ", "terms": {"2023-24 Term 1": {"--LEC (5272)": {"startTimes": ["13:30", "13:30"], "endTimes": ["14:15", "15:15"], "days": [4, 2], "locations": ["Wu Ho Man Yuen Bldg 407", "Science Centre L5"], "instructors": ["Dr. LI Kwan Kit Ronald, \n\nProfessor TAI Pui Kuen Amos", "Dr. LI Kwan Kit Ronald, \n\nProfessor TAI Pui Kuen Amos"], "meetingDates": ["5/9", "7/9", "12/9", "14/9", "19/9", "21/9", "26/9", "28/9", "3/10", "5/10", "10/10", "12/10", "17/10", "19/10", "24/10", "26/10", "31/10", "2/11", "7/11", "9/11", "14/11", "16/11", "21/11", "23/11", "28/11", "30/11"]}, "-T01-TUT (5273)": {"startTimes": ["14:30"], "endTimes": ["15:15"], "days": [4], "locations": ["Wu Ho Man Yuen Bldg 407"], "instructors": ["Dr. LI Kwan Kit Ronald, \n\nProfessor TAI Pui Kuen Amos"], "meetingDates": ["7/9", "14/9", "21/9", "28/9", "5/10", "12/10", "19/10", "26/10", "2/11", "9/11", "16/11", "23/11", "30/11"]}}}, "assessments": {"Essay test or exam": "35", "Homework or assignment": "20", "Lab reports": "15", "Presentation": "5", "Short answer test or exam": "25"}}, {"code": "2030", "title": "Computational Earth and Environmental Sciences", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "Lecture\nInteractive Tutorial", "campus": "Main Campus", "academic_group": "Earth & Environmental Sci PC", "requirements": "Not for students who have taken CSCI1040, CSCI2040 or ESSC2030.", "description": "This course covers basic computation skills which are important to modern Earth and Environmental Sciences research and data analysis. Topics include the basic Python language syntax; programming flow control; usage of functions; file input/output modules; data visualisation; atmospheric science applications; geoscience applications and basic machine learning applications in earth and environmental sciences. Python 3 will be used throughout the course. Examples and tutorials will be based on various problems in Earth and Environmental Sciences using actual observational or in-situ data.", "outcome": "Students will obtain basic skills in coding for the tasks in different earth science problems. This includes data acquisition, selection and manipulation in geophysical and environmental problems. They will also learn specific Python modules in science applications.", "syllabus": " Installation and Basics Methods, Functions, and Numpy Booleans, If-then-else Statement For Loop and While Loop, Try-except Self-defined Functions, Programming Style File IO with Pandas and Xarray Data Visualization with Matplotlib Scientific Computing with Scipy", "required_readings": "Refer to the course syllabus distributed in the class.", "recommended_readings": "These are some recommended reference, https://docs.python.org/3.8/tutorial/ https://www.earthdatascience.org/courses/intro-to-earth-data-science/ https://www.colorado.edu/earthlab/learn-python-free-online-earth-data-science-tutorials", "terms": {"2023-24 Term 2": {"--LEC (6482)": {"startTimes": ["11:30", "14:30"], "endTimes": ["13:15", "15:15"], "days": [1, 2], "locations": ["Mong Man Wai Bldg 705", "Mong Man Wai Bldg 705"], "instructors": ["Dr. AU-YEUNG Yee Man", "Dr. AU-YEUNG Yee Man"], "meetingDates": ["8/1", "9/1", "15/1", "16/1", "22/1", "23/1", "29/1", "30/1", "5/2", "6/2", "19/2", "20/2", "26/2", "27/2", "11/3", "12/3", "18/3", "19/3", "25/3", "26/3", "2/4", "8/4", "9/4", "15/4", "16/4"]}, "-T01-TUT (7544)": {"startTimes": ["15:30"], "endTimes": ["16:15"], "days": [2], "locations": ["Mong Man Wai Bldg 705"], "instructors": ["Dr. AU-YEUNG Yee Man"], "meetingDates": ["9/1", "16/1", "23/1", "30/1", "6/2", "20/2", "27/2", "12/3", "19/3", "26/3", "2/4", "9/4", "16/4"]}}}, "assessments": {"Examination": "30", "Homework or assignment": "60", "Participation": "10"}}, {"code": "2110", "title": "Geoscience Field Study", "career": "Undergraduate", "units": "1.00", "grading": "Graded", "components": "Field Studies/Field-trip\nLecture\nProject\nInteractive Tutorial", "campus": "Main Campus", "academic_group": "Earth & Environmental Sci PC", "requirements": "Not for students who have taken ESSC2110.", "description": "EESC2110 is a fundamental field-based course introducing elementary concepts of past Earth’s processes and environmental changes. It also covers important aspects of plate tectonics, different rock types, geological deformation, geomorphology and environmental changes, natural hazards and human impacts. The principal goal of this course is to let students understand how the present geological records and landforms reveal the past tectonic movements and affect the human urban planning. Students are trained to observe, describe and discuss field features, with the help of field tools (e.g. compasses-clinometer and GPS receiver). Basic skills of field techniques, interpreting geologic maps and making field notes are introduced to assist students acquiring field data and discuss possible geologic processes. A field report from each group is required to summarize the field study logically. Field locations of this course may change from year to year. All students are welcome, but priority will be given to students who have taken EESC1001.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "2120", "title": "Integrated Geoscience Field Study", "career": "Undergraduate", "units": "2.00", "grading": "Graded", "components": "Field Studies/Field-trip\nLecture\nOthers\nInteractive Tutorial", "campus": "Main Campus", "academic_group": "Earth System Science Pgm Comm", "requirements": "Not for students who have taken ESSC2120. Pre-requisite: (EESC2010 or ESSC2010) and (EESC2020 or ESSC2020).", "description": "Field study of current landform and geological features is the key to reveal past Earth’s processes and environmental changes. This also provides data for further studies on natural hazards. EESC2120 is a fundamental level, field-based course of the Earth and Environmental Sciences Programme. It covers important aspects of atmospheric sciences, plate tectonics, volcanoes, deformation structures, sedimentology, coastal features, earthquakes and associated present-day infrastructures. The principal goal of this course is to let students study major atmospheric sciences, geological features and understand how tectonic movement and atmospheric phenomenon contributes to the current different landforms, disasters and urban planning. Students are trained to observe, describe and discuss field features. Basic skills of using field tools (e.g. compasses-clinometer), studying geologic maps and making field notes are introduced to help students acquire field data and analyze possible atmospheric phenomenon and geologic processes. A field report is required to summarize the field study logically. The field location and term of offer of this course may change from year to year. Due to limited quota, priority will be given to students who have taken EESC2010 and will enroll in EESC3110.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "2130", "title": "Fundamental Geoscience Fieldwork", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "Field Studies/Field-trip\nLecture\nOthers\nInteractive Tutorial", "campus": "Main Campus", "academic_group": "Earth & Environmental Sci PC", "requirements": "Not for students who have taken ESSC2130. Pre-requisite: EESC2010 or ESSC2010.", "description": "Field study of current landform and geological features is the key to reveal past Earth’s processes and environmental changes. This also provides data for further studies on natural hazards. EESC2130 is a fundamental level, field-based course of the Earth and Environmental Sciences Programme. It covers important aspects of atmospheric sciences, plate tectonics, volcanoes, deformation structures, sedimentology, coastal features, earthquakes and associated present-day infrastructures. The principal goal of this course is to let students study major atmospheric sciences, geological features and understand how tectonic movement and atmospheric phenomenon contribute to the current different landforms, disasters and urban planning. Students are trained to observe, describe and discuss field features. Basic skills of using field tools (e.g. compasses-clinometer), studying geologic maps and making field notes are introduced to help students acquire field data and analyze possible atmospheric phenomenon and geologic processes. A field report is required to summarize the field study logically. The field location and term of offer of this course may change from year to year. Due to limited quota, priority will be given to students who have taken EESC2010 and passed the pre-enrolment quiz.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "2270", "title": "Introduction to Environmental Science", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Earth & Environmental Sci PC", "requirements": "Not for students who have taken ENSC2270.", "description": "This course deals with the relationships between living organisms, resources and environment. The basic multidisciplinary concepts of sustainable development, human population and health risk, conservation of resources, climate change, environmental degradation, pollution control, biodiversity, solid waste and waste water management, etc, will be introduced. Concepts of think globally, act locally will be introduced the importance of acting as a global citizen to help solving environmental problems with an innovative mind to design new policy or technology. Case studies and field trips are included to illustrate various environmental issues using a multidisciplinary approach with emphasis on how modern technology can have significant societal impacts and responsibility.", "outcome": "The students shall be able to understand the basic knowledge in current environmental problems, including natural conservation, pollution control, waste management and problems arisen from environmental deterioration, sustainable development, after taking this course.", "syllabus": " Sustainable Development Population and Resources Climate Change and Energy Policy Environmental Pollution & Health Group Presentations on RESOURCES Environmental Monitoring & Assessment Water Quality Control Sewage Treatment Green Chemistry Biodiversity Conservation Environmental Protection (I): Solid Waste Treatment Environmental Protection (II): Air Pollution and Control Environmental Remediation and Biotechnology", "required_readings": " Cunningham WP, Cunningham MA, Saigo B (2008) Environmental Science-A Global Concern. 10th ed., McGraw-Hill, 618p. GE105.C86 2008 (RESERVED at UL) Cunningham WP, Cunningham MA (2009) Environmental Science-A Global Concern. 11th ed., McGraw-Hill, 618p. (Available from university bookstore)  ", "recommended_readings": " Masters GM, Ela WP (2007) Introduction to Environmental Engineering and Science, 3rd ed. Prentice Hall, 720p. 145.M33 1998 (second edition available from UL, RESERVED) Miller Jr. GT, Spoolman SE (2009) Living in the Environment. Principles, Connections and Solutions. 16th ed., Brooks/Cole, Belmont, CA, USA GE105.M547 2009 (RESERVED at UL) Spiro, TG, Stigliani WM (2003) Chemistry of the Environment, 2nd Ed., Prentice Hall, New Jersey, 489p. TD193.S7 2003 (RESERVED at UL)", "terms": {"2023-24 Term 2": {"--LEC (6514)": {"startTimes": ["8:30"], "endTimes": ["11:15"], "days": [5], "locations": ["Wong Foo Yuan Bldg UG01"], "instructors": ["Dr. CHAN Ka Long Donald, \n\nProfessor TSUI Tsz Ki Martin"], "meetingDates": ["12/1", "19/1", "26/1", "2/2", "16/2", "23/2", "1/3", "15/3", "22/3", "5/4", "12/4", "19/4"]}}}, "assessments": {"Fieldwork or field study": "5", "Homework or assignment": "15", "Report": "20", "Short answer test or exam": "50", "Selected response test or exam": "10"}}, {"code": "2515", "title": "Environmental Chemistry", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Earth & Environmental Sci PC", "requirements": "Not for students who have taken ENSC2515. Pre-requisite: EESC2270 or ENSC2270 or permission of the instructor.", "description": "This is a foundation course designed to equip students with a proper understanding of the fundamental aspects of environmental chemistry. It introduces the basic concept of chemical equilibrium and kinetics, the nature and characteristics of various common types of air and water pollution arising from industrial, agricultural and domestic sources. It outlines the principles of measurement for various parameters commonly used for air and water pollution studies, their significance and limitations. It also examines various types of aerial emission arising from combustion and industrial processes, and vehicles, and their chemical interaction leading to various global environmental issues such as the formation of photochemical smog, depletion of ozone layer and global warming effects.", "outcome": "Students who have finished this course are expected to understand: some basic concepts in chemistry ranging from atomic structure and chemical bonding to the basic principle of coordination chemistry of the transition metals, and thermodynamics and kinetics. aquatic chemistry which includes solubility, acid-base reactions, complexation equilibria, and redox reactions. the chemistry of common pollutants in natural water systems. atmospheric chemistry with emphasis on chemical and photochemical processes occurring in the atmosphere. the chemistry of common air pollutants. the chemistry of soil including its composition, essential nutrients in soil, the chemistry of fertilizers, and acid-base and ion-exchange reactions in soil.Student will understand key ideas on these topics and understand various local and global environmental problems through a case-study approach.", "syllabus": "  Some basic concepts in chemistry  Aquatic chemistry  Water pollution  Atmospheric chemistry  Air pollution  Environmental Geochemistry", "required_readings": " Cunningham WP, Cunningham MA, Saigo B (2008) Environmental Science-A Global Concern. 10th ed., McGraw-Hill, 618p. GE105.C86 2008 (RESERVED at UL) Cunningham WP, Cunningham MA (2009) Environmental Science-A Global Concern. 11th ed., McGraw-Hill,618p. (Available from university bookstore)", "recommended_readings": " Masters GM, Ela WP (2007) Introduction to Environmental Engineering and Science, 3rd ed. Prentice Hall,720p. 145.M33 1998 (second edition available from UL, RESERVED) Miller Jr. GT, Spoolman SE (2009) Living in the Environment. Principles, Connections and Solutions. 16th ed., Brooks/Cole, Belmont, CA, USA GE105.M547 2009 (RESERVED at UL) Spiro, TG, Stigliani WM (2003) Chemistry of the Environment, 2nd Ed., Prentice Hall, New Jersey, 489p. TD193.S7 2003 (RESERVED at UL)", "terms": {"2023-24 Term 1": {"--LEC (6985)": {"startTimes": ["8:30"], "endTimes": ["11:15"], "days": [3], "locations": ["Mong Man Wai Bldg 715"], "instructors": ["Professor LEE Hung Kay"], "meetingDates": ["6/9", "13/9", "20/9", "27/9", "4/10", "11/10", "18/10", "25/10", "1/11", "8/11", "15/11", "22/11", "29/11"]}}}, "assessments": {"Homework or assignment": "15", "Short answer test or exam": "50", "Selected response test or exam": "35"}}, {"code": "2517", "title": "Environmental Chemistry Laboratory", "career": "Undergraduate", "units": "2.00", "grading": "Graded", "components": "Laboratory", "campus": "Main Campus", "academic_group": "Earth & Environmental Sci PC", "requirements": "Not for students who have taken ENSC2517. Co-requisite: EESC2515 or ENSC2515 or permission of the instructor.", "description": "This is a foundation chemistry laboratory course designed to accompany EESC2515. This course illustrates the fundamental principles and basic techniques in general environmental chemistry. Laboratory work covers a range of experiments, including acid-base reactions, chemical thermodynamics and kinetics, complexation equilibria, coordination chemistry of the transition metals, and analysis of air pollutants. Students who finish this course are expected to be familiar with the general techniques in conducting chemistry experiments and the use of simple instruments such as IR and UV–Vis spectrophotometers. They will also learn how to design of experiments and report experimental data in scientific reports. The assessment scheme of this course is based on students' performance in conducting experiments and report writing.", "outcome": "Students who have finished this course are expected to: be familiar with the general techniques in conducting chemistry experiments; be familiar with the use of common instruments such as IR and UV-Vis spectrophotometers; learn how to report and analyze scientific data, and write up scientific reports; understand some basic principles of chemistry ranging from acid-base reactions, thermodynamics and kinetics, complexation equilibria, to coordination chemistry of the transition metals; learn how to design and plan experiments, acquire hands-on experience in analyzing common environmental pollutants.", "syllabus": "Experiment List: Synthesis of Alum Crystals from Scrap Metal Rates of Chemical Reactions Alkalinity of Water Total Phosphorus Content in Polluted Water Determination of the Iron Content in a Vitamin Tablet (a) Tyndall Effect in Starch and Gelatin Colloids, (b) Infra-Red Analysis of CuC12-DMSO Complex Determination of Total Aldehydes in Indoor Environment with Impinger Sampling Sampling of NOx (NO+NO2) and Particulates", "required_readings": " S. E. Manahan, Environmental Chemistry, 7th Ed., Lewis publishers, Boca Raton, 2000. N. J. Bunce, Introduction to Environmental Chemistry, Wuerz Publishing, Winnipeg, 1993. P. E. Buell and J. E. Girard, Chemistry: An Environmental Perspective, Prentice Hall, Englewood Cliffs, 1994.", "recommended_readings": "Refer to the course syllabus distributed in the class.", "terms": {"2023-24 Term 1": {"-L01-LAB (5431)": {"startTimes": ["14:30"], "endTimes": ["18:15"], "days": [1], "locations": ["Science Centre 257"], "instructors": ["Dr. LO Chui Man, \n\nProfessor LEE Hung Kay"], "meetingDates": ["4/9", "11/9", "18/9", "25/9", "9/10", "16/10", "30/10", "6/11", "13/11", "20/11", "27/11"]}}}}, {"code": "2520", "title": "Elementary Methods for Earth and Environmental Sciences", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "Lecture\nInteractive Tutorial", "campus": "Main Campus", "academic_group": "Earth & Environmental Sci PC", "requirements": "Pre-requisite: (MATH1520 or MATH1010) or permission of instructor.", "description": "The course provides a survey of elementary analytical quantitative and qualitative methods commonly used in earth and environmental sciences, with applications in geophysics, geophysical/environmental fluid dynamics, as well as related aspects in thermodynamics and wave physics. Teaching aided by numerical programming is adopted and emphasized, in addition to analytical understanding of these methods. Typical examples include heat conduction on earth surface, seismic and ocean waves, air pollution, geodynamics, and atmospheric dynamics.", "outcome": " An understanding of elementary quantitative methods used in earth and environmental sciences. Appreciation of how physical principles in earth and environmental sciences are formulated quantitatively,  Knowledge of the application of elementary methods in solving problems in earth and environmental sciences. ", "syllabus": " Basic solid Mechanics: Equation of motions of solid, Hooke’s law, plane strain and plane stress problems, Airy stress function (biharmonic equations), bending of beam and plates (nonhomogeneous biharmonic equation), Solution method of elasticity, Helmholtz decomposition theorem for displacement field, use of gradient, divergence and curl in formulating Lame strain potential and Love’s potential.  Geodynamics: Heat conduction in earth, Fourier law of heat conduction, error functions, instantaneous cooling of the half-space, age of the earth; lithospheric bending and folding.    Seismicity: single degree of oscillator, response spectrum, Helmholtz decomposition for velocity vectors, use of gradient, divergence and curl in formulating compression and shear wave equations. Rayleigh wave as surface wave; 2-D waves versus 3-D waves; Analysis of seismic signals using Fourier transforms, physical meaning of phase shift, physical meaning of Fourier transform magnitude. Basic fluid Mechanics: Circulation and vorticity, Helmholtz theorem, Kelvin circulation theorem and their implications, conservation of mass, derivation of Navier-Stokes equation, stream function for potential flow theory; Geophysical flows: Coriolis force as function of latitude, geophysical scaling, Rossby number, Ekman number, and Reynold’s number; turbulent diffusion in fluids and atmosphere, Duhamel integral for time varying boundary condition, Taylor’s point source solution (1-D, 2-D and 3-D cases), pollutant diffusion in river, ocean, and atmosphere; Ogata-Banks solution; Gaussian plume model for smoke diffusion; Kelvin-Helmholtz instability. Atmospheric flows: vortex models, maximum wind speed in tornadoes, maximum wind speed in typhoons, eyewall dynamics, buoyance instability in atmosphere; Taylor-Proudman theorem; radiative transfer equation (integro-differentiation equation) and climate change, use of radiative transfer model in remote sensing data assimilation and numerical weather forecast.   Ocean waves: Perturbation theory and Stokes wave theory, stream functions, Airy’s wave theory, shallow water and deep- water limits, dispersion relation, shallow water equation, conical theory for ocean waves, solitary wave or solitons. storm surges (inverse barometer effect, moving depression effect, wind-induced surge).  ", "required_readings": " Chau K.T. (2013). Analytic Methods in Geomechanics. CRC Press, Boca Raton.  Chau K.T. (2018). Theory of Differential Equations in Engineering and Mechanics, CRC Press, Boca Raton.   Chau K.T. (2019). Applications of Differential Equations in Engineering and Mechanics, CRC Press, Boca Raton.", "recommended_readings": " K.T. Chau, Theory of Differential Equations in Mechanics and Engineering (CRC Press, 2017). K.T. Chau, Applications of Differential Equations in Mechanics and Engineering (CRC Press, 2019). M. L. Boas, Mathematical Methods in the Physical Sciences (3rd ed.,Wiley, 2005) E. Kreyszig, Advanced Engineering Mathematics (9th ed., Wiley, 2006). S. J .Farlow, Partial Differential Equations for Scientists and Engineers (Wiley, 1983). R.V. Church and J.W. Brown, Fourier Series and Boundary Value Problems (7th ed., McGraw-Hill, 2008).  W.E. Boyce and R.C. DiPrima, Elementary Differential Equations and Boundary Value Problems (10th ed., Wiley 2012).    E. Kreyszig, Advances Engineering Mathematics (9th ed., Wiley, 2006).", "terms": {"2023-24 Term 1": {"--LEC (4687)": {"startTimes": ["11:30", "11:30"], "endTimes": ["13:15", "12:15"], "days": [1, 3], "locations": ["Mong Man Wai Bldg 704", "Mong Man Wai Bldg 706"], "instructors": ["Professor CHAU Kam Tim", "Professor CHAU Kam Tim"], "meetingDates": ["4/9", "6/9", "11/9", "13/9", "18/9", "20/9", "25/9", "27/9", "4/10", "9/10", "11/10", "16/10", "18/10", "25/10", "30/10", "1/11", "6/11", "8/11", "13/11", "15/11", "20/11", "22/11", "27/11", "29/11"]}, "-T01-TUT (4688)": {"startTimes": ["12:30"], "endTimes": ["13:15"], "days": [3], "locations": ["Mong Man Wai Bldg 706"], "instructors": ["Professor CHAU Kam Tim"], "meetingDates": ["6/9", "13/9", "20/9", "27/9", "4/10", "11/10", "18/10", "25/10", "1/11", "8/11", "15/11", "22/11", "29/11"]}}}, "assessments": {"Examination": "50", "Homework or assignment": "20", "Test or quiz": "30"}}, {"code": "2701", "title": "Elementary Topics in Earth and Environmental Sciences", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Earth & Environmental Sci PC", "requirements": "", "description": "State-of-the-art research methods, experimental, and computational techniques applied in elementary topics in Earth and Environmental Sciences.", "outcome": " Students will learn in-depth knowledge in the elementary topics in Earth and Environmental Sciences.  Students will get familiar with the literature in the research in the elementary topics.  Students will get familiar with the analytical and mathematical skills necessary in the elementary topics.  Students will develop the ability to analyze and synthesize scientific data (observations and modeling) necessary in the elementary topics. Students will develop the ability to communicate the results in the form of written reports, visual displays, and scientific presentations.", "syllabus": " Background of the elementary topics Key concepts and principles of the elementary topics Methods and major findings of the elementary topics", "required_readings": "Refer to the course syllabus distributed in the class", "recommended_readings": "Refer to the course syllabus distributed in the class", "terms": {"2023-24 Term 2": {"--LEC (7399)": {"startTimes": ["15:30"], "endTimes": ["18:15"], "days": [1], "locations": ["Mong Man Wai Bldg 706"], "instructors": ["Dr. ZHANG Li"], "meetingDates": ["8/1", "15/1", "22/1", "29/1", "5/2", "19/2", "26/2", "11/3", "18/3", "25/3", "8/4", "15/4"]}}}, "assessments": {"Essay test or exam": "50", "Presentation": "50"}}, {"code": "2800", "title": "Introduction to Environmental Engineering", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "Lecture\nInteractive Tutorial", "campus": "Main Campus", "academic_group": "Earth & Environmental Sci PC", "requirements": "Not for students who have taken ESSC2800. Pre-requisite: MATH1010 or 1510 or 1520.", "description": "This is a multidisciplinary course introducing the fundamental physical, chemical and biological principles necessary for understanding the natural and built environments, with an emphasis on reliable water and food supplies, pollution mitigation, waste management, energy resources, climate change, and sustainable development. Examples of engineering solutions to tackle some of these resource and environmental issues are presented. Field trips are included to illustrate interesting case studies. Topics include: conservation principles for mass, energy and momentum in the environmental systems; basic environmental chemistry, hydrology and ecology; risk assessment; and basic principles of water resource engineering, solid waste treatment, noise pollution, air pollution control, climate change adaptation and mitigation, and the interplay between energy consumption and the environment.", "outcome": " Understand the basic physical, chemical and biological principles governing the various resource and environmental issues of our society. Be able to use basic mathematical methods to assess environmental risks and the feasibility of various engineering solutions to resource and environmental problems. Be able to participate knowledgeably and intelligently in discussion of public policy related to global and regional resource and environmental issues including the food-water-energy crisis, water and air pollution, global climate change, and hazardous wastes. Be able to work effectively in a team, and present information in a clear, concise and logical manner.  ", "syllabus": "Part I: Physical and Chemical Fundamentals1.    Mass transport and balance (2 lecture-hours)2.    Energy transport, balance and thermodynamics (3 lecture-hours)3.    Basic environmental chemistry and chemical kinetics (3 lecture-hours)4.    Ecosystem and population dynamics (3 lecture-hours)5.    Risk assessment tools (3 lecture-hours)Part II: Water Resources and Pollution6.    Basic hydrology (2 lecture-hours)7.    Water resources management and optimization (3 lecture-hours)8.    Water pollution: principles (2 lecture-hours)9.    Water pollution: control measures (3 lecture-hours)Part III: Solid Waste Management and Noise Pollution10.    Principles and measures of solid waste management (3 lecture-hours)11.    Principles and measures of noise pollution (2 lecture-hours)Part IV: Air Pollution and Climate Change12.    Atmospheric chemical composition and processes (3 lecture-hours)13.    Air pollution control measures (2 lecture-hours)14.    Climate change: principles, observations and projections (3 lecture-hours)15.    Climate change adaptation and mitigation (2 lecture-hours)", "required_readings": "Gilbert M. Masters and Wendell P. Ela (2007): Introduction to Environmental Engineering and Science (3rd Edition), Prentice Hall.", "recommended_readings": "Mackenzie Davis and David Cornwell (2012): Introduction to Environmental Engineering (5th Edition), McGraw-Hill Education.", "terms": {"2023-24 Term 1": {"--LEC (5329)": {"startTimes": ["15:30", "15:30"], "endTimes": ["16:15", "17:15"], "days": [4, 2], "locations": ["Wen Lan Tang LG204", "Basic Med Sci Bldg LT"], "instructors": ["Dr. AU-YEUNG Yee Man", "Dr. AU-YEUNG Yee Man"], "meetingDates": ["5/9", "7/9", "12/9", "14/9", "19/9", "21/9", "26/9", "28/9", "3/10", "5/10", "10/10", "12/10", "17/10", "19/10", "24/10", "26/10", "31/10", "2/11", "7/11", "9/11", "14/11", "16/11", "21/11", "23/11", "28/11", "30/11"]}, "-T01-TUT (5331)": {"startTimes": ["16:30"], "endTimes": ["17:15"], "days": [4], "locations": ["Wen Lan Tang LG204"], "instructors": ["Dr. AU-YEUNG Yee Man"], "meetingDates": ["7/9", "14/9", "21/9", "28/9", "5/10", "12/10", "19/10", "26/10", "2/11", "9/11", "16/11", "23/11", "30/11"]}}}, "assessments": {"Essays": "10", "Essay test or exam": "40", "Homework or assignment": "30", "Selected response test or exam": "20"}}, {"code": "3020", "title": "Analytical Methods for Earth and Environmental Sciences", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "Lecture\nInteractive Tutorial", "campus": "Main Campus", "academic_group": "Earth & Environmental Sci PC", "requirements": "Not for students who have taken ESSC3020. Pre-requisite: (EESC2010 or ESSC2010) and (EESC2020 or ESSC2020), and (MATH2550), and (PHYS1001 or 1002 or 1111 or 1113), or permission of instructor.", "description": "The course provides a survey of various analytical techniques commonly employed in solving problems encountered in earth and environmental sciences. Typical examples include heat conduction on earth surface, seismic and ocean waves, air pollution, geodynamics, and atmospheric dynamics.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "3100", "title": "Structural Geology", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "Field Studies/Field-trip\nLaboratory\nLecture", "campus": "Main Campus", "academic_group": "Earth & Environmental Sci PC", "requirements": "Not for students who have taken ESSC3100. Pre-requisite: EESC2010 or ESSC2010 or permission of instructor.", "description": "This course is an important part of the core Earth and Environmental Sciences Curriculum. It introduces the processes and products of rock deformation in three dimensions, ranging from micro- (micron) to macro- (kilometer) scales. It discusses geometries and mechanism of faults, folds, structural features of igneous, sedimentary and metamorphic rocks, and superposed deformations and introduces regional deformational history and tectonics. Structural geology in the field of resource exploration (petroleum and mineral deposits) is also introduced. Class lectures are supplemented by lab exercise and demonstrations as well as field trips to local or overseas outcrops.", "outcome": "Students are expected to gain the following abilities:1.  Understand the geometry of different geological structures2.  Use concepts of solid mechanics to interpret the kinematics and geometries of geological structure formation3.  Use graphical tools to compile and interpret structural data4.  Integrate topics in structural geology and plate tectonics through survey of scientific literatures5.  Make primary observations in the field and using them to construct and test structural hypothesesLectures focus on geometric, kinematic, and mechanical analysis of geological structures. Labs use geological maps, computers, stereonets, and physical analogs to illustrate these concepts. Students are encouraged to lead discussion of leading geological topics spread throughout the semester, each of which integrates recent class topics with large-scale active tectonics. Field trips in the second half of the semester encourage small-group discussion of observations and interpretations of deformational history of the field working area. The students will develop: 1) the ability to evaluate an issue critically based on evidence and scientific principle, 2) to acquire knowledge effectively by self-study and using information technology, and to work independently, 3) to work effectively in a team, and 4) to present information in a clear, concise and logical manner. The students also can acquire a responsible attitude in study and work, and have motivation for life-long learning.", "syllabus": "Refer to the course syllabus distributed in the class.", "required_readings": "Refer to the course syllabus distributed in the class.", "recommended_readings": " Haakon Fossen, Structural Geology, 2010, Cambridge University Press, ISBN-13: 9780521516648.  Ben A. van der Pluijm & Stephen Marshak, Earth Structure – An Introduction to Structural Geology and Tectonics, 2004, W. W. Norton & Company Inc., ISBN0-393-92467-X. Robert J. Twiss & Eldridge M. Moores, Structural Geology, Second Edition, 2006, W.H.Freeman & Co. Ltd., ISBN 13: 9780716749516. John Suppe, Principles of Structural Geology, 1985, Prentice-Hall, Inc., Englewood Cliffs, New Jersey 07362. ISBN: 0-13-710500-2. Passchier C.W.& Trouw R.A.J., Microtectonics, Second Edition, 2006, Springer. ISBN: 978-3-540-64003-5 (print) & 978-3-540-29359-0 (Online).", "terms": {"2023-24 Term 2": {"--LEC (5345)": {"startTimes": ["16:30", "13:30"], "endTimes": ["17:15", "15:15"], "days": [2, 1], "locations": ["Science Centre 331", "Science Centre 331"], "instructors": ["Dr. TAM Pui Yuk, \n\nProfessor ZHAN Yan", "Dr. TAM Pui Yuk, \n\nProfessor ZHAN Yan"], "meetingDates": ["8/1", "9/1", "15/1", "16/1", "22/1", "23/1", "29/1", "30/1", "5/2", "6/2", "19/2", "20/2", "26/2", "27/2", "11/3", "12/3", "18/3", "19/3", "25/3", "26/3", "2/4", "8/4", "9/4", "15/4", "16/4"]}, "-L01-LAB (5344)": {"startTimes": ["17:30"], "endTimes": ["18:15"], "days": [2], "locations": ["Science Centre 331"], "instructors": ["Dr. TAM Pui Yuk, \n\nProfessor ZHAN Yan"], "meetingDates": ["9/1", "16/1", "23/1", "30/1", "6/2", "20/2", "27/2", "12/3", "19/3", "26/3", "2/4", "9/4", "16/4"]}}}, "assessments": {"Essay test or exam": "35", "Fieldwork or field study": "20", "Lab reports": "20", "Short answer test or exam": "25"}}, {"code": "3110", "title": "Geoscience Field Course", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "Field Studies/Field-trip\nLecture\nProject\nInteractive Tutorial", "campus": "Main Campus", "academic_group": "Earth & Environmental Sci PC", "requirements": "Not for students who have taken ESSC3110. Pre-requisite: (EESC2010 or ESSC2010), and (EESC3100 or ESSC3100) or (EESC4120 or ESSC4120) or by instructor’s approval.", "description": "Understanding of Earth processes and environmental changes over geological time is highly dependent upon the experience and capabilities gained through doing fieldwork. EESC3110 is an intermediate level course of the Earth and Environmental Sciences Programme. It covers important aspects of field geology, including sedimentary, igneous and metamorphic petrology, tectonics, geophysics and surficial processes. The principal goal of this course is to train students to recognize different lithological units and their geometries in three dimensions, and understand the related tectonic environment and formation mechanism. Class lectures introduce basic skills of reading and interpreting geological maps, using geological equipment (i.e. Compass-clinometer, GPS receiver), and producing field notes and reports. Field projects include field observation and description, techniques of field data acquisition and analysis, sample collection, and geological map compilation. Field projects also focus on surficial processes (relatively occurring on short geological time scale), which are of environmental and ecological importance. The field location (either in mainland of China or overseas) may change from year to year.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "3120", "title": "Physics of the Earth", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "Lecture\nInteractive Tutorial", "campus": "Main Campus", "academic_group": "Earth & Environmental Sci PC", "requirements": "Not for students who have taken ESSC3120. Pre-requisite: EESC 2010 or ESSC2010 or permission of instructor.", "description": "This course focuses on the concepts of the physics of the Earth to understand how the solid Earth works. Since 1960s, plate tectonics has been developed to explain observations on Earth such as mountain building, occurrence of earthquakes and volcanoes, as well as deposition of natural resources. The discovery of plate tectonics requires understanding of geophysical methods, which will be covered in this course. The topics covered include the Earth’s gravitational and magnetic fields, earthquake seismology, internal structure of the Earth, thermal and electrical properties, as well as geodynamics. Methods of geophysical survey will also be introduced.", "outcome": "At the completion of this course, the students will be able to know about Earth’s inner structure, composition, and thermal and electrical properties, understand principles of seismic wave propagation and earthquake physics, gain knowledge of gravity and geomagnetism, and have the ability to analyze the observation data for explanation of geophysical processes. The students will develop: 1) the ability to evaluate an issue critically based on evidence and scientific principle, 2) to acquire knowledge effectively by self-study and using information technology, and to work independently, 3) to work effectively in a team, and 4) to present information in a clear, concise and logical manner. The students also can acquire a responsible attitude in study and work, and have motivation for life-long learning.", "syllabus": "Plate tectonics: Magnetic field, Paleomagnetism, Plate motion and rotationSeismology: Earthquakes and plate boundaries, Earthquake location and magnitude, Earthquake energy andfocal mechanism, Wave propagation, Refraction and reflection seismologyGravity: Gravity and geoid, Gravity corrections, Gravity anomaly, IsostasyHeat: Heat flow, Heat conduction, Heat convection ", "required_readings": "Refer to the course syllabus distributed in the class.", "recommended_readings": " C. M. R. Fowler, 2005, The Solid Earth: An introduction to global geophysics, 2nd edition, 685 pp, Cambridge University Press.  D. L. Turcotte and G. Schubert, 2002, Geodynamics, 2nd edition, 472 pp, Cambridge University Press.", "terms": {"2023-24 Term 1": {"--LEC (5332)": {"startTimes": ["9:30", "15:30"], "endTimes": ["10:15", "17:15"], "days": [5, 2], "locations": ["Mong Man Wai Bldg 704", "Basic Med Sci Bldg Rm2"], "instructors": ["Professor YANG Hongfeng", "Professor YANG Hongfeng"], "meetingDates": ["5/9", "8/9", "12/9", "15/9", "19/9", "22/9", "26/9", "29/9", "3/10", "6/10", "10/10", "13/10", "17/10", "20/10", "24/10", "27/10", "31/10", "3/11", "7/11", "10/11", "14/11", "17/11", "21/11", "24/11", "28/11", "1/12"]}, "-T01-TUT (5333)": {"startTimes": ["10:30"], "endTimes": ["11:15"], "days": [5], "locations": ["Mong Man Wai Bldg 704"], "instructors": ["Professor YANG Hongfeng"], "meetingDates": ["8/9", "15/9", "22/9", "29/9", "6/10", "13/10", "20/10", "27/10", "3/11", "10/11", "17/11", "24/11", "1/12"]}}}, "assessments": {"Essay test or exam": "30", "Homework or assignment": "30", "Presentation": "20", "Short answer test or exam": "20"}}, {"code": "3130", "title": "Introduction to Seismic Data Processing", "career": "Undergraduate", "units": "3.00", "grading": "Pass (P)/Fail (U)", "components": "Project", "campus": "Main Campus", "academic_group": "Earth & Environmental Sci PC", "requirements": "", "description": "This course that will be offered in the summer term aims to develop the students’ knowledge, skills, and interest in seismology, scientific computing, and seismic data processing. Topics include introduction to Linux command line, shell scripting, and Generic Mapping Tools (GMT); introduction to Seismic Analysis Code (SAC); how to use the various Incorporated Research Institutions for Seismology (IRIS) tools for data request and initial data exploration; and various methods to model and visualize seismic waveforms for earthquake and velocity structure studies.", "outcome": "Students will obtain basic skills in seismic data acquisition, processing, visualizing, and modeling that are fundamental to the field of seismology.", "syllabus": "Each week, a learning module will be assigned to the students for completion. This includes watching pre-recorded lectures and completing specific assignments to demonstrate their grasp of the lecture materials. There will be a final project where students will integrate what they have learnt throughout the semester to gain new scientific insights from analyzing seismic data. Linux command line Shell scripting Generic Mapping Tools (GMT) for plotting seismicity and velocity models Seismic Analysis Code (SAC) for seismic data visualization, processing, and analysis Incorporated Research Institutions for Seismology (IRIS) tools for data request and initial data exploration Seismic data visualization and modelling for earthquake source and velocity structure studies ObsPy: Python toolbox for seismology Jupyter Notebooks for code and results sharing", "required_readings": "Refer to the course syllabus distributed in the class.", "recommended_readings": "Refer to the course syllabus distributed in the class.", "terms": {"2023-24 Term 1": {"-J01-PRJ (7749)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["No Room Required"], "instructors": ["Professor TAN Yen Joe, \n\nProfessor YANG Hongfeng"], "meetingDates": ["04/09/2023 - 27/11/2023"]}}}, "assessments": {"Homework or assignment": "60", "Project": "40"}}, {"code": "3200", "title": "Atmospheric Dynamics", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "Lecture\nInteractive Tutorial", "campus": "Main Campus", "academic_group": "Earth & Environmental Sci PC", "requirements": "Not for students who have taken ESSC3200. Pre-requisite: (EESC2020 or ESSC2020) and MATH2550, or permission of instructor.", "description": "This course introduces observations of and physical principles governing the circulation of the Earth’s atmosphere in relation to weather and climate. The topics covered include atmospheric composition and structure, convection, fundamentals of atmospheric motions, and the basic principles for weather and climate modeling. Physical principles covered include basic conservation laws, balanced flows, atmospheric thermodynamics, circulation and vorticity, atmospheric waves, and theories for various weather systems.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "3220", "title": "Atmospheric Chemistry", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "Lecture\nInteractive Tutorial", "campus": "Main Campus", "academic_group": "Earth & Environmental Sci PC", "requirements": "Not for students who have taken ESSC3220. Pre-requisite: CHEM1070 or CHEM1072 or CHEM1280 or permission of instructor.", "description": "This course introduces the physical and chemical processes determining the composition for the atmosphere and its implications for climate, ecosystems, air pollution and human welfare. Topics covered include atmospheric structure, atmospheric chemistry models, atmospheric transport, chemical kinetics, stratospheric and tropospheric chemistry, chemistry of aerosols, biogeochemical cycles, as well as critical environmental issues including stratospheric ozone depletion, acid rain, photochemical smog, and climate change.", "outcome": "At the completion of this course, the students will be able to1)  Gain fundamental concepts of atmospheric chemistry;2)  Understand the physical and chemical principles related to natural and pollution aspects of the atmosphere;3)  Develop the ability to analyze and explain observed atmospheric phenomena and environmental change;4)  Acquire the basics of atmospheric modeling used for air quality and climate projections.(Course outcomes as related to Programme Learning Outcomes) -- The students will develop: 1) the ability to evaluate an issue critically based on evidence and scientific principle, 2) to acquire knowledge effectively by self-study and using information technology, and to work independently, 3) to work effectively in a team, and 4) to present information in a clear, concise and logical manner. The students also can acquire a responsible attitude in study and work, and have motivation for life-long learning.", "syllabus": "TopicsIntroduction and overviewMeasures of atmospheric compositionVertical structure of the atmosphere; chemical thermodynamicsChemical kineticsAtmospheric photochemistryAtmospheric lifetime; box and puff modelsStratospheric chemistry: Chapman mechanismStratospheric chemistry: HOx  catalytic loss cyclesStratospheric chemistry: NOx  catalytic loss cyclesStratospheric chemistry: ClOx  and BrOx  catalytic loss cyclesStratospheric chemistry: polar ozone holeStratospheric chemistry: polar ozone hole recoveryOxidizing power of the troposphereTropospheric ozoneTropospheric ozone pollutionAtmospheric gas-phase chemistryAerosol sources and formationAerosol physics and thermodynamicsAerosol measurement techniquesAerosol – cloud formationChemistry of atmospheric aqueous phase and precipitationAcid rain", "required_readings": "Jacob, D.J.: Introduction to Atmospheric Chemistry, Princeton University Press, 1999.", "recommended_readings": "Seinfeld, J.H. and Pandis, S.N.: Atmospheric Chemistry and Physics: From Air Pollution to Climate Change, 2006.", "terms": {"2023-24 Term 2": {"--LEC (6325)": {"startTimes": ["12:30", "11:30"], "endTimes": ["14:15", "12:15"], "days": [2, 3], "locations": ["Mong Man Wai Bldg 704", "Basic Med Sci Bldg Rm2"], "instructors": ["Professor CHAN Man Nin", "Professor CHAN Man Nin"], "meetingDates": ["9/1", "10/1", "16/1", "17/1", "23/1", "24/1", "30/1", "31/1", "6/2", "7/2", "20/2", "21/2", "27/2", "28/2", "12/3", "13/3", "19/3", "20/3", "26/3", "27/3", "2/4", "3/4", "9/4", "10/4", "16/4", "17/4"]}, "-T01-TUT (7545)": {"startTimes": ["12:30"], "endTimes": ["13:15"], "days": [3], "locations": ["Basic Med Sci Bldg Rm2"], "instructors": ["Professor CHAN Man Nin"], "meetingDates": ["10/1", "17/1", "24/1", "31/1", "7/2", "21/2", "28/2", "13/3", "20/3", "27/3", "3/4", "10/4", "17/4"]}}}, "assessments": {"Essay test or exam": "40", "Homework or assignment": "25", "Presentation": "10", "Short answer test or exam": "25"}}, {"code": "3230", "title": "Principles of Environmental Protection and Pollution Control", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Earth & Environmental Sci PC", "requirements": "Not for students who have taken ENSC3230 or GRMD3202. Pre-requisite: EESC2270 or ENSC2270 or permission of the instructor.", "description": "This course discusses from a multidisciplinary viewpoint the anthropogenic causes of environmental degradation and the various approaches to environmental protection and pollution control. Students are introduced the concept of sustainability in environmental protection, economic measures and voluntary approach in environmental management, control and treatment technologies, and their comparative effectiveness in the abatement of various types of pollution. Management programmes and control strategies in tackling local environmental problems are illustrated.", "outcome": "Students are expected to understand the multidisciplinary nature of environmental management, learn the various measures (regulatory, economic, technological) available, and aware of different stakeholders' needs and the constraints in environmental protection.Students should be able to: understand the socio-economic causes of environmental problems; view environment as a site for conflict and environmental solutions for conflict resolution; sustainability as the core conceptual principle of environmental protection; appreciate that environmental protection can be achieved by changes in environmental attitudes and ethics; sole use of technologies cannot eliminate environmental problems, but integration of technical and nontechnical measures (incl voluntary corporate environmental management) in environmental protection; environmental protection strategies and their inadequa cies in tackling local environmental problems.", "syllabus": " Environmental crises – Trends and causes Sustainable development Environmental management – Elements and approaches Air pollution control Water pollution control Solid waste management Hazardous waste management", "required_readings": " Wright, R.T. and Boorse, D.F. (2017) Environmental Science. Towards a Sustainable Future (13th Ed.). Pearson Prentice Hall, Upper Saddle River, New Jersey. Enger, E.D. & Smith, B.F. (2013) Environmental Science: A Study of Interrelationships (13th Ed.). McGraw-Hill, Dubuque. Withgott, J & Brennan, S. (2014) Environment. The Science Behind the Stories (5th Ed.). Benjamin Cummings, Boston.", "recommended_readings": " Cunningham, W.P. & Cunningham, M.A. (2015) Environmental Science: A Global Concern (13th Ed.). McGraw-Hill, Boston. Chiras, D.D. (2010) Environmental Science. Creating a Sustainable Future (8th Ed.). Jones and Barlett Publishers, Sudbury. Davis, M.L. & Masten, S.J. (2014) Principles of Environmental Engineering and Science (3rd Ed.). McGraw Hill, New York. Mines, R.O. Jr. (2014) Environmental Engineering: Principles and Practice. Wiley Blackwell, Hoboken, NJ. Weiner, R.F. and Matthews, R.A. (2003) Environmental Engineering (4th Ed.). Butterworth- Heinemann, Amsterdam. Mtchell, B. (2002) Resource and Environmental Management (2nd Ed.). Longman, Harlow. O'Riordan, T. (2000) Environmental Science for Environmental Management (2nd Ed.). Prentice Hall, Essex. Dryzek, J.S. & Schlosberg, D. (2005) Debating the Earth – The Environmental Politics Reader (2nd Ed.). Oxford University Press, Oxford. Selected articles from webs", "terms": {"2023-24 Term 2": {"--LEC (6339)": {"startTimes": ["10:30", "11:30"], "endTimes": ["12:15", "12:15"], "days": [2, 4], "locations": ["Mong Man Wai Bldg 704", "Mong Man Wai Bldg 705"], "instructors": ["Professor TSUI Tsz Ki Martin", "Professor TSUI Tsz Ki Martin"], "meetingDates": ["9/1", "11/1", "16/1", "18/1", "23/1", "25/1", "30/1", "1/2", "6/2", "8/2", "20/2", "22/2", "27/2", "29/2", "12/3", "14/3", "19/3", "21/3", "26/3", "28/3", "2/4", "9/4", "11/4", "16/4", "18/4"]}}}, "assessments": {"Homework or assignment": "10", "Others": "10", "Presentation": "10", "Short answer test or exam": "40", "Selected response test or exam": "30"}}, {"code": "3300", "title": "Oceanography", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "Lecture\nInteractive Tutorial", "campus": "Main Campus", "academic_group": "Earth & Environmental Sci PC", "requirements": "Not for students who have taken ESSC3300. Pre-requisite: (EESC2010 or ESSC2010) and (EESC2020 or ESSC2020), or permission of instructor.", "description": "This course will investigate the characteristics and dynamics of the ocean. Specific topics include ocean floor, marine sediments, oceanic plate, seawater, air-sea interaction, ocean circulation, waves, El Niño-Southern Oscillation, and the roles of the ocean in climate and climate variability.", "outcome": "At the completion of this course, the students will 1) Gain knowledge of the physical, chemical and biological process associated with the ocean, 2) Understand fundamental physic of phenomena related to the ocean,3) Develop ability to analyze and explain observed oceanic phenomena.(Course outcomes as related to Programme Learning Outcomes) -- The students will develop: 1) the ability to evaluate an issue critically based on evidence and scientific principle, 2) to acquire knowledge effectively by self-study and using information technology, and to work independently, 3) to work effectively in a team, and 4) to present information in a clear, concise and logical manner. The students also can acquire a responsible attitude in study and work, and have motivation for life-long learning.", "syllabus": " Ocean floor and seafloor mapping Oceanic plate and crust Mid-ocean ridges and seismic reflection imaging Marine sediments  Properties of sea water, mixed layer and thermocline Ocean general circulation, ocean heat transport Geostrophic and hydrostatic balance, vorticity Wind-driven circulation, western boundary current, Sverdrup theory Thermohaline circulation Inertial oscillations, surface waves, Rossby waves, Kelvin waves, Climate variability, El Nino-Southern Oscillation, Paleoclimate  ", "required_readings": "Refer to the course syllabus distributed in the class.", "recommended_readings": " Talley, L.D., G.L. Pickard, W.J. Emery, and J.H. Swift, 2011, Descriptive Physical Oceanography, An introduction, 6th edition, Academic Press.  Stewart, R.H., 2008, Introduction to Physical Oceanography.  Trujillo, A.P., and H.V. Thurman, 2019, Essentials of Oceanography, 13th edition, Pearson.  Jones, E.J.W. 1999, Marine Geophysics, Wiley.  ", "terms": {"2023-24 Term 2": {"--LEC (6008)": {"startTimes": ["13:30", "16:30"], "endTimes": ["15:15", "17:15"], "days": [1, 2], "locations": ["Mong Man Wai Bldg 706", "Basic Med Sci Bldg Rm1"], "instructors": ["Dr. LI Kwan Kit Ronald, \n\nProfessor Benoit THIBODEAU, \n\nProfessor TAN Yen Joe", "Dr. LI Kwan Kit Ronald, \n\nProfessor Benoit THIBODEAU, \n\nProfessor TAN Yen Joe"], "meetingDates": ["8/1", "9/1", "15/1", "16/1", "22/1", "23/1", "29/1", "30/1", "5/2", "6/2", "19/2", "20/2", "26/2", "27/2", "11/3", "12/3", "18/3", "19/3", "25/3", "26/3", "2/4", "8/4", "9/4", "15/4", "16/4"]}, "-T01-TUT (6025)": {"startTimes": ["17:30"], "endTimes": ["18:15"], "days": [2], "locations": ["Basic Med Sci Bldg Rm1"], "instructors": ["Dr. LI Kwan Kit Ronald, \n\nProfessor Benoit THIBODEAU, \n\nProfessor TAN Yen Joe"], "meetingDates": ["9/1", "16/1", "23/1", "30/1", "6/2", "20/2", "27/2", "12/3", "19/3", "26/3", "2/4", "9/4", "16/4"]}}}, "assessments": {"Essay test or exam": "35", "Homework or assignment": "20", "Lab reports": "25", "Short answer test or exam": "20"}}, {"code": "3320", "title": "Hydrogeology", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "Lecture\nInteractive Tutorial", "campus": "Main Campus", "academic_group": "Earth & Environmental Sci PC", "requirements": "Not for students who have taken ESSC3320. Pre-requisite: EESC 2010 or ESSC2010 or permission of instructor.", "description": "This course introduces the physical and chemical principles of hydrogeology. Concepts of surface and groundwater hydrology, as well as quantitative modelling of groundwater flow and contaminant transport are covered. Special topics on the coupling of hydrologic and geologic processes will also be addressed, with examples from tectonics, petroleum geology, geothermics, and global change.", "outcome": "Students will acquire basic concepts in relation to the physical chemical processes of water circulations in the various components of the Earth system. The students will appreciate the interaction between the hydrosphere and geosphere, and its impact on natural resources and the environment. The students will develop: 1) the ability to evaluate an issue critically based on evidence and scientific principle, 2) to acquire knowledge effectively by self-study and using information technology, and to work independently, 3) to work effectively in a team, and 4) to present information in a clear, concise and logical manner. The students also can acquire a responsible attitude in study and work, and have motivation for life-long learning.", "syllabus": "Refer to the course syllabus distributed in the class.", "required_readings": "Fetter, C. W., Applied Hydrogeology (4th edition), Pearson, 612 pp., 2014.", "recommended_readings": " Hornberger, G.M., Wiberg, P.L., Raffensperger, J.P. and P. D'Odorico, Elements of Physical Hydrology, 2nd edition, John Hopkins UP, 378 pp., 2014. Fitts, C.R., Groundwater Science, 2nd edition, Academic Press, 672 pp., 2013. Mays, L. W., Ground and Surface Water Hydrology, John Wiley & Sons, 640 pp., 2011. Schwartz, F. W. and H. Zhang, Fundamentals of Ground Water, John Wiley & Sons, 583 pp., 2003.", "terms": {"2023-24 Term 1": {"--LEC (6197)": {"startTimes": ["13:30", "13:30"], "endTimes": ["14:15", "15:15"], "days": [1, 3], "locations": ["Y.C. Liang Hall G03", "Y.C. Liang Hall G03"], "instructors": ["Professor TAN Yen Joe", "Professor TAN Yen Joe"], "meetingDates": ["4/9", "6/9", "11/9", "13/9", "18/9", "20/9", "25/9", "27/9", "4/10", "9/10", "11/10", "16/10", "18/10", "25/10", "30/10", "1/11", "6/11", "8/11", "13/11", "15/11", "20/11", "22/11", "27/11", "29/11"]}}}, "assessments": {"Essay test or exam": "30", "Homework or assignment": "30", "Selected response test or exam": "40"}}, {"code": "3330", "title": "Biogeochemistry", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Earth & Environmental Sci PC", "requirements": "Not for students who have taken ENSC3330. Pre-requisite: (EESC2270 or ENSC2270) or (EESC2020 or ESSC2020) or GRMD2209, or permission of the instructors.", "description": "This course aims to take students to explore recent advances in biogeochemistry of different elements in both terrestrial and aquatic ecosystems. The course will include basic concepts of watershed processes, elemental cycling, hydrological transport, atmospheric processes, and oceanic transformation. The applications of the knowledge on environmental pollution and environmental health will be discussed, different cutting-edge techniques and hands-on field approaches will be covered in this course, with an emphasis on aquatic habitats.", "outcome": "After completing this course, students are expected to: understand the key processes regulating elemental cycling in the environment. understand the basic concepts and recent development in environmental biogeochemistry and its relationships to major global environmental problems. know how to design and conduct simple investigation of elemental cycling in the environment know how to communicate with the general public with a scientific understanding of biogeochemistry.", "syllabus": "This course presents the recent understanding and advancements in global biogeochemistry. The lectures are on a range of topics, covering major elemental cycles in forest, streams, groundwater, wetlands, inland waters, oceans, and atmosphere. Advanced concepts of application of biogeochemistry will further be discussed with an emphasis on environmental pollution and health, and global climate change. The fundamentals of major elemental cycles like carbon, nitrogen, phosphorus, oxygen, sulphur, mercury and silicate will also be covered.   Week 1 Introduction; overview of global environmental problems and key elements; basics of environmental chemistry Tsui   Week 2 Watershed processes: forests, streams, groundwater, wetlands, and inland waters Tsui   Week 3 Carbon cycling in forests and inland waters Tsui   Week 4 Nutrient cycling in forests and inland waters Tsui   Week 5 Sulphur and mercury cycling in terrestrial and freshwater environment Tsui   Week 6 Biogeochemistry and its applications to study environmental pollution Tsui   Week 7 Review and midterm exam     Week 8 Notions of oceanography Thibodeau   Week 9 Biogeochemical air-sea interface Thibodeau   Week 10 Organic matter production, export, remineralization and burial Thibodeau   Week 11 The oceanic carbon, silicate and calcium carbonate cycles Thibodeau   Week 12 Linkages between nutrient and oxygen cycles in the oceans Thibodeau   Week 13 Ocean biogeochemistry and climate Thibodeau  ", "required_readings": "Refer to the course syllabus distributed in the class.", "recommended_readings": "Lecture handout for each of the topics will be uploaded to the accompanied Blackboard site. Extra reading materials are expected to change every year to reflect the latest development in the research field in biogeochemistry. Additional reading materials such as journal articles will be provided by individual instructors.  Sarmiento JL and Gruber N. 2006. Ocean Biogeochemical Dynamics, Academic Press (Paperback ISBN: 9780691017075)   Chapin III FS, Matson PA and Vitousek PM. 2011. Principles of Terrestrial Ecosystem Ecology 2nd ed., Springer (Paperback ISBN: 978-1-4419-9503-2) (eBook ISBN: 978-1-4419-9504-9)  Schlesinger WH and Bernhardt E. 2020. Biogeochemistry: An Analysis of Global Change 4th ed., Academic Press (Paperback ISBN: 9780128146088) (eBook ISBN: 9780128146095)   ", "terms": {"2023-24 Term 2": {"--LEC (6426)": {"startTimes": ["14:30"], "endTimes": ["17:15"], "days": [4], "locations": ["Wu Ho Man Yuen Bldg 403"], "instructors": ["Professor Benoit THIBODEAU, \n\nProfessor TSUI Tsz Ki Martin"], "meetingDates": ["11/1", "18/1", "25/1", "1/2", "8/2", "22/2", "29/2", "14/3", "21/3", "28/3", "11/4", "18/4"]}}}, "assessments": {"Essay test or exam": "30", "Homework or assignment": "20", "Project": "20", "Short answer test or exam": "30"}}, {"code": "3415", "title": "Environmental Instrumentation Techniques", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Earth & Environmental Sci PC", "requirements": "Not for students who have taken CHEM2400 or CHEM3410 or ENSC3415. Pre-requisite: EESC2515 or ENSC2515.", "description": "This course aims to provide students with a basic understanding of the operational principles and applications of various instrumental techniques commonly used for the studies of air and water pollution. It is designed to cover atomic and molecular absorption and emission spectroscopy, mass spectrometry, gas chromatography, high-performance liquid chromatography, and electrochemical methods. Emphasis will be placed on the application of such techniques for pollution monitoring and preventive detection systems, especially with reference to the identification and determination of trace levels of toxic heavy metals, organic and organometallic compounds.", "outcome": " To allow students to gain fundamental knowledge of the principles of instrumental techniques. To allow students to gain fundamental knowledge of mathematical techniques required in treatment of analytical data. To allow students to gain the ability of recognizing key factors and applying appropriate assumption to formulate solutions for environmental analysis. To allow students to acquire problem solving skills including ability to identify key issues and formulate feasible solutions of problems based on logical analysis and critical thinking. To develop students' critical evaluation of issues based on evidence and scientific logic. To allow students to gain ability of analyzing issues quantitatively with the sense of level of uncertainty and reliability. To enhance students' awareness of impacts of instrumental analysis in environmental, social, economic, industrial, and technological aspects. To enhance students' confidence in ability of solving problems.", "syllabus": "This course will be divided into the following parts: Treatment of Analytical Data Spectroscopic Techniques (UV-VIS, IR, AAS, ICP, MS and XRF) Electrochemical Methods (Potentiometry, Coulometry and Voltammetry) Chromatographic Techniques (GC and HPLC)  Environmental Sampling and Analysis", "required_readings": "D.A. Skoog, F. J. Holler and T. A. Nieman: Principles of Instrumental Analysis, 6th ed. Thomson, 2006.", "recommended_readings": "  R. Reeve: Introduction to Environmental Analysis, Wiley, 2002.  G. Christian: Analytical Chemistry, 6th ed., Wiley, 2004.", "terms": {"2023-24 Term 2": {"--LEC (7991)": {"startTimes": ["8:30"], "endTimes": ["11:15"], "days": [4], "locations": ["Basic Med Sci Bldg Rm2"], "instructors": ["Professor CHAN Tak Wah Dominic"], "meetingDates": ["11/1", "18/1", "25/1", "1/2", "8/2", "22/2", "29/2", "14/3", "21/3", "28/3", "11/4", "18/4"]}}}, "assessments": {"Homework or assignment": "30", "Short answer test or exam": "40", "Selected response test or exam": "30"}}, {"code": "3417", "title": "Environmental Instrumentation Techniques Laboratory", "career": "Undergraduate", "units": "2.00", "grading": "Graded", "components": "Laboratory", "campus": "Main Campus", "academic_group": "Earth & Environmental Sci PC", "requirements": "Not for students who have taken ENSC3417. Co-requisite: EESC3415 or ENSC3415 or permission of the instructor.", "description": "This laboratory course provides students with hands-on experience in applying and operating various instrumental techniques that are commonly used in environmental analysis. In addition, this course also provides practical training to students in collecting, handling and treating the samples.", "outcome": " To allow students to gain experience on understanding and analyzing specified goals. To allow students to gain experience on carrying out appropriate experiments for specified goals. To allow students to be familiar with the use of resources of chemical literature and databases. To develop students' convergent thinking and convergent thinking. To allow students to acquire experimental skills in different disciplines of analytical chemistry. To allow students to strengthen their analytical chemistry background through performing experiments. To allow students to gain experience on applying analytical chemistry knowledge onto experimental works. To stimulate students' creativity to solve for difficulties encountered in experiments, to suggest possible causes for undesirable results, and to summarize and analyze raw data for conclusions. To enhance students' written skills in presenting conclusion from raw data. To enhance students' professional communication skills with colleagues and supervisors. To enhance students' skills to collaborate with other people.", "syllabus": "This course aims to provide students with hands-on experience in applying different types of instrumental techniques in environmental analysis including spectroscopic, electrochemical and chromatographic techniques.", "required_readings": "D.A. Skoog, F. J. Holler and T. A. Nieman: Principles of Instrumental Analysis, 6th ed., Saunders, 2006.", "recommended_readings": "Please refer to the laboratory manual for the references of each experiment.", "terms": {"2023-24 Term 2": {"-L01-LAB (7992)": {"startTimes": ["14:30"], "endTimes": ["18:15"], "days": [3], "locations": ["Science Centre 130A"], "instructors": ["Dr. CHAN Ka Long Donald, \n\nProfessor CHAN Tak Wah Dominic"], "meetingDates": ["10/1", "17/1", "24/1", "31/1", "7/2", "21/2", "28/2", "13/3", "20/3", "27/3", "3/4", "10/4", "17/4"]}}}, "assessments": {"Lab reports": "60", "Others": "40"}}, {"code": "3520", "title": "Environmental and Biochemical Toxicology", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Earth & Environmental Sci PC", "requirements": "Not for students who have taken ENSC3520. Pre-requisite: BCHE2030 and BIOL2120, or permission of instructor.", "description": "The first part of this course introduces the sources, chemical nature and environmental effects of major environmental toxicants. The second part covers the fundamental basis of toxic action of chemical substances including environmental toxicants on living systems. The third part provides students an understanding of the basic principles and biochemical mechanisms of toxicology. This course will also cover the basic concepts of biomonitoring and ecotoxicology.", "outcome": "Students will understand the sources and chemical nature of selected toxicants, and the carcinogenesis, hepatotoxicity and neurotoxicity caused by the toxicants. They will know how the toxicity of chemical substances including some common toxic metals, carcinogens, pesticides and natural toxins can be changed. They will also study the basic techniques in ecotoxicology, and able to plan and carry out environmental monitoring and ecotoxicological studies of the impacts of environmental pollutants on local organisms", "syllabus": "  Sources and chemical nature of environmental toxicants  Environmental effects on the selected toxicants  Microbial bioassay and genotoxicity study  Biomonitoring, bioindicators and biomarkers  Ecological effects of the toxicants (Eco-toxicology)  Regulatory toxicology and risk assessment", "required_readings": "Hodgson, E. (ed) 2010. A Textbook of Modern Toxicology, 4th Ed., John Wiley & Sons, Inc. 648 p. RA1211.H62 2010.", "recommended_readings": "Klaassen, C. (ed) 2013. Casarett & Doull's Toxicology: The Basic Science of Poisons, 8th Ed., McGraw Hill Education, 1423 p. QV600 615.9", "terms": {"2023-24 Term 2": {"--LEC (9217)": {"startTimes": ["13:30", "12:30"], "endTimes": ["14:15", "14:15"], "days": [3, 4], "locations": ["William M W Mong Eng Bldg 405", "Mong Man Wai Bldg 704"], "instructors": ["Dr. LAU Ching Ching", "Dr. LAU Ching Ching"], "meetingDates": ["10/1", "11/1", "17/1", "18/1", "24/1", "25/1", "31/1", "1/2", "7/2", "8/2", "21/2", "22/2", "28/2", "29/2", "13/3", "14/3", "20/3", "21/3", "27/3", "28/3", "3/4", "10/4", "11/4", "17/4", "18/4"]}}}, "assessments": {"Essay test or exam": "50", "Short answer test or exam": "50"}}, {"code": "3522", "title": "Environmental and Biochemical Toxicology Laboratory", "career": "Undergraduate", "units": "2.00", "grading": "Graded", "components": "Laboratory", "campus": "Main Campus", "academic_group": "Earth & Environmental Sci PC", "requirements": "Not for students who have taken ENSC3820. Co-requisite: EESC3520 or ENSC3520.", "description": "Students will conduct practical work including multiple cytotoxicity assay, DNA damage assay, and biomarker assays in laboratory. The practical lab helps students understand the lecture taught in EESC3520. Students will also be introduced with internationally recognized methods to study how chemicals can have biochemical and ecological impacts as a global citizen. Students are also encouraged to use innovative ideas to design new methods to test chemical toxicity.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "3600", "title": "Ecosystems and Climate", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "Lecture\nInteractive Tutorial", "campus": "Main Campus", "academic_group": "Earth & Environmental Sci PC", "requirements": "Not for students who have taken ESSC3600 or EESC3601 or ESSC3601. Pre-requisite: EESC2020 or ESSC2020 or permission of instructor.", "description": "This course introduces the physical, chemical and biological principles governing the functioning of terrestrial and marine ecosystems, and their roles in shaping the Earth’s climatic and geological environments. Topics include: basic hydrology and surface energy balance; energy, momentum, water and chemical exchange between ecosystems and the atmosphere; cycling of water, carbon and other nutrients in soil, vegetation and ocean; survival strategies of different life forms (especially plants and microorganisms); ecosystem structures and functions; landscapes, disturbances and ecosystem dynamics; human perturbations of biogeochemical cycles via pollution, greenhouse gas emissions and land use; responses and evolution of terrestrial and marine ecosystems under global climate change. This course serves as a comprehensive introduction to ecological climatology, biogeochemistry and ecosystem ecology, and requires basic mathematical operations. This version of the course includes an integrated set of computer laboratory sessions.", "outcome": " Students will understand fundamental concepts in the physical and chemical principles governing the structures and functions of ecosystems; Students will understand how ecosystems are impacted by natural processes and humans activities; Students will learn to search for information and data from the literature; Students will acquire mathematical skills required to conduct ecosystem and climate analysis, as well as presentation and writing skills. Students will develop the responsibility in study and work. Student will have motivation for life-long learning.", "syllabus": " Topic 1: Ecosystems, global plant biogeography and climate Topic 2: Plant ecophysiology: photosynthesis and transpiration Topic 3: Surface energy balance and biogeophysical climate-vegetation interactions Topic 4: Soil and plant biogeochemistry Topic 5: Global carbon cycle and biogeochemical feedbacks Topic 6: Marine and wetland ecosystems and biogeochemistry Topic 7: Nitrogen, aerosols and atmospheric chemistry Topic 8: Sustainable ecosystem management", "required_readings": " Bonan, G.B. (2016): Ecological Climatology: Concepts and Applications (3rd edition). Cambridge University Press. Schlesinger, W.H., Bernhardt, E.S. (2013): Biogeochemistry: An Analysis of Global Change (3rd edition). Academic Press.", "recommended_readings": " Schimel, D. (2013): Climate and Ecosystems. Princeton University Press. Chapin (III), F.S., Matson, P.A., Vitousek, P.M. (2012): Principles of Terrestrial Ecosystem Ecology (2nd edition). Springer. Valiela, I. (2016): Marine Ecological Processes (3rd edition). Springer.", "terms": {"2023-24 Term 2": {"--LEC (6526)": {"startTimes": ["11:30", "14:30"], "endTimes": ["13:15", "15:15"], "days": [1, 2], "locations": ["Esther Lee Bldg 207", "Lee Shau Kee Archi Bldg 212"], "instructors": ["Dr. LI Kwan Kit Ronald, \n\nProfessor TAI Pui Kuen Amos", "Dr. LI Kwan Kit Ronald, \n\nProfessor TAI Pui Kuen Amos"], "meetingDates": ["8/1", "9/1", "15/1", "16/1", "22/1", "23/1", "29/1", "30/1", "5/2", "6/2", "19/2", "20/2", "26/2", "27/2", "11/3", "12/3", "18/3", "19/3", "25/3", "26/3", "2/4", "8/4", "9/4", "15/4", "16/4"]}, "-T01-TUT (7586)": {"startTimes": ["15:30"], "endTimes": ["16:15"], "days": [2], "locations": ["Lee Shau Kee Archi Bldg 212"], "instructors": ["Dr. LI Kwan Kit Ronald, \n\nProfessor TAI Pui Kuen Amos"], "meetingDates": ["9/1", "16/1", "23/1", "30/1", "6/2", "20/2", "27/2", "12/3", "19/3", "26/3", "2/4", "9/4", "16/4"]}}}, "assessments": {"Essay test or exam": "60", "Homework or assignment": "5", "Lab reports": "30", "Participation": "5"}}, {"code": "3601", "title": "Principles of Ecosystems and Climate", "career": "Undergraduate", "units": "2.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Earth & Environmental Sci PC", "requirements": "Not for students who have taken ESSC3601 or EESC3600 or ESSC3600. Pre-requisite: EESC2020 or ESSC2020 or permission of instructor.", "description": "This course introduces the physical, chemical and biological principles governing the functioning of terrestrial and marine ecosystems, and their roles in shaping the Earth’s climatic and geological environments. Topics include: basic hydrology and surface energy balance; energy, momentum, water and chemical exchange between ecosystems and the atmosphere; cycling of water, carbon and other nutrients in soil, vegetation and ocean; survival strategies of different life forms (especially plants and microorganisms); ecosystem structures and functions; landscapes, disturbances and ecosystem dynamics; human perturbations of biogeochemical cycles via pollution, greenhouse gas emissions and land use; responses and evolution of terrestrial and marine ecosystems under global climate change. This course serves as a comprehensive introduction to ecological climatology, biogeochemistry and ecosystem ecology, and requires basic mathematical operations. This course is the same as and meets with EESC3600, except without the integrated computer laboratory sessions and exercises.", "outcome": " Students will understand fundamental concepts in the physical and chemical principles governing the structures and functions of ecosystems; Students will understand how ecosystems are impacted by natural processes and humans activities; Students will learn to search for information and data from the literature; Students will acquire mathematical skills required to conduct ecosystem and climate analysis, as well as presentation and writing skills. Students will develop the responsibility in study and work. Student will have motivation for life-long learning.  ", "syllabus": " Topic 1: Ecosystems, global plant biogeography and climate Topic 2: Plant ecophysiology: photosynthesis and transpiration Topic 3: Surface energy balance and biogeophysical climate-vegetation interactions Topic 4: Soil and plant biogeochemistry Topic 5: Global carbon cycle and biogeochemical feedbacks Topic 6: Marine and wetland ecosystems and biogeochemistry Topic 7: Nitrogen, aerosols and atmospheric chemistry Topic 8: Sustainable ecosystem management", "required_readings": " Bonan, G.B. (2016): Ecological Climatology: Concepts and Applications (3rd edition). Cambridge University Press. Schlesinger, W.H., Bernhardt, E.S. (2013): Biogeochemistry: An Analysis of Global Change (3rd edition). Academic Press.", "recommended_readings": " Schimel, D. (2013): Climate and Ecosystems. Princeton University Press. Chapin (III), F.S., Matson, P.A., Vitousek, P.M. (2012): Principles of Terrestrial Ecosystem Ecology (2nd edition). Springer. Valiela, I. (2016): Marine Ecological Processes (3rd edition). Springer.", "terms": {"2023-24 Term 2": {"--LEC (7588)": {"startTimes": ["11:30"], "endTimes": ["13:15"], "days": [1], "locations": ["Esther Lee Bldg 207"], "instructors": ["Dr. LI Kwan Kit Ronald, \n\nProfessor TAI Pui Kuen Amos"], "meetingDates": ["8/1", "15/1", "22/1", "29/1", "5/2", "19/2", "26/2", "11/3", "18/3", "25/3", "8/4", "15/4"]}}}, "assessments": {"Essay test or exam": "80", "Homework or assignment": "10", "Participation": "10"}}, {"code": "3701", "title": "Intermediate Topics in Earth and Environmental Sciences", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Earth & Environmental Sci PC", "requirements": "", "description": "State-of-the-art research methods, experimental, and computational techniques applied in intermediate topics in Earth and Environmental Sciences.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "3800", "title": "Global Environmental Change", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "Lecture\nInteractive Tutorial", "campus": "Main Campus", "academic_group": "Earth & Environmental Sci PC", "requirements": "Not for students who have taken ESSC3800.", "description": "This course includes the science behind the global warming issue, how the public views the issue and the critical thinking needed to analyze the evidence seen in the media/articles from the point of view of scientists. The world energy use, which is considered to be the cause of global warming, and the impacts are discussed in the course. In this course, students will learn about the radiation budgets/balance in the atmosphere, possible climate forcings that can upset the energy balance, how the earth’s global average temperature is measured, why global warming is described as “the biggest hoax” in human history, observations from the ocean and cryosphere and popular environmental issues/arguments discussed in the mainstream media. Newest observations from the Intergovernmental Panel on Climate Change (IPCC) report are included throughout the course.This course actively incorporates elements of innovation, design, global citizenship and social enterprisingness by asking the students to think innovatively but critically about possible solutions to adapt to and combat climate change and the global energy/health crisis. Different options including their pros and cons are actively discussed in class. Students are encouraged to think creatively about the problem from different angles, e.g., by standing in the shoes of climate skeptics – evaluating their “data”, how they present them, the arguments put forth by them – in order to develop a strategic approach to best communicate the issues to a variety of stakeholders. Project assignments will allow students to focus on one particular environmental issue in other part of the world, attempting to address the issue in the very different geographical, cultural, economic and political contexts from that of the students. Example projects can be “How to use geoengineering to combat climate change?”, “How can Sub-Saharan Africa secure its future food supply under the threat of climate change?”, etc. In the course, students will define and understand the problem. They shall form groups and discuss their own point of views and search information on the evidence of the corresponding arguments. They will present their ideas in class and write a self-reflection report. Each of the group will have to make an “infographic”- a layout of science knowledge learnt in the project that is easy enough for the public to understand but at the same time informative. Good infographics will be used in our OpenDay.", "outcome": "At the completion of this course, the students will be able to gain understanding of basic climate science behind the global warming issue, including how Earth’s global temperature has been measured by scientists and how the global average temperature is calculated study observations from different components of Earth besides the atmosphere, such as ocean and cryosphere observations, and how these components are affected by the human activities study how the scientific problem is presented and perceived in the society and learn how to use one’s scientific knowledge to identify possible solutionsThe active incorporation of elements of innovation and design in the course is critical in allowing the students to develop a keen scientific mindset and logic flow to understand the complexity of the climate change and energy issues (Learning Outcome #1), and to dissect the reasons behind contradictory arguments in a society (Learning Outcome #3). Critical evaluation of the arguments from both sides (climate alarmists vs. skeptics) will ultimately allow them to develop their own stance in the issue, and think critically about the ways to move the world forward towards sustainability (Learning Outcome #3). The incorporation of global citizenship and social enterprisingness is also crucial for students to develop a keen awareness of how environmental issues affect people in a huge variety of geographical and cultural contexts (Learning Outcome #2), and think critically about what kinds of solutions best fit a certain region (Learning Outcome #3).", "syllabus": "•L01 Changing Planet (2 lecture-hours)•L02 Energy: A Closer Look (2 lecture-hours)•L03 Energy and Heat (2 lecture-hours)•L04 Fossil Energy (2 lecture-hours)•L05 Impacts of Fossil Fuels (2 lecture-hours)•L06 Nuclear Energy (2 lecture-hours)•Documentary Quiz: Pandora Promise (1.5 hour of video quiz)•L07 Energy from Earth and Moon (2 lecture-hours)•L08 Direct from the Sun: Solar Energy (2 lecture-hours)•Documentary: Minimalism (1.5 hour of video)•L09 Basic Climate Science (2 lecture-hours)•L10 Climate Forcing (2 lecture-hours)•Documentary Quiz: Merchants of Doubt (1.5 hour of video quiz)•L11 Tropical Cyclone and Climate Change (2 lecture-hours)•L12 Ocean Observations (2 lecture-hours)•Documentary: Mission Blue (1.5 hour of video)•L13 Cryosphere (2 lecture-hours)•Documentary: Chasing Ice (1.5 hour of video)•L14 Future Climate (2 lecture-hours)•L15 Energy and Climate: Breaking the Link (2 lecture-hours)", "required_readings": "Refer to the course syllabus distributed in the class.", "recommended_readings": " Wolfson, Richard, and B. F. Wissler. Energy, environment, and climate (Second Edition). WW Norton & Company, Inc., 2011. McKibben, Bill. The global warming reader: a century of writing about climate change. Penguin, 2012.", "terms": {"2023-24 Term 1": {"--LEC (5338)": {"startTimes": ["11:30", "11:30"], "endTimes": ["12:15", "13:15"], "days": [3, 1], "locations": ["Mong Man Wai Bldg 704", "Y.C. Liang Hall G03"], "instructors": ["Dr. AU-YEUNG Yee Man", "Dr. AU-YEUNG Yee Man"], "meetingDates": ["4/9", "6/9", "11/9", "13/9", "18/9", "20/9", "25/9", "27/9", "4/10", "9/10", "11/10", "16/10", "18/10", "25/10", "30/10", "1/11", "6/11", "8/11", "13/11", "15/11", "20/11", "22/11", "27/11", "29/11"]}, "-T01-TUT (5339)": {"startTimes": ["12:30"], "endTimes": ["13:15"], "days": [3], "locations": ["Mong Man Wai Bldg 704"], "instructors": ["Dr. AU-YEUNG Yee Man"], "meetingDates": ["6/9", "13/9", "20/9", "27/9", "4/10", "11/10", "18/10", "25/10", "1/11", "8/11", "15/11", "22/11", "29/11"]}}}, "assessments": {"Classwork": "10", "Homework or assignment": "30", "Participation": "20", "Report": "20", "Test or quiz": "20"}}, {"code": "3900", "title": "Internship", "career": "Undergraduate", "units": "3.00", "grading": "Distinction/Pass/Failure", "components": "Practicum", "campus": "Main Campus", "academic_group": "Earth & Environmental Sci PC", "requirements": "Not for students who have taken ESSC3900. Pre-requisite: (EESC2010 or ESSC2010) and (EESC2020 or ESSC2020), and have taken at least one course from (EESC3100/ 3120/ 3200/ 3220/ 3300/ 3320) or (ESSC3100/ 3120/ 3200/ 3220/ 3300/ 3320).", "description": "This course aims to let students apply their Earth and Environmental Sciences knowledge in, and gain hands-on experience from workplace. Students are expected to gain practical experience from various internship opportunities such as CUHK units, government or private companies. The internship can be held through local fieldwork, guided tours, workshops or other related tasks, depending on the requests from different units. Students are required to serve at least 320 hours during the internship and will be evaluated based upon biweekly progress reports, final written report, presentation and the evaluation from the supervisor(s)/course coordinator (subject to their supervisors).Advisory: For year 2 or above Earth and Environmental Sciences major students.Note: Allowance may vary each year for the internships depending on the needs of students.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "4010", "title": "Solid and Fluid Mechanics", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "Lecture\nInteractive Tutorial", "campus": "Main Campus", "academic_group": "Earth & Environmental Sci PC", "requirements": "Not for students who have taken ESSC3010 or 4010.", "description": "This course presents the fundamentals of continuum mechanics illustrated with earth and environmental sciences applications. Background materials on matrices, vectors and differential operators are first reviewed. The following topics will be covered: tensors and their properties; stress and strain; constitutive equations for Hookean elastic solid and Newtonian viscous fluid; mechanical properties and rheology of geomaterials; Eulerian and Lagrangian kinematics; momentum equations; vorticity and divergence; applications in geomechanics, seismology, atmospheric dynamics, and oceanography.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "4020", "title": "Soil Mechanics and Its Applications", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "Lecture\nInteractive Tutorial", "campus": "Main Campus", "academic_group": "Earth & Environmental Sci PC", "requirements": "Not for students who have taken ESSC4020. Pre-requisite: (MATH1010 or 1030 or 1510 or 1520), (PHYS1001 or 1002 or 1111 or 1113) and (EESC2010 or ESSC2010), or permission of instructor.", "description": "A survey of basic concepts of soil mechanics: Classification and physical properties of soil; stress and strain; pore pressure, seepage theory and effective stress; elastic solutions; shear strength and Mohr-Coulomb theory; failure mode and criteria; soil consolidation; lateral earth pressure; slope stability; bearing capacity and foundation designs; pile analyses and designs; soil improvement and soil nailing. Geotechnical applications: shallow and deep foundations; retaining structures; slope instability.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "4030", "title": "Engineering Geology", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "Lecture\nInteractive Tutorial", "campus": "Main Campus", "academic_group": "Earth & Environmental Sci PC", "requirements": "Not for students who have taken ESSC4030. Pre-requisite: (EESC2130 or ESSC2130), (EESC3100 or ESSC3100), (EESC4020 or ESSC4020) and (EESC4040), or permission of instructor.", "description": "To introduce basic engineering, geotechnical investigation for urban development applications, as well as analytic and field skills performed by the practicing engineering geologists. A review of selected case histories will be provided to illustrate the use of these concepts and skills.Ground investigation (GI) portion of the course gives the concepts and skills used in geotechnical site investigation. Topics include the factors controlling site selection for a development, desk study and walkover survey, the use of aerial photographic interpretation, ground investigation technology and awareness of site safety, common field and laboratory test methods for soil and rock, introduction of soil and rock description and classification, borehole logging techniques of soil samples and rock types, The GI part of the course also touch on the basic knowledge of design, management practice of GI works and different roles of GI project personnel.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "4040", "title": "Rock Mechanics and Its Applications", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "Field Studies/Field-trip\nLaboratory\nLecture\nInteractive Tutorial", "campus": "Main Campus", "academic_group": "Earth & Environmental Sci PC", "requirements": "Pre-requisite: (MATH1010 or 1030 or 1510 or 1520), (EESC2130 or ESSC2130) and (EESC3100 or ESSC3100), or permission of instructor.", "description": "A survey of basic concepts of rock mechanics: Classification and index properties of rock; rock strength and failure criteria; measurement of mechanical behavior of rock discontinuity; initial stresses in rocks and their measurement; deformability of rock and their measurement. Geotechnical applications: rock slope engineering; underground openings and foundation engineering. Practical Training: Laboratory techniques and field trip mapping training.", "outcome": " Able to understand of the basics concept of rock mechanics: physical and mechanic properties of rock and rock mass, intact rock failure mode and failure criteria, the shear criteria for jointed rock, initial stresses under the ground in rocks and their measurement; and rock deformation under loading; Able to apply the basic principles of rock mechanics to solve problems in rock engineering projects, such as rock slope, rock tunnel and rock foundation; Able to perform assessments and professional judgment on the safety or possible failure of complex rock engineering projects; Able to exercise professional judgment in the evaluation and justification of possible failure in complex rock engineering projects; Able to have critical and creative thinking in solving rock engineering problems and have an ability to work independently.", "syllabus": " A survey of basic concepts of rock mechanics: Classification and index properties of rock. Rock strength and failure criteria. Measurement of mechanical behavior of rock discontinuity . Initial stresses in rocks and their measurement . Deformability of rock and their measurement . Geotechnical applications: rock slope engineering; underground openings and foundation engineering.", "required_readings": " Goodman, R.E., Introduction to Rock Mechanics, 1989, 2nd edition, Wiley. Wyllie, D.C. and Mah, C.W., Rock Slope Engineering, Civil and Mining, 2004, 4th edition, Spon Press. Duncan C.W., Foundations on Rock, 2005, 2nd edition, CRC Press.", "recommended_readings": " Geotechnical Manual for slopes, 1979, Geotechnical Control Office, Engineering Development Department, Hong Kong. Hoek, E. and Brown, E.T., Underground excavations in rock, (1982), Institution of Mining  and Metallurgy. Hudson, J.A. and Harrison, J. P., Engineering Rock Mechanics, An introduction to the principles, 1997, Pergamon. Poulos H.G. and Davis E.H., Elastic solutions for soil and rock mechanics 1974, Wiley.", "terms": {"2023-24 Term 1": {"--LEC (5432)": {"startTimes": ["9:30", "9:30"], "endTimes": ["10:15", "11:15"], "days": [4, 2], "locations": ["Science Centre 331", "Science Centre 331"], "instructors": ["Professor Robina WONG, \n\nProfessor ZHAN Yan", "Professor Robina WONG, \n\nProfessor ZHAN Yan"], "meetingDates": ["5/9", "7/9", "12/9", "14/9", "19/9", "21/9", "26/9", "28/9", "3/10", "5/10", "10/10", "12/10", "17/10", "19/10", "24/10", "26/10", "31/10", "2/11", "7/11", "9/11", "14/11", "16/11", "21/11", "23/11", "28/11", "30/11"]}, "-T01-TUT (5433)": {"startTimes": ["10:30"], "endTimes": ["11:15"], "days": [4], "locations": ["Science Centre 331"], "instructors": ["Professor Robina WONG, \n\nProfessor ZHAN Yan"], "meetingDates": ["7/9", "14/9", "21/9", "28/9", "5/10", "12/10", "19/10", "26/10", "2/11", "9/11", "16/11", "23/11", "30/11"]}}}, "assessments": {"Examination": "30", "Fieldwork or field study": "5", "Homework or assignment": "40", "Lab reports": "5", "Test or quiz": "20"}}, {"code": "4110", "title": "Applied Geophysics", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "Lecture\nInteractive Tutorial", "campus": "Main Campus", "academic_group": "Earth & Environmental Sci PC", "requirements": "Not for students who have taken ESSC4110. Pre-requisite: (EESC2010 or ESSC2010) and (EESC3120 or ESSC3120).", "description": "This course introduces concepts, principles, and applications of geophysical methods in environmental and engineering studies. It offers an overall survey of various geophysical methods for exploring the shallow subsurface. It provides the technical foundation needed to understand the use and limitations of gravity, seismic, ground penetrating radar, and electromagnetic methods. Demonstration of commonly used methods will be provided in the field along with tutorials of preliminary data analysis techniques.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "4120", "title": "Petrology", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "Laboratory\nLecture", "campus": "Main Campus", "academic_group": "Earth & Environmental Sci PC", "requirements": "Not for students who have taken ESSC4120. Pre-requisite: EESC2010 or ESSC2010.", "description": "Petrology is an essential subfield of Earth and Environmental Sciences because the rock record is the foundation for interpreting Earth history and internal processes. Petrologic concepts help us understand the Earth system, with connections to related fields such as geochemistry, geophysics, mineralogy, structural geology and geodynamics. This course broadly surveys the formation, distribution, chemical composition, mineral associations, and internal texture and structures in rocks of the earth’s crust and upper mantle, and establishes it relation to global tectonic environments. Class lectures are supplemented by lab exercise, demonstrations and tutorials (e.g. study of rock hand specimens, understand phase rule, use of optical microscope etc.).", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "4130", "title": "Geomorphology", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "Field Studies/Field-trip\nLaboratory\nLecture", "campus": "Main Campus", "academic_group": "Earth & Environmental Sci PC", "requirements": "Not for students who have taken ESSC4130. Pre-requisite: EESC3100 or ESSC3100.", "description": "This course is an important part of the core Earth and Environmental Sciences Curriculum. It introduces the main concepts in geomorphology with emphasis on understanding the coupling of environments, processes and materials that leads to landform development. Understanding the underlying geological principles of rocks, minerals, structural deformation and geological time are important background knowledge to be enhanced by the study of geomorphology.It discusses the qualitative and quantitative techniques for investigation and research in the field, laboratory, and computer simulation. The application of geomorphology for public safety, engineering problems and development of sustainable solutions will be emphasized. Examples from theory and practice of geomorphology in Hong Kong will be introduced. Practical understanding and skills will be gained from lab exercises and field trips in Hong Kong.Students are suggested to be equipped with basic knowledge of rocks and minerals, structural geology and geological time scale.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "4140", "title": "Seismology", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "Field Studies/Field-trip\nLecture\nInteractive Tutorial", "campus": "Main Campus", "academic_group": "Earth & Environmental Sci PC", "requirements": "Not for students who have taken ESSC4140. Pre-requisite: (EESC3120 or ESSC3120) or ESSC3010.", "description": "This course focuses on the concepts and theory of elastic wave propagation and physics of earthquake. The topics covered include the Earth’s internal structure, material elasticity, travel time tomography, seismic ray theory, ray tracing, and earthquake source parameter. Methods and field practice of seismological survey will also be introduced.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "4150", "title": "Volcanoes", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "Lecture\nSeminar", "campus": "Main Campus", "academic_group": "Earth & Environmental Sci PC", "requirements": "", "description": "On any given day, ~20 subaerial volcanoes worldwide are erupting. Even more submarine volcanoes are probably erupting without being detected. Volcanic eruptions can have devastating economic and social consequences, but are also the fundamental force that builds the majority of our planet’s surface. Volcanic eruptions and emissions can also affect atmospheric and climate conditions. This course will explore the various techniques used to study volcanoes’ underlying structure as well as their precursory and eruptive activity.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "4160", "title": "Marine Geology and Geophysics", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "Field Studies/Field-trip\nLecture\nProject\nInteractive Tutorial", "campus": "Main Campus", "academic_group": "Earth & Environmental Sci PC", "requirements": "Not for students who have taken ESSC4160. Pre-requisite: (EESC3120 or ESSC3120) or ESSC3010 or (EESC4010 or ESSC4010).", "description": "This course focuses on the concepts and theory of marine geology and geophysics. Marine geology is distinct from that of continent and is the important foundation to launch Plate Tectonics, the modern unified theory of the Earth. In this course, major components of marine geological settings such as mid-ocean ridges, transform faults, subduction zones, oceanic lithosphere, and etc. will be introduced and discussed in details. Methods of geophysical survey will also be introduced. Field experiments of scientific instruments such as Ocean Bottom Seismometers, marine magnetometer and gravimeter will be conducted. A geological field trip will also be included. This course will be jointly offered with Ocean College, Zhejiang University, as an initiative to develop ocean sciences at CUHK.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "4180", "title": "Earthquake Source Physics", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "Lecture\nInteractive Tutorial", "campus": "Main Campus", "academic_group": "Earth & Environmental Sci PC", "requirements": "Not for students who have taken ESSC4180. Pre-requisite: (EESC3120 or ESSC3120) or (EESC4010 or ESSC4010) or (EESC4140 or ESSC4140).", "description": "This course focuses on the concepts and theory of earthquake source physics. The topics covered include seismic instrumentation, geophysical observations of earthquake source processes, kinematic source representation of earthquakes, dynamic rupture propagation of earthquakes, frictional properties of fault zones, and entire earthquake cycle. Methods and field practice of seismological survey will also be introduced.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "4210", "title": "Land-Atmosphere Interactions and Boundary-Layer Meteorology", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "Lecture\nInteractive Tutorial", "campus": "Main Campus", "academic_group": "Earth & Environmental Sci PC", "requirements": "Not for students who have taken ESSC4210. Pre-requisite: (EESC2020 or ESSC2020) or (EESC3200 or ESSC3200) or permission of instructor.", "description": "This course introduces the physical, chemical and biological processes governing the exchange of energy, momentum, water and other chemical materials between the atmosphere and land surface, including a formal introduction into boundary-layer meteorology. Topics covered include the basic equations and concepts of heat, momentum and mass conservation and transfer at the land-atmosphere interface; soil physics and hydrometeorology; temperature, humidity and wind distribution in the atmospheric boundary layer; theories and observations of turbulence; boundary layer dynamics; biometeorology and ecophysiology of land plants; canopy and ecosystem exchange; and land use change and urbanization. Applications to weather phenomena, air pollution, forestry, agriculture and ecosystem management will be emphasized throughout.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "4220", "title": "Tropical Meteorology", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "Lecture\nInteractive Tutorial", "campus": "Main Campus", "academic_group": "Earth & Environmental Sci PC", "requirements": "Not for students who have taken ESSC4220. Pre-requisite: EESC3200 or ESSC3200.", "description": "This course introduces tropical atmospheric circulation and related air-sea coupling at a variety of spatial and temporal scales. The topics covered include the role of the tropics in the global energy and momentum balance, ITCZ, subtropical high, upper-level anticyclones, tropical ocean circulation, tropical weather, climate and atmosphere-ocean interaction phenomena including meso-scale convective systems, tropical waves, the Hadley and the Walker circulation, El Nino-Southern Oscillation, tropical cyclones, Madden Julian Oscillation, and monsoons.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "4230", "title": "Introduction to the Physics and Chemistry of Aerosol", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "Lecture\nInteractive Tutorial", "campus": "Main Campus", "academic_group": "Earth & Environmental Sci PC", "requirements": "Not for students who have taken ESSC4230. Pre-requisite: EESC2020 or ESSC2020 or permission of instructor.", "description": "Fundamentals of aerosol physics and chemistry; condensation and evaporation; thermodynamics; nucleation, diffusion, coagulation; radiative, hygroscopic properties, and cloud formation potential of aerosols; aerosol phase oxidation reactions; heterogeneous oxidative processes.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "4240", "title": "Air Pollution Science and Engineering", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "Lecture\nInteractive Tutorial", "campus": "Main Campus", "academic_group": "Earth & Environmental Sci PC", "requirements": "Not for students who have taken ESSC4240.", "description": "This course will cover a variety of topics related to air pollution science and engineering. Topics include: indoor and outdoor air quality (including particulate matters (PM) and gases pollutants); air pollution measurement and statistics; air quality meteorology and dispersion models; principles and challenges of air pollution control and measurement.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "4250", "title": "Advanced Topics in Atmospheric Dynamics", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "Lecture\nInteractive Tutorial", "campus": "Main Campus", "academic_group": "Earth & Environmental Sci PC", "requirements": "Not for students who have taken ESSC4250. Pre-requisite: EESC3200 or ESSC3200 or permission of instructor.", "description": "This course introduces the basics of geophysical fluid dynamics. Topics include fundamental governing equations, scale analyses of geophysical flows in the Earth's atmosphere and ocean, filtered models, waves, vorticity, quasi-geostrophic theory, bartropic and baroclinic instabilities.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "4260", "title": "Urban Climatology", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "Laboratory\nLecture", "campus": "Main Campus", "academic_group": "Earth & Environmental Sci PC", "requirements": "Not for students who have taken ESSC4260. Pre-requisite: EESC2020 or ESSC2020.", "description": "Human modifications to the surface of the Earth during urbanisation change most of the elements of climate and weather in the urban atmosphere. This course introduces the fundamentals of urban climatology and the processes caused by the changes in the surface environment, particularly focusing on how urban structures interact with the atmospheric environment. Numerical modelling and field techniques are introduced to understand the underlying processes resulting urban climatic phenomena. It also examines the implications on human comfort and climate-sensitive urban planning and design, as well as the relationship between cities and climate change", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "4270", "title": "Cloud Dynamics", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "Lecture\nInteractive Tutorial", "campus": "Main Campus", "academic_group": "Earth & Environmental Sci PC", "requirements": "Pre-requisite: EESC2020 or ESSC2020.", "description": "This course presents an introduction to clouds. We begin with a descriptive cloud classification to introduce the different types of clouds in the Earth’s atmosphere. This is followed by cloud microphysics, describing some of the basic microphysical processes regarding formation, growth, shrinkage, breakup and fallout of cloud and precipitation particles. This will then be linked to cloud dynamics, associated with the fluid motions of the atmosphere. Next, different structures of precipitation and radar cloud sensing shall be presented. These shall then feedback onto our beginning description of clouds on the global climatological level. Student taking this course are expected to have taken EESC2020 or ESSC2020.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "4325", "title": "Advanced Environmental Chemistry", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Earth & Environmental Sci PC", "requirements": "Not for students who have taken ENSC4525. Pre-requisite: EESC2515 or ENSC2515 or permission of the instructor.", "description": "This course is designed to extend students' understanding of and develop their ability in the application of various aspects of environmental chemistry in relation to the major types of air and water pollution associated with industrial and vehicle emissions. It outlines the basic processes in bleaching and dyeing, electroplating and food processing that give rise to water pollution and application of physico-chemical techniques in controlling such pollution. It also examines combustion processes and the associated applications and limitations of the absorption, adsorption, oxidation-reduction and catalytic conversion techniques in relation to aerial emissions from furnaces and vehicles. Site visits will be arranged where possible to enhance students' ability in application.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "4335", "title": "Chemical Treatment Processes", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Earth & Environmental Sci PC", "requirements": "Not for students who have taken ENSC4535. Pre-requisite: EESC2515 or ENSC2515 or permission of the instructor.", "description": "This course introduces the principles and applications of various chemical and physiochemical processes applicable for treatment and control of air and water pollution. It studies the processes of neutralization, oxidation-reduction, chemical precipitation, coagulation, flocculation, physical separation, absorption, adsorption, filtration, chemical disinfection, solvent extraction, fractional distillation and incineration. It also examines the applicabilities and limitations of such processes with reference to the treatment and recovery of toxic and hazardous chemical wastes. Site visits will be arranged to enhance students' ability in application.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "4340", "title": "Environmental Impact Assessment", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Earth & Environmental Sci PC", "requirements": "Not for students who have taken ENSC4240. Pre-requisite: (EESC2270 or ENSC2270) and BIOL2210.", "description": "This course discusses the techniques and procedures of evaluating environmental consequences arising from human activities, with focus on their application in Hong Kong as prescribed under the Hong Kong Environmental Impact Assessment Ordinance, and its Technical Memorandum. Students are encouraged to take the laboratory course (EESC4342) together with the lecture in order to have a better integration of theories and practical experiences on the subject.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "4342", "title": "Environmental Impact Assessment Laboratory", "career": "Undergraduate", "units": "2.00", "grading": "Graded", "components": "Laboratory", "campus": "Main Campus", "academic_group": "Earth & Environmental Sci PC", "requirements": "Not for students who have taken ENSC4242. Co-requisite: EESC4340 or ENSC4240.", "description": "This laboratory course accompanies the lecture course EESC4340 and provides hands-on exercises on selected techniques used in environmental impact assessment (EIA). Students will critically review a current EIA report with respect to its soundness in the application of EIA methodologies and the evaluation of assessment results. They will also gain first-hand experience on how to carry out an EIA by working on a small scale EIA project focusing on specific components of impact assessment.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "4350", "title": "Environmental Health", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Earth & Environmental Sci PC", "requirements": "Not for students who have taken ENSC4250. Pre-requisite: EESC3520 or ENSC3520.", "description": "This course introduces the contemporary problems and issues in environmentally dependent aspects of health. Broad coverage of health effects of foodborne, airborne and waterborne pollutants, pesticides, and consumer product are considered.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "4510", "title": "Statistical Methods and Data Analysis for Earth and Environmental Sciences", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "Lecture\nInteractive Tutorial", "campus": "Main Campus", "academic_group": "Earth & Environmental Sci PC", "requirements": "Not for students who have taken ESSC4510. Pre-requisite: (STAT1011 or 1012), and ((EESC2030 or ESSC2030) or PHYS2061).", "description": "This course covers the theoretical basis and practical applications of data analysis relevant for earth and environmental sciences. This course aims to introduce students to Earth and environmental data manipulation, from sampling, reading and writing, to statistical analysis and parameter estimation, to time series analysis, to plotting and visualization. Topics include: digital signal processing, sampling techniques; probability distributions; hypothesis testing; correlation analysis; linear and nonlinear regression; statistical forecasting, harmonic analysis and spectral analysis; principle component analysis; and geostatistics. Tutorials will be based on real geophysical examples including remote sensing and in situ observations, as well as model data.Previous elementary coding experience in Python 3 is recommended.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "4520", "title": "Numerical Methods and Modeling for Earth and Environmental Sciences", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "Lecture\nInteractive Tutorial", "campus": "Main Campus", "academic_group": "Earth & Environmental Sci PC", "requirements": "Not for students who have taken ESSC4520. Pre-requisite: (MATH1010 or 1030 or 1520), and ((EESC2030 or ESSC2030) or PHYS2061).", "description": "This course covers the principles of numerical methods and modeling relevant for earth and environmental sciences applications. Topics include: optimization; interpolation; finite differencing; numerical solutions to ordinary and partial differential equations; programming numerical models; filtered models; boundary conditions; subgrid-scale processes; data assimilation; applications in earthquake, climate, air quality, weather forecast and groundwater models. Python will be used in this course.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "4540", "title": "Remote Sensing – Principles and Applications", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "Lecture\nInteractive Tutorial", "campus": "Main Campus", "academic_group": "Earth & Environmental Sci PC", "requirements": "Not for students who have taken ESSC4540. Pre-requisite: (EESC2010 or ESSC2010) &(EESC2020 or ESSC2020) & (MATH1010 or 1030 or 1510 or 1520) & (PHYS1001 or 1002 or 1111 or 1113) & ((EESC2030 or ESSC2030) or PHYS2061), or permission of instructor.", "description": "Remote sensing observations are critical for monitoring regional and global changes, determining spatial and temporal variability of the Earth System, and addressing fundamental global issues. This course introduces the basic physical principles of remote sensing, including electromagnetic waves and radiation, optical, microwave, and non-imaging remote sensing. It also presents key concepts and examples on remote sensing applications in Earth system science (such as atmosphere, lithosphere, hydrosphere, cryosphere) and global changes. This course also provides computer-based lab exercises that facilitate the understanding of remote sensing principles and the processing of remote sensing data.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "4550", "title": "Practical Atmospheric Modeling", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "Lecture\nInteractive Tutorial", "campus": "Main Campus", "academic_group": "Earth & Environmental Sci PC", "requirements": "Pre-requisite: (EESC2020 or ESSC2020) and MATH2550 and (PHYS1001 or 1002 or 1111 or 1113), or permission of instructor.", "description": "The course introduces the basic principles behind numerical atmospheric modeling and provides hands-on practice to perform numerical simulation on computers. It begins by reviewing the application of basic governing equations for the atmospheric flows in a model and basic modeling techniques. The course examines the three basic processes in atmospheric simulation: pre-processing data, modeling, and post-processing data. The pre-processing process, which is the preparation of data from various sources by different data assimilation techniques such as interpolation, is described. It then covers different options to decide before the actual modeling such as the choice of parameterization schemes, map projection and time step size. For post-processing, this course offers a quick look at different skills in visualization of the post-processed data. It also covers some basic Linux environment commands to perform the main tasks mentioned above. The course mentions model usage in different timescales such as individual tropical cyclone track simulation versus simulated seasonal tropical cyclone activity.", "outcome": " An understanding of the basic operations of numerical atmospheric models. Knowledge of the techniques used in handling meteorological data. An appreciation of the implementation of geophysical fluid governing equations and relevant parameterization schemes.  Ability to assess model performance.", "syllabus": " Basics in numerical methods Governing geophysical fluid equations Basic Linux operations Pre-processing meteorological data Model resolution, map projections and parameterizations Simulation for atmospheric flow Post-processing output data from atmospheric model Data visualization Evaluation of model performance and model limitations   Ensemble simulations", "required_readings": " Documents and publications of Weather Research & Forecasting Model (WRF)  https://www.mmm.ucar.edu/models/wrf   https://www2.mmm.ucar.edu/wrf/users/docs/user_guide_v4/v4.4/contents.html  ", "recommended_readings": "Jacobson, M. Z.: Fundamentals of Atmospheric Modeling, Cambridge University Press, 2 ed., https://doi.org/10.1017/CBO9781139165389, 2005.", "terms": {"2023-24 Term 2": {"--LEC (9246)": {"startTimes": ["9:30", "9:30"], "endTimes": ["11:15", "11:15"], "days": [3, 1], "locations": ["William M W Mong Eng Bldg 402", "Science Centre 329"], "instructors": ["Professor ZHAI Shixian", "Professor ZHAI Shixian"], "meetingDates": ["8/1", "10/1", "15/1", "17/1", "22/1", "24/1", "29/1", "31/1", "5/2", "7/2", "19/2", "21/2", "26/2", "28/2", "11/3", "13/3", "18/3", "20/3", "25/3", "27/3", "3/4", "8/4", "10/4", "15/4", "17/4"]}}}, "assessments": {"Homework or assignment": "50", "Project": "50"}}, {"code": "4601", "title": "Research Seminar in Earth and Environmental Sciences", "career": "Undergraduate", "units": "1.00", "grading": "Graded", "components": "Seminar", "campus": "Main Campus", "academic_group": "Earth & Environmental Sci PC", "requirements": "Not for students who have taken ESSC4601.", "description": "Research seminar series in Earth and Environmental Sciences. Students will be exposed to frontier research presented by guest speakers through active participation.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "4602", "title": "Selected Topics in Earth and Environmental Sciences", "career": "Undergraduate", "units": "2.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Earth & Environmental Sci PC", "requirements": "Not for students who have taken ESSC4602.", "description": "Recent research methods, experimental, and computational techniques applied in selected topics in Earth and Environmental Sciences.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "4603", "title": "Advanced Topics in Earth and Environmental Sciences", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Earth & Environmental Sci PC", "requirements": "Not for students who have taken ESSC4603.", "description": "State-of-the-art research methods, experimental, and computational techniques applied in advanced topics in Earth and Environmental Sciences.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "4810", "title": "Senior Project I", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "Project\nInteractive Tutorial", "campus": "Main Campus", "academic_group": "Earth & Environmental Sci PC", "requirements": "Not for students who have taken ESSC4810 or PHYS4610. Pre-requisite: Permission of project advisor.", "description": "A project in earth and environmental sciences, either focusing more on research or on reviewing the literature. The project may be combined with EESC4820 to form a more substantial project. Students should seek prior permission of project advisor before enrolment.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "4820", "title": "Senior Project II", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "Project\nInteractive Tutorial", "campus": "Main Campus", "academic_group": "Earth & Environmental Sci PC", "requirements": "Not for students who have taken ESSC4820 or PHYS4620. Pre-requisite: Permission of project advisor.", "description": "A project in earth and environmental sciences, either focusing more on research or on reviewing the literature. The project may be combined with EESC4810 to form a more substantial project. Students should seek prior permission of project advisor before enrolment.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}]