[{"code": "6101", "title": "History, Professional Issues and Ethical Practice in Educational Psychology", "career": "Postgraduate - Taught", "units": "3.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Div of Education", "requirements": "For students in MA Professional Educational Psychology", "description": "This course explores the history of psychology, with an emphasis on the history of the science and practice of educational psychology, so as to offer EP Trainees important perspectives about the past, present, and future of the field. In addition, ethical principles of psychologists and codes of conduct, including standards of practice that are core to professional educational psychology, as well as relevant legal issues are reviewed and discussed. This course also examines current trends and issues salient to professional educational psychology in Hong Kong and worldwide, such as the evolving roles of professional educational psychologists in response to changing societal and individual needs. ", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "6102", "title": "Children and Adolescents with Special Needs (I)", "career": "Postgraduate - Taught", "units": "3.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Div of Education", "requirements": "For students in MA Professional Educational Psychology", "description": "Professional educational psychologists play an important role in supporting children with special needs in both regular and special school settings. This two-course series on special needs is designed to enhance the professional capacity of EP Trainees in collaborating with teachers and parents to facilitate the personal, social and educational development of students with diverse needs. Drawing on recent research developments, these courses attempt to demystify misconceptions in findings related to special needs. They show how the latest research improves our understanding of the mechanisms underlying different kinds of special needs and discuss the implications of these empirical studies for developing effective interventions. In this course, we introduce the contextual foundation for understanding students with diverse needs by looking at their families and schools. We then focus on the needs and characteristics of children and adolescents with different intellectual and learning abilities or disabilities. In particular, we examine topics related to global cognitive impairment, developmental delay, specific learning difficulties, and individuals who are gifted and talented.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "6103", "title": "Children and Adolescents with Special Needs (II)", "career": "Postgraduate - Taught", "units": "3.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Div of Education", "requirements": "For students in MA Professional Educational Psychology\nPre-requisite: EPSY6102", "description": "Building upon the analytic framework developed in EPSY 6102, the course focuses on two broad areas of special needs: emotional and behavioral challenges, and physical and sensory disabilities. Emotional and behavioral challenges addressed include but are not limited to attention deficit/ hyperactivity disorder, conduct problems, affective disorders, and autism spectrum disorders. We also look into the special needs arising from hearing and/ or visual impairments and examine the complex nature of physical disabilities and their subsequent impact on student development. EP trainees will be introduced to how the latest research improves our understanding of the mechanisms underlying different kinds of special needs and discuss the implications of these empirical studies for developing effective interventions in working with school children.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "6104", "title": "Applied Developmental Psychology", "career": "Postgraduate - Taught", "units": "1.50", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Div of Education", "requirements": "For students in MA Professional Educational Psychology", "description": "This course provides a framework for identifying learning and clinical issues which specifically occur during lifespan development from childhood through adolescence and young adulthood. It also allows EP trainees an opportunity to lead and participate in scholarly and didactic discussions of educational and clinical issues relevant to developmental psychology, and to the Hong Kong context.", "outcome": "Upon completion of the Course, EP Trainees will be able to: 1. Demonstrate knowledge of specific issues in developmental psychology in the context of Hong Kong; 2. Integrate theories, research, and practice in developmental psychology; and3. Identify and work with clients with the said issues in educational settings.(Individual course teachers may update the learning outcome as and whenever necessary.)", "syllabus": "Self-Concept and Identity DevelopmentPeer RelationshipsFamily RelationshipsLove, Sex and MarriageChallenges of the CyberworldAddictionsMotivation and Learning(For reference only, please refer to the course outline of respective teacher for details.)", "required_readings": "(Please refer to the course outline of respective teacher for details.)", "recommended_readings": "Bornstein, M. H., & Lamb, M. E. (2015). Developmental science: An advanced textbook (7th ed.). NY: Psychology Press.Durkin, K., & Schaffer, H. R. (2016). The Wiley handbook of developmental psychology in practice: Implementation and impact. UK: Wiley.Israel, A. C., Malatras, J. W., Wicks-Nelson, R. (2021). Abnormal child and adolescent psychology (9th ed.). NY: Routledge.Lerner, R. M., Jacobs, F., & Wertlieb, D. (2005). Applied developmental science: An advanced textbook. UK: Sage.Votruba-Drzal, E., & Dearing, E. (2017). The Wiley handbook of early childhood development programs, practices, and policies. UK: Wiley.Rohill, S. A., & Kaiser, L. T. (2022). Case studies in school psychology: Applying standards for professional practice. NY: Routledge.(For reference only, please refer to the course outline of respective teacher for details.)", "terms": {"2024-25 Term 1": {"--LEC (1028)": {"startTimes": ["9:30"], "endTimes": ["12:15"], "days": [1], "locations": ["Sino Building 239"], "instructors": ["Dr. WONG Pak Ho"], "meetingDates": ["2/9", "9/9", "16/9", "23/9", "30/9", "7/10", "14/10"]}}}, "assessments": {"Discussion": "30", "Essays": "40", "Presentation": "30"}}, {"code": "6105", "title": "Cultural Diversity and Individual Differences: Implications for Learning and Practice", "career": "Postgraduate - Taught", "units": "1.50", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Div of Education", "requirements": "For students in MA Professional Educational Psychology", "description": "This course is designed to facilitate EP Trainees’ self-awareness of diversity issues in educational settings, which is of importance to the professional competency of educational psychologists. During the course, EP trainees are expected to actively engage in trainee-led discussion and experiential activities that increase their knowledge, sensitivity, critical thinking, and skills repertoire in handling diversity issues in their educational psychology practices.", "outcome": "Upon completion of the Course, EP Trainees will be able to: 1. Demonstrate awareness and critical thinking of their assumptions, attitudes, beliefs, and values in relation to their multicultural competencies as an educational psychologist;2. Apply various multicultural concepts, theories and models to their personal life as well as professional experiences;3. Demonstrate knowledge and ability to develop and implement culture-sensitive interventions to meet the needs of diverse populations.(Individual course teachers may update the learning outcome as and whenever necessary.)", "syllabus": "Multicultural CompetenciesGenderSocial-Economic StatusEthnic MinoritiesSexual MinoritiesCultural-Sensitive Learning and TeachingCultural-Sensitive Interventions(For reference only, please refer to the course outline of respective teacher for details.)", "required_readings": "(Please refer to the course outline of respective teacher for details.)", "recommended_readings": "Banks, J. A., & Banks, C. A. M. (2020). Multicultural education: Issues and perspectives (10th ed.). IN: Wiley.Banks, J. A. (2016). Cultural diversity and education (6th ed.). NY: Routledge. Bond, M. H. (2015). Oxford handbook of Chinese psychology (2010). NY: Oxford.Hays, P. A. (2016). Addressing cultural complexities in practice: Assessment, diagnosis, and therapy (3rd ed.). Washington, DC: American Psychological Association.Markowitz, N. L., & Bouffard, S. M. (2020). Teaching with a social, emotional, and cultural lens: A framework for educators and teacher educators. Cambridge, MA: Harvard.Sue, D. W., Sue, D., Neville, H. A., & Smith, L. (2022). Counseling the culturally diverse: Theory and practice (9th ed.). Hoboken, NJ: Wiley.(For reference only, please refer to the course outline of respective teacher for details.)", "terms": {"2024-25 Term 2": {"--LEC (4447)": {"startTimes": ["9:30"], "endTimes": ["12:15"], "days": [3], "locations": ["Wu Ho Man Yuen Bldg 507"], "instructors": ["Dr. WONG Pak Ho"], "meetingDates": ["8/1", "22/1", "12/2", "26/2", "12/3", "26/3", "9/4"]}}}, "assessments": {"Discussion": "30", "Essays": "40", "Presentation": "30"}}, {"code": "6201", "title": "Psychoeducational Assessment (I)", "career": "Postgraduate - Taught", "units": "3.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Div of Education", "requirements": "For students in MA Professional Educational Psychology", "description": "This is part one of the two courses in psycho-educational assessment aiming at equipping students with the necessary knowledge and skills in the administration and interpretation of standardized assessment instruments, and the use of comprehensive assessment data to assist in making decisions on the delivery services to individuals with special needs. This course covers the basic concepts of intelligence and intellectual assessment. There will be administration, scoring, interpretation and report writing on some of the widely used instruments in Hong Kong. This course will also enable students to develop knowledge and skills to use academic-based achievement measures in school settings for students with specific learning difficulties or exceptional abilities, and discusses curriculum issues that are closely linked to the choice of measures and understanding of test scores. Overall, this course emphasizes the importance of collecting and using comprehensive data on individual’s cognitive functioning to make evidence-based decisions for effective intervention. ", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "6202", "title": "Psychoeducational Assessment (II)", "career": "Postgraduate - Taught", "units": "3.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Div of Education", "requirements": "For students in MA Professional Educational Psychology\nPre-requisite: EPSY6201", "description": "This course focuses on behavioral, social and emotional assessment. EP trainees will learn to administer, score and interpret behavioral and personality measures including objective assessment tools and projective measures. Different measures with respect to their purposes and appropriate use will be discussed, and their impact of cultural, language and socioeconomic factors will be examined. Building upon the foundations acquired from Psychoeducational Assessment (I), this course discusses ways to integrate data from measures of cognitive abilities, academic performance as well as those from social and behavioral ones to obtain an overall understanding of students’ psychological functioning.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "6203", "title": "Skills Training Seminar (I)", "career": "Postgraduate - Taught", "units": "3.00", "grading": "Graded", "components": "Seminar", "campus": "Main Campus", "academic_group": "Div of Education", "requirements": "For students in MA Professional Educational Psychology", "description": "This course equips students with practical knowledge and skills in assessment and intervention when working as an educational psychologist in a variety of education and social service settings. It also covers skills and strategies in conducting interviews, observing behaviors, administrating tests of various types, writing reports, and making recommendations to individual cases. Site visits and guest lectures will be arranged to widen EP Trainees’ perspective in their roles as an educational psychologist in school-related settings.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "6301", "title": "Psychoeducational Intervention with Children and Adolescents (I)", "career": "Postgraduate - Taught", "units": "3.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Div of Education", "requirements": "For students in MA Professional Educational Psychology", "description": "This course examines intervention strategies and programs for meeting the needs of students with educational, emotional, behavioral and social adjustment difficulties. Students learn how to use instructional, behavioral and inter-disciplinary approaches as theoretical backdrops to design, deliver, and evaluate psychoeducational programs in school and community settings. Issues related to curriculum-based evaluation and curriculum designs are also discussed.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "6302", "title": "Psychoeducational Intervention with Children and Adolescents (II)", "career": "Postgraduate - Taught", "units": "3.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Div of Education", "requirements": "For students in MA Professional Educational Psychology\nPre-requisite: EPSY6301", "description": "This course aims to introduce to students a broad array of theories and perspectives that are foundational to psychological interventions for children and adolescents. We will evaluate major theories in working with school-age youngsters and their families, including cognitive-behavioral approaches, solution-focused brief counseling, systems and ecological approaches, family counseling, creative arts therapies, mindfulness, and career and vocational counseling. Strategies in working with children and adolescents with special issues (e.g., depression and suicidality) are also addressed. Throughout the course, students are encouraged to (1) adopt theory-based practice, and (2) examine relevant literature and use a scientist-practitioner model to evaluate the effectiveness of different approaches in working with clients from a wide range of backgrounds. ", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "6303", "title": "Skills Training Seminar (II)", "career": "Postgraduate - Taught", "units": "3.00", "grading": "Graded", "components": "Seminar", "campus": "Main Campus", "academic_group": "Div of Education", "requirements": "For students in MA Professional Educational Psychology\nPre-requisite: EPSY6201, EPSY6203", "description": "This course is the second part for skills training. It provides a platform for students to further polish their micro-skills that are required in their practicum. In addition to basic assessment skills, other skills to be covered include crisis management, inter-disciplinary collaboration, working with the 3-tier support at school, counseling, and systems-intervention. Guest lectures and mini-workshops will be arranged to further equip students with practical skills in conducting interventions with individuals and in group settings. EP Trainees are expected to be actively engaged in small group practice and role play exercises throughout the course. ", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "6304", "title": "Consultation in Schools and Community: Theory and Practice", "career": "Postgraduate - Taught", "units": "3.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Div of Education", "requirements": "For students in MA Professional Educational Psychology", "description": "This course examines the role of educational psychologists as consultants and systems-change agents, whose charge is to strengthen the capacity of various interlocking systems (e.g., school and family) that have an impact on students’ well-being and development. Consultation theory, problem-solving models, and a variety of sequential consultation strategies to facilitate systems-change are explored, including data-based decision-making and target identification, solution generation, and solution implementation. The role of educational psychologists as external consultants in schools to facilitate crisis management and prevention is discussed.", "outcome": "Upon completion of the Course, EP Trainees will be able to:  1. Display knowledge of school system and other settings (family and community), and use consultation theory and problem-solving models to create and promote a healthy and supportive learning environment for students.  2. Demonstrate abilities and skills to support and provide consultation to schools and communities based on the developmental needs of students, data-informed decision and the outcomes of evidence-based interventions.  3. Demonstrate abilities and skills in the transfer of knowledge and provide mentoring/ coaching to teachers regrading various prevention, intervention strategies and crisis management.  4. Demonstrate knowledge and skills to promote home-school-community collaboration and effectively engage in multi-discipline professional collaboration to promote the well-being of the students.   (Individual course teachers may update the learning outcome as and whenever necessary.)", "syllabus": "(Please refer to the course outline of respective teacher for details.)", "required_readings": "Berninger, V.W. (2015). Interdisciplinary frameworks for schools: Best professional practices for serving the needs of all students. Washington DC: American Psychological Association. Cox, D.D. (2005). Evidence-based interventions using home-school collaboration. School Psychology Quarterly, 20, 473-497. Forman, S.G. (2015). Implementation of mental health programs in schools: A change agent's guide. Washington DC: American Psychological Association. Orpinas, P., & Horne, A.M. (2006). Bullying prevention: Creating a positive school climate and developing social competence. Washington DC: American Psychological Association. Scorgie, K., & Sobsey, D. (2017). So you think we can trust? (Re)-building Home-School Collaboration with families of children with disability. In K. Scorgie, D. Sobsey (Ed.), Working with families for inclusive education: Navigating identity, opportunity and belonging (pp. 255-271). Bingley, UK: Emerald Publishing Limited.  Thornberg, R. (2014). Consultation barriers between teachers and external consultants: A grounded theory of change resistance in school consultation. Journal of Educational and Psychological Consultation, 24, 183-210.  (For reference only, please refer to the course outline of respective teacher for details.)", "recommended_readings": "Brown, J.A., & Jimerson, S.R. (2015). Toward understanding school psychology around the globe: Economical, educational, and professional factors. International Journal of School & Educational Psychology, 3, 73-84. Clare, M.M., Ardron-Hudson, E.A., & Grindell, J. (2015). Fat in school: Applied interdisciplinarity as a basis for consultation in oppressive social context. Journal of Educational and Psychological Consultation, 25, 45-65.  Dowdy, E., Furlong, M., Raines, T.C., Bovery, B., Kauffman, B., Kamphaus, R.W., Dever, B.V., Price, M., & Murdock, J. (2015). Enhancing school-based mental health services with a preventive and promotive approach to universal screening for complete mental health. Journal of Educational and Psychological Consultation, 25, 178-197.  Garbacz, S.A., Cariveau, T., & Barrett, E. (2016). Examining the Treatment Validation Consultation Model. Journal of Educational and Psychological Consultation, 26, 200-211.  Gelbar, N.W., Jaffery, R., Stein, R., & Cymbala, H. (2015) Case study on the implementation of school-wide positive behavioral interventions and supports in an alternative educational setting. Journal of Educational and Psychological Consultation, 25, 287-313.  Goldberg, A.E., Beemyn, G., & Smith, J.Z. (in press). What is needed, what is valued: Trans-students’ perspectives on trans-inclusive policies and practices in higher education. Journal of Educational and Psychological Consultation. https://doi.org/10.1080/10474412.2018.1480376  Newman, D.S., Hazel, C.E., Barrett, C.A., Chaudhuri, S.D., & Fetterman, H. (2018). Early career school psychologists' perceptions of consultative service delivery: The more things change, the more they stay the same. Journal of Educational and Psychological Consultation, 28, 105-136.  Song, S.Y., & Swearer, S.M. (2016). The cart before the horse: The challenge and promise of restorative justice consultation in schools. Journal of Educational and Psychological Consultation, 26, 313-324.  Sundqvist, C., & Ström, K. (2015). Special Education teachers as consultants: Perspectives of Finnish teachers. Journal of Educational and Psychological Consultation, 25, 314-338.  Truscott, S.D., Lopez, E., Fish, M.C., & Margolis, H. (2015) The Journal of Educational and Psychological Consultation: A quarter century of contribution, A future of challenge and optimism. Journal of Educational and Psychological Consultation, 25, 2-15.  Tyre, A.D., & Feuerborn, L.L. (2017). The Minority Report: The concerns of staff opposed to schoolwide positive behavior interventions and supports in their schools. Journal of Educational and Psychological Consultation, 27, 145-172.   (For reference only, please refer to the course outline of respective teacher for details.)", "terms": {"2024-25 Term 1": {"--LEC (4386)": {"startTimes": ["9:30"], "endTimes": ["12:15"], "days": [3], "locations": ["Chen Kou Bun Bldg UG05"], "instructors": ["Dr. WONG Pak Ho"], "meetingDates": ["4/9", "11/9", "25/9", "2/10", "9/10", "16/10", "23/10", "30/10", "6/11", "13/11", "20/11", "27/11", "4/12"]}}}}, {"code": "6305", "title": "Skills Training Seminar (III)", "career": "Postgraduate - Taught", "units": "1.50", "grading": "Graded", "components": "Seminar", "campus": "Main Campus", "academic_group": "Div of Education", "requirements": "For students in MA Professional Educational Psychology", "description": "This course is the third part for skills training. It serves as a platform for EP trainees to polish micro-skills that are required in their concurrent practicum. Specific focuses include case formulation, group facilitations, inter-disciplinary collaborations, consultations, and systems-intervention. This course also provides a forum in which experienced educational psychologists and allied professionals can share their specialities and expertise with EP trainees.", "outcome": "Upon completion of the Course, EP Trainees will be able to: 1. Demonstrate skills in assessment, intervention, consultations and group facilitations proficiently;2. Demonstrate abilities in reflecting on the experiences in the fieldwork; and3. Provide services in accordance to professional ethics and legal standards.(Individual course teachers may update the learning outcome as and whenever necessary.)", "syllabus": "Practicum orientationCase formulation and feedbackInter-disciplinary collaborationsConsultation skillsGroup development and facilitationSystems-interventionCase presentation and discussion(For reference only, please refer to the course outline of respective teacher for details.)", "required_readings": "Education Bureau (2020). Operation guide on the whole school approach to integrated education (3rd ed.).Education Bureau (2021). School-based educational psychology (SBEPS) service guide.(For reference only, please refer to the course outline of respective teacher for details.)", "recommended_readings": "Test manuals of various standardized assessments and other training packages developed by Education Bureau(For reference only, please refer to the course outline of respective teacher for details.)", "terms": {"2024-25 Term 1": {"-S01-SEM (2012)": {"startTimes": ["14:30"], "endTimes": ["17:15"], "days": [3], "locations": ["Ho Tim Building G2"], "instructors": ["Dr. LAM Wing Chi, \n\nDr. LUI Wan Hap, \n\nDr. WONG Kathy, \n\nMr. NGAN Wai Lam"], "meetingDates": ["4/9", "25/9", "9/10", "23/10", "6/11", "20/11", "4/12"]}}}, "assessments": {"Discussion": "30", "Others": "40", "Presentation": "30"}}, {"code": "6306", "title": "Skills Training Seminar (IV)", "career": "Postgraduate - Taught", "units": "1.50", "grading": "Graded", "components": "Seminar", "campus": "Main Campus", "academic_group": "Div of Education", "requirements": "For students in MA Professional Educational Psychology", "description": "This course is the last series of skills training. It serves as a platform for EP trainees to further polish micro-skills that are required in their concurrent practicum. It also provides them with opportunities to seek support and guidance for the challenges they come across in practicum. In addition, it is a forum in which educational psychologists and allied professionals from the field can share with the students their experience in difficult cases and latest development in intervention. EP trainees will also be guided to develop a personal career development plan for their long-term professional and personal growth.", "outcome": "Upon completion of the Course, EP Trainees will be able to: 1. Demonstrate skills and knowledge in handling difficult situations at fieldwork;2. Develop a career development plan for long-term professional and personal growth; and3. Provide services in accordance to all professional ethics and legal standards.(Individual course teachers may update the learning outcome as and whenever necessary.)", "syllabus": "Practicum orientationHandling difficult clientsCommunicating effectively in inter-disciplinary teamsResolving ethical dilemmas in fieldworkCareer talk and sharingCase presentation and discussion(For reference only, please refer to the course outline of respective teacher for details.)", "required_readings": "Education Bureau (2020). Operation guide on the whole school approach to integrated education (3rd ed.).Education Bureau (2021). School-based educational psychology (SBEPS) service guide.(For reference only, please refer to the course outline of respective teacher for details.)", "recommended_readings": "Test manuals of various standardized assessments and other training packages developed by Education Bureau(For reference only, please refer to the course outline of respective teacher for details.)", "terms": {"2024-25 Term 2": {"-S01-SEM (4437)": {"startTimes": ["9:30"], "endTimes": ["12:15"], "days": [3], "locations": ["Esther Lee Bldg 302"], "instructors": ["Dr. LAM Wing Chi, \n\nDr. LUI Wan Hap, \n\nDr. WONG Kathy, \n\nMr. NGAN Wai Lam"], "meetingDates": ["15/1", "5/2", "19/2", "5/3", "19/3", "2/4", "16/4"]}}}, "assessments": {"Discussion": "30", "Others": "40", "Presentation": "30"}}, {"code": "6401", "title": "Research seminar in Professional Educational Psychology", "career": "Postgraduate - Taught", "units": "3.00", "grading": "Graded", "components": "Seminar", "campus": "Main Campus", "academic_group": "Div of Education", "requirements": "For students in MA Professional Educational Psychology", "description": "This course introduces a number of ways in which research in educational psychology are commonly conducted, with special attention being paid to the role of the scientist-practitioner. The focus will be on evaluating a range of statistical softwares (such as SPSS, MPlus, AMOS) and research methods used by educational psychology researchers to inform decision making within a multi-tier system. Both quantitative and qualitative methods will be discussed. The translation of research findings into the professional practice of educational psychology is emphasized. ", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "6402", "title": "Dissertation Research (I)", "career": "Postgraduate - Taught", "units": "3.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Div of Education", "requirements": "For students in MA Professional Educational Psychology", "description": "This seminar is the first course in a two-course dissertation sequence. EP trainees participate in individual or small group tutorials that guide them in utilizing knowledge and skills in research methods and statistics to conduct a dissertation research project. Emphasis will also be on helping students appreciate the need for evidence-based practice, supported by program evaluation of efficacy and effectiveness as indicated by intervention research relevant to professional practice in educational psychology. This course will guide EP Trainees toward completion of a dissertation proposal.", "outcome": "After taking this course, EP Trainees will be able to: 1. Demonstrate ability to critically evaluate research evidence in one area of Educational Psychology. 2. Identify research gaps and formulate research questions which can be addressed using appropriate research and analytical methods. 3. Write up a detailed research proposal for their final year dissertation.  (Individual course teachers may update the learning outcome as and whenever necessary.)", "syllabus": "(Please refer to the course outline of respective teacher for details.)", "required_readings": "Mertens, D.M. (2014). Research and evaluation in education and psychology. Thousand Oaks: SAGE  (For reference only, please refer to the course outline of respective teacher for details.)", "recommended_readings": "Field, A (2013). Discovering statistics using IBM SPSS Statistics. London: Sage. Pallant, J. (2013). SPSS survival manual. New York: McGraw Hill.  (For reference only, please refer to the course outline of respective teacher for details.)", "terms": {"2024-25 Term 2": {"--LEC (3475)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["No Room Required"], "instructors": ["Dr. LUK Sau Ha, \n\nDr. WONG Pak Ho, \n\nProfessor LAM Yu Hin, \n\nProfessor SIU Fung Ying Angela"], "meetingDates": ["06/01/2025 - 14/04/2025"]}}}}, {"code": "6403", "title": "Dissertation Research (II)", "career": "Postgraduate - Taught", "units": "3.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Div of Education", "requirements": "For students in MA Professional Educational Psychology", "description": "This seminar is the second course in a two-course dissertation sequence. Tutorial is conducted on an individual or small group basis to guide EP Trainees toward the completion of their dissertations. ", "outcome": "At the end of the course, EP Trainees will demonstrate ability to: 1. Conduct and complete an independent and ethically sound piece of research on one area in educational psychology. 2. Make an original contribution to Educational Psychology literature.   (Individual course teachers may update the learning outcome as and whenever necessary.)", "syllabus": "(Please refer to the course outline of respective teacher for details.)", "required_readings": "Mertens, D.M. (2005). Research and evaluation in education and psychology. Thousand Oaks: SAGE  (For reference only, please refer to the course outline of respective teacher for details.)", "recommended_readings": "(Recommended readings (if any) would depend on individual course teachers. Please refer to the course outline of respective teacher for details.)", "terms": {"2024-25 Term 3": {"--LEC (1174)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["No Room Required"], "instructors": ["Dr. LUK Sau Ha, \n\nDr. WONG Pak Ho, \n\nProfessor LAM Yu Hin, \n\nProfessor SIU Fung Ying Angela"], "meetingDates": ["12/05/2025 - 23/06/2025"]}}}}, {"code": "6501", "title": "Practicum (I)", "career": "Postgraduate - Taught", "units": "3.00", "grading": "Graded", "components": "Practicum", "campus": "Main Campus", "academic_group": "Div of Education", "requirements": "For students in MA Professional Educational Psychology\nPre-requisite: EPSY6201, EPSY6203", "description": "Practicum provides opportunities for students to develop their abilities and competence in integrating theory and practice under professional supervision. Each EP Trainee is expected to have fieldwork training of a minimum of 1200 hours, with at least 600 hours in educational settings, for the whole practicum. The first practicum provides hands-on experience in relation to individual work and group work. It should include experiences in working with students, families and/ or teachers. The placement sites/ collaborating parties can include, but not limited to, the educational psychology service unit of the Faculty, and mentorship scheme under the MA(EP) program. In the second and third practicum, EP trainees are supervised closely and regularly by qualified educational/ clinical psychologists in the field. The placements provide hands-on experience in relation to individual work, group work, and systems work, encompassing a wide range of student/ school needs, and they should include experiences in working with students, families, teachers, and improving the school system. The practicum settings include, but not limited to, preschools, primary schools, secondary schools, tertiary institutions and government departments.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "6502", "title": "Practicum (II)", "career": "Postgraduate - Taught", "units": "3.00", "grading": "Graded", "components": "Practicum", "campus": "Main Campus", "academic_group": "Div of Education", "requirements": "For students in MA Professional Educational Psychology", "description": "Practicum provides opportunities for students to develop their abilities and competence in integrating theory and practice under professional supervision. Each EP Trainee is expected to have fieldwork training of a minimum of 1200 hours, with at least 600 hours in educational settings, for the whole practicum. The first practicum provides hands-on experience in relation to individual work and group work. It should include experiences in working with students, families and/ or teachers. The placement sites/ collaborating parties can include, but not limited to, the educational psychology service unit of the Faculty, and mentorship scheme under the MA(EP) program. In the second and third practicum, EP Trainees are supervised closely and regularly by qualified educational/ clinical psychologists in the field. The placements provide hands-on experience in relation to individual work, group work, and systems work, encompassing a wide range of student/ school needs, and they should include experiences in working with students, families, teachers, and improving the school system. The practicum settings include, but not limited to, preschools, primary schools, secondary schools, tertiary institutions and government departments.", "outcome": "At the end of the course, EP Trainees will be able to: 1. Demonstrate adequate professional knowledge, abilities and skills in a broad array of assessment and intervention activities to facilitate individual or systems changes. 2. Provide educational psychological services consistent with legal and professional standards.  3. Effectively engage in home-school-community collaboration to promote students’ well-being.  4. Polish skills in professional report writing and record keeping for inform service and intervention decision.  (Individual course teachers may update the learning outcome as and whenever necessary.)", "syllabus": "(Please refer to the course outline of respective teacher for details.)", "required_readings": "(Required readings (if any) would depend on individual course teachers. Please refer to the course outline of respective teacher for details.)", "recommended_readings": "Baird, B. (2013). Internship, Practicum, and Field Placement Handbook. New York, NY: Routledge.  Grapin, S.L., & Kranzler, J.H. (2018). School Psychology: Professional Issues and Practices. New York, NY: Springer.  Peacock, G.G., & Ervin, R.A. (2012). Practical Handbook of School Psychology: Effective Practices for the 21st Century. New York, NY: Guilford.   (For reference only, please refer to the course outline of respective teacher for details.)", "terms": {"2024-25 Term 2": {"-P01-PRA (1317)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["No Room Required"], "instructors": ["Dr. LAM Wing Chi, \n\nDr. LUI Wan Hap, \n\nDr. WONG Kathy, \n\nMr. NGAN Wai Lam"], "meetingDates": ["06/01/2025 - 14/04/2025"]}}, "2024-25 Term 3": {"-P01-PRA (1213)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["No Room Required"], "instructors": ["Mr. NGAN Wai Lam"], "meetingDates": ["12/05/2025 - 23/06/2025"]}}}}, {"code": "6503", "title": "Practicum (III)", "career": "Postgraduate - Taught", "units": "3.00", "grading": "Graded", "components": "Practicum", "campus": "Main Campus", "academic_group": "Div of Education", "requirements": "For students in MA Professional Educational Psychology", "description": "Practicum provides opportunities for students to develop their abilities and competence in integrating theory and practice under professional supervision. Each EP Trainee is expected to have fieldwork training of a minimum of 1200 hours, with at least 600 hours in educational settings, for the whole practicum. The first practicum provides hands-on experience in relation to individual work and group work. It should include experiences in working with students, families and/ or teachers. The placement sites/ collaborating parties can include, but not limited to, the educational psychology service unit of the Faculty, and mentorship scheme under the MA(EP) program. In the second and third practicum, EP Trainees are supervised closely and regularly by qualified educational/ clinical psychologists in the field. The placements provide hands-on experience in relation to individual work, group work, and systems work, encompassing a wide range of student/ school needs, and they should include experiences in working with students, families, teachers, and improving the school system. The practicum settings include, but not limited to, preschools, primary schools, secondary schools, tertiary institutions and government departments.", "outcome": "At the end of the course, EP Trainees will be able to: 1. Demonstrate adequate professional knowledge, abilities and skills in a broad array of assessment and intervention activities to facilitate individual or systems changes. 2. Provide educational psychological services consistent with legal and professional standards.  3. Effectively engage in home-school-community collaboration to promote students’ well-being.  4. Polish skills in professional report writing and record keeping for inform service and intervention decision.  (Individual course teachers may update the learning outcome as and whenever necessary.)", "syllabus": "(Please refer to the course outline of respective teacher for details.)", "required_readings": "(Required readings (if any) would depend on individual course teachers. Please refer to the course outline of respective teacher for details.)", "recommended_readings": "Baird, B. (2013). Internship, Practicum, and Field Placement Handbook. New York, NY: Routledge.  Grapin, S.L., & Kranzler, J.H. (2018). School Psychology: Professional Issues and Practices. New York, NY: Springer.  Peacock, G.G., & Ervin, R.A. (2012). Practical Handbook of School Psychology: Effective Practices for the 21st Century. New York, NY: Guilford.  (For reference only, please refer to the course outline of respective teacher for details.)", "terms": {"2024-25 Term 1": {"-P01-PRA (3617)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["No Room Required"], "instructors": ["Dr. WONG Kathy"], "meetingDates": ["02/09/2024 - 25/11/2024"]}}, "2024-25 Term 2": {"-P01-PRA (9529)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["No Room Required"], "instructors": ["Mr. NGAN Wai Lam"], "meetingDates": ["06/01/2025 - 14/04/2025"]}}, "2024-25 Term 3": {"-P01-PRA (1054)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["No Room Required"], "instructors": ["Dr. LAM Wing Chi, \n\nDr. LUI Wan Hap, \n\nDr. WONG Kathy, \n\nMr. NGAN Wai Lam"], "meetingDates": ["12/05/2025 - 23/06/2025"]}}}}]