[{"code": "1000", "title": "Exploring the Earth System", "career": "Undergraduate", "units": "1.00", "grading": "Graded", "components": "Field Studies/Field-trip\nLecture\nVisit", "campus": "Main Campus", "academic_group": "Dept of Earth & Environ Sci", "requirements": "Not for students who have taken EESC1001 or UGEB1870.", "description": "The course provides an interdisciplinary platform for students to navigate the Earth System Science curriculum. Natural phenomena associated with the atmosphere, hydrosphere, geosphere, cryosphere, and biosphere will be described, and concepts related to their dynamics and anthropogenic impacts will be introduced. The connection with global environmental change, natural hazards and the water-energy-food nexus will be highlighted. In addition to attending lectures, students will undertake visits to Museum of Climate Change and a geological field trip.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "2010", "title": "Solid Earth Dynamics", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "Lecture\nInteractive Tutorial", "campus": "Main Campus", "academic_group": "Dept of Earth & Environ Sci", "requirements": "Not for students who have taken EESC2010 or ESGS2101.", "description": "This course presents an integrated introduction to the solid earth system stressing the geological, chemical, physical, and biological interactions among the lithosphere, hydrosphere and cryosphere. The course applies basic scientific and mathematical concepts to explain the history and behaviour of the solid earth system. Geophysical and geochemical techniques for probing the interior of the earth are reviewed. Plate tectonics is introduced as a unifying theme to understand geodynamic processes. The course includes discussions of topics that are relevant to society, resources and sustainability, such as the physical and chemical basis of natural hazards (earthquakes, tsunami, landslides) and their mitigation, and the impact of geological processes on the global environment.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "2020", "title": "Climate System Dynamics", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "Lecture\nInteractive Tutorial", "campus": "Main Campus", "academic_group": "Dept of Earth & Environ Sci", "requirements": "Not for students who have taken EESC2020 or ESGS2101.", "description": "This course presents an integrated introduction to the climate system, stressing the dynamics of the atmosphere and its physical and chemical interactions with the hydrosphere, biosphere and geosphere. The course applies basic scientific and mathematical principles to explain the history, current state and future projection of weather and climate, natural hazards (e.g., typhoons, floods), and global climate change in the context of natural variability and anthropogenic influence. Topics include Earth’s energy balance, climate feedback, convection and clouds, general circulation of the atmosphere and ocean, biogeochemistry and global carbon cycle, roles of vegetation and ecosystems, and historical and future climate change. Student taking this course are expected to have taken PHYS1111, CHEM1070 and MATH1010 or equivalent.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "2030", "title": "Computational Earth and Environmental Sciences", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "Lecture\nInteractive Tutorial", "campus": "Main Campus", "academic_group": "Dept of Earth & Environ Sci", "requirements": "Not for students who have taken CSCI1040 or CSCI2040 or EESC2030.", "description": "This course covers basic computation skills which are important to modern Earth and Environmental Sciences research and data analysis. Topics include the basic Python language syntax; programming flow control; usage of functions; file input/output modules; data visualisation; atmospheric science applications; geoscience applications and basic machine learning applications in earth and environmental sciences. Python 3 will be used throughout the course. Examples and tutorials will be based on various problems in Earth and Environmental Sciences using actual observational or in-situ data.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "2110", "title": "Geoscience Field Study", "career": "Undergraduate", "units": "1.00", "grading": "Graded", "components": "Field Studies/Field-trip\nLecture\nProject\nInteractive Tutorial", "campus": "Main Campus", "academic_group": "Dept of Earth & Environ Sci", "requirements": "Not for students who have taken EESC2110.", "description": "ESSC2110 is a fundamental field-based course introducing elementary concepts of past Earth’s processes and environmental changes. It also covers important aspects of plate tectonics, different rock types, geological deformation, geomorphology and environmental changes, natural hazards and human impacts. The principal goal of this course is to let students understand how the present geological records and landforms reveal the past tectonic movements and affect the human urban planning. Students are trained to observe, describe and discuss field features, with the help of field tools (e.g. compasses-clinometer and GPS receiver). Basic skills of field techniques, interpreting geologic maps and making field notes are introduced to assist students acquiring field data and discuss possible geologic processes. A field report from each group is required to summarize the field study logically. Field locations of this course may change from year to year. All students are welcome, but priority will be given to students who have taken ESSC1000.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "2120", "title": "Integrated Geoscience Field Study", "career": "Undergraduate", "units": "2.00", "grading": "Graded", "components": "Field Studies/Field-trip\nLecture\nOthers\nInteractive Tutorial", "campus": "Main Campus", "academic_group": "Dept of Earth & Environ Sci", "requirements": "Not for student who have taken EESC2120. Pre-requisite: (EESC2010 or ESSC2010) and (EESC2020 or ESSC2020).", "description": "Field study of current landform and geological features is the key to reveal past Earth’s processes and environmental changes. This also provides data for further studies on natural hazards. ESSC2120 is a fundamental level, field-based course of the Earth System Science Programme. It covers important aspects of atmospheric sciences, plate tectonics, volcanoes, deformation structures, sedimentology, coastal features, earthquakes and associated present-day infrastructures. The principal goal of this course is to let students study major atmospheric sciences, geological features and understand how tectonic movement and atmospheric phenomenon contributes to the current different landforms, disasters and urban planning. Students are trained to observe, describe and discuss field features. Basic skills of using field tools (e.g. compasses-clinometer), studying geologic maps and making field notes are introduced to help students acquire field data and analyze possible atmospheric phenomenon and geologic processes. A field report is required to summarize the field study logically. The field location and term of offer of this course may change from year to year. Due to limited quota, priority will be given to students who have taken ESSC2010 and will enroll in ESSC3110.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "2130", "title": "Fundamental Geoscience Fieldwork", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "Field Studies/Field-trip\nLecture\nInteractive Tutorial", "campus": "Main Campus", "academic_group": "Dept of Earth & Environ Sci", "requirements": "Not for student who have taken EESC2130. Pre-requisite: EESC2010 or ESSC2010.", "description": "Field study of current landform and geological features is the key to reveal past Earth’s processes and environmental changes. This also provides data for further studies on natural hazards. ESSC2130 is a fundamental level, field-based course of the Earth System Science Programme. It covers important aspects of atmospheric sciences, plate tectonics, volcanoes, deformation structures, sedimentology, coastal features, earthquakes and associated present-day infrastructures. The principal goal of this course is to let students study major atmospheric sciences, geological features and understand how tectonic movement and atmospheric phenomenon contribute to the current different landforms, disasters and urban planning. Students are trained to observe, describe and discuss field features. Basic skills of using field tools (e.g. compasses-clinometer), studying geologic maps and making field notes are introduced to help students acquire field data and analyze possible atmospheric phenomenon and geologic processes. A field report is required to summarize the field study logically. The field location and term of offer of this course may change from year to year. Due to limited quota, priority will be given to students who have taken ESSC2010 and passed the pre-enrolment quiz.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "2600", "title": "Biosphere, Climate and the Environment", "career": "Undergraduate", "units": "1.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Dept of Earth & Environ Sci", "requirements": "Not for students who have taken ESGS4005.", "description": "This course introduces basic concepts of the biosphere with a focus on its relationships with the Earth system and global environmental change. Topics include: ecosystem ecology; global biogeochemical cycles, climate and the roles of different life forms; evolution of life throughout Earth history; human perturbations of carbon and nutrient cycles; impacts of agriculture and deforestation; ocean acidification and eutrophication; responses and evolution of terrestrial and marine ecosystems and biodiversity under global climate change. Students are recommended to take ESSC2600 and MBTE2010 simultaneously.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "2800", "title": "Introduction to Environmental Engineering", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "Lecture\nInteractive Tutorial", "campus": "Main Campus", "academic_group": "Dept of Earth & Environ Sci", "requirements": "Not for students who have taken EESC2800. Pre-requisite: MATH1010 or 1510 or 1520.", "description": "This is a multidisciplinary course introducing the fundamental physical, chemical and biological principles necessary for understanding the natural and built environments, with an emphasis on reliable water and food supplies, pollution mitigation, waste management, energy resources, climate change, and sustainable development. Examples of engineering solutions to tackle some of these resource and environmental issues are presented. Field trips are included to illustrate interesting case studies. Topics include: conservation principles for mass, energy and momentum in the environmental systems; basic environmental chemistry, hydrology and ecology; risk assessment; and basic principles of water resource engineering, solid waste treatment, noise pollution, air pollution control, climate change adaptation and mitigation, and the interplay between energy consumption and the environment.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "3010", "title": "Continuum Mechanics", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "Lecture\nInteractive Tutorial", "campus": "Main Campus", "academic_group": "Dept of Earth & Environ Sci", "requirements": "Not for students who have taken ESSC4010 or EASC5010.", "description": "This course presents the fundamentals of continuum mechanics illustrated with earth system science applications. Background materials on matrices, vectors and differential operators are first reviewed. The following topics will be covered: tensors and their properties; stress and strain; constitutive equations for Hookean elastic solid and Newtonian viscous fluid; mechanical properties and rheology of geomaterials; Eulerian and Lagrangian kinematics; momentum equations for fluids in a rotating frame; vorticity and divergence; geostrophic balance; boundary layer dynamics; applications in geomechanics, seismology, atmospheric dynamics, and oceanography.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "3020", "title": "Analytical Methods for Earth and Environmental Sciences", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "Lecture\nInteractive Tutorial", "campus": "Main Campus", "academic_group": "Dept of Earth & Environ Sci", "requirements": "Not for students who have taken EESC3020. Pre-requisite: (EESC2010 or ESSC2010) and (EESC2020 or ESSC2020), and MATH2550 and (PHYS1001 or PHYS1002 or PHYS1111 or PHYS1113), or permission of instructor.", "description": "The course provides a survey of various analytical techniques commonly employed in solving problems encountered in earth and environmental sciences. Typical examples include heat conduction on earth surface, seismic and ocean waves, air pollution, geodynamics, and atmospheric dynamics.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "3100", "title": "Structural Geology", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "Field Studies/Field-trip\nLaboratory\nLecture", "campus": "Main Campus", "academic_group": "Dept of Earth & Environ Sci", "requirements": "Not for students who have taken EESC3100. Pre-requisite: EESC2010 or ESSC2010 or permission of instructor.", "description": "This course is an important part of the core Earth System Sciences Curriculum. It introduces the processes and products of rock deformation in three dimensions, ranging from micro- (micron) to macro- (kilometer) scales. It discusses geometries and mechanism of faults, folds, structural features of igneous, sedimentary and metamorphic rocks, and superposed deformations and introduces regional deformational history and tectonics. Structural geology in the field of resource exploration (petroleum and mineral deposits) is also introduced. Class lectures are supplemented by lab exercise and demonstrations as well as field trips to local or overseas outcrops.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "3110", "title": "Geoscience Field Course", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "Field Studies/Field-trip\nLecture\nProject\nInteractive Tutorial", "campus": "Main Campus", "academic_group": "Dept of Earth & Environ Sci", "requirements": "Not for students who have taken EESC3110. Pre-requisite: (EESC2010 or ESSC2010) and [(EESC3010 or ESSC3100) or (EESC4120 or ESSC4120)], or by instructor's approval.", "description": "Understanding of Earth processes and environmental changes over geological time is highly dependent upon the experience and capabilities gained through doing fieldwork. ESSC3110 is an intermediate level course of the Earth System Science Programme. It covers important aspects of field geology, including sedimentary, igneous and metamorphic petrology, tectonics, geophysics and surficial processes. The principal goal of this course is to train students to recognize different lithological units and their geometries in three dimensions, and understand the related tectonic environment and formation mechanism. Class lectures introduce basic skills of reading and interpreting geological maps, using geological equipment (i.e. Compass-clinometer, GPS receiver), and producing field notes and reports. Field projects include field observation and description, techniques of field data acquisition and analysis, sample collection, and geological map compilation. Field projects also focus on surficial processes (relatively occurring on short geological time scale), which are of environmental and ecological importance. The field location (either in mainland of China or overseas) may change from year to year.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "3120", "title": "Physics of the Earth", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "Lecture\nInteractive Tutorial", "campus": "Main Campus", "academic_group": "Dept of Earth & Environ Sci", "requirements": "Not for students who have taken EESC3120. Pre-requisite: EESC2010 or ESSC2010 or permission of instructor.", "description": "This course focuses on the concepts of the physics of the Earth to understand how the solid Earth works. Since 1960s, plate tectonics has been developed to explain observations on Earth such as mountain building, occurrence of earthquakes and volcanoes, as well as deposition of natural resources. The discovery of plate tectonics requires understanding of geophysical methods, which will be covered in this course. The topics covered include the Earth’s gravitational and magnetic fields, earthquake seismology, internal structure of the Earth, thermal and electrical properties, as well as geodynamics. Methods of geophysical survey will also be introduced.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "3200", "title": "Atmospheric Dynamics", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "Lecture\nInteractive Tutorial", "campus": "Main Campus", "academic_group": "Dept of Earth & Environ Sci", "requirements": "1) Pre-requisite: (EESC2020 or ESSC2020) or (MATH2550 or EESC2520 or PHYS2051) or permission of instructor.\n2) Not for students who have taken EESC3200 or ESGS5014.", "description": "This course introduces observations of and physical principles governing the circulation of the Earth’s atmosphere in relation to weather and climate. The topics covered include atmospheric composition and structure, convection, fundamentals of atmospheric motions, and the basic principles for weather and climate modeling. Physical principles covered include basic conservation laws, balanced flows, atmospheric thermodynamics, circulation and vorticity, atmospheric waves, and theories for various weather systems.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "3220", "title": "Atmospheric Chemistry", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "Lecture\nInteractive Tutorial", "campus": "Main Campus", "academic_group": "Dept of Earth & Environ Sci", "requirements": "Not for students who have taken EESC3220 or ESGS5014. Pre-requisite: CHEM1070 or CHEM1072 or CHEM1280 or permission of instructor.", "description": "This course introduces the physical and chemical processes determining the composition for the atmosphere and its implications for climate, ecosystems, air pollution and human welfare. Topics covered include atmospheric structure, atmospheric chemistry models, atmospheric transport, chemical kinetics, stratospheric and tropospheric chemistry, chemistry of aerosols, biogeochemical cycles, as well as critical environmental issues including stratospheric ozone depletion, acid rain, photochemical smog, and climate change.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "3300", "title": "Oceanography", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "Lecture\nInteractive Tutorial", "campus": "Main Campus", "academic_group": "Dept of Earth & Environ Sci", "requirements": "Not for students who have taken EESC3300. Pre-requisite: (EESC2010 or ESSC2010) and (EESC2020 or ESSC2020), or permission of instructor.", "description": "This course will investigate the characteristics and dynamics of the ocean. Specific topics include ocean floor, marine sediments, oceanic plate, seawater, air-sea interaction, ocean circulation, waves, El Niño-Southern Oscillation, and the roles of the ocean in climate and climate variability.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "3320", "title": "Hydrogeology", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "Lecture\nInteractive Tutorial", "campus": "Main Campus", "academic_group": "Dept of Earth & Environ Sci", "requirements": "Not for students who have taken EESC3320 or ESGS5006. Pre-requisite: EESC2010 or ESSC2010 or permission of instructor.", "description": "This course introduces the physical and chemical principles of hydrogeology. Concepts of surface and groundwater hydrology, as well as quantitative modelling of groundwater flow and contaminant transport are covered. Special topics on the coupling of hydrologic and geologic processes will also be addressed, with examples from tectonics, petroleum geology, geothermics, and global change.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "3600", "title": "Ecosystems and Climate", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "Lecture\nInteractive Tutorial", "campus": "Main Campus", "academic_group": "Dept of Earth & Environ Sci", "requirements": "Not for students who have taken EESC3600 or EESC3601 or ESGS4005 or ESSC3601. Pre-requisite: EESC2020 or ESSC2020 or permission of instructor.", "description": "This course introduces the physical, chemical and biological principles governing the functioning of terrestrial and marine ecosystems, and their roles in shaping the Earth’s climatic and geological environments. Topics include: basic hydrology and surface energy balance; energy, momentum, water and chemical exchange between ecosystems and the atmosphere; cycling of water, carbon and other nutrients in soil, vegetation and ocean; survival strategies of different life forms (especially plants and microorganisms); ecosystem structures and functions; landscapes, disturbances and ecosystem dynamics; human perturbations of biogeochemical cycles via pollution, greenhouse gas emissions and land use; responses and evolution of terrestrial and marine ecosystems under global climate change. This course serves as a comprehensive introduction to ecological climatology, biogeochemistry and ecosystem ecology, and requires basic mathematical operations.This version of the course includes an integrated set of computer laboratory sessions.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "3601", "title": "Principles of Ecosystems and Climate", "career": "Undergraduate", "units": "2.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Dept of Earth & Environ Sci", "requirements": "Not for students who have taken EESC3600 or EESC3601 or ESGS4005 or ESSC3600. Pre-requisite: EESC2020 or ESSC2020 or permission of instructor.", "description": "This course introduces the physical, chemical and biological principles governing the functioning of terrestrial and marine ecosystems, and their roles in shaping the Earth’s climatic and geological environments. Topics include: basic hydrology and surface energy balance; energy, momentum, water and chemical exchange between ecosystems and the atmosphere; cycling of water, carbon and other nutrients in soil, vegetation and ocean; survival strategies of different life forms (especially plants and microorganisms); ecosystem structures and functions; landscapes, disturbances and ecosystem dynamics; human perturbations of biogeochemical cycles via pollution, greenhouse gas emissions and land use; responses and evolution of terrestrial and marine ecosystems under global climate change. This course serves as a comprehensive introduction to ecological climatology, biogeochemistry and ecosystem ecology, and requires basic mathematical operations. This course is the same as and meets with ESSC3600, except without the integrated computer laboratory sessions and exercises.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "3800", "title": "Global Environmental Change", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "Lecture\nInteractive Tutorial", "campus": "Main Campus", "academic_group": "Dept of Earth & Environ Sci", "requirements": "Not for students who have taken EESC3800.", "description": "This course includes the science behind the global warming issue, how the public views the issue and the critical thinking needed to analyze the evidence seen in the media/articles from the point of view of scientists. The world energy use, which is considered to be the cause of global warming, and the impacts are discussed in the course. In this course, students will learn about the radiation budgets/balance in the atmosphere, possible climate forcings that can upset the energy balance, how the earth’s global average temperature is measured, why global warming is described as “the biggest hoax” in human history, observations from the ocean and cryosphere and popular environmental issues/arguments discussed in the mainstream media. Newest observations from the Intergovernmental Panel on Climate Change (IPCC) report are included throughout the course. This course actively incorporates elements of innovation, design, global citizenship and social enterprisingness by asking the students to think innovatively but critically about possible solutions to adapt to and combat climate change and the global energy/health crisis. Different options including their pros and cons are actively discussed in class. Students are encouraged to think creatively about the problem from different angles, e.g., by standing in the shoes of climate skeptics – evaluating their “data”, how they present them, the arguments put forth by them – in order to develop a strategic approach to best communicate the issues to a variety of stakeholders. Project assignments will allow students to focus on one particular environmental issue in other part of the world, attempting to address the issue in the very different geographical, cultural, economic and political contexts from that of the students. Example projects can be “How to use geoengineering to combat climate change?”, “How can Sub-Saharan Africa secure its future food supply under the threat of climate change?”, etc. In the course, students will define and understand the problem. They shall form groups and discuss their own point of views and search information on the evidence of the corresponding arguments. They will present their ideas in class and write a self-reflection report. Each of the group will have to make an “infographic”- a layout of science knowledge learnt in the project that is easy enough for the public to understand but at the same time informative. Good infographics will be used in our OpenDay.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "3900", "title": "Internship", "career": "Undergraduate", "units": "3.00", "grading": "Distinction/Pass/Failure", "components": "Practicum", "campus": "Main Campus", "academic_group": "Dept of Earth & Environ Sci", "requirements": "Not for students who have taken EESC3900. Pre-requisite: (EESC2010 or ESSC2010) and (EESC2020 or ESSC2020), and have taken at least one course from (EESC3100, 3120, 3200, 3220, 3300 or 3320) or (ESSC3100, 3120, 3200, 3220, 3300 or 3320).", "description": "This course aims to let students apply their Earth System Science knowledge in, and gain hands-on experience from workplace. Students are expected to gain practical experience from various internship opportunities such as CUHK units, government or private companies. The internship can be held through local fieldwork, guided tours, workshops or other related tasks, depending on the requests from different units. Students are required to serve at least 320 hours during the internship and will be evaluated based upon biweekly progress reports, final written report, presentation and the evaluation from the supervisor(s)/course coordinator (subject to their supervisors).Advisory: For year 2 or above Earth System Science major students.Note: Allowance may vary each year for the internships depending on the needs of students.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "4010", "title": "Solid and Fluid Mechanics", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "Lecture\nInteractive Tutorial", "campus": "Main Campus", "academic_group": "Dept of Earth & Environ Sci", "requirements": "Not for students who have taken EESC4010 or ESSC3010 or EASC5010.", "description": "This course presents the fundamentals of continuum mechanics illustrated with earth system science applications. Background materials on matrices, vectors and differential operators are first reviewed. The following topics will be covered: tensors and their properties; stress and strain; constitutive equations for Hookean elastic solid and Newtonian viscous fluid; mechanical properties and rheology of geomaterials; Eulerian and Lagrangian kinematics; momentum equations; vorticity and divergence; applications in geomechanics, seismology, atmospheric dynamics, and oceanography.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "4020", "title": "Soil Mechanics and Its Applications", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "Lecture\nInteractive Tutorial", "campus": "Main Campus", "academic_group": "Dept of Earth & Environ Sci", "requirements": "Not for students who have taken EESC4020. Pre-requisite: (MATH1010 or 1030 or 1510 or 1520), (PHYS1001 or 1002 or 1111 or 1113) and (EESC2010 or ESSC2010), or permission of instructor.", "description": "A survey of basic concepts of soil mechanics: Classification and physical properties of soil; stress and strain; pore pressure, seepage theory and effective stress; elastic solutions; shear strength and Mohr-Coulomb theory; failure mode and criteria; soil consolidation; lateral earth pressure; slope stability; bearing capacity and foundation designs; pile analyses and designs; soil improvement and soil nailing. Geotechnical applications: shallow and deep foundations; retaining structures; slope instability.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "4030", "title": "Engineering Geology", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "Lecture\nInteractive Tutorial", "campus": "Main Campus", "academic_group": "Dept of Earth & Environ Sci", "requirements": "Not for students who have taken EESC4030. Pre-requisite: (EESC2130 or ESSC2130), (EESC3100 or ESSC3100), (EESC3110 or ESSC3110), (EESC4020 or ESSC4020) and EESC4040, or permission of instructor.", "description": "To introduce ground investigation application and practice for urban development as well as field skill performed by the practicing engineering geologists. A review of selected case histories will be provided to illustrate the use of these concepts and skills.Topics include the factors controlling site selection for a development, desk study and walkover survey, the use of aerial photographic interpretation, ground investigation technology and awareness of site safety, brief introduction of common field and laboratory test methods for soil and rock, introduction of soil and rock description and classification, borehole logging techniques of soil samples and rock types. The content of the course also touches on the basic knowledge of design, management practice of GI works and different roles and responsibilities of GI project personnel.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "4110", "title": "Applied Geophysics", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "Lecture\nInteractive Tutorial", "campus": "Main Campus", "academic_group": "Dept of Earth & Environ Sci", "requirements": "Not for students who have taken EESC4110. Pre-requisite: (EESC2010 or ESSC2010) and (EESC3120 or ESSC3120).", "description": "This course introduces concepts, principles, and applications of geophysical methods in environmental and engineering studies. It offers an overall survey of various geophysical methods for exploring the shallow subsurface. It provides the technical foundation needed to understand the use and limitations of gravity, seismic, ground penetrating radar, and electromagnetic methods. Demonstration of commonly used methods will be provided in the field along with tutorials of preliminary data analysis techniques.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "4120", "title": "Petrology", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "Laboratory\nLecture", "campus": "Main Campus", "academic_group": "Dept of Earth & Environ Sci", "requirements": "Not for students who have taken EESC4120. Pre-requisite: EESC2010 or ESSC2010.", "description": "Petrology is an essential subfield of Earth System Science because the rock record is the foundation for interpreting Earth history and internal processes. Petrologic concepts help us understand the Earth system, with connections to related fields such as geochemistry, geophysics, mineralogy, structural geology and geodynamics. This course broadly surveys the formation, distribution, chemical composition, mineral associations, and internal texture and structures in rocks of the earth’s crust and upper mantle, and establishes it relation to global tectonic environments. Class lectures are supplemented by lab exercise, demonstrations and tutorials (e.g. study of rock hand specimens, understand phase rule, use of optical microscope etc.).", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "4130", "title": "Geomorphology", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "Field Studies/Field-trip\nLaboratory\nLecture", "campus": "Main Campus", "academic_group": "Dept of Earth & Environ Sci", "requirements": "Not for students who have taken EESC4130. Pre-requisite: EESC3100 or ESSC3100.", "description": "This course is an important part of the core Earth System Sciences Curriculum. It introduces the main concepts in geomorphology with emphasis on understanding the coupling of environments, processes and materials that leads to landform development. Understanding the underlying geological principles of rocks, minerals, structural deformation and geological time are important background knowledge to be enhanced by the study of geomorphology.It discusses the qualitative and quantitative techniques for investigation and research in the field, laboratory, and computer simulation. The application of geomorphology for public safety, engineering problems and development of sustainable solutions will be emphasized. Examples from theory and practice of geomorphology in Hong Kong will be introduced. Practical understanding and skills will be gained from lab exercises and field trips in Hong Kong.Students are suggested to be equipped with basic knowledge of rocks and minerals, structural geology and geological time scale.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "4140", "title": "Seismology", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "Field Studies/Field-trip\nLecture\nInteractive Tutorial", "campus": "Main Campus", "academic_group": "Dept of Earth & Environ Sci", "requirements": "Not for students who have taken EESC4140. Pre-requisite: EESC3120 or ESSC3010 or ESSC3120.", "description": "This course focuses on the concepts and theory of elastic wave propagation and physics of earthquake. The topics covered include the Earth’s internal structure, material elasticity, travel time tomography, seismic ray theory, ray tracing, and earthquake source parameter. Methods and field practice of seismological survey will also be introduced.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "4160", "title": "Marine Geology and Geophysics", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "Field Studies/Field-trip\nLecture\nProject\nInteractive Tutorial", "campus": "Main Campus", "academic_group": "Dept of Earth & Environ Sci", "requirements": "Not for students who have taken EESC4160. Pre-requisite: EESC3120 or EESC4010 or ESSC3010 or ESSC3120 or ESSC4010.", "description": "This course focuses on the concepts and theory of marine geology and geophysics. Marine geology is distinct from that of continent and is the important foundation to launch Plate Tectonics, the modern unified theory of the Earth. In this course, major components of marine geological settings such as mid-ocean ridges, transform faults, subduction zones, oceanic lithosphere, and etc. will be introduced and discussed in details. Methods of geophysical survey will also be introduced. Field experiments of scientific instruments such as Ocean Bottom Seismometers, marine magnetometer and gravimeter will be conducted. A geological field trip will also be included. This course will be jointly offered with Ocean College, Zhejiang University, as an initiative to develop ocean sciences at CUHK.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "4180", "title": "Earthquake Source Physics", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "Lecture\nInteractive Tutorial", "campus": "Main Campus", "academic_group": "Dept of Earth & Environ Sci", "requirements": "Not for students who have taken EESC4180. Pre-requisite: EESC3120 or EESC4010 or EESC4140 or ESSC3120 or ESSC4010 or ESSC4140.", "description": "This course focuses on the concepts and theory of earthquake source physics. The topics covered include seismic instrumentation, geophysical observations of earthquake source processes, kinematic source representation of earthquakes, dynamic rupture propagation of earthquakes, frictional properties of fault zones, and entire earthquake cycle. Methods and field practice of seismological survey will also be introduced.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "4210", "title": "Land-Atmosphere Interactions and Boundary-Layer Meteorology", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "Lecture\nInteractive Tutorial", "campus": "Main Campus", "academic_group": "Dept of Earth & Environ Sci", "requirements": "Not for students who have taken EESC4210. Pre-requisite: EESC2020 or EESC3200 or ESSC2020 or ESSC3200 or permission of instructor.", "description": "This course introduces the physical, chemical and biological processes governing the exchange of energy, momentum, water and other chemical materials between the atmosphere and land surface, including a formal introduction into boundary-layer meteorology. Topics covered include the basic equations and concepts of heat, momentum and mass conservation and transfer at the land-atmosphere interface; soil physics and hydrometeorology; temperature, humidity and wind distribution in the atmospheric boundary layer; theories and observations of turbulence; boundary layer dynamics; biometeorology and ecophysiology of land plants; canopy and ecosystem exchange; and land use change and urbanization. Applications to weather phenomena, air pollution, forestry, agriculture and ecosystem management will be emphasized throughout.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "4220", "title": "Tropical Meteorology", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "Lecture\nInteractive Tutorial", "campus": "Main Campus", "academic_group": "Dept of Earth & Environ Sci", "requirements": "Not for students who have taken EESC4220. Pre-requisite: EESC3200 or ESSC3200.", "description": "This course introduces tropical atmospheric circulation and related air-sea coupling at a variety of spatial and temporal scales. The topics covered include the role of the tropics in the global energy and momentum balance, ITCZ, subtropical high, upper-level anticyclones, tropical ocean circulation, tropical weather, climate and atmosphere-ocean interaction phenomena including meso-scale convective systems, tropical waves, the Hadley and the Walker circulation, El Nino-Southern Oscillation, tropical cyclones, Madden Julian Oscillation, and monsoons.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "4230", "title": "Introduction to the Physics and Chemistry of Aerosol", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "Lecture\nInteractive Tutorial", "campus": "Main Campus", "academic_group": "Dept of Earth & Environ Sci", "requirements": "Not for students who have taken EESC4230. Pre-requisite: EESC2020 or ESSC2020 or permission of instructor.", "description": "Fundamentals of aerosol physics and chemistry; condensation and evaporation; thermodynamics; nucleation, diffusion, coagulation; radiative, hygroscopic properties, and cloud formation potential of aerosols; aerosol phase oxidation reactions; heterogeneous oxidative processes.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "4240", "title": "Air Pollution Science and Engineering", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "Lecture\nInteractive Tutorial", "campus": "Main Campus", "academic_group": "Dept of Earth & Environ Sci", "requirements": "Not for students who have taken EESC4240.", "description": "This course will cover a variety of topics related to air pollution science and engineering. Topics include: indoor and outdoor air quality (including particulate matters (PM) and gases pollutants); air pollution measurement and statistics; air quality meteorology and dispersion models; principles and challenges of air pollution control and measurement.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "4250", "title": "General Circulation and Climate Models", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "Lecture\nInteractive Tutorial", "campus": "Main Campus", "academic_group": "Dept of Earth & Environ Sci", "requirements": "Not for students who have taken EESC4250. Pre-requisite: EESC3200 or ESSC3200 or permission of instructor.", "description": "This course is about the general circulation of the atmosphere, oceans, the interactions among them and with other components of the Earth System, as well as their simulations using climate models, in the context of climate variability and climate change. Topics include basic fluid dynamics of large-scale atmospheric and oceanic motions, radiative transfer, atmospheric general circulation, midlatitude dynamics, ocean general circulation, and general circulation models.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "4260", "title": "Urban Climatology", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "Laboratory\nLecture", "campus": "Main Campus", "academic_group": "Dept of Earth & Environ Sci", "requirements": "Not for students who have taken EESC4260. Pre-requisite: EESC2020 or ESSC2020.", "description": "Human modifications to the surface of the Earth during urbanisation change most of the elements of climate and weather in the urban atmosphere. This course introduces the fundamentals of urban climatology and the processes caused by the changes in the surface environment, particularly focusing on how urban structures interact with the atmospheric environment. Numerical modelling and field techniques are introduced to understand the underlying processes resulting urban climatic phenomena. It also examines the implications on human comfort and climate-sensitive urban planning and design, as well as the relationship between cities and climate change.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "4510", "title": "Statistical Methods and Data Analysis for Earth System Science", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "Lecture\nInteractive Tutorial", "campus": "Main Campus", "academic_group": "Dept of Earth & Environ Sci", "requirements": "Not for students who have taken EESC4510 or ESGS4004. Pre-requisite: (STAT1011 or 1012), and (EESC2030 or ESSC2030 or PHYS2061).", "description": "This course covers the theoretical basis and practical applications of data analysis relevant for earth system science. This course aims to introduce students to Earth and environmental data manipulation, from sampling, reading and writing, to statistical analysis and parameter estimation, to time series analysis, to plotting and visualization. Topics include: digital signal processing, sampling techniques; probability distributions; hypothesis testing; correlation analysis; linear and nonlinear regression; statistical forecasting, harmonic analysis and spectral analysis; principle component analysis; and geostatistics. Tutorials will be based on real geophysical examples including remote sensing and in situ observations, as well as model data.Previous elementary coding experience in Python 3 is recommended.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "4520", "title": "Numerical Methods and Modeling for Earth System Science", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "Lecture\nInteractive Tutorial", "campus": "Main Campus", "academic_group": "Dept of Earth & Environ Sci", "requirements": "Not for students who have taken EESC4520. Pre-requisite: (MATH1010 or 1030 or 1520) and (EESC2030 or ESSC2030 or PHYS2061).", "description": "This course covers the principles of numerical methods and modeling relevant for earth system science applications. Topics include: optimization; interpolation; finite differencing; numerical solutions to ordinary and partial differential equations; programming numerical models; filtered models; boundary conditions; subgrid-scale processes; data assimilation; applications in earthquake, climate, air quality, weather forecast and groundwater models. Python will be used in this course.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "4540", "title": "Remote Sensing – Principles and Applications", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "Lecture\nInteractive Tutorial", "campus": "Main Campus", "academic_group": "Dept of Earth & Environ Sci", "requirements": "Not for students who have taken EESC4540 or ESGS4002. Pre-requisite: EESC/ESSC2010 and EESC/ESSC2020 and (MATH1010 or 1030 or 1510 or 1520) and (PHYS1001 or 1002 or 1111 or 1113) and (EESC/ESSC2030 or PHYS2061), or permission of instructor.", "description": "Remote sensing observations are critical for monitoring regional and global changes, determining spatial and temporal variability of the Earth System, and addressing fundamental global issues. This course introduces the basic physical principles of remote sensing, including electromagnetic waves and radiation, optical, microwave, and non-imaging remote sensing. It also presents key concepts and examples on remote sensing applications in Earth system science (such as atmosphere, lithosphere, hydrosphere, cryosphere) and global changes. This course also provides computer-based lab exercises that facilitate the understanding of remote sensing principles and the processing of remote sensing data.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "4601", "title": "Research Seminar in Earth System Science", "career": "Undergraduate", "units": "1.00", "grading": "Graded", "components": "Seminar", "campus": "Main Campus", "academic_group": "Dept of Earth & Environ Sci", "requirements": "Not for students who have taken EESC4601.", "description": "Research seminar series in Earth System Science. Students will be exposed to frontier research presented by guest speakers through active participation.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "4602", "title": "Selected Topics in Earth System Science", "career": "Undergraduate", "units": "2.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Dept of Earth & Environ Sci", "requirements": "Not for students who have taken EESC4602.", "description": "Recent research methods, experimental, and computational techniques applied in selected topics in Earth System Science.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "4603", "title": "Advanced Topics in Earth System Science", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Dept of Earth & Environ Sci", "requirements": "Not for students who have taken EESC4603.", "description": "State-of-the-art research methods, experimental, and computational techniques applied in advanced topics in Earth System Science.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "4810", "title": "Senior Project I", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "Project\nInteractive Tutorial", "campus": "Main Campus", "academic_group": "Dept of Earth & Environ Sci", "requirements": "Not for students who have taken EESC4810 or PHYS4610. Pre-requisite: Permission of project advisor.", "description": "A project in earth system science, either focusing more on research or on reviewing the literature. The project may be combined with ESSC4820 to form a more substantial project. Students should seek prior permission of project advisor before enrolment.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "4820", "title": "Senior Project II", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "Project\nInteractive Tutorial", "campus": "Main Campus", "academic_group": "Dept of Earth & Environ Sci", "requirements": "Not for students who have taken EESC4820 or PHYS4620. Pre-requisite: Permission of project advisor.", "description": "A project in earth system science, either focusing more on research or on reviewing the literature. The project may be combined with ESSC4810 to form a more substantial project. Students should seek prior permission of project advisor before enrolment.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}]