[{"code": "1020", "title": "The Hong Kong Story", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "Lecture\nWeb-enhanced Teaching", "campus": "Main Campus", "academic_group": "Joint Colleges General Edu", "requirements": "For Shaw College students and Year 1 students of Wu Yee Sun College only.\nNot for students who have taken UGEC2865, SOCI1201 or SOCI2104.", "description": "From a colony of the British Empire to the SAR of the PRC, the Hong Kong story has undergone many ups and downs, twists and turns. Designed from a sociological perspective, but specifically for students without sociological background or much background knowledge about Hong Kong, this course shall guide them through the journey of Hong Kong and its people so far. It will pick up popular images about Hong Kong, such as \"a laissez-faire economic miracle\", \"the safest place in the world\", or \"the land of opportunity\", evaluating their validities or tracing their origins and implications. Selected contemporary issues arising from the city’s sustainable development will also be discussed, such as migration, inequality, and affordable housing. Integrating experiential learning and e-learning strategies, this course should offer students a range of new learning experiences and new angles of approaching the Hong Kong society.", "outcome": " After completing the course, students should be able to:  Go beyond the constraint of individual experiences and recognize the broader influence of Hong Kong’s post-war social developments on Hong Kong people's personal biography and community living.  Identify and critically discuss dominant imageries of social life in Hong Kong.  Analyze everyday encounters in the community of Hong Kong and evaluate their broader significance with consolidated knowledge and perspectives gained from this course.  Evaluate and reflect on selected issues concerning the sustainable development of Hong Kong  Engage in self-initiated learning processes with technological aid geared towards active discovery.", "syllabus": " 1. ​Introduction – The Hong Kong spectacle  2. Hong Kong as a crown jewel of the British Empire: Colonial history and legacy  3. Hong Kong as an international hub: The rise of Hong Kong in the world-system  4. Hong Kong as an economic miracle? The myth of laissez-faire and industrialization  5. Hong Kong as a migration center: Cultural diversity and social polarization in Hong Kong – SDG#1, 8, 10 – this lecture will discuss migration in HK with reference to SDG indicators that are ‘migration-related’ and ‘disaggregation’ related . Specifically, the lecture will discuss protection of migrant labour rights and promote safe and secure migrant working environment (8.8); facilitation of orderly, safe, regular and responsible migration (10.7), reducing poverty and better social protection of all population members, such as ethnic minorities in HK (1.3.1).  6. Hong Kong as a place of conflict over hearts and minds: identity politics beyond left and right  7. Hong Kong as a divided society: From land of opportunity to land of inequality? – SDG#10 – this lecture will introduce the concept of inequality and examine the evolving social mobility system of HK and the inequalities in outcome (10.3), hence giving students insights on methods to reduce HK’s inequality (e.g. wage and social protection policies 10.4).  8. Hong Kong as an urban jungle: Affordable housing in Hong Kong – SDG#11 – this lecture will examine HK’s current housing problem within the SDG framework of adequate, safe and affordable housing (11.1). Comparison will be made with overseas cases to discuss how to enhance inclusive and sustainable urbanization in the case of HK (11.3).  9. Hong Kong as the safest place in the world? From gang-land to cop-land to Disneyland  10. Hong Kong as a city of protest: Social movements past and now  11. Hollywood of the East: Cultural industry in Hong Kong  12. Conclusion: Cosmopolitan Hong Kong", "required_readings": " 1. Introduction – The Hong Kong spectacle -    Lui, T. L., Chiu, S. W., & Yep, R. (2018). Introduction. In T. L. Lui, S. W. Chiu & R. Yep (Eds.). Routledge Handbook of Contemporary Hong Kong (pp.1-29). London: Routledge. -    Chan, M. K. (1997). The legacy of the British administration of Hong Kong: a view from Hong Kong. The China Quarterly, 151, 567-582.  2. Hong Kong as a crown jewel of the British Empire: Colonial history and legacy -    Carroll, John. 2013. “Introduction”, “Early colonial Hong Kong” and “State and society.” in A Concise History of Hong Kong. Hong Kong: Hong Kong University Press.  3. Hong Kong as an international hub: The rise of Hong Kong in the world-system -    Ho, K. C., & So, A. (1997). Semi-periphery and borderland integration: Singapore and Hong Kong experiences. Political Geography, 16(3), 241-259. -    Yeung, H. W. C. (1997). Business networks and transnational corporations: A study of Hong Kong firms in the ASEAN region. Economic Geography, 73(1), 1-25. 4. Hong Kong as an economic miracle? The myth of laissez-faire and industrialization -    Chiu, Stephen Wing-kai 1996. “Unravelling Hong Kong’s exceptionalism: The politics of laissez-faire in the industrial takeoff.” Political Power and Social Theory 10: 229-56. -    Ngo, T.W. (2018). A genealogy of business and politics in Hong Kong. In T. L. Lui, S. W. Chiu & R. Yep (Eds.). Routledge Handbook of Contemporary Hong Kong (pp.324-341). London: Routledge. 5. Hong Kong as a migration center: Cultural diversity and social polarization in Hong Kong -    O’Connor, P. (2018). Ethnic minorities and ethnicity in Hong Kong. In T. L. Lui, S. W.  Chiu & R. Yep (Eds.). Routledge Handbook of Contemporary Hong Kong (pp.259-274). London: Routledge. -    Chiu, S. W., & Lui, T. L. (2004). Testing the global city-social polarisation thesis: Hong Kong since the 1990s. Urban Studies, 41(10), 1863-1888. 6. Hong Kong as a place of conflict over hearts and minds: identity politics beyond left and right -    Mathews, Gordon, Eric Kit-wai Ma and Tai-lok Lui. 2008. “Fleeing the nation, creating a local home, 1949-1983” and “Rejoining the nation: Hong Kong, 1983-2006.” In Hong Kong, China: Learning to Belong to a Nation. Oxon: Routledge.    - Ku, A. S. (2018). Identity as politics. Contesting the local, the national and the global. In T.L. Lui, S. W. Chiu & R. Yep (Eds.). Routledge Handbook of Contemporary Hong Kong (pp.451-461). London: Routledge.  7. Hong Kong as a divided society: From land of opportunity to land of inequality? -    Wong, Y. L., & Koo, A. (2016). Is Hong Kong no longer a land of opportunities after the 1997 handover? A comparison of patterns of social mobility between 1989 and 2007. Asian -    Journal of Social Science, 44(4-5), 516-545. -    Lee, K. M., Wong, H., & Law, K. Y. (2007). Social polarisation and poverty in the global city: The case of Hong Kong. China report, 43(1), 1-30. 8. Hong Kong as an urban jungle: Affordable housing in Hong Kong -    Ng, M. K. (2020). Transformative urbanism and reproblematising land scarcity in Hong Kong. Urban Studies, 57(7), 1452-1468. -    Forrest, R., & Yip, N. M. (2014). The future for reluctant intervention: the prospects for Hong Kong's public rental sector. Housing Studies, 29(4), 551-565. 9. Hong Kong as the safest place in the world? From gang-land to cop-land to Disneyland -    Gaylord, Mark and Harold Traver. 1995. “Colonial policing and the demise of British rule in Hong Kong.” International Journal of the Sociology of Law 23:23-43. -    Cuthbert, A. R. (1995). The right to the city: surveillance, private interest and the public domain in Hong Kong. Cities, 12(5), 293-310 10. Hong Kong as a city of protest: Social movements past and now -    Lui, Tai-lok and Chiu, Stephen Wing-kai. 2000. “Introduction—Changing Political Opportunities and the Shaping of Collective Action: Social Movements in Hong Kong”, pp.1-20 in Wing-kai Chiu and Tai-lok Lui (eds.) The Dynamics of Social Movement in Hong Kong. Hong Kong: University of Hong Kong Press. -    Chiu, Stephen Wing-kai and Li Hang. 2014. Contentious Politics in Two Villages. Anti-High-Speed-Rail Campaigns in Hong Kong and Taiwan. Occasional Paper no. 230. Hong Kong Institute of Asia-Pacific Studies, The Chinese University of Hong Kong. 11. Hollywood of the East: Cultural industry in Hong Kong -    Chiu, S.W. & Shin, V.K. (2018.). Hong Kong’s film industry reconstituted. In T. L. Lui, S. W. Chiu & R. Yep (Eds.). Routledge Handbook of Contemporary Hong Kong (pp.365-396). London: Routledge. -   Morris, M. (2004). Transnational imagination in action cinema: Hong Kong and the making of a global popular culture. Inter-Asia Cultural Studies, 5(2), 181-199. 12. Conclusion: Cosmopolitan Hong Kong -    Mathews, Gordon, Eric Kit-wai Ma and Tai-lok Lui. 2008. “Hong Kong’s market-based national identity: harbinger of a global future?” In Hong Kong, China: Learning to Belong to a Nation. Oxon: Routledge. -    Yu, H. (2019). The Guangdong-Hong Kong-Macau greater Bay area in the making: development plan and challenges. Cambridge Review of International Affairs, 34(4), 481-509.", "recommended_readings": " -    Ngo, Tak-wing. 1999. “Colonialism in Hong Kong revisited.” In Tak-wing Ngo (edited). Hong Kong’s History: State and Society under Colonial Rule. London: Routledge. -    So, Alvin Y., and Stephen W.K. Chiu. 1995. “The semiperipherization of the newly industrializing economies.” In East Asia and the World Economy. Thousand Oaks, CA: Sage Publications. -    Chiu, Stephen Wing-kai and Ho-fung Hung. 1999. “State Building and Rural Stability.” In Tak-Wing Ngo (Edited). Hong Kong's History: State and Society Under Colonial Rule. London: Routledge. -    Sara Ashencaen Crabtree and Hung Wong. 2013. “‘Ah Cha’! The racial discrimination of Pakistani minority communities in Hong Kong: An analysis of multiple, intersecting oppressions.” British Journal of Social Work 43: 945–963. -    Lui, Tai-lok. 2009. “Hong Kong’s changing opportunity structures: Political concerns and sociological observations.” In Kwok-bun Chan, Agnes S. Ku and Yin-wah Chu (eds.) Social Stratification in Chinese Societies. Leiden: Brill. -    Castells, Manuel, Lee Goh, R. Yin-wang Kwok. 1990. “Public housing as a political strategy: its economic, social, and political goals and impacts.” In The Shek Kip Syndrome: Economic Development and Public Housing in Hong Kong and Singapore. London: Pion Ltd. -    Smart, Alan. 2006. The Shek Kip Mei Myth: Squatters, Fires and Colonial Rule in Hong Kong, 1950-1963. Hong Kong: Hong Kong University Press. - Smart, A., & Lee, J. (2003). Financialization and the role of real estate in Hong Kong's regime of accumulation. Economic geography, 79(2), 153-171. -    Poon, Alice. 2010. “Land and power.” In Land and the Ruling Class in Hong Kong (2nd Edition). Hong Kong: Enrich Professional Publishing.", "terms": {"2024-25 Term 1": {"--LEC (6101)": {"startTimes": ["15:30"], "endTimes": ["17:15"], "days": [5], "locations": ["Yasumoto Int'l Acad Park LT8"], "instructors": ["Dr. LEE King Wa"], "meetingDates": ["6/9", "13/9", "20/9", "27/9", "4/10", "18/10", "25/10", "1/11", "8/11", "15/11", "22/11", "29/11"]}, "-X01-WBL (7742)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["No Room Required"], "instructors": ["Dr. LEE King Wa"], "meetingDates": ["02/09/2024 - 25/11/2024"]}}}, "assessments": {"Classwork": "10", "Project": "50", "Test or quiz": "40"}}, {"code": "1110", "title": "College, University and Community: Student-Oriented Teaching", "career": "Undergraduate", "units": "1.00", "grading": "Distinction/Pass/Failure", "components": "Discussion", "campus": "Main Campus", "academic_group": "Joint Colleges General Edu", "requirements": "For Year 1 Chung Chi College students only. Students must take GEJC1120 in the same term for taking this course. Not for students who have taken GECC1130, GECC1131 or GECC1132", "description": "This is a student-oriented small group tutorial course connected to GEJC1120 for Chung Chi students only. This course is designed specifically for year one students, with the aims to enhance students to adapt to the learning environment and life style in The Chinese University, allow them to get a better understanding to university life, university education and the lectures of GEJC1120 through small group discussion.The enrollment of this course is in connection with the 2 unit course GEJC1120 “College, University and Community”. ", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "1120", "title": "College, University and Community", "career": "Undergraduate", "units": "2.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Joint Colleges General Edu", "requirements": "1. For College Year 1 Students only. 2. Students enrolled in this course cannot take GECC1130, GENA1112 or GEUC1011. 3. Chung Chi students are required to take GEJC1110 or GECC1132 in the same term.", "description": "This course is jointly offered by Chung Chi, New Asia and United Colleges with the aim of introducing students to the basic elements of university education, history and traditions of college, campus life, personal development and social responsibility. The course comprises a series of lectures, each with a distinct theme. Together the lectures encompass critical aspects of education and life in the social, cultural and global contexts. The course would allow students to develop an understanding and appreciation of university education as well as their role and responsibility in the community.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}]