[{"code": "2002", "title": "Methodology of Social Science Research", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "Lecture\nInteractive Tutorial", "campus": "Main Campus", "academic_group": "Global Studies PC 2-yr", "requirements": "Not for students who have taken SOCI2003", "description": "This course deals with the methodology and skills in studying social science subjects, with particular focus on politics, economics and sociological disciplines. It provides training for students to handle a variety of data presented in either verbal, numbers or graphical fashion, alongside with the skills to present their analysis in a reader-friendly fashion. It also familiarizes students with some basic data-processing skills and functions supported by SPSS (Statistical Package for the Social Sciences). This course covers, but not limited to, i) Basic research skills: Literature Review and citations ii) Quantitative data analysis: Basic Statistics, Simple Regression Model and SPSS; iii) Qualitative data analysis: Surveys, interviews, focus groups, field works and discourse analysis, iv) Analysis and Interpretation; v) Internet Research methods. This is a required course for GLBS students.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "2003", "title": "Field Studies and Methodology of Social Science Research", "career": "Undergraduate", "units": "1.00", "grading": "Graded", "components": "Field Studies/Field-trip", "campus": "Main Campus", "academic_group": "Global Studies PC 2-yr", "requirements": "Not for students who have taken GLBS2001", "description": "This is a required course for GLBS students and a continuation of GLBS2002. Students will be given the opportunities to visit a destination outside of Hong Kong, to taste the real-world implications of Globalization to different communities. The objective of this course is multifold: (1) to practice the skills acquired from GLBS2002 via field studies; (2) to train students’ ability in comparing the impact of Globalization to different regions, (3) to provide opportunities for students work in group; and (4) to enhance students’ relationship with the teaching staffs. The field studies will take place under the supervision of one or more teaching staffs of this Programme. Students are required to join all lectures and workshops before the field studies. They are required to submit an individual report afterwards.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "2201", "title": "Geopolitics and the World in Media", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Global Studies PC 2-yr", "requirements": "", "description": "This course introduces a number of important issues happening around the World today - provided with some basic level of analysis and understanding of some key terms often come across in studying features of Globalization - by using materials from news media. It aims to equip students with better foundation of facts as well as some basic presentation skills. This course is going to cover, but not limited to, i) historical background of the contemporary world order; ii) basic knowledge about the geopolitical distribution; iii) overview of the agendas concerned by different regions; iv) introduction and comparisons of the political systems and institutions undertaken in the major powers. This is a required course for GLBS students and is conducted in Chinese.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "3001", "title": "Use of English in Global Studies", "career": "Undergraduate", "units": "2.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Global Studies PC 2-yr", "requirements": "", "description": "This is a required course for all the first-year GLBS students. Students will receive intensive trainings about the usage of English, including the vocabulary expansion, speaking and writing for academic purposes, so that it can enhance their capabilities to cope with various topics come across from different classes. Coursework is specifically designed and particularly relevant to international and global affairs.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "3002", "title": "English Speech and Presentation for the Global Market", "career": "Undergraduate", "units": "2.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Global Studies PC 2-yr", "requirements": "", "description": "This is a required course dedicated for GLBS students in order to enhance their communication skills and competitiveness in the Global market. Special attention will be given to interpersonal communication, pair/group discussion, oral presentations and speaking improvement activities.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "3003", "title": "English Speaking in Global Studies", "career": "Undergraduate", "units": "1.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Global Studies PC 2-yr", "requirements": "", "description": "This course is an advanced version for GLBS3002. It aims to equip students with better speaking skills in order to enhance their competitiveness in the global market through intensive trainings in oral presentations and interpersonal communications. Students are required to demonstrate active participation in class. This is exclusively designed for GLBS students only.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "3101", "title": "Theories and Practices of International Relations", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "Lecture\nInteractive Tutorial", "campus": "Main Campus", "academic_group": "Global Studies PC 2-yr", "requirements": "", "description": "This course provides an overview of International Relations (IR) theory, the concepts and approaches often adopted in studying the discipline. It aims to familiarize students with different theoretical frameworks and key issues encountered by the globalizing society. This course covers a wide array of topics, but not limited to, i) the mainstream IR theories, provided with some case studies; ii) analysis of some key theoretical literatures and introduce their respective historiographical perspectives, including the Clash of Civilizations and its critics; iii) in-depth studies on some selected thematic issues; iv) International Relations theory and Globalization.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "3102", "title": "Global Governance and Principles of International Law", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "Lecture\nInteractive Tutorial", "campus": "Main Campus", "academic_group": "Global Studies PC 2-yr", "requirements": "", "description": "This course aims to cope with the subjects of Global Governance from the perspective of Public International Law. It examines the interaction among nation-states, non-state-actors and the International institutions and analyzes how they come to terms with each other under the Global context, provided with some case studies. This course covers, but not limited to, i) concepts of global governance; ii) key concepts from different sources of International Law, e.g. the Law of the Sea ; iii) international organizations and global governance including the Bretton Woods system; iv) state, sovereignty, and globalization; v) role of Hong Kong and China in Global Governance.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "3104", "title": "World Economies: Theories, Practices and New Development", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "Lecture\nInteractive Tutorial", "campus": "Main Campus", "academic_group": "Global Studies PC 2-yr", "requirements": "", "description": "This course provides an introduction to both macroeconomics and microeconomics with a view of the international economy by looking at some major theories and case studies. It aims at equipping students with the capacity to analyze the impacts of economic and social policies. It studies the implications of national policies and international agreements as well. This course covers, but is not limited to, i) macroeconomic theory, ii) microeconomic theory, iii) theories of international economics, iv) relationship between trade and politics, and v) international trade policy in developing nations, not least the emerging markets and BRICS.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "3105", "title": "Understanding Global Cities and Urban Space", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Global Studies PC 2-yr", "requirements": "", "description": "The course aims to present the effect of globalization on global cities and urban space. This is a required course for students majoring Global Studies without substantial background in social science disciplines on society and urban space use. The course shall first provide students with basic ideas and concepts relevant to topics relating to modern society and control of public space in social science disciplines. The second part of the course shall present fundamental concepts and theoretical perspectives to the study of globalization and its consequence on urban development and global changes. Such course design aims to build students’ conceptual thinking and imagination on the global world so they shall use such capacities to evaluate issues and debates shaped by the effects of globalization on the expansion of global cities and functions of public space in GLBS4501 Analyzing Development and Change in Global Cities and Urban Space.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "3106", "title": "The Rise of China in the Global Context I: Diplomacy, Trade and Soft Power", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Global Studies PC 2-yr", "requirements": "", "description": "This course looks at the \"Rise of China\" from the perspective of Global Governance and specifically sheds light on its diplomatic, trade and cultural relations with others in the Global Community. It provides a critical analysis on the transformation of Chinese foreign policies since the establishment of the People's Republic of China and the momentum behind this change of practices. This course covers, but not limited to, i) the History and evolution of Chinese foreign policies; ii) the analytical framework of policy-making process in China, particularly in handling foreign and security affairs; iii) its foreign relations with both the developed and developing nations; iv) its booming economy and integration with the global economy; v) assessment on the rhetoric of \"Peaceful Rise\" and \"Charm Offensive\" with reference to the Confucius Institute.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "3301", "title": "Understanding Global Issues from Movies", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Global Studies PC 2-yr", "requirements": "", "description": "This is an elementary level course which examines how media industries have projected the global agenda items through movies. It enables students to understand how the difference in cultural/national/social background would impact on the perceptions of people, in spite of the same objects and referents. In some occasions, such interpretations may reflect a certain degree of bias and hence jeopardize integrity of the facts. It is particularly helpful to students who haven't studied any courses from the Global Studies Programme in understanding relevant topics.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "3302", "title": "Sports and World Politics", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Global Studies PC 2-yr", "requirements": "", "description": "This course examines the relationship between Sports and World politics, in particular about the evolution of global political economy through various sports events like the Olympic Games and World Cup. Taking different sport games as case studies, this course aims to raise attention about some ongoing debates on the global political arena, e.g. Separatism, regional identity, global democracy. It also encourages students to think critically how politics and sports are mutually shaping each other.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "3303", "title": "Music in the Global Society", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Global Studies PC 2-yr", "requirements": "", "description": "This course examines aspects of popular music culture and its industry in shaping global order and influencing the global society. It introduces the dominant theoretical approaches to the study of music, including musicology, cultural studies and sociology. By illustrating the relationship and conflict between industry giants and indie musicians in light of the approaches taught, students are able to appreciate the global and local dynamics in shaping our global society. Societal trends and phenomena affecting the global order that are driven by music, such as the 60’s US folk movement and the recent K-Pop enthusiasm, will be lastly examined.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "3401", "title": "Hong Kong's External Relations and Chinese Foreign Policies", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Global Studies PC 2-yr", "requirements": "", "description": "This course aims to illustrate how Hong Kong has exercised its influence in the global society after the handover of Sovereignty in 1997, despite the constraints imposed by the Basic Law, and how they conform to, or at odds with, the grand strategy of People's Republic of China (PRC). This course approaches the subjects from individual, domestic, and systemic levels of analysis. It covers topics ranging from the transnational economic network of Hutchison-Whampoa to legal case which exhibit clashes of the code of practice between the Special Administrative Region (SAR) and its motherland. This course is conducted in Chinese.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "3402", "title": "Korea and the World: Politics, Economy and Culture", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Global Studies PC 2-yr", "requirements": "", "description": "This course examines the connection between Globalization and South Korea after World War II. It is also interested in accounting for the changes of political, economic, social and cultural aspects ofSouth Korea in the last few decades and the transformation of the attitudes towards Globalization in South Korean society. This course will cover a variety of topics ranging from i) brief overview ofthe historical development of South Korea since WWII; ii) driving forces and features of the economic developments, iii) their foreign policy concerns, iv) the characteristics of the traditional culturalidentities, v) the recent Korean-wave phenomenon; vi) opportunities and challenges brought by Globalization to Korean society.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "3403", "title": "European Union and the World", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Global Studies PC 2-yr", "requirements": "-", "description": "This course adopts various approaches to unravel the complexity of the ongoing integration project in Europe. Alongside the theoretical analysis, this course sheds light on the connection between Europe and the World. It will cover topics including, but not limited to, the Common Foreign and Security Policy, the EU Law, as well as EU’s contribution to Global Governance.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "3404", "title": "Japan and Global Political Economy", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Global Studies PC 2-yr", "requirements": "", "description": "This course examines the connection between Globalization and foreign policy-making of the country after World War II. It will cover a variety of topics ranging from the rationales behind the ups-and-downs of its economy, towards the Japanese perceptions towards Sino-Japanese relations and even the country’s role in the Global society.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "3406", "title": "Colonial Governance in Hong Kong and the British Empire", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "Lecture\nInteractive Tutorial", "campus": "Main Campus", "academic_group": "Global Studies PC 2-yr", "requirements": "", "description": "This course studies the interaction between Hong Kong, at a time when it was still under British colonial rule, and the international community. Themes include the features of early globalization, the connection between colonial Hong Kong and the collapse of the Qing Dynasty in China, Hong Kong under the influence of Japanese Imperialism and the Cold War, and Sino-British relations. It also examines how various international norms have found their way to shaping the tiny colony, which has stood in stark contrast with Mainland China, to whom Hong Kong's sovereignty was returned in 1997.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "3501", "title": "Global Civil Society and Operation of Non-Governmental Organizations", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Global Studies PC 2-yr", "requirements": "", "description": "This course looks at the operation of Global Governance from a bottom-up approach. It aims to provide a combination of major theories and debates behind global civil society, together with the practices of advocacy networks, social movements and non-governmental organizations coalitions. This course covers the following topics, but is not limited to, i) Features and Operations of Global Civil Society (GCS), with particular concerns on the operations of NGOs; ii) Themes and Issues which GCS pushed forward in the recent decade, and assessments over their performance; iii) Role of GCS in Global Governance, e.g. its cooperation with the United Nations in addressing global food crisis; iv) Challenges and Opportunities open to different International NGOs and transnational advocacy groups; v) Case-studies, e.g. Anti-WTO protests in Seattle; GONGOs in China, etc.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "3502", "title": "ICT and the Global Order: Internet, Smartphone and E-Governance", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Global Studies PC 2-yr", "requirements": "", "description": "This course tackles specifically on the growing importance of Information Technology and e-Governance in recent decades. Besides studying the significance of the proliferating information flow and accessibility, this course studies how the virtual society has hence been connected to the physical life, not least its effects on us. The following topics will be covered in this course, but they are not confined to: i) Rise and Features of E-commerce, E-politics and E-Governance; ii) IT Products and trade policies; iii) IT, Social Media and Political influence; iv) Cyber-security and Cybercrime; v) Case Studies on digital currencies and virtual states.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "4102", "title": "Developmental Study: Poverty, Inequality and Welfare of the World", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Global Studies PC 2-yr", "requirements": "", "description": "This course aims at providing a critical and theoretical overview of the issues, processes, and responses central to poverty, inequality and welfare around the World. It relates the challenges encountered by these developing states with the dark-sides of the Globalization. This course covers topics including, but not limited to, i) Theoretical understanding of Development and Poverty; ii) Development and Modernization: Asia as examples; iii) Dependency and World Systems Theories: Latin America as examples; iv) Colonization and Cultural Imperialism; iv) Equality in various aspects: Gender, Labour, Food and Wealth; v) International Institutions in ameliorating/aggravating poverty.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "4104", "title": "Global Development: Markets, States, Societies and IOs", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Global Studies PC 2-yr", "requirements": "", "description": "This course aims to provide in-depth analysis of inter-disciplinary global issues using basic principles of economics. This course is built on the introductory economics with respect to the International Political Economy (IPE) framework i.e., the roles of markets, states, society, and International Organizations (IOs) will be elaborated throughout the course. Hence, prior knowledge of introductory economics and the IPE theory are recommended. The course covers growth and human capital theories, and case studies of how policies are developed and implemented to address global issues. Issues discussed in the course include human capital development, economic development and widening inequality, education, social protection, human rights, emergencies and responses including both natural disaster and man-made conflicts, aging population, disadvantaged populations such as disabilities and ethnic minority, energy, and environment.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "4151", "title": "Graduation Project and Experiential Learning I", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "Project", "campus": "Main Campus", "academic_group": "Global Studies PC 2-yr", "requirements": "", "description": "This is a required course for the GLBS final year students while teaching staffs will be assigned as their supervisors. Each student can fulfill the requirement by either i) complete a research project by adopting his/her own research, problem-solving and thesis-writing skills acquired from other subjects; or ii) engage in an internship program - which should be no shorter than 8 weeks - approved by his/her supervisors in advance.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "4152", "title": "Graduation Project and Experiential Learning II", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "Project", "campus": "Main Campus", "academic_group": "Global Studies PC 2-yr", "requirements": "", "description": "This is a required course for the GLBS final year students while teaching staffs will be assigned as their supervisors. Each student can fulfill the requirement by either i) complete a research project by adopting his/her own research, problem-solving and thesis-writing skills acquired from other subjects; or ii) engage in an internship program - which should be no shorter than 8 weeks - approved by his/her supervisors in advance.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "4301", "title": "Islamic and Christian Culture in the Global Order: Religion, Society and Economy", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Global Studies PC 2-yr", "requirements": "", "description": "This course focuses on the relations among the world religions and their contribution to the formation of new identities of class, gender, ethnicity, nation and economic development in the global context. This course covers two major sets of world religions, Islam and Christianity with emphasis on their popular expression rather than formal theologies.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "4302", "title": "Advanced Methodology of Social Science Research", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Global Studies PC 2-yr", "requirements": "Prerequistie: GLBS2002 or any other basic methodology courses offered by other departments at a similar level.", "description": "This course is built on the core course on GLBS2002 Methodology of Social Science Research (or any other basic methodology courses offered by other departments at a similar level). While the introductory course covers the basics of social science research methods, this course offers more practical and advanced social research techniques by covering descriptive statistics, uni- and multi-variate regression analysis, and introduction of cost-benefit analysis and other intermediate quantitative methods. Students will acquire new quantitative skills through learning a statistical program (e.g., SPSS). Students are requested to write a term paper using quantitative methods. The quantitative methods learned in this class are used in all policy arenas, including the public and private sectors. The course content prepares students for academic and professional careers that use empirical analyses, particularly relevant to those who are interested in working for governments, NGOs or policy consultation units after graduation.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "4401", "title": "Traditional Security: Military, War and Peace", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Global Studies PC 2-yr", "requirements": "", "description": "This course introduces the academic field of strategic studies and security studies by referring to a few theoretical analysis and their practices in reality. This course also sketches out the ongoing debates about security, war and peace in International Relations for the better understandings of strengths and limitations of extant frameworks. The topics covered in this course include, but do not limit to, i) Basic understanding of military history and strategies, e.g. Clausewitz and Sun Tzu; ii) Theoretical approaches to International Security; iii) Traditional security challenges faced by nation-states and its evolution; iv) Alliance system and other responses to such challenges; v) Assessment of the level of threats imposed by these traditional security challenges.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "4402", "title": "New Security Challenges: Terrorism, Ethnic Conflicts and Human Trafficking", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Global Studies PC 2-yr", "requirements": "", "description": "This course furthers the studies of security challenges to the so-called \"Non-Traditional Security\" field which becomes more outstanding under Globalization by undermining the role of states in terms of the ability to mobilize force. Unlike another course emphasizing states as the primary actors in Global Security, this course puts more emphasis on how individuals, non-state actors and International Organizations have taken up the responsibilities to uphold the Global Order. This course puts special focus on: i) Terrorism, ii) Ethnic conflicts, and iii) other human security challenges including immigration, energy, health problems.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "4403", "title": "Political Economy of Africa", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Global Studies PC 2-yr", "requirements": "", "description": "This course examines the political economy of nation-states in the Sub-Saharan region and review how Globalization has aggravated the outstanding developmental problems. This course will cover issues such as colonialism, ethnicity, ideology, political cultures, global capitalism, and foreign interventions, in order to provide a comprehensive analysis to study the factors impeding development in Africa.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "4501", "title": "Analyzing Global Cities and Urban Space", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Global Studies PC 2-yr", "requirements": "Not for students who have taken GLBS4103.", "description": "The course is an extension of GLBS3105 Understanding Global Cities and Urban Space. It examines the extent of globalization effects that shape social, political and cultural meanings of space and place. The course is divided into two sections. The first section gives emphasis to the collective effect of globalization on everyday life in global cities. Social problems of urbanization, technological change in global cities, and mass culture of consumption are topics to be examined in this section. Political shaping of urban space use is another emphasis of this course. Both sections shall use issue-based approach to illustrate concepts covered in GLBS3105. Each lecture shall cover a collective phenomenon in the global cities. The purpose is to use an issue to illustrate the making of everyday life in global cities is a consequence of globalization. At the same time, local society and communities are remaking the global landscape of social and cultural space.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "4502", "title": "Education and Development in a Global Perspective", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Global Studies PC 2-yr", "requirements": "", "description": "This course introduces general functions and effects of education in development. The course covers and reviews main theoretical approaches in the field of education and development, such as modernization theory, human capital theory, dependency theory, liberation theory, and new institutionalist theory. Drawing on these theoretical approaches, the course further discusses collective effects of education on national development in industrialized world and developing world. At the same time, the course gives emphasis to examine educational changes and reforms that shape and reshape national educational policies across nations over time. Such organization of this course aims to invite students to think critically about the societal value of schools and schooling experiences and its relevance as a development project in both first and third world societies.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "4601", "title": "Global Capital Flows: Multinational Corporations, Global Property Market and FDI", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Global Studies PC 2-yr", "requirements": "", "description": "This course examines the major dynamic of economic globalization, global capital flows, and its impacts to the foreign direct investment, global financial market and also the Property market around the World. It also sheds light on the issue of money laundering and other financial crimes which has been accelerated, if not made possible, by Globalization. This course covers the following topics, but is not limited to, i) the Global financial order: Relationship between trade, finance and MNCs, ii) the Operation of different financial markets, e.g. Properties, Derivatives, Bonds, Stocks and FX Market; iii) an in-depth study of the financial institutions and assessment of the mode of Governance, e.g. Credit-Rating Agencies, Central Banks, BIS, G8, G20 and the Bretton Woods System; iv) Possibilities and Challenges of Global Financial Governance in the 21st Century. ", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "4602", "title": "The Rise of China in the Global Context II: Internationalization of the Chinese economy", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Global Studies PC 2-yr", "requirements": "", "description": "This is an advanced-level course which is designed mainly for students planning to enhance their understanding in the contemporary China under globalization. This course will provide a comprehensive analysis of the market transition of Chinese economy and China’s increasing role in the world economy after 1978. It covers topics including, but not limited to, i) China's strategies in promoting internationalization; ii) China and Global Economic Governance, iii) challenges and possibilities of China's internationalization strategies. Students are recommended to register this course only after having studied GLBS3106 or relevant subjects.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "4701", "title": "Selected Topics in Global Studies I", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Global Studies PC 2-yr", "requirements": "", "description": "This course conducts selected studies on some important topics in Global Studies. The topics may include issues such as globalization, global politics, economic and financial development and social and cultural evolutions. The focus of the course may vary according to the area of expertise of the instructor and the interests of the class.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "4702", "title": "Selected Topics in Global Studies II", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Global Studies PC 2-yr", "requirements": "", "description": "This course conducts selected studies on some important topics in Global Studies. The topics may include issues such as globalization, global politics, economic and financial development and social and cultural evolutions. The focus of the course may vary according to the area of expertise of the instructor and the interests of the class.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "4703", "title": "Independent Study", "career": "Undergraduate", "units": "1.00", "grading": "Graded", "components": "Independent Study", "campus": "Main Campus", "academic_group": "Global Studies PC 2-yr", "requirements": "", "description": "This course allows final-year students to carry out their own researches which are related to Global Studies. Student can integrate the skills and knowledge acquired from other classes and compiles his/her research report. It should be conducted under the supervision of teaching staff. This course is exclusively designed for students from the Global Studies Programme only.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}]