[{"code": "5010", "title": "Introduction to Programming", "career": "Postgraduate - Taught", "units": "3.00", "grading": "Graded", "components": "Lecture\nInteractive Tutorial", "campus": "Main Campus", "academic_group": "Div of Biomedical Sciences", "requirements": "For students in MSc Genomics and Bioinformatics", "description": "This course introduces computer programming to students with no previous programming experience. Students learn the fundamentals of python programming and learn how to design, implement, test, debug, and document programs. They also learn how to solve problems using object-oriented programming methodology. Most of the examples and assignments will be related to biological questions in genomics and bioinformatics.", "outcome": "After finishing this course, students should be able toa. master key programming concepts such data types, variables, conditions, loops and functions;b. understand fundamental concepts in object-oriented programming and pattern matching;c. solve small to medium size programming tasks that arise in bioinformatics; andd. write well-structured and maintainable programs in Python.", "syllabus": "Introduction to computation and programming; Flow controls: conditional and iteration; Python functions; File I/O; Lists, tuples and strings; Dictionaries and sets; Program design; algorithm complexity; recursion; Introduction to object-oriented programming; classes and inheritance; Program development with classes; Python packages; biopython; regular expressions; Working with databases in Python; UI and Web development in Python", "required_readings": "All required readings (if any) will be listed in the course outline given to students.", "recommended_readings": "All recommended readings (if any) will be listed in the course outline given to students.", "terms": {"2024-25 Term 1": {"--LEC (1860)": {"startTimes": ["13:30"], "endTimes": ["15:45"], "days": [6], "locations": ["Pi-Ch'iu Building Room 103"], "instructors": ["Dr. HUANG Yongjie"], "meetingDates": ["7/9", "14/9", "21/9", "28/9", "5/10", "12/10", "19/10", "26/10", "2/11", "9/11", "16/11", "23/11", "30/11", "7/12", "14/12"]}, "-T01-TUT (1931)": {"startTimes": ["14:30"], "endTimes": ["16:15"], "days": [5], "locations": ["Wu Ho Man Yuen Bldg 508"], "instructors": ["Dr. HUANG Yongjie"], "meetingDates": ["20/9", "4/10", "25/10", "8/11", "22/11"]}}}, "assessments": {"Examination": "65", "Homework or assignment": "20", "Project": "15"}}, {"code": "5020", "title": "Introduction to Molecular Biology and Genetics", "career": "Postgraduate - Taught", "units": "3.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Div of Biomedical Sciences", "requirements": "For students in MSc Genomics and Bioinformatics", "description": "This course introduces students to the molecular mechanisms responsible for the transmission, expression and regulation of genetic information in prokaryotic and eukaryotic organisms. Students will also learn the basic concepts of genetics including population genetics, developmental genetics and evolutionary genetics.", "outcome": "After finishing this course, students should be able toa. understand basic concepts in biomolecules and cell biology; b. know how molecular biology can explain the transmission of genetic information; andc. correlate molecular biology concepts with genetic and phenotypic traits.", "syllabus": "Introduction to Biomolecules; Basic Cell Biology; DNA and Chromatin Structure; DNA Replication, Repair and Recombination; Control of Gene Expression; Methods in Molecular Biology; Genomic Applications in Biomedical Research; Molecular Genetics of Menedelian Diseases; Molecular Genetics of Complex Diseases; Population Genetics; Evolutionary Genetics", "required_readings": "All required readings (if any) will be listed in the course outline given to students.", "recommended_readings": "All recommended readings (if any) will be listed in the course outline given to students.", "terms": {"2024-25 Term 1": {"--LEC (1873)": {"startTimes": ["16:00"], "endTimes": ["18:15"], "days": [6], "locations": ["Wu Ho Man Yuen Bldg 408"], "instructors": ["Dr. WONG Kwong Fai"], "meetingDates": ["7/9", "14/9", "21/9", "28/9", "5/10", "12/10", "19/10", "26/10", "2/11", "9/11", "16/11", "23/11", "30/11", "7/12"]}}}, "assessments": {"Examination": "70", "Homework or assignment": "30"}}, {"code": "5030", "title": "Bio-computing and Statistics", "career": "Postgraduate - Taught", "units": "3.00", "grading": "Graded", "components": "Lecture\nInteractive Tutorial", "campus": "Main Campus", "academic_group": "Div of Biomedical Sciences", "requirements": "For students in MSc Genomics and Bioinformatics", "description": "This course covers several computational technologies in bioinformatics. First, students learn the fundamentals of Linux OS and shell and learn how to accustom themselves to the Linux computing environment for routine bioinformatics tasks. Students also learn how to run and install common bioinformatics tools from the command line. In the second half of this course, students learn the basic statistical methods for bioinformatics, and how to use R to conduct statistical tests and create graphs for bioinformatics questions. Hands-on practice is provided throughout the whole course, whereas a comprehensive genomics project enhances students’ learning on the technologies above mentioned.", "outcome": "After finishing this course, students should be able toa. accustom themselves to Linux computing environment;b. acquire the usage of common bioinformatics tools; andc. employ common statistical methods for bioinformatics problems using R.", "syllabus": "Introduction to Linux computational environment; Working with Linux; Common bioinformatics tools (I);  Common bioinformatics tools (II); Common bioinformatics tools (III); Common bioinformatics tools (IV); High performance computing;  Introduction to programming with R (I); Introduction to programming with R (II); Basic statistical methods for bioinformatics (I); Basic statistical methods for bioinformatics (II); Basic statistical methods for bioinformatics (II); Introduction to machine leraning methods for bioinformatics", "required_readings": "All required readings (if any) will be listed in the course outline given to students.", "recommended_readings": "All recommended readings (if any) will be listed in the course outline given to students.", "terms": {"2024-25 Term 1": {"--LEC (1318)": {"startTimes": ["19:00"], "endTimes": ["21:30"], "days": [2], "locations": ["Wu Ho Man Yuen Bldg 306"], "instructors": ["Dr. HUANG Yongjie"], "meetingDates": ["3/9", "10/9", "24/9", "8/10", "15/10", "22/10", "29/10", "5/11", "12/11", "19/11", "26/11", "3/12", "10/12", "17/12"]}, "-T01-TUT (1932)": {"startTimes": ["14:30"], "endTimes": ["16:15"], "days": [5], "locations": ["Wu Ho Man Yuen Bldg 508"], "instructors": ["Dr. HUANG Yongjie"], "meetingDates": ["13/9", "27/9", "18/10", "1/11", "15/11", "29/11"]}}, "2024-25 Term 2": {"--LEC (3278)": {"startTimes": ["13:30"], "endTimes": ["15:45"], "days": [6], "locations": ["Wu Ho Man Yuen Bldg 508"], "instructors": ["Dr. HUANG Yongjie"], "meetingDates": ["11/1", "18/1", "25/1", "8/2", "15/2", "22/2", "1/3", "8/3", "15/3", "22/3", "29/3", "5/4", "12/4", "26/4"]}}}, "assessments": {"Examination": "55", "Homework or assignment": "30", "Project": "15"}}, {"code": "5040", "title": "Genomics: Basic Concepts and Applications", "career": "Postgraduate - Taught", "units": "3.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Div of Biomedical Sciences", "requirements": "For students in MSc Genomics and Bioinformatics", "description": "This course introduces the basic concepts of genomics. It covers the structure and organization of human genome, and the strategies that are used to map, sequence and analyze the genomes. Students learn how to make connections between genomic data and the relevant biological questions. They also learn how genomic sequence information is utilized biomedicine including pharmacogenomics, drug discovery, diagnostics and personalized medicine.", "outcome": "After finishing this course, students should be able toa. acquire the basic concept of genomics;b. learn the principle, strategies and limitations of genomic technology; andc. apply genomics to solve biological and biomedical questions.", "syllabus": "Introduction to genomics; An overview of large scale genomic projects; Genomic sequencing and data analysis; Genome assembly: a key step towards comprehensive genomic maps; Workshop I, Functional annotation of genomes (gene, mutation, and SNP, mutation profiling, cancer diagnosis, transcriptional reguation, transcriptome analysis, noncoding RNA and single cell sequencing); Medical genomics; Workshop II", "required_readings": "All required readings (if any) will be listed in the course outline given to students.", "recommended_readings": "All recommended readings (if any) will be listed in the course outline given to students.", "terms": {"2024-25 Term 1": {"--LEC (1703)": {"startTimes": ["19:00"], "endTimes": ["21:30"], "days": [4], "locations": ["Yasumoto Int'l Acad Park LT8"], "instructors": ["Professor SUN Hao"], "meetingDates": ["5/9", "12/9", "19/9", "26/9", "3/10", "10/10", "17/10", "24/10", "31/10", "7/11", "14/11", "21/11", "28/11", "5/12"]}}, "2024-25 Term 2": {"--LEC (1739)": {"startTimes": ["16:00"], "endTimes": ["18:15"], "days": [6], "locations": ["Wu Ho Man Yuen Bldg 508"], "instructors": ["Professor SUN Hao"], "meetingDates": ["11/1", "18/1", "25/1", "8/2", "15/2", "22/2", "1/3", "8/3", "15/3", "22/3", "29/3", "5/4", "12/4", "26/4"]}}}, "assessments": {"Examination": "60", "Homework or assignment": "40"}}, {"code": "5050", "title": "Theories and Algorithms in Bioinformatics", "career": "Postgraduate - Taught", "units": "3.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Div of Biomedical Sciences", "requirements": "For students in MSc Genomics and Bioinformatics", "description": "This course introduces the basic concepts underlying the theoretical basis of common bioinformatics algorithms. It covers the topics of sequence alignment, phylogeny, motifs finding, assembly, metagenomics and machine learning. Students learn these topics by attending lectures, classroom activities, and getting hands-on experience through assignments.", "outcome": "After finishing this course, students should be able toa. describe the related biological problems in mathematical terms such that they can be solved by algorithms;b. appreciate the computational ideas underlying common bioinformatics algorithms and get familiar with the corresponding software to solve the problems;c. list and explain the strengths and weaknesses of existing algorithms and interpret their results appropriately; andd. develop the ability to read and understand the scientific publications on bioinformatics in depth.", "syllabus": "Sequence Alignment and searching (Theory); Sequence Alignment and searching (Application & Practice); Molecular phylogenetics (Theory); Molecular phylogenetics (Application & Practice); Motif finding and hidden Markov model (Theory); Motif finding and hidden Markov model (Application & Practice) Part I; Motif finding and hidden Markov model (Application & Practice) Part II; Mapping of next-generation sequencing data (Theory & Application); Assembly of next-generation sequencing data (Theory & Application); Metagenomics (Theory & Practice); Machine learning in Bioinformatics (Introduction & Practice).", "required_readings": "All required readings (if any) will be listed in the course outline given to students.", "recommended_readings": "All recommended readings (if any) will be listed in the course outline given to students.", "terms": {"2024-25 Term 1": {"--LEC (4239)": {"startTimes": ["13:30"], "endTimes": ["15:45"], "days": [6], "locations": ["Wu Ho Man Yuen Bldg 301"], "instructors": ["Professor CAO Qin"], "meetingDates": ["7/9", "14/9", "21/9", "28/9", "5/10", "12/10", "19/10", "26/10", "2/11", "9/11", "16/11", "23/11", "30/11", "7/12"]}}, "2024-25 Term 2": {"--LEC (1670)": {"startTimes": ["19:00"], "endTimes": ["21:30"], "days": [2], "locations": ["Yasumoto Int'l Acad Park LT8"], "instructors": ["Professor CAO Qin"], "meetingDates": ["7/1", "14/1", "21/1", "4/2", "11/2", "18/2", "25/2", "4/3", "11/3", "18/3", "25/3", "1/4", "8/4", "15/4"]}}}, "assessments": {"Examination": "60", "Homework or assignment": "35", "Participation": "5"}}, {"code": "5060", "title": "Systems Biology", "career": "Postgraduate - Taught", "units": "3.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Div of Biomedical Sciences", "requirements": "For students in MSc Genomics and Bioinformatics", "description": "This course introduces how systems biology combines molecular biology and genomics with physical chemistry and mathematical modeling to analyze and model biological systems. Students will learn a broad range of modeling methods relevant to systems and computational biology and apply them in several practical biological networks such as transcriptional regulatory networks, cell signaling networks, and metabolic networks.", "outcome": "After finishing this course, students should be able toa. explain the importance of studying biological systems as a whole;b. illustrate common methods of modeling biological systems;c. simulate system dynamics that respond to input signals;d. describe the roles and behavior of regulatory network motifs;e. calculate biological network properties using graph theory;f. reconstruct regulatory networks using high-throughput data; andg. apply appropriate methods to model and analyze specific biological systems. ", "syllabus": "Introduction to Systems Biology; Computational approaches for systems biology (I); Computational approaches for systems biology (II); Computational approaches for systems biology (III); Transcriptional networks and network motifs (I); Transcriptional networks and network motifs (II); Signal transduction networks; Metabolic networks; Networks analysis in systems biology (I); Cytoscape workshop; Network analysis in systems biology (II); Network analysis in systems biology (III)", "required_readings": "All required readings (if any) will be listed in the course outline given to students.", "recommended_readings": "All recommended readings (if any) will be listed in the course outline given to students.", "terms": {"2024-25 Term 1": {"--LEC (2076)": {"startTimes": ["16:00"], "endTimes": ["18:15"], "days": [6], "locations": ["Wu Ho Man Yuen Bldg 301"], "instructors": ["Dr. HUANG Yongjie, \n\nProfessor SUNG Wing Kin"], "meetingDates": ["7/9", "14/9", "21/9", "28/9", "5/10", "12/10", "19/10", "26/10", "2/11", "9/11", "16/11", "23/11", "30/11", "7/12", "14/12"]}}, "2024-25 Term 2": {"--LEC (1479)": {"startTimes": ["19:00"], "endTimes": ["21:30"], "days": [4], "locations": ["Wu Ho Man Yuen Bldg 304"], "instructors": ["Dr. HUANG Yongjie, \n\nProfessor SUNG Wing Kin"], "meetingDates": ["9/1", "16/1", "23/1", "6/2", "13/2", "20/2", "27/2", "6/3", "13/3", "20/3", "27/3", "3/4", "10/4", "17/4"]}}}, "assessments": {"Examination": "55", "Homework or assignment": "30", "Presentation": "15"}}, {"code": "5070", "title": "Genome Informatics", "career": "Postgraduate - Taught", "units": "3.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Div of Biomedical Sciences", "requirements": "For students in MSc Genomics and Bioinformatics", "description": "This course provides a comprehensive introduction to the field of genome informatics. Students will gain knowledge about various aspects of genomics studies, including reference genome studies, population genomic studies, and applications of genomics. The course covers both the fundamental concepts and the latest advancements in each of these categories. In addition to theoretical lectures, students will have the opportunity to engage in hands-on practice using relevant tools. This practical experience will enhance their understanding of genomics and bioinformatics, allowing them to apply their knowledge effectively.", "outcome": "After finishing this course, students should be able toa. understand the fundamental principles and pipelines involved in sequencing and genomic studies;b. stay updated with the latest advancements and progress in the field of genomic studies;c. acquire the skills to analyze second-generation sequencing data;d. gain proficiency in utilizing and applying various bioinformatics tools; ande. develop the ability to independently conduct a genomic study. ", "syllabus": "Overview of genome informatics; Sequencing to provide genome information; Genome assembly to obtain the reference genome; Reference genome based studies; Hands-on study on genome assembly; Resequencing to identify genomic variations; Genomic variation based studies; Transcriptome studies; Hands-on study on resequencing analysis; Using genome sequencing as a tool for other research; Using genome sequencing as a tool for applications; Summary of genome informatics", "required_readings": "All required readings (if any) will be listed in the course outline given to students.", "recommended_readings": "All recommended readings (if any) will be listed in the course outline given to students.", "terms": {"2024-25 Term 2": {"--LEC (1668)": {"startTimes": ["13:30"], "endTimes": ["18:15"], "days": [6], "locations": ["Wu Ho Man Yuen Bldg 408"], "instructors": ["Professor LIU Xin"], "meetingDates": ["11/1", "18/1", "25/1", "8/2", "15/2", "22/2", "1/3", "8/3", "15/3", "22/3", "29/3", "5/4", "12/4", "26/4"]}}}, "assessments": {"Examination": "55", "Homework or assignment": "45"}}, {"code": "6010", "title": "Research Project", "career": "Postgraduate - Taught", "units": "3.00", "grading": "Graded", "components": "Project", "campus": "Main Campus", "academic_group": "Div of Biomedical Sciences", "requirements": "For students in MSc Genomics and Bioinformatics", "description": "Students are required to conduct a research project on a current topic in genomics and bioinformatics under the research supervisors at the Chinese University of Hong Kong. This course gives students an insight into how research is carried out in the fields of bioinformatics, with selected research techniques and data analysis approaches. It will give students the opportunity to develop and enhance their analytical and organizational skills through hands-on research and the opportunity to develop their ability to work independently. This course also provides practice in writing project reports and presenting scientific findings.", "outcome": "After finishing this course, students should be able to a. design the strategy and methodology to solve a research question;  b. conduct experiments by implementing the research plan; c. interpret and integrate experimental results to answer the research question; and d. present the research finding in the format of a written report and an oral presentation.", "syllabus": "Each student is required to conduct a research project, submit a research proposal and a final report, and also give an oral presentation. Students and supervisors are matched subject to the mutual agreement.", "required_readings": "All required readings (if any) will be listed in the course outline given to students.", "recommended_readings": "All recommended readings (if any) will be listed in the course outline given to students.", "assessments": {"Essays": "15", "Presentation": "25", "Participation": "25", "Report": "35"}}]