[{"code": "3111", "title": "Ageing, Health and Society", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "Classwork\nLecture\nWeb-enhanced Teaching", "campus": "Main Campus", "academic_group": "JC Sch of Pub Health Prim Care", "requirements": "", "description": "The aim of this course is to provide students with a basic understanding of population ageing from the bio-physiological and sociological perspectives. It focuses on the development of a multi-dimensional understanding of the factors that affect the health of older adults and the ways that socio-demographic changes shape societal attitudes towards old age. Emphasis is placed on discussions of the impact of population ageing on the social and health care needs of a society.", "outcome": "After completing this course, students should be able to:  1. Analyze the global trends of population ageing and their impact on health care, social and economic issues in society. 2. Develop theoretical understandings in the societal changes in ageing. 3. Justify the social construction of \"age\" and \"ageing process\" in individual and social contexts. 4. Synthesize the impact of population ageing on health and social care needs in society.", "syllabus": "1. Global trends of population ageing. 2. Ageing theories. 3. Gender issues in old age. 4. Health patterning among older adults. 5. Changing roles and relationships over life course. 6. Social construction of being old. 7. Ageing and medicalization. 8. Ethical and social dilemma in care for older adults. 9. Ageing and health policy. 10. Impact of population ageing on health and social care in society.", "required_readings": "Please refer to course outline.", "recommended_readings": "Binstock, R. H., & George, L. K. (Eds.). (2011). Handbook of aging and the social sciences. (7th ed.). Boston: Elsevier/Academic Press. Dannefer, D., & Phillipson, C. (2010). The SAGE handbook of social gerontology. London: SAGE. Hooyman, N. R., & Kiyak, H. A. (2011). Social gerontology: A multidisciplinary perspective. Boston, MA: Allyn & Bacon. Gratton, L., & Scott, A. (2016). The 100-year life. London: Bloomsbury. Higgs, P., & Gilleard, C. (2015). Rethinking old age: Theorising the fourth age. London: Palgrave. Hyde, M., & Higgs, P. (2016). Ageing and globalization. Bristol: Policy Press. Hillier, S. M., & Barrow, G. M. (2015). Aging, the individual, and society. Stamford, CT: Cengage Learning. Phillipson, C. (2013). Ageing. Cambridge: Polity Press. Phillips, J. E., Ajrouch, K., & Hillcoat-Nallétamby, S. (Eds.). (2010). Key concepts in social gerontology. Los Angeles: SAGE. Settersten, R.A. Jr., & Angel, J.L. (2011). (Eds.), Handbook of sociology of aging. New York: Springer Verlag.", "terms": {"2023-24 Term 2": {"--LEC (5922)": {"startTimes": ["9:30"], "endTimes": ["12:15"], "days": [3], "locations": ["William M W Mong Eng Bldg 706"], "instructors": ["Dr. WANG Jingxuan"], "meetingDates": ["10/1", "17/1", "24/1", "31/1", "7/2", "21/2", "28/2", "13/3", "20/3", "27/3", "3/4", "10/4", "17/4"]}}}, "assessments": {"Homework or assignment": "80", "Presentation": "20"}}, {"code": "3112", "title": "Basic Care in Gerontology", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "Field Studies/Field-trip\nLaboratory\nLecture\nOthers\nInteractive Tutorial\nWeb-enhanced Teaching", "campus": "Main Campus", "academic_group": "JC Sch of Pub Health Prim Care", "requirements": "", "description": "The aim of this course is to equip students with foundational knowledge and essential skills to address the basic care needs of older people. Emphasis is placed on promoting an understanding of the basic principles of care to help older people to meet their basic life needs. Fundamental concepts such as nutrition, exercise, oral care, basic hygiene care, foot and nail care, communication, and psychosocial care are also covered.", "outcome": "After completing this course, students should be able to:  1. Explain the purposes and content of various geriatric assessment tools. 2. Demonstrate the ability to conduct comprehensive assessment to determine the biopsychosocial needs and conditions of the older people and their families. 3. Formulate individualized care plan and deliver client education for the older people and their families. 4. Describe the principles and demonstrate the ability to perform basic skills for providing care to older people safely and effectively. 5. Discuss the special issues relating to the provision of basic care to older people. The issues include infection control, occupational safety, promotion of independence, advanced and assisted technologies, and interprofessional practice. 6. Develop an awareness of providing current, innovative and evidence-based care through the application of relevant research findings, and lead innovation in aged care.", "syllabus": "1. Methods of conducting a comprehensive assessment to identify basic care needs of older people. The content includes vital signs monitoring, blood glucose monitoring, skin inspection, assessment of activities of daily living (ADL) and cognitive and mood assessment, that reflect the body's physiologic status. 2. Risk assessment for common physical and psychosocial problems in older people, such as constipation, fall, depression and social isolation, and the associated preventive measures. 3. Principles and skills commonly adopted in care delivery to address the basic needs of older people, including skin care, oral care, basic hygiene care, foot and nail care, sleep hygiene, nutrition and mobility. 4. Knowledge and skills in supporting healthcare professionals to deliver complex geriatric medical and nursing care. 5. Special issues relating to the provision of basic care to older people. These issues include infection control, occupational safety, promotion of independence, first aid, advanced and assisted technologies.", "required_readings": "Please refer to course outline.", "recommended_readings": "Boltz, M., Ebrary, Inc, ProQuest, & ProQuest CSA. (2016). Evidence-based Geriatric Nursing Protocols for Best Practice [electronic Resource]. Carter, P. J. (2017). Lippincott's essentials for nursing assistants: A humanistic approach to caregiving (4th ed.). Philadelphia: Wolters Kluwe. Keady, J., & Watts, S. (2011). Mental health and later life: Delivering a holistic model for practice. New York, NY: Routledge. Kydd, A., Duffy, T., & Duffy F. J. R. (Eds.) (2009). The care and wellbeing of older people: A textbook for health care students. Exeter, Devon: Reflect Press. Miller, C. A. (2015). Nursing for wellness in older adults (7th ed.). Philadelphia: Wolters Kluwer. Touhy, T.A., & Jett, K.F. (2018). Ebersole and Hess' gerontological nursing and healthy aging (5th ed.). St. Louis, Missouri: Elsevier.", "terms": {"2023-24 Term 1": {"--LEC (8559)": {"startTimes": ["15:30"], "endTimes": ["17:15"], "days": [2], "locations": ["Basic Med Sci Bldg Rm1"], "instructors": ["Mr. CHIU Cheuk Pong"], "meetingDates": ["5/9", "12/9", "19/9", "26/9", "3/10", "10/10", "17/10", "24/10", "31/10", "7/11", "14/11", "21/11", "28/11"]}, "-L01-LAB (6151)": {"startTimes": ["13:30"], "endTimes": ["15:15"], "days": [3], "locations": ["TBA"], "instructors": ["Mr. CHIU Cheuk Pong"], "meetingDates": ["6/9", "13/9", "20/9", "27/9", "4/10", "11/10", "18/10", "25/10", "1/11", "8/11", "15/11", "22/11", "29/11"]}, "-L02-LAB (6152)": {"startTimes": ["15:30"], "endTimes": ["17:15"], "days": [3], "locations": ["TBA"], "instructors": ["Mr. CHIU Cheuk Pong"], "meetingDates": ["6/9", "13/9", "20/9", "27/9", "4/10", "11/10", "18/10", "25/10", "1/11", "8/11", "15/11", "22/11", "29/11"]}}}}, {"code": "3113", "title": "Promoting Successful Ageing: Individual and Societal Perspectives", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "Lecture\nInteractive Tutorial\nVisit", "campus": "Main Campus", "academic_group": "JC Sch of Pub Health Prim Care", "requirements": "", "description": "The aim of this course is to provide students with a comprehensive overview of the concepts, principles and theories of successful ageing from the health and social perspectives. Emphasis is placed on exploring and discussing the subjective and objective dimensions of successful ageing, the modifiable factors affecting the achievement of successful ageing, and the strategies to promote successful ageing at both individual and societal levels.", "outcome": "After completing this course, students should be able to:  1. Describe the different terminologies and definitions of successful ageing. 2. Describe the concepts and principles of successful ageing from a theoretical perspective and a lay perspective. 3. Discuss the attributes representing successful ageing from both subjective and objective dimensions. 4. Discuss how successful ageing is related to the adaptation of physical, psychosocial and cognitive changes in later life. 5. Discuss how successful ageing is related to social change and the social environment. 6. Discuss the strategies to promote successful ageing at individual, family and societal levels. 7. Discuss the concepts and strategies to build an age-friendly community.", "syllabus": "1. Concepts and principles of successful ageing 2. Biographical approaches to care in relation to successful ageing 3. Factors affecting successful ageing 4. Adapting to successful ageing 5. Promoting successful ageing 6. Concepts of age-friendly community", "required_readings": "Please refer to course outline.", "recommended_readings": "Bülow, M. H., & Söderqvist, T. (2014). Successful ageing: A historical overview and critical analysis of a successful concept. Journal of Aging Studies, 31, 139–149. Cheng, S. T., Chi, I., Fung, H. H., Li, L. W. & Woo, J (Eds.). (2015). Successful Aging: Asian Perspectives. Dordrecht: Springer Netherlands: Imprint: Springer. [eBook] Ferraro, K. F., & Wilmoth, J. M. (2013). Gerontology: Perspectives and Issues (4th ed.). New York: Springer Publishing Company. [eBook] Fillit, H. M., Rockwood, K., & Young, J. (2017). Brocklehurst's textbook of geriatric medicine and gerontology (8th ed.). Philadelphia: Saunders/Elsevier. [eBook] Iecovich, E. (2014). Aging in place: From theory to practice. Anthropological Notebooks, 20(1), 21–33. Janssen, B., Janssen, T., & Van Regenmortel, T. (2011). Identifying sources of strength: Resilience from the perspective of older people receiving long-term community care. European Journal of Ageing, 8(3), 145-156. doi:10.1007/s10433-011-0190-8 Li, C., Lin, C., Lin, W., Liu, C., Chang, C., Meng, N., Lin, C. (2014). Successful aging defined by health- related quality of life and its determinants in community-dwelling elders. BMC Public Health, 14(1), 1013-1013. doi:10.1186/1471-2458-14-1013 Lowry, K., Vallejo, A., & Studenski, S. A. (2012). Successful aging as a continuum of functional independence: Lessons from physical disability models of aging. Aging and Disease, 3(1), 5–15. Moody, H. R., & Sasser, J. R. (2018). Aging: Concepts and controversies (9th ed.). Thousand Oaks, California: SAGE Publications, Inc. Pfeiffer, E. (2013). Winning strategies for successful aging. New Haven Conn.: Yale University Press. Rowe, J. W., & Kahn, R. L. (2015). Successful aging 2.0: conceptual expansions for the 21st century. Journals of Gerontology, Series B: Psychological Sciences and Social Sciences, 70(4), 593–596. Woo, J. (2013). Aging in Hong Kong: A Comparative Perspective. Boston, MA: Springer.", "terms": {"2023-24 Term 2": {"--LEC (8963)": {"startTimes": ["14:30"], "endTimes": ["17:15"], "days": [1], "locations": ["Mong Man Wai Bldg 715"], "instructors": ["Dr. YEK Po Loi"], "meetingDates": ["8/1", "15/1", "22/1", "29/1", "5/2", "19/2", "26/2", "11/3", "18/3", "25/3", "8/4", "15/4"]}}}, "assessments": {"Homework or assignment": "60", "Presentation": "40"}}, {"code": "3114", "title": "Psychology in Ageing: Theories and Application", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "JC Sch of Pub Health Prim Care", "requirements": "", "description": "The aim of this course is to provide students with a basic understanding of the concepts and theoretical approaches of psychology relevant to ageing and aged care in various care settings. Emphasis is placed on the application of these concepts to understand individual and group behaviour and the health and social care needs of individuals and groups.", "outcome": "After completing this course, students should be able to:  1. Discuss the psychological changes throughout the lifespan. 2. Demonstrate understanding of the influence of motivation, emotion, learning, memory and personality on individual and group behaviour of older people in various health and social care settings. 3. Discuss the purposes and approaches of enhancing psychological well-being in older people. 4. Discuss the common major life events and challenges among older people and integrate psychological theories to explain the impact on psychological well-being. 5. Identify interventions to promote psychological adaptation to ageing. 6. Demonstrate effective communication and basic counseling skills in the care of older people.", "syllabus": "1. Introduction to theories of psychosocial functions: motivation and emotion, stress and coping. 2. Psychological changes throughout the lifespan, and the common psychological problems and psychological therapies. 3. The effects of learning, memory and personality on the behaviour of older population in various health and social care settings. 4. Methods, approaches and challenges to assess psychological well-being of older people. 5. Understanding the major events in later life and helping older people to cope with grief and loss. 6. Health psychology for older people. 7. Promoting psychosocial well-being in older people. 8. Understanding the psychological aspects of pain. 9. Culture, communication and counseling skills in aged care.", "required_readings": "Stuart-Hamiliton, I. (2012). Psychology of ageing: An introduction (5th ed.). Philadelphia: Jessica Kingsley Publishers.", "recommended_readings": "Schaie, K. W., & Will, S. L. (2015). Handbook of psychology of aging. London: Elsevier.", "terms": {"2023-24 Term 2": {"--LEC (7362)": {"startTimes": ["14:30"], "endTimes": ["17:15"], "days": [4], "locations": ["Mong Man Wai Bldg 715"], "instructors": ["Dr. YEK Po Loi"], "meetingDates": ["11/1", "18/1", "25/1", "1/2", "8/2", "22/2", "29/2", "14/3", "21/3", "28/3", "11/4", "18/4"]}}}, "assessments": {"Examination": "80", "Others": "20"}}, {"code": "3211", "title": "Chronic Disease Management in Ageing", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "Field Studies/Field-trip\nLaboratory\nLecture\nInteractive Tutorial", "campus": "Main Campus", "academic_group": "JC Sch of Pub Health Prim Care", "requirements": "", "description": "This course comprises both theoretical and practical components to enhance students’ understanding of the complexities of caring for older people with major chronic diseases. It takes an interdisciplinary approach to chronic disease management from the health and social perspectives. Emphasis is placed on the care designed to directly address the physical and psychosocial consequences of chronic disease for older people and their caregivers.", "outcome": "After completing this course, students should be able to:  1. Discuss the physical and psychosocial impacts of chronic diseases on older people.  2. Identify the roles of different healthcare disciplines in managing major chronic diseases in older people.  3. Identify the issues relating to pharmaceutical care in older people.  4. Understand the concepts of multiple morbidity and comorbidity and their implications for long-term care.  5. Discuss the self-care models for chronic disease management and strategies to empower older people managing their diseases.  6. Discuss the types and roles of community resources in supporting older people living with chronic conditions.  7. Define quality of life and justify the interventions for promoting positive adjustment in older people with chronic diseases.  8. Apply related principles and utilise research findings in the care of older people with chronic diseases.  9. Discuss the role of complementary and alternative medicine in chronic disease management.  10. Demonstrate the ability to offer psychosocial support and interventions in caring for older people experiencing chronic diseases and their families.", "syllabus": "1. Major chronic diseases among older people: prevalence, etiology and clinical manifestations.  2. The impacts of major chronic diseases on physical and psychosocial health of older people.  3. The roles of different healthcare disciplines in chronic disease management.  4. Special considerations for supporting pharmaceutical care in older people.  5. The changing patterns of disease and illness.  6. Biographical disruption regarding on chronic illness.  7. Help-seeking and responses to treatment.  8. The concepts of multiple morbidity and comorbidity and their implications for long-term care.  9. Conceptual models to explain self-care and patient empowerment strategies.  10. Introduction to innovative models of chronic disease management.  11. The role and trend towards integrating complementary and alternative medicine in chronic disease management.  12. The concept of quality of life and interventions for promoting positive adjustment in older people with chronic diseases.", "required_readings": "Please refer to course outline.", "recommended_readings": "Cash, J. C., & Glass, C. A. (Eds). (2016). Adult-gerontology practice guidelines. New York, NY: Springer Publishing Company.  Dahlkemper, T. R., & Anderson, M. A. (2016). Caring for older adults holistically (6th ed.). Philadelphia, PA: F.A. Davis Company.  Farooqui, T., & Farooqui, A. A. (Eds.). (2015). Diet and exercise in cognitive function and neurological diseases. New Jersey: Wiley Blackwell.  Grassman, E. J., & Whitaker, A. (Eds). (2013). Ageing with disability. A lifecourse perspective. Chicago, IL: Policy Press.  Haber, D. (2016). Health promotion and aging. Practical applications for health professionals (7th ed.). New York: Springer Publishing Company.  Hirth, V., Wieland, D., & Dever-Bumba, M. (2011). Case-based geriatrics. A global approach. New York: McGraw Hill Companies, Inc.  Hooyman, N. R., & Kiyak, H. A. (2011). Social gerontology. A multidisciplinary perspective. (9th ed.). New York: Allyn and Bacon.  Kogan, M. (Ed.). (2018). Integrative geriatric medicine. New York: Oxford University Press.  Kane, R. L., Ouslander, J. G., Resnick, B., & Malone, M. L. (Eds.). (2018). Essentials of clinical geriatrics (8th ed.). New York: McGraw-Hill Education.  Larsen, P. D. (Ed.). (2016). Lubkin's chronic illness: Impact and intervention (9th ed.). Burlington, MA: Jones and Bartlett Learning.  Malone, M. L., Capezuti, E. A., & Palmer, R. M. (Eds). (2015). Geriatrics models of care: Bringing 'best practice' to an aging America. Cham, Switzerland: Springer International Publishing.  McEvoy, P. J. (2014). Chronic disease management: A new paradigm for care. New York, N. Y.: Radcliffe Publishing.", "terms": {"2023-24 Term 1": {"--LEC (8560)": {"startTimes": ["14:30"], "endTimes": ["17:15"], "days": [1], "locations": ["Basic Med Sci Bldg LT"], "instructors": ["Mr. CHIU Cheuk Pong"], "meetingDates": ["4/9", "11/9", "18/9", "25/9", "9/10", "16/10", "30/10", "6/11", "13/11", "20/11", "27/11"]}}}, "assessments": {"Essay test or exam": "80", "Short answer test or exam": "20"}}, {"code": "3213", "title": "Dementia: Prevention and Management", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "Lecture\nInteractive Tutorial\nVisit", "campus": "Main Campus", "academic_group": "JC Sch of Pub Health Prim Care", "requirements": "", "description": "The aim of this course is to provide students with a comprehensive overview of the pathophysiological, behavioural and psychosocial aspects of dementia. Emphasis is placed on equipping students with the knowledge and skills required to prevent, detect and manage dementia in older people. The course also highlights the roles of family caregivers, multidisciplinary care team, and community care services in managing dementia.", "outcome": "After completing this course, students should be able to:  1. Describe the etiologies, pathophysiologies, risk factors, types, and stages of dementia.  2. Describe the comprehensive health and social assessment for dementia.  3. Discuss the physical, cognitive, behavioural and psychosocial manifestations of dementia and the patients' care needs.  4. Describe the pharmacological and non-pharmacological interventions for dementia.  5. Discuss the evidence-based care in managing dementia in community, rehabilitative and long-term care settings.  6. Describe the role of assistive technology in dementia care and drive innovation in practice.  7. Discuss the interventions to maintain and promote brain health.  8. Discuss the role of interprofessional team approach in the care of older people with dementia and their caregivers and families.  9. Discuss the role of informal caregivers in the care of older people with dementia.  10. Discuss the role of health and social care services in the care of older people with dementia.", "syllabus": "1. Overview of dementia: Definition, types, pathophysiology, risk factors, diagnosis, staging, pharmacological management and promoting brain health.  2. Sociological understanding of dementia.  3. Comprehensive health and social assessment for dementia.  4. Manifestations of dementia: physical, behavioural and psychosocial perspectives.  5. Communication with dementia clients.  6. Managing challenging behaviours.  7. Non-pharmacological interventions for dementia: Cognitive interventions for people with dementia; Practice sharing by music therapist and horticulture therapist.  8. Evidence-based research in dementia: Quantitative and qualitative approach.  9. Use of assistive technology in dementia care.  10. Interprofessional team approach in the care of older people with dementia and their caregivers and families: Community and social care services.  11. Advanced care planning for clients with dementia.  12. Tour visit to community care services for dementia.", "required_readings": "Please refer to course outline.", "recommended_readings": "Agronin, M. E. (2014). Alzheimer's disease and other dementias: A practical guide (3rd ed.). New York: Routledge.  Budson, A. E., & Solomon, P. R. (2016). Memory loss: A practical guide for clinicians (2nd ed.). Edinburgh: Elsevier Saunders.  De Waal, H. (2013). Designing and delivering dementia services. Chichester, West Sussex: Wiley-Blackwell.  Devi, G. (2017). The Spectrum of Hope: An Optimistic and New Approach to Alzheimer's Disease and Other Dementias. New York: Workman Publishing Company.  Downs, M., & Bower, B. (Eds.) (2014). Excellence in dementia care [electronic resource]: Research into practice (2nd ed.). Maidenhead: Open University Press.  Goode, B., & Booth, G. (2012). Dementia care: A care worker handbook. London: Hodder Education.  Hayes, J., Povey, S., & McNiff, S. (2011). The Creative Arts in Dementia Care: Practical Person-centred Approaches and Ideas. London: Jessica Kingsley Publishers.  James, J., Cotton, B., Freyne, R., Gilby, L., Knight, J., Pettit, J., & Tommy Dunne, T. (2017). Excellent Dementia Care in Hospitals: A Guide to Supporting People with Dementia and Their Carers. London: Jessica Kingsley Publishers.  Jenkins, C., Ginesi, L., & Keenan, B. (2016). Dementia Care at a Glance. England: Wiley-Blackwell.  Jewell, A. (2011). Spirituality and personhood in dementia. London; Philadelphia: Jessica Kingsley Publishers.  Killick, J., & Craig, C. (2011). Creativity and Communication in Persons with Dementia. London: Jessica Kingsley Publishers.  Krishnamoorthy, E. S., Prince, M. J., & Cummings, J. L. (Eds.) (2010). Dementia: A global approach. Cambridge, UK: New York: Cambridge University Press.  Lee, H., & Adams, T. (2011). Creative approaches in dementia care. New York: Palgrave Macmillan.  May, H., Edwards, P., & Brooker, D. (2009). Enriched care planning for people with dementia: A good practice guide for delivering person-centred dementia care. London: Jessica Kingsley Publishers.  Moniz-Cook, E., & Manthorpe, J. (2009). Early psychosocial interventions in dementia: Evidence-based practice. Philadelphia: Jessica Kingsley Publishers.  Power, G., & Taylor, R. (2014). Dementia beyond disease: Enhancing well-being. Baltimore: Health Professions Press.  Pulsford, D., & Thompson, R. (2013). Dementia: Support for family and friends. Philadelphia: Jessica Kingsley Publishers.  Scharre, D. W. (2011). Long-term management of dementia. London: Informa Healthcare.  Sawatsky, J. (2017). Dancing with elephants: Mindfulness training for those living with dementia, chronic illness or an aging brain. Toronto: Red Canoe Press.  Waite, J. (Eds.) (2009). Dementia care: A practical manual. Oxford: Oxford University Press.  World Health Organization (2012). Dementia a public health priority. Geneva: World Health Organization.  Wu, J. (2011). Early Detection and Rehabilitation Technologies for Dementia. Neuroscience and Biomedical Applications. Hershey, Pa: IGI Global.  Yu, R. (Eds.) (2010). Dementia trends: Impact of the ageing population and societal implications for Hong Kong. Hong Kong: The Hong Kong Jockey Club.  香港中文大學那打素護理學院流金頌培訓計劃. (2013). 腦退化症患者照顧手册. 香港: 香港賽馬會. 賴錦玉. (2010). 預防老年痴呆症患者走失及走失後處理. 香港: 香港老年痴呆症協會. 香港心理衛生會. (2010). 愛在晚晴時: 失智症照顧者指南. 香港: 零至壹出版有限公司. 香港復康會社區網絡. (2009). 誰能明白我─痴呆症早期病患者心聲集 . 香港: 香港復康會社區網絡.", "terms": {"2023-24 Term 2": {"--LEC (5940)": {"startTimes": ["14:30"], "endTimes": ["17:15"], "days": [3], "locations": ["Basic Med Sci Bldg Rm2"], "instructors": ["Mr. CHIU Cheuk Pong"], "meetingDates": ["10/1", "17/1", "24/1", "31/1", "7/2", "21/2", "28/2", "13/3", "20/3", "27/3", "3/4", "10/4", "17/4"]}}}, "assessments": {"Essays": "50", "Presentation": "50"}}, {"code": "3214", "title": "Ethical and Financial Issues in Ageing", "career": "Undergraduate", "units": "1.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "JC Sch of Pub Health Prim Care", "requirements": "", "description": "The aim of this course is to enhance students' understanding of the ethical issues relating to aged care. It focuses on the basic ethical principles and theories relating to gerontological practice; the ethical issues and dilemmas encountered in practice; the financial planning for older people; and the funding models for aged care services.", "outcome": "After completing this course, students should be able to:  1. Critically appraise contemporary ethical and financial issues in relation to the care and services for older people.  2. Examine local and overseas ethical guidelines and legislations relevant to the care and services for older people.  3. Compare different approaches for ethical decision-making.  4. Apply ethical principles in analyzing the care and services for older people.  5. Appreciate different viewpoints on the care and services through discussions.  6. Describe the financial planning and funding models for different aged care services and discuss the associated implications.", "syllabus": "1. Ethical considerations in the provision of care and services for older people.  2. Major ethical issues including truth telling, privacy and confidentiality, mental capacity, informed consent, best interest, human rights of the older people, euthanasia, assisted death, doctrine of double effect, guardianship, enduring power of attorney, use of restraint, abuse of older people, negligence and malpractice, professional misconduct, vicarious liability, defamation and fraud, false imprisonment, assault and battery.  3. Implications of major ethical issues in aged care practice.  4. The bioethical principles and theories and code of conduct of health care providers, and the associated implications in aged care delivery.  5. The financial planning and funding models for different aged care services and the associated implications in care delivery.", "required_readings": "Please refer to course outline.", "recommended_readings": "British Medical Association. (2009). The ethics of caring for older people (2nd ed.). Chichester, UK: Wiley-Blackwell.  Rai, G.S. (2014). Medical ethics and the elderly (4th ed.). Oxford: Radcliffe Publishing.  Wai. A (Ed.) (2016). Medical Law and Ethics in Hong Kong. Hong Kong: Thomson Reuters Hong Kong Ltd.", "terms": {"2023-24 Term 2": {"--LEC (7363)": {"startTimes": ["9:30"], "endTimes": ["11:15"], "days": [5], "locations": ["Mong Man Wai Bldg 715"], "instructors": ["Dr. YEK Po Loi"], "meetingDates": ["12/1", "19/1", "26/1", "2/2", "16/2", "23/2", "1/3", "15/3", "22/3", "5/4", "12/4", "19/4"]}}}, "assessments": {"Discussion": "40", "Essay test or exam": "60"}}, {"code": "3311", "title": "Aged Care Service Planning and Delivery Models", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "Field Studies/Field-trip\nLecture\nInteractive Tutorial\nWeb-enhanced Teaching", "campus": "Main Campus", "academic_group": "JC Sch of Pub Health Prim Care", "requirements": "", "description": "The aim of this course is to provide students with a comprehensive understanding of the principles, concepts and skills involved in planning and delivering aged care services in a variety of geriatric settings, including community, rehabilitative and residential care settings. The basic concepts covered with regard to these settings include ageing in place, social involvement and participation, integrated community-based care, home-based care delivery model, discharge planning, interdisciplinary and cross-sectoral service coordination, and the residential care home accreditation system. The course highlights the notion of health and social care partnership, and a multi-dimensional perspective is adopted to facilitate students to examine the service planning and delivery model for the provision of community, rehabilitative and residential care services to older people.", "outcome": "After completing this course, students should be able to:  1. Demonstrate an understanding of the principles, philosophies, and concepts of community, rehabilitative, and residential aged care and their relevance to older persons in a society locally and globally.  2. Understand the roles and functions of different health care and social welfare organisations in the provision of different levels of aged care services.  3. Differentiate the types of aged care services according to older persons’ level of care needs in community, rehabilitative and residential care settings.  4. Demonstrate an understanding of the concepts, significance, and methods of optimising multi-sectoral collaboration between health care, social welfare and business organisations in the delivery of community, rehabilitative and residential care.  5. Describe innovative care models for delivering community, rehabilitative, and residential care services to older persons.  6. Discuss the knowledge and skills in coordinating multi-disciplinary and inter-sectoral aged care in community, rehabilitative and residential care settings.  7. Describe innovative strategies to monitor quality and promote excellence in the provision of aged care services in community, rehabilitative and residential care settings.", "syllabus": "Major concepts and topics to be covered:  1 Health care and social welfare organisations  1.1 Types, roles and functions of community care services  1.2 Types, roles and functions of rehabilitative care services in community  1.3 Types, roles and functions of rehabilitative care services in hospital  1.4 Types, roles and functions of residential care services   2 Models of delivering aged care services  2.1 Innovative service models in community care setting  2.2 Community self-help model  2.3 Social involvement and participation  2.4 Innovative care models for delivering rehabilitative care services in community  2.5 Innovative care models for delivering rehabilitative care services for discharge planning  2.6 Innovative service models in residential care setting   3 Service planning and delivery  3.1 The principles, philosophies, and concepts of community, rehabilitative, and residential aged care: local and global scenarios  3.2 Design thinking to promote social innovation in respond to ageing population  3.3 Elder abuse: The suffering in silence  3.4 Safety planning in elder abuse-role of gerontological professionals  3.5 Integrative and innovative practices for delivering residential care services  3.6 Adjustment of older people to residential care placements   4 Multi-sectoral collaboration in aged care provisions  4.1 The concepts and strategies of coordinating multi-disciplinary and inter-sectoral aged care  4.2 Landscape of social enterprises and social entrepreneurship in respond to ageing population  4.3 Rehabilitative service delivery: physiotherapy perspectives  4.4 Rehabilitative service delivery: occupational therapy perspectives  4.5 Multi-sectoral collaboration in managing and preventing elder abuse   5 Monitoring quality and excellence in aged care services  5.1 Principles and strategies to monitor quality and promote excellence in aged care services  5.2 Quality of care and accreditation system for residential care services", "required_readings": "Please refer to course outline.", "recommended_readings": "Asthana, S. et al., (2017). Hazzard's Geriatric Medicine and Gerontology, 7e 7th ed., New York, N.Y: McGraw-Hill Education LLC.  Brody, R., & Nair, M. (2014). Effectively managing and leading human service organizations (4th ed.). Thousand Oaks, California: SAGE Publications.  Cai, F., Giles, J., O’Keefe, P., & Wong, D. (2011). The elder and old age support in rural China. World Bank Publications.  Chia, S., Healthcote, J., & Hibberd, J. (2011). Group and individual work with older people: A practical guide to running successful activity-based programmes. London; Philadelphia, PA: Jessica Kingsley.  Furman, R., & Gibelman, M. (2013). Navigating human service organizations. (3rd ed.). Chicago, Ill.: Lyceum Books.  Hall, B., & Scragg, T. (2012). Social work with older people: Approaches to person-centred practice. Maidenhead, Berkshire, England: Open University Press.  Harris, J. L., Roussel, L., Walters, S., & Dearman, C. (2011). Project planning and management: A guide for CNLs, DNPs, and nurse executives. Sudbury, MA: Jones & Bartlett Publishers.  Lewis, J. P. (2011). Project planning, scheduling & control [electronic resource]: The ultimate hands-on guide to bringing projects in on time and on budget (5th ed.). New York: McGraw-Hill.  McKenzie, J., Neiger, B., & Thackeray, R. (2013). Planning, implementing, and evaluating health promotion programs: A primer (6th ed.). Boston: Pearson.  Moyle, W., Parker, D., & Bramble, M. (2014). Care of older adults: A strengths-based approach. Port Melbourne, VIC: Cambridge University Press.", "terms": {"2023-24 Term 2": {"--LEC (5941)": {"startTimes": ["14:30"], "endTimes": ["17:15"], "days": [2], "locations": ["Y.C. Liang Hall 106"], "instructors": ["Dr. YEK Po Loi"], "meetingDates": ["9/1", "16/1", "23/1", "30/1", "6/2", "20/2", "27/2", "12/3", "19/3", "26/3", "2/4", "9/4", "16/4"]}}}, "assessments": {"Essay test or exam": "50", "Homework or assignment": "30", "Presentation": "20"}}, {"code": "3412", "title": "Innovations and Evidence-based Practice for Aged Care Services", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "JC Sch of Pub Health Prim Care", "requirements": "", "description": "This course aims to provide students with an overview of the research methods used in examining health and social care issues, and to equip them with knowledge of evidence-based practice with special reference to gerontology. The course also examines the impacts of the changing health and social care context on the delivery of aged care services, and introduces the evidence-based innovative models of aged care service delivery.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "4101", "title": "Special Topics in Gerontology I", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "JC Sch of Pub Health Prim Care", "requirements": "", "description": "Special topics having significant impacts on the advancement of public health in the lecturer's field of expertise will be covered.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "4102", "title": "Special Topics in Gerontology II", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "JC Sch of Pub Health Prim Care", "requirements": "", "description": "Special topics having significant impacts on the advancement of public health in the lecturer's field of expertise will be covered.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "4212", "title": "Death, Dying and End-of-life Care", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "JC Sch of Pub Health Prim Care", "requirements": "", "description": "This course aims to provide students with a basic understanding of the concepts and principles of end-of-life care, and to equip them with essential knowledge and skills in the provision of hospice care and advance care planning to older people with terminal illness sufferers and their families.", "outcome": "After completing this course, students should be able to:  1. Describe the trend of mortality in recent decades and the development of palliative care. 2. Define the concepts of death, end of life, self-awareness on death and dying, and discuss the stages of grief process and corresponding somatic and psychological symptoms. 3. Identify the influence of personal experience, health and socio-cultural factors on perceptions of death, dying and quality of life. 4. Develop effective communication skills in conversations concerning death and dying issues. 5. Demonstrate the ability to conduct advance care planning and evaluate its outcomes. 6. Discuss appropriate interventions for managing physical symptoms and emotional distress for clients at the end of life. 7. Devise ways for addressing psychosocial and spiritual needs for clients and their families.", "syllabus": "1. Development and principles of palliative care  a) Mortality trend in older adults b) Development of palliative care: historical perspectives, philosophies, services and resources c) Principles for delivery of end-of-life care 2. Concepts of death, dying and end-of-life a) Concepts of death, dying and end-of-life b) Grief process and symptoms c) Bereavement care and care for caregivers and relating procedures d) Factors influencing perceptions of death, dying and quality of life: personal experience, health and socio-cultural factors e) Self-awareness on death and dying 3. Communication a) Communication and basic counselling skills, care for the carer, family care and support at end stage 4. End-of-life care model, delivery and management a) End-of-life care models and advance directives b) Quality of life assessment c) Advance care planning programme and evaluation d) Management of older adults with terminal illness (I): Age-related changes, risk factors, common cancers in older adults and impacts on physical and psychological well-being e) Management of older adults with terminal illness (II): Palliative treatments, physical care, symptoms and pain management. f) Community programmes for older persons planning on death and dying g) Dying in place for older adults as a choice", "required_readings": "Please refer to course outline.", "recommended_readings": "Brinkman-Stoppelenburg, A., Rietjens, J. A., & van der Heide, A. (2014). The effects of advance care planning on end-of-life care: a systematic review. Palliative medicine, 28(8), 1000-1025. Callanan, M. (2009). Final journeys: A practical guide for bringing care and comfort at the end of life. New York: Bantam. Chan, H. Y. L. & Pang, S. M. C. (2010). Let Me Talk – an advance care planning programme for frail nursing home residents. Journal of Clinical Nursing, 19, 3073-3084.  Chan, H. Y., Yu, D. S., Leung, D. Y., Chan, A. W., & Hui, E. (2016). Quality of life and palliative care needs of elderly patients with advanced heart failure. Journal of geriatric cardiology: JGC, 13(5), 420. Corr, C. A., Corr, C., Nabe, C., & Corr, D. (2012). Death and dying life and living (7th ed.). Belmont CA: Wadsworth. Ellershaw, J., & Wilkinson, S. (2011). Care of the dying: A pathway to excellence (2nd ed.). Oxford: Oxford University Press. (E-copy) Keegan, L., & Drick, C.A. (2011). End of life: Nursing solutions for death with dignity. New York: Springer.  Kinzbrunner, B. M., & Policzer, J. S. (2011). End of life care: A practical guide (2nd ed.). New York: McGraw-Hill Medical.  Leming, M. L., & Dickinson, G. E. (2011). Understanding dying, death and bereavement (7th ed.). CA: Cengage.  Lum, H. D., Sudore, R. L., Bekelman, D. B. (2015). Advance care planning in the elderly. Medical Clinic in America, 99, 391-403. Lynn, J. (2008). Improving care for the end of life: A sourcebook for health care managers and clinicians (2nd ed.). Oxford: Oxford University Press.  Scherer, L. S. (Ed.) (2014). Death and dying. Farmington Hills: Greenhaven Press. (E-copy) Thomas, K., & Lobo, B. (Ed.) (2011). Advance care planning in end of life care. Oxford: Oxford University Press. (E-copy) Watts, J. H. (2010). Death, dying and bereavement. Edinburgh: Dunedin Academic. (E-copy)", "terms": {"2023-24 Term 2": {"--LEC (7365)": {"startTimes": ["10:30"], "endTimes": ["13:15"], "days": [2], "locations": ["Y.C. Liang Hall G06"], "instructors": ["Dr. WANG Jingxuan"], "meetingDates": ["9/1", "16/1", "23/1", "30/1", "6/2", "20/2", "27/2", "12/3", "19/3", "26/3", "2/4", "9/4", "16/4"]}}}, "assessments": {"Examination": "70", "Others": "30"}}, {"code": "4312", "title": "Gerontological Practicum", "career": "Undergraduate", "units": "9.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "JC Sch of Pub Health Prim Care", "requirements": "", "description": "The aim of this clinical practicum is to provide students with clinical practice opportunities to apply related principles, concepts and theories for planning and delivering aged care services in community, rehabilitative and residential care settings. Students are facilitated to develop their knowledge of and skills in service planning, coordination and delivery in these settings.", "outcome": "After completing this course, students should be able to:  1. Discuss the models for planning and delivering aged care services in community, rehabilitative and residential care settings. 2. Effectively communicate with older clients, their families, and health and social care team members in community, rehabilitative and residential care settings. 3. Apply the knowledge and skills of health and social sciences in ageing to identify the needs of older people and deliver high quality aged care services in community, rehabilitative and residential care settings. 4. Demonstrate an understanding of the principles and skills in coordinating multi-disciplinary care and optimizing inter-sectoral collaboration for the delivery of aged care services in community, rehabilitative and residential care settings. 5. Apply legal and ethical principles in delivering high quality aged care in community, rehabilitative and residential care settings.", "syllabus": "This clinical course facilitates development and application of knowledge and skills of health and social aged care in community, rehabilitative and residential care settings. Students are expected to discuss the service planning and delivery models adopted in these aged care settings, to demonstrate effective communication skills, to develop knowledge and skills for assessing health and social care needs, coordinating multi- disciplinary care and optimizing inter-sectoral collaboration in the delivery of aged care services, and to discuss legal and ethical issues in community aged care services.", "required_readings": "Please refer to course outline.", "recommended_readings": "Carpenito-Moyet, L. J. (2013). Nursing diagnosis: Application to clinical practice (14th ed.). Philadelphia: Lippincott Williams & Wilkins. Carter, P. J. (2010). Lippincott’s textbook for long-term care nursing assistants: A humanistic approach to caregiving. Philadelphia: Wolters Kluwer/ Lippincott Williams and Wilkins. Chadwick, R., Have, H. T., & Meslin, E. M. (Eds.). (2011). The SAGE Handbook of Health Care Ethics. London: SAGE Publication Ltd. Cox, E. O., Chapin, R., & Kelchner, E. (2014). Gerontological Social Work Practice: Issues, Challenges, and Potential. New York: Routledge. Fillit, H. M., Rockwood, K., & Young, J. (2017). Brocklehurst's textbook of geriatric medicine and gerontology (8th ed.). Philadelphia: Saunders/Elsevier. [eBook] Gopee, N., & Galloway, J. (2013). Leadership and Management in Healthcare (2nd ed.). London: SAGE Publication Ltd. Henwood, S. (Ed.). (2014). Practical Leadership in Nursing and Health Care: A Multi-Professional Approach. Boca Raton, Florida: CRC Press. Innes, A. (2009). Dementia Studies: A Social Science Perspective. London: SAGE Publication Ltd. Jett, K., & Touhy, T. A. (Eds.). (2011). Ebersole and Hess’ Towards Healthy Aging: Human Needs and Nursing Response (8th ed.). New York: Mosby. Lloyd, C. E., & Heller, T. (2012). Long-Term Conditions: Challenges in Health and Social Care. London: SAGE Publication Ltd. Lynch, R. (2014). Social work practice with older people: A positive person-centred approach. London: SAGE. Stuart-Hamilton, I. (Ed.). (2011). An introduction to gerontology. New York: Cambridge University Press. Wold, G. H. (2011). Basic Geriatric Nursing (5th ed.). New York: Mosby.", "terms": {"2023-24 Term 1": {"--LEC (4652)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["No Room Required"], "instructors": ["Dr. YEK Po Loi"], "meetingDates": ["04/09/2023 - 27/11/2023"]}}}, "assessments": {"Others": "50", "Presentation": "25", "Report": "25"}}, {"code": "4411", "title": "Health and Social Care Policy in Ageing", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "JC Sch of Pub Health Prim Care", "requirements": "", "description": "The aim of this course is to provide students with a comprehensive understanding of policy issues relating to health and social care needs of older people. The course also examines the operation of health care and social care systems to further students' understanding of the planning and delivery of aged care services for older people.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}]