[{"code": "3111", "title": "Ageing, Health and Society", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "Classwork\nLecture\nWeb-enhanced Teaching", "campus": "Main Campus", "academic_group": "JC Sch of Pub Health Prim Care", "requirements": "", "description": "The aim of this course is to provide students with a basic understanding of population ageing from the bio-physiological and sociological perspectives. It focuses on the development of a multi-dimensional understanding of the factors that affect the health of older adults and the ways that socio-demographic changes shape societal attitudes towards old age. Emphasis is placed on discussions of the impact of population ageing on the social and health care needs of a society.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "3112", "title": "Basic Care in Gerontology", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "Field Studies/Field-trip\nLaboratory\nLecture\nOthers\nInteractive Tutorial\nWeb-enhanced Teaching", "campus": "Main Campus", "academic_group": "JC Sch of Pub Health Prim Care", "requirements": "", "description": "The aim of this course is to equip students with foundational knowledge and essential skills to address the basic care needs of older people. Emphasis is placed on promoting an understanding of the basic principles of care to help older people to meet their basic life needs. Fundamental concepts such as nutrition, exercise, oral care, basic hygiene care, foot and nail care, communication, and psychosocial care are also covered.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "3113", "title": "Promoting Successful Ageing: Individual and Societal Perspectives", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "Lecture\nInteractive Tutorial\nVisit", "campus": "Main Campus", "academic_group": "JC Sch of Pub Health Prim Care", "requirements": "", "description": "The aim of this course is to provide students with a comprehensive overview of the concepts, principles and theories of successful ageing from the health and social perspectives. Emphasis is placed on exploring and discussing the subjective and objective dimensions of successful ageing, the modifiable factors affecting the achievement of successful ageing, and the strategies to promote successful ageing at both individual and societal levels.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "3211", "title": "Chronic Disease Management in Ageing", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "Field Studies/Field-trip\nLaboratory\nLecture\nInteractive Tutorial", "campus": "Main Campus", "academic_group": "JC Sch of Pub Health Prim Care", "requirements": "", "description": "This course comprises both theoretical and practical components to enhance students’ understanding of the complexities of caring for older people with major chronic diseases. It takes an interdisciplinary approach to chronic disease management from the health and social perspectives. Emphasis is placed on the care designed to directly address the physical and psychosocial consequences of chronic disease for older people and their caregivers.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "3213", "title": "Dementia: Prevention and Management", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "Lecture\nInteractive Tutorial\nVisit", "campus": "Main Campus", "academic_group": "JC Sch of Pub Health Prim Care", "requirements": "", "description": "The aim of this course is to provide students with a comprehensive overview of the pathophysiological, behavioural and psychosocial aspects of dementia. Emphasis is placed on equipping students with the knowledge and skills required to prevent, detect and manage dementia in older people. The course also highlights the roles of family caregivers, multidisciplinary care team, and community care services in managing dementia.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "3311", "title": "Aged Care Service Planning and Delivery Models", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "Field Studies/Field-trip\nLecture\nInteractive Tutorial\nWeb-enhanced Teaching", "campus": "Main Campus", "academic_group": "JC Sch of Pub Health Prim Care", "requirements": "", "description": "The aim of this course is to provide students with a comprehensive understanding of the principles, concepts and skills involved in planning and delivering aged care services in a variety of geriatric settings, including community, rehabilitative and residential care settings. The basic concepts covered with regard to these settings include ageing in place, social involvement and participation, integrated community-based care, home-based care delivery model, discharge planning, interdisciplinary and cross-sectoral service coordination, and the residential care home accreditation system. The course highlights the notion of health and social care partnership, and a multi-dimensional perspective is adopted to facilitate students to examine the service planning and delivery model for the provision of community, rehabilitative and residential care services to older people.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "3412", "title": "Innovations and Evidence-based Practice for Aged Care Services", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "JC Sch of Pub Health Prim Care", "requirements": "", "description": "This course aims to provide students with an overview of the research methods used in examining health and social care issues, and to equip them with knowledge of evidence-based practice with special reference to gerontology. The course also examines the impacts of the changing health and social care context on the delivery of aged care services, and introduces the evidence-based innovative models of aged care service delivery.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}]