[{"code": "3111", "title": "Ageing, Health and Society", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "Classwork\nLecture\nWeb-enhanced Teaching", "campus": "Main Campus", "academic_group": "JC Sch of Pub Health Prim Care", "requirements": "", "description": "The aim of this course is to provide students with a basic understanding of population ageing from the sociological perspectives. It focuses on the development of a multi-dimensional understanding of the factors that affect the health of older adults and the ways that socio-demographic changes shape societal attitudes towards old age. Emphasis is placed on discussions of the impact of population ageing on the social and health care needs of a society.", "outcome": "After completing this course, students should be able to:  1. Analyze the global trends of population ageing and their impact on health care, social and economic issues in society. 2. Develop theoretical understandings in the societal changes in ageing. 3. Justify the social construction of \"age\" and \"ageing process\" in individual and social contexts. 4. Synthesize the impact of population ageing on health and social care needs in society.", "syllabus": "Introduction: Orienting concepts and related issuesGlobal ageing: Changing demographics and epidemiological transitionAgeing theories (I)Ageing theories (II)Social construction of health and ageing Health patterning and ageing Ageing and social policy (Bio)medicalisation of ageing Changing roles and relationships over life course Ethical and social dilemmas in ageing issues Formal and informal caregiving in context Ageing as a women’s issue ", "required_readings": "Textbooks Estes, C. L., & DiCarlo, N. B. (2019). Ageing A-Z: Concepts towards Emancipatory gerontology. Routledge. Hooyman, N. R., & Kiyak, H. A. (2018). Social gerontology: A multidisciplinary perspective. Allyn & Bacon. Hyde, M., & Higgs, P. (2016). Ageing and globalization. Policy Press.Phillipson, C. (2013). Ageing. Polity Press. Quadagno, J. S. (2022). Aging and the life course: An introduction to social gerontology. McGraw-Hill Education. Settersten, R. A. Jr., & Angel, J. L. (Eds.). (2011). Handbook of sociology of ageing. Springer Verlag. Sokolovsky, J. (Ed.). (2020). The cultural context of aging: Worldwide perspectives. Praeger. Journals Asquith, N. (2009). Positive ageing, neoliberalism and Australian sociology. Journal of Sociology, 45(3), 255-269. Chau, K.L., Chow, N.W.S. & Chi, I. (2006). Economic status of the elderly in Hong Kong – Homogeneous or heterogeneous? International      Social Work, 49(2), 218-232. Hendricks, J., Applebaum, R., & Kunkel, S. (2010). A world apart? Bridging the gap between theory and applied social gerontology. The       Gerontologist, 50(3), 284-293. Lin, Y. Y., & Huang, C. S. (2016). Ageing in Taiwan: Building a society for active ageing and ageing in place. The Gerontologist, 56 (2), 176–    183. Rishworth, A., & Elliott, S. J. (2019). Global environmental change in an aging world: The role of space, place and scale. Social Science &      Medicine, 227, 128-136. Walker, A. (2012). The new ageism. Political Quarterly, 83(4), 812-819. Wiles, J., Miskelly, P., Stewart, O., Kerse, N., Rolleston, A., & Gott, M. (2019). Challenged but not threatened: Managing health in advanced      age. Social Science & Medicine, 227, 104-110. Useful websites •            Changing Ageing.org http://changingageing.org/ This Web site compiles current information from various news and media sources and provides video clips and links to those sources and a blog for people to react to the stories. Dr. Bill Thomas, a well-known geriatrician and gerontologist, gives his insights about the attitudes and stereotypes that underlie some of these stories.  •            National Institute on Ageing http://www.nih.gov/nia The National Institute on Ageing, part of the federally funded National Institutes of Health, is involved with both basic and applied research on physical, social, and psychological aspects of health as people age.  •            United Nations Statistics Division http://unstats.un.org/unsd/methods/inter-natlinks/sd_natstat.htm The UNSD provides a Web page that links to selected national statistics offices. Each of the country’s statistical information is unique but may be useful for international comparisons on ageing issues.", "recommended_readings": "Dannefer, D., & Phillipson, C. (2010). The SAGE handbook of social gerontology. Sage. George, L. K., & Ferraro, E. (Eds.) (2016). Handbook of ageing and the social sciences. Academic Press. Gratton, L., & Scott, A. (2016). The 100-year life. Bloomsbury. Higgs, P., & Gilleard, C. (2015). Rethinking old age: Theorising the fourth age. Palgrave. Park, H. W. (2016). Old age, new science: Gerontologists and their biosocial visions, 1900-1960. University of Pittsburgh Press. Kriebernegg, U., & Maierhofer, R. (Eds.). (2013). The ages of life: Living and ageing in conflict? Transcript. Phillips, J. E., Ajrouch, K., & Hillcoat-Nallétamby, S. (Eds.). (2010). Key concepts in social gerontology. Sage. Wellin, C. (Ed.) (2018). Critical gerontology comes of age: Advances in research and theory for a new century. Routledge.", "terms": {"2024-25 Term 2": {"--LEC (8115)": {"startTimes": ["14:30"], "endTimes": ["17:15"], "days": [3], "locations": ["Y.C. Liang Hall G06"], "instructors": ["Dr. WANG Jingxuan"], "meetingDates": ["8/1", "15/1", "22/1", "5/2", "12/2", "19/2", "26/2", "12/3", "19/3", "26/3", "2/4", "9/4", "16/4"]}}}, "assessments": {"Examination": "60", "Homework or assignment": "15", "Presentation": "25"}}, {"code": "3112", "title": "Basic Care in Gerontology", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "Field Studies/Field-trip\nLaboratory\nLecture\nOthers\nInteractive Tutorial\nWeb-enhanced Teaching", "campus": "Main Campus", "academic_group": "JC Sch of Pub Health Prim Care", "requirements": "", "description": "This course aims to equip students with foundational knowledge and essential skills to address the basic care needs of older people. Emphasis is placed on promoting an understanding of the basic principles of care to help older people to meet their basic life needs. Fundamental concepts such as nutrition, exercise, oral care, basic hygiene care, communication, and psychosocial care are also covered.", "outcome": "After completing this course, students should be able to:  1. Explain the purposes and content of various geriatric assessment tools. 2. Demonstrate the ability to conduct comprehensive assessments to determine the biopsychosocial needs and conditions of older people and their families. 3. Deliver client education for older people and their families.             4. Describe the principles and demonstrate the ability to perform basic skills for providing care to older people safely and effectively. 5. Discuss the special issues relating to the provision of basic care to older people. The issues include infection control, occupational safety, and inter-professional practice.", "syllabus": " Course Introduction Basic anatomy & physiology Nutrition and hydration Pain management for older adults Frailty in older adults Basic infection control with laboratory session Basic health assessment with laboratory session Comprehensive Geriatric Assessment (CGA) Occupational safety Mobility and client transfer with laboratory session Safety and fall prevention Fall prevention with experiential learning Personal hygiene and elimination with experiential learning Emergency care for older adults with laboratory session Assisting with fluid and nutritional needs Skincare for older adults Pressure injuries Sleep hygiene", "required_readings": "Black, J.M., & Hawks, J.H. (2009). Medical-surgical nursing: clinical management (8th e.d.). St Louis, Mo.: Saunders/Elsevier.Miller, C.A. (2019). Nursing for Wellness in Older Adults (8th e.d.). Wolters Kluwer", "recommended_readings": "Carter, P.J. (2010) Lippincott’s textbook for long-term care nursing assistants: A humanistic approach to caregiving. Philadelphia: Wolters Kluwer Health/Lippincott Williams & Wilkins", "terms": {"2024-25 Term 1": {"--LEC (8409)": {"startTimes": ["15:30"], "endTimes": ["17:15"], "days": [2], "locations": ["Basic Med Sci Bldg Rm2"], "instructors": ["Mr. CHIU Cheuk Pong"], "meetingDates": ["3/9", "10/9", "17/9", "24/9", "8/10", "15/10", "22/10", "29/10", "5/11", "12/11", "19/11", "26/11"]}, "-L01-LAB (5863)": {"startTimes": ["13:30"], "endTimes": ["15:15"], "days": [3], "locations": ["TBA"], "instructors": ["Mr. CHIU Cheuk Pong"], "meetingDates": ["4/9", "11/9", "18/9", "25/9", "2/10", "9/10", "16/10", "23/10", "30/10", "6/11", "13/11", "20/11", "27/11"]}, "-L02-LAB (5864)": {"startTimes": ["15:30"], "endTimes": ["17:15"], "days": [3], "locations": ["TBA"], "instructors": ["Mr. CHIU Cheuk Pong"], "meetingDates": ["4/9", "11/9", "18/9", "25/9", "2/10", "9/10", "16/10", "23/10", "30/10", "6/11", "13/11", "20/11", "27/11"]}}}, "assessments": {"Examination": "50", "Lab performance": "40", "Participation": "10"}}, {"code": "3113", "title": "Promoting Successful Ageing: Individual and Societal Perspectives", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "Lecture\nInteractive Tutorial\nVisit", "campus": "Main Campus", "academic_group": "JC Sch of Pub Health Prim Care", "requirements": "", "description": "The aim of this course is to provide students with a comprehensive overview of the concepts, principles and theories of successful ageing from the health and social perspectives. Emphasis is placed on exploring and discussing the subjective and objective dimensions of successful ageing, the modifiable factors affecting the achievement of successful ageing, and the strategies to promote successful ageing at both individual and societal levels.", "outcome": "After completing this course, students should be able to:  1. Describe the different terminologies and definitions of successful ageing. 2. Discuss how successful ageing is related to the adaptation of changes in later life from theoretical and lay perspective. 3. Discuss the strategies to promote successful ageing at individual, family and societal levels. 4. Discuss the concepts and strategies to build an age-friendly community.", "syllabus": " Course introduction Successful ageing and its relationship Foundation of successful ageing: Concepts and principles Foundation of successful ageing: Modifiable factors affecting the achievement of successful ageing Foundation of successful ageing: Changes in later life – influences and adaptation Introducing age-friendly community and the interrelated domains of an age-friendly community Strategies, challenges and issues in creating an age-friendly community Promoting successful ageing: Local and overseas perspective Promoting successful ageing: Individual perspective – positive psychology, building resilience and lifelong learning Promoting successful ageing •       Family perspective: enhancing intergenerational solidarity and effective coping strategies •       Societal perspective: reengagement and senior volunteerism Field trip Use of biographical approaches to promote successful ageing, and experience sharing ", "required_readings": "Textbook: Cheng, S. T., Chi, I., Fung, H. H., Li, L. W., & Woo, J. (Eds.). (2015). Successful ageing: Asian perspectives. Springer. Ferraro, K. F., & Wilmoth, J. M. (2013). Gerontology: Perspectives and issues (4th ed.). Springer. Fillit, H. M., Rockwood, K., & Young, J. (2017). Brocklehurst's textbook of geriatric medicine and gerontology (8th ed.). Saunders/Elsevier. Hooyman, N. R., & Kiyak, H. A. (2018). Social gerontology: A multidisciplinary perspective (10th ed.). Pearson Education. Moody, H. R., & Sasser, J. R. (2021). Ageing: Concepts and controversies (10th ed.). SAGE Publications. Moulaert, T., & Garon, S. (Eds.). (2016). Age-friendly cities and communities in international comparison: Political lessons, scientific avenues, and democratic issues. Springer. Pfeiffer, E. (2013). Winning strategies for successful ageing. Yale University Press. Scharlach, A., & Lehning, A. (2016). Creating aging-friendly communities. Oxford University Press. Woo, J. (2013). Ageing in Hong Kong: A comparative perspective. Springer. Journals Bülow, M. H., & Söderqvist, T. (2014). Successful ageing: A historical overview and critical analysis of a successful concept. Journal of Ageing          Studies, 31, 39–149. https://doi.org/10.1016/j.jaging.2014.08.009 Iecovich, E. (2014). Ageing in place: From theory to practice. Anthropological Notebooks, 20(1), 21–33. Janssen, B., Janssen, T., & Van Regenmortel, T. (2011). Identifying sources of strength: Resilience from the perspective of older people receiving long-term community care. European Journal of Ageing, 8(3), 145–156. https://doi.org/10.1007/s10433-011-0190-8 Li, C. I., Lin, C. H., Lin, W. Y., Liu, C. S., Chang, C. K., Meng, N. H., Lee, Y. D., Li, T. Ch., & Lin, C. C. (2014). Successful aging defined by      health-related quality of life and its determinants in community-dwelling elders. BMC Public Health, 14(1), 1013. https://doi.org/10.1186/1471-2458-14-1013 Lowry, K., Vallejo, A., & Studenski, S. A. (2012). Successful ageing as a continuum of functional independence: Lessons from physical disability models of ageing. Ageing and Disease, 3(1), 5–15. Rowe, J. W., & Kahn, R. L. (2015). Successful ageing 2.0: Conceptual expansions for the 21st century. Journals of Gerontology, Series B:      Psychological Sciences and Social Sciences, 70(4), 593–596. https://doi.org/10.1093/geronb/gbv025  Useful websites Center for Healthy Ageing — National Council on Ageing: http://www.ncoa.org/ Library Resources: Gerontology: http://libguides.lib.cuhk.edu.hk/gerontology The CADENZA: http://www.cadenza.hk/index.php?lang=en The CUHK Jockey Club Institute of Ageing: http://www.ioa.cuhk.edu.hk/en-GB/ Age-friendly Port: https://jcafc-port.hk/en/", "recommended_readings": "To be advised by the course teacher", "terms": {"2024-25 Term 2": {"--LEC (8116)": {"startTimes": ["10:30"], "endTimes": ["13:15"], "days": [1], "locations": ["William M W Mong Eng Bldg 706"], "instructors": ["Ms. LAI Pui Man"], "meetingDates": ["6/1", "13/1", "20/1", "27/1", "10/2", "17/2", "24/2", "10/3", "17/3", "24/3", "31/3", "7/4", "14/4"]}}}, "assessments": {"Examination": "60", "Presentation": "30", "Participation": "10"}}, {"code": "3114", "title": "Psychology in Ageing: Theories and Application", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "JC Sch of Pub Health Prim Care", "requirements": "", "description": "The aim of this course is to provide students with a basic understanding of the concepts and theoretical approaches of psychology relevant to ageing and aged care in various care settings. Emphasis is placed on the application of these concepts to understand individual and group behaviour and the health and social care needs of individuals and groups.", "outcome": "After completing this course, students should be able to:  1.        Discuss the psychological changes throughout the lifespan. 2. Examine influences of motivation, emotion, learning, memory and personality on individual and group behaviour of older people in various   health and social care settings. 3. Develop sensitivity over approaches and demonstrate effective communication skills of enhancing psychological well-being in older people4. Discuss the common major life events and challenges among older people and integrate psychological theories to explain the impact on psychological well-being.", "syllabus": " Course introduction  Psychology of human development and psychological challenges to older adults Communication with older adults Stress and coping in older adulthood Memory and intellectual functioning of older adults Personality and ageing Health psychology for older adults: Health behaviours and behavioural modification  Counselling older adults: Skills and age-related crisis Psychological assessment and assessment tools for older adults Psychological disorders and management for older adults I:                 Anxiety disorder Psychological disorders and management for older adults II: Depression Psychological disorders and management for older adults III: Delirium & Delusional disorder Emotional experience and regulation in older adults", "required_readings": "Christopher, G. (2014). The psychology of ageing: From mind to society. Palgrave Macmillan. Erber, J. T. (2019). Aging and older adulthood (4th ed.). Wiley-Blackwell. Larsen, L. (2011). Geropsychology: The psychology of the ageing person. Aarhus University Press. Schaie, K. W., & Will, S. L. (2021). Handbook of psychology of aging (9th ed.). Elsevier. Stuart-Hamiliton, I. (2012). Psychology of ageing: An introduction (5th ed.). Jessica Kingsley Publisher. Stuart-Hamiliton, I. (2014). Introduction to the psychology of ageing for non-specialist. Jessica Kingsley Publisher. Weiten, W. (2022). Psychology: Themes and variations (11th ed.). Boston, MA:Cengage.", "recommended_readings": "Psychology and Aging (http://www.apa.org/pubs/journals/pag/index.aspx) The Journal of Gerontology, Series B: Psychological Sciences and Social Sciences (https://academic.oup.com/psychsocgerontology) Key journal articles: Cabello, R., Sorrel, M. A, Fernández-Pinto, I., Extremera, N., & Fernández-Berrocal, P. (2016). Age and gender difference in ability emotional intelligence in adults: A cross-sectional study. Development Psychology, 52(9), 1486-1492. MacLeod, S., Musich, S., Hawkins, K., Alsgaard, K., & Wicker, E. R. (2016). The impact of resilience among older adults. Geriatric Nursing, 37(4), 266-272. Opdebeeck, C., Martyr, A., & Clare, L. (2016). Cognitive reserve and cognitive function in healthy older people: A meta-analysis. Aging, Neuropsychology, and Cognition, 23(1), 40-60. Sargent-Cox, K., & Anstey, K. J. (2015). The relationship between age-stereotypes and health locus of control across adult age-groups. Psychology & Health, 30(6), 652-670. Shenkin, S. D., Laidlaw, K., Allerhand, M., Mead, G. E., Starr, J. M., & Deary, I. J. (2014). Life course influences of physical and cognitive function and personality on attitudes to aging in the Lothian Birth Cohort 1936. International Psychogeriatrics, 26(9), 1417-1430.", "terms": {"2024-25 Term 1": {"--LEC (9302)": {"startTimes": ["14:30"], "endTimes": ["17:15"], "days": [4], "locations": ["Mong Man Wai Bldg 703"], "instructors": ["Ms. LAI Pui Man"], "meetingDates": ["5/9", "12/9", "19/9", "26/9", "3/10", "10/10", "17/10", "24/10", "31/10", "7/11", "14/11", "21/11", "28/11"]}}}, "assessments": {"Examination": "55", "Presentation": "30", "Participation": "15"}}, {"code": "3211", "title": "Chronic Disease Management in Ageing", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "Field Studies/Field-trip\nLaboratory\nLecture\nInteractive Tutorial", "campus": "Main Campus", "academic_group": "JC Sch of Pub Health Prim Care", "requirements": "", "description": "This course aims to enhance the understanding of the complexities of care for people with chronic diseases. An interdisciplinary approach for the chronic disease management from health and social perspectives will be applied. It also focuses on the design of care which directly addresses the physical and psychosocial consequences of chronic diseases, especially for older people and their caregivers. Basic principles and concepts of community-based care and rehabilitation, and the importance of empowerment of patients as well as families in self-management of chronic illnesses in a community setting will be covered.", "outcome": "After completing this course, students should be able to:  1. Summarize the physical and psychosocial impacts of chronic diseases especially on older people  2. Identify the roles of different healthcare disciplines in managing major chronic diseases 3. Explain the concepts of multiple morbidity and comorbidity and their implications for long-term care                             4. Discuss the self-care models for chronic disease management and strategies to empower people managing their diseases  5. Discuss the types and roles of community resources in supporting people living with chronic conditions.  6. Describe the role of public health or community health practitioners in disease management", "syllabus": " Course Introduction Hypertension, blood lipid disorders and diabetes mellitus Chronic obstructive pulmonary disease  Musculoskeletal health Common problems of the urinary system Stroke Chronic care model Community-based rehabilitation Development of a person-centered care plan Application of self-care and empowerment concepts on chronic disease management Quality of life and maintaining independence in older people Interdisciplinary team care of older people with chronic diseases Chronic illness: Sociological perspectives Visual impairment Hearing impairment Medication management for older people with chronic diseases  Drug safety and polypharmacy Mental health and common mental health problems in older adults", "required_readings": "Black, J.M., & Hawks, J.H. (2009). Medical-surgical nursing: clinical management (8th e.d.). St Louis, Mo.: Saunders/Elsevier.", "recommended_readings": "Miller, C.A. (2019). Nursing for Wellness in Older Adults (8th e.d.). Wolters Kluwer", "terms": {"2024-25 Term 1": {"--LEC (6594)": {"startTimes": ["14:30"], "endTimes": ["17:15"], "days": [1], "locations": ["Yasumoto Int'l Acad Park 505"], "instructors": ["Mr. CHIU Cheuk Pong"], "meetingDates": ["2/9", "9/9", "16/9", "23/9", "30/9", "7/10", "14/10", "21/10", "28/10", "4/11", "11/11", "18/11", "25/11"]}}}, "assessments": {"Examination": "50", "Homework or assignment": "40", "Presentation": "10"}}, {"code": "3213", "title": "Dementia: Prevention and Management", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "Lecture\nInteractive Tutorial\nVisit", "campus": "Main Campus", "academic_group": "JC Sch of Pub Health Prim Care", "requirements": "", "description": "This course aims to provide students with a comprehensive overview of the pathophysiological, behavioural and psychosocial aspects of dementia. Emphasis is placed on equipping students with the knowledge and skills required to prevent, detect and manage dementia in older people. The course also highlights the roles of family caregivers, multidisciplinary care teams, and community care services in managing dementia.", "outcome": "After completing this course, students should be able to:  1. Describe the pathogenesis, risk factors, types, and stages of dementia.             2. Describe the comprehensive health and social assessment for dementia.  3. Discuss the physical, cognitive, behavioural and psychosocial manifestations of dementia.  4. Describe the pharmacological and non-pharmacological interventions for dementia.         5. Discuss the evidence-based care in managing dementia in the community, rehabilitative and long-term care settings.  6. Discuss the interventions to maintain and promote brain health.  7. Discuss the role of an interprofessional team approach in the care of older people with dementia and their caregivers and families.  8. Discuss the role of informal caregivers in the care of older people with dementia.  9. Discuss the role of health and social care services in the care of older people with dementia.", "syllabus": " Course Introduction An overview of dementia Manifestations of dementia Assessment of dementia Communication with dementia clients  Management of dementia Sociological understanding of dementia COVID-19 and dementia  Living with dementia Dementia-friendly environment  Care of informal caregivers Prevention of dementia", "required_readings": "Agronin, M. E. (2014). Alzheimer's disease and other dementias: A practical guide (3rd ed.). Routledge", "recommended_readings": "Ames, D., O’Brien, J. T., & Burns, A. (2017). Dementia (5th ed.) Chapman and Hall/CRC Press.De Waal, H. (2013). Designing and delivering dementia services. Wiley-Blackwell.", "terms": {"2024-25 Term 2": {"--LEC (8117)": {"startTimes": ["9:30"], "endTimes": ["12:15"], "days": [3], "locations": ["Basic Med Sci Bldg Rm1"], "instructors": ["Mr. CHIU Cheuk Pong"], "meetingDates": ["8/1", "15/1", "22/1", "5/2", "12/2", "19/2", "26/2", "12/3", "19/3", "26/3", "2/4", "9/4", "16/4"]}}}, "assessments": {"Examination": "50", "Project": "30", "Report": "20"}}, {"code": "3214", "title": "Ethical and Financial Issues in Ageing", "career": "Undergraduate", "units": "1.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "JC Sch of Pub Health Prim Care", "requirements": "", "description": "The aim of this course is to enhance students' understanding of the ethical issues relating to aged care. It focuses on the basic ethical principles and theories relating to gerontological practice; the ethical issues and dilemmas encountered in practice; the financial planning for older people; and the funding models for aged care services.", "outcome": "After completing this course, students should be able to:  1. Critically appraise contemporary ethical and financial issues in relation to the care and services for older people.  2. Compare different approaches for ethical decision-making.  3. Describe the financial planning and funding models for different aged care services and discuss the associated implications.", "syllabus": " Course introduction •       Introduction to ethical decision making models; •       Introduction to bioethical principles and theories; •       Code of conduct; •       Human rights of the older people Ethical and financial issues - negligence and malpractice, professional misconduct, elderly abuse, use of restraint Ethical and financial issues in decision making (I) – mental capacity; informed consent; best interests for handling the issues of the third age Ethical and financial issues in decision making (II) – Guardianship law and practice in older people Funding model on health and social care services for older people  Financial issues in ageing Will Truth-telling, privacy and confidentiality in dealing with the case of elder person", "required_readings": "Avery, G. (2016). Law and ethics in nursing and healthcare: An Introduction (2nd ed.). London: SAGE. Lo, B. (2020). Resolving ethical dilemmas: A guide for clinicians (6th ed.). Philadelphia: Wolters Kluwer.Holistein, P.B. & Mitzen, P.B. (2001). Ethics in community-based elder care. New York. Springer Publishing Company.  Useful websites Department of Justice Bilingual Laws Information System http://www.elegislation.gov.hk/ 2023 Hong Kong Policy Address https://www.policyaddress.gov.hk/2023/en/policy.htmlSocial Welfare Department http://www.swd.gov.hk/en/index/ Social Workers Registration Board http://www.swrb.org.hk/index_eng.asp The Treasury, Hong Kong (Financial Statements of the Government of the HKSAR)http://www.try.gov.hk/internet/ehpubl_accounts.html The Nursing Council of Hong Kong http://www.nchk.org.hk/en/home/index.htmlCommunity Legal Information Centrehttps://www.clic.org.hk/zh", "recommended_readings": "To be advised by the course teacher", "terms": {"2024-25 Term 2": {"--LEC (8230)": {"startTimes": ["9:30"], "endTimes": ["11:15"], "days": [5], "locations": ["Mong Man Wai Bldg 715"], "instructors": ["Ms. LAI Pui Man"], "meetingDates": ["10/1", "17/1", "24/1", "7/2", "14/2", "21/2", "28/2", "14/3", "21/3", "28/3", "11/4"]}}}, "assessments": {"Homework or assignment": "80", "Presentation": "20"}}, {"code": "3311", "title": "Aged Care Service Planning and Delivery Models", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "Field Studies/Field-trip\nLecture\nInteractive Tutorial\nWeb-enhanced Teaching", "campus": "Main Campus", "academic_group": "JC Sch of Pub Health Prim Care", "requirements": "", "description": "The aim of this course is to provide students with a comprehensive understanding of the principles, concepts and skills involved in planning and delivering aged care services in a variety of aged care settings, including community, rehabilitative and residential care settings locally and globally. The basic concepts covered include ageing in place, social involvement and participation, integrated community-based care, the home care delivery model, discharge planning, innovative practice, interdisciplinary and cross-sectoral service coordination, and the residential care home accreditation system. The course highlights the notion of health and social care partnership, and a multi-dimensional perspective is adopted to facilitate students’ examination on the service planning and delivery model for the provision of community, rehabilitative and residential care services to older people.", "outcome": "After completing this course, students should be able to:  1. Demonstrate an understanding of the principles, philosophies, and concepts of community, rehabilitative, and residential aged care and their relevance to older persons in a society locally and globally. 2. Demonstrate an understanding of the roles and functions of different health care and social welfare organizations in the provision of different levels of aged care services. 3. Discuss the knowledge and skills in coordinating multi-disciplinary and inter-sectoral aged care in community, rehabilitative and residential care settings 4. Describe innovative strategies to monitor quality and promote excellence in the provision of aged care services in community, rehabilitative and residential care settings.", "syllabus": " Course introduction The principles, philosophies, and concepts of community, rehabilitative, and residential aged care An overview of long-term care services for older people in Hong Kong Ageing in place and related care models Types, roles and functions of community care services Innovative service models in community care settings Types, roles and functions of rehabilitative care Types, roles and functions of residential care services The role of SCNAMO in aged care services Critiques of residential care services Field trip Aged care service – The role and functions of healthcare services  Proposal and evaluation writing I Proposal and evaluation writing II Residential Care Home Accreditation System End of life care in elderly service  Inter-sectoral aged care services: service and delivery models from private sector Principles and strategies to promote excellence in aged care services", "required_readings": "Textbooks Asthana, S. et al., (2022). Hazzard's geriatric medicine and gerontology (8th ed.). New York: McGraw-Hill Education. Brody, R.(2014). Effectively managing and leading human service organizations (4th ed.). Thousand Oaks, California: SAGE.Chia, S. H., Healthcote, J., & Hibberd, J. M. (2011). Group and individual work with older people: A practical guide to running successful activity-    based programmes. London; Philadelphia, PA: Jessica Kingsley Publisher. Corey, G. (2016). Theory and practice of group counselling (9th ed.). Boston, Massachusetts: Cengage Learning.  Corey, G. (2021). Theory and practice of counseling and psychotherapy (10th ed.). Boston, MA: Cengage.  Cox, E. O., Chapin, R., & Kelchner, E. (2013). Gerontological social work practice: Issues, challenges, and potential. New York: Routledge. Furman, R., & Gibelman, M. (2013). Navigating human service organizations. (3rd ed.). Chicago, Ill.: Lyceum Books. Hall, B., & Scragg, T. (2012). Social work with older people: Approaches to person-centred practice. Maidenhead, Berkshire, England: Open      University Press. Harris, J. L., Roussel, L., Walters, S., & Dearman, C. (2011). Project planning and management: A guide for CNLs, DNPs, and nurse     executives. Sudbury, MA: Jones & Bartlett Publishers. Hughes, M., & Heycox, K. (2020). Older people, ageing and social work: Knowledge for practice. Crows Nest, NSW: Allen & Unwin.Jordan, C., & Franklin, C. (Eds.). (2021). Clinical assessment for social workers: Quantitative and qualitative methods. New York: Oxford University     Press. Kerzner, H. (2017). Project management: a systems approach to planning, scheduling, and controlling (12th ed.). Hoboken, New Jersey: John Wiley & Sons Inc. McKenzie, J., Neiger, B., & Thackeray, R. (2017). Planning, implementing, and evaluating health promotion programs: A primer (7th ed.).     New Jersey: Pearson. Moyle, W., Parker, D., & Bramble, M. (2014). Care of older adults: A strengths-based approach. Port Melbourne, VIC: Cambridge University     Press.Yalom, I. D. & Leszcz, M. (2020). The theory and practice of group psychotherapy (6th ed.). New York: Basic Books. Useful websites CADENZA Training Programme http://www.cadenza.hk/trainingeLearning information package (e-LIP) http://www.cuhk.edu.hk/proj/eLIP/index.htmlGlobal Ageing Network http://globalageing.org/Hong Kong Association of Gerontology http://www.hkag.org/ Social Welfare Department. Elderly Services. http://www.swd.gov.hk/en/index/site_pubsvc/page_elderly/The CUHK Jockey Club Institute of Ageing https://www.ioa.cuhk.edu.hk/zh-tw/homeThe Hong Kong Council of Social Service. HKCSS Channel: Elderly. http://www.hkcss.org.hk/c/channel.asp?video=1&topic_type=1The Hong Kong Geriatrics Society http://hkgs.org/en-index.htmlUnited Nations: Ageing. http://www.un.org/en/sections/issues-depth/ageing/index.htmlWorld Health Organization. Ageing and Life Course. http://www.who.int/ageing/en/", "recommended_readings": "To be advised by the course teacher", "terms": {"2024-25 Term 2": {"--LEC (8118)": {"startTimes": ["14:30"], "endTimes": ["17:15"], "days": [2], "locations": ["William M W Mong Eng Bldg 706"], "instructors": ["Ms. LAI Pui Man"], "meetingDates": ["7/1", "14/1", "21/1", "4/2", "11/2", "18/2", "25/2", "11/3", "18/3", "25/3", "1/4", "8/4", "15/4"]}}}, "assessments": {"Homework or assignment": "50", "Presentation": "40", "Participation": "10"}}, {"code": "3412", "title": "Innovations and Evidence-based Practice for Aged Care Services", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "JC Sch of Pub Health Prim Care", "requirements": "", "description": "This course aims to provide students with an overview of the research methods used in examining health and social care issues, and to equip them with knowledge of evidence-based practice with special reference to gerontology. The course also examines the impacts of the changing health and social care context on the delivery of aged care services, and introduces the evidence-based innovative models of aged care service delivery.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "4101", "title": "Special Topics in Gerontology I", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "JC Sch of Pub Health Prim Care", "requirements": "", "description": "Special topics having significant impacts on the advancement of public health in the lecturer's field of expertise will be covered.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "4102", "title": "Special Topics in Gerontology II", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "JC Sch of Pub Health Prim Care", "requirements": "", "description": "Special topics having significant impacts on the advancement of public health in the lecturer's field of expertise will be covered.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "4212", "title": "Death, Dying and End-of-life Care", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "JC Sch of Pub Health Prim Care", "requirements": "", "description": "This course aims to provide students with a basic understanding of the concepts and principles of end-of-life care, and to equip them with essential knowledge and skills in the provision of hospice care and advance care planning to older people with terminal illness sufferers and their families.", "outcome": "After completing this course, students should be able to:  1. Be familiar with the history and global/local experiences of end-of-life care, including significant milestones, influential programs, and major trends.2. Define the concepts of death and end-of-life caring, and critically examine the social-cultural perspectives surrounding these concepts.3. Develop a heightened awareness and sensitivity towards the ethical concerns in dilemmas related to end-of-life care.4. Demonstrate effective communication with elderlies and their families regarding death and dying issues. 5. Demonstrate the ability to conduct advance care planning and evaluate its outcomes. 6. Discuss appropriate interventions for managing physical symptoms and emotional distress for elderlies at the end of life. 7. Critically analyze current policies and practices in the field of end-of-life care, and propose innovative approaches and strategies for improving the quality of care and support provided to individuals and their families facing the end of life.", "syllabus": " Introduction: Orienting concepts and related issues  Death theories and implementation in end-of-life care Development and principles of end-of-life care  Management of clients with terminal illness  Communication and counselling skills in end-of-life care Global experiences and challenges of end-of-life care End-of-life care services in Asia End-of-life care services in Hong Kong  Advanced care planning (ACP) programme and evaluation Funeral & bereavement care Ethical considerations in end-of-life care Elderly suicide, assisted suicide, and euthanasia in the end-of-life phase", "required_readings": "TextbooksAbel, E. K. (2018). Prelude to hospice: Listening to dying patients and their families. Rutgers University Press. Chan, I. K. N. (2019). Innovation. Impact: The Foundation of community-based end-of-life care in Hong Kong. The Jockey Club Eng-of-Life Community Care Project. Sadler, C. (2015). A practical guide to end of life care. Open University Press. [ebook] Corr, C. A., Corr, D. M. & Doka, K. J. (2019). Death and dying life and living (8th ed.). Cengage Learning. [ebook] Leming, M. L., & Dickinson, G. E. (2020). Understanding dying, death and bereavement (9th ed.). Cengage Learning. [ebook] Thomas, K., Lobo, B., & Detering, K. (2018). Advance care planning in end of life care (2nd ed.). Oxford University Press.Journal articles Brinkman-Stoppelenburg, A., Rietjens, J. A., & Van der Heide, A. (2014). The effects of advance care planning on end-of-life care: a systematic review. Palliative medicine, 28(8), 1000-1025. https://doi.org/10.1177/0269216314526272 Lum, H. D., Sudore, R. L., & Bekelman, D. B. (2015). Advance care planning in the elderly. Medical Clinics, 99(2), 391-403. https://doi.org/10.1016/j.mcna.2014.11.010 Chung, R. Y. N., Wong, E. L. Y., Kiang, N., Chau, P. Y. K., Lau, J. Y., Wong, S. Y. S., ... & Woo, J. W. (2017). Knowledge, attitudes, and preferences of advance decisions, end-of-life care, and place of care and death in Hong Kong. A population-based telephone survey of 1067 adults. Journal of the American Medical Directors Association, 18(4), 367-e19. https://doi.org/10.1016/j.jamda.2016.12.066", "recommended_readings": "To be advised by the course teacher", "terms": {"2024-25 Term 2": {"--LEC (9192)": {"startTimes": ["14:30"], "endTimes": ["17:15"], "days": [4], "locations": ["William M W Mong Eng Bldg 706"], "instructors": ["Ms. LAI Pui Man"], "meetingDates": ["9/1", "16/1", "23/1", "6/2", "13/2", "20/2", "27/2", "13/3", "20/3", "27/3", "3/4", "10/4", "17/4"]}}}, "assessments": {"Examination": "50", "Presentation": "30", "Participation": "20"}}, {"code": "4312", "title": "Gerontological Practicum", "career": "Undergraduate", "units": "9.00", "grading": "Graded", "components": "Practicum", "campus": "Main Campus", "academic_group": "JC Sch of Pub Health Prim Care", "requirements": "", "description": "The aim of this clinical practicum is to provide students with clinical practice opportunities to apply related principles, concepts and theories for planning and delivering aged care services in community, rehabilitative and residential care settings. Students are facilitated to develop their knowledge of and skills in service planning, coordination and delivery in these settings.", "outcome": "After completing this course, students should be able to:  1. Discuss the models for planning and delivering aged care services in community, rehabilitative and residential care settings. 2. Effectively communicate with older clients, their families, and health and social care team members in community, rehabilitative and residential care settings. 3. Apply the knowledge and skills of health and social sciences in ageing to identify the needs of older people and deliver high quality aged care services in community, rehabilitative and residential care settings. 4. Demonstrate an understanding of the principles and skills in coordinating multi-disciplinary care and optimizing inter-sectoral collaboration for the delivery of aged care services in community, rehabilitative and residential care settings. 5. Apply legal and ethical principles in delivering high quality aged care in community, rehabilitative and residential care settings.", "syllabus": "This clinical course facilitates development and application of knowledge and skills of health and social aged care in community, rehabilitative and residential care settings. Students are expected to discuss the service planning and delivery models adopted in these aged care settings, to demonstrate effective communication skills, to develop knowledge and skills for assessing health and social care needs, coordinating multi- disciplinary care and optimizing inter-sectoral collaboration in the delivery of aged care services, and to discuss legal and ethical issues in community aged care services.", "required_readings": "Cash, J. C., & Glass, C. A. (2019). Adult-gerontology practice guidelines. Springer Publishing Company. Carpenito-Moyet, L. J. (2017). Nursing diagnosis: Application to clinical practice (15th ed.). Wolters Kluwer. Carter, P. J. (2020). Lippincott Essentials for Nursing Assistants: A Humanistic Approach to Caregiving. Lippincott Williams & Wilkins. Chapman, F. (2018). Counselling and Psychotherapy with Older People in Care: A Support Guide. Jessica Kingsley Publishers. Cox, E. O., Chapin, R., & Kelchner, E. (2013). Gerontological Social Work Practice: Issues, Challenges, and Potential. Routledge.", "recommended_readings": "Fillit, H. M., Rockwood, K., & Young, J. B. (2017). Brocklehurst's textbook of geriatric medicine and gerontology E-book. Elsevier Health Sciences. Gopee, N., & Galloway, J. (2017). Leadership and management in healthcare. Sage. Golensky, M., & Hager, M. (2020). Strategic leadership and management in nonprofit organizations: Theory and practice. Oxford University Press. Henwood, S. (Ed.). (2014). Practical Leadership in Nursing and Health Care: A Multi-Professional Approach. CRC Press. Kaplan, D. B., & Berkman, B. (Eds.). (2016). The Oxford handbook of social work in health and aging. Oxford University Press, USA. Lo, B. (2020). Resolving ethical dilemmas: A guide for clinicians (6th ed.). Wolters Kluwer. Sanders, S., Kolomer, S. R., Spellman, C. W., & Rizzo, V. M. (2019). Gerontological Social Work and the Grand Challenges: Focusing on Policy and Practice. Springer Nature. Hua, W. A. (2016). Medical Law and Ethics in Hong Kong. Thomson Reuters Hong Kong Ltd.", "terms": {"2024-25 Term 1": {"-P01-PRA (8763)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["No Room Required"], "instructors": ["Ms. LAI Pui Man"], "meetingDates": ["02/09/2024 - 25/11/2024"]}}}, "assessments": {"Internship or practicum": "60", "Presentation": "20", "Report": "20"}}, {"code": "4411", "title": "Health and Social Care Policy in Ageing", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "JC Sch of Pub Health Prim Care", "requirements": "", "description": "The aim of this course is to provide students with a comprehensive understanding of policy issues relating to health and social care needs of older people. The course also examines the operation of health care and social care systems to further students' understanding of the planning and delivery of aged care services for older people.", "outcome": "After completing this course, students should be able to:  1. Illustrate the social, political and economic issues and changes resulting from the ageing of society.  2. Describe the historical and cultural basis to the development of policy and welfare systems on ageing.  3. Critically discuss the strengths and limitations of the current policy on the delivery of aged care services in Hong Kong.  .  4. Discuss and analyse the roles, trends and ethical issues of health and social care professionals in the development and implementation of policy on ageing. ", "syllabus": "1 Framework for policy analysis and planning  1.1 Introduction to social policy in ageing  1.2 Theoretical approaches to the development of ageing policies  1.3 Aged care policies: analysis, promotion and implementation  1.4 The process of legislation relating to health and social care policies in ageing   2 Health and social care policy development  2.1 Social, political and poverty issues and changes resulting from population ageing  2.2 Future direction and policy options for older people  2.3 Gerontechnology and health informatics   3 Examination of health and social care policies  3.1 Healthcare infrastructure for older people:  3.1.1 Healthcare organization and healthcare system, healthcare financing and health economics  3.1.2 Health policy approaches for improving health outcomes in older people  3.2 The healthcare system and service model in response to the population change  3.3 A structural analysis on the development of Long-Term Care System  3.4 Social welfare and ageing: model, impact and sustainability  3.5 Empowerment of older people in political participation  3.6 Housing policies in ageing  3.7 The challenges and growing trends in housing for older people", "required_readings": "To be advised by the course teacher", "recommended_readings": "Alcock, C., Daly, G., & Griggs, E. (2008). Introducing social policy (2nd ed.). Harlow, England ; New York: Prentice Hall.  Alcock, P., Haux, T., May, M., & Wright, S. (2016). The student's companion to social policy (Fifth ed.). Chichester, UK ; Hoboken  Baldock, J. (2012). Social policy (4th ed.). Oxford: Oxford University Press.  Binstock, R. H., George, L. K., Cutler, S. J., Hendricks, J., & Schulz, J. H. (Eds.). (2011). Handbook of aging and the social sciences. United States: Academic Press.  Chi, I. (2013). Long-term care in the 21st century: perspectives from around the asia-pacific rim. New York: Routledge.  Chinese, A. O. S. S., Indonesian, A. O. S., & Indian, N. S. A. (2009). Preparing for the challenges of population aging in asia: strengthening the scientific basis of policy development. Washington, US: National Academies Press.  Hudson, R. (2014). The new politic of old age policy. Baltimore: Johns Hopkins University Press.  Jordan, B. (2008), Welfare and well-being: socialvalue in public policy. UK: Tue Policy Press.  Wacker, R. R. & Roberto, K. A. (2011). Aging social policies: an international perspective. Thousand Oaks, CA: SAGE Publications Ltd.  Walker, A., & Aspalter, C. (Eds.). (2014). Active aging in asia. London: Routledge.     周永新。（2013）。社會政策的觀念和制度。香港：中華書局。 歐陽達初、黃和平（2017）。未完成的香港社會保障：批判的導論。香港：中華書局。  周永新（2017）。創建公平和關愛社會──香港民生政策的得與失。香港：中華書局。", "terms": {"2024-25 Term 2": {"--LEC (6611)": {"startTimes": ["9:30"], "endTimes": ["12:15"], "days": [3], "locations": ["Basic Med Sci Bldg Rm2"], "instructors": ["Ms. LAI Pui Man"], "meetingDates": ["8/1", "15/1", "22/1", "5/2", "12/2", "19/2", "26/2", "12/3", "19/3", "26/3", "2/4", "9/4", "16/4"]}}}, "assessments": {"Homework or assignment": "50", "Presentation": "35", "Participation": "15"}}]