[{"code": "1038", "title": "Algebra I", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "Lecture\nInteractive Tutorial", "campus": "Main Campus", "academic_group": "Artic BSc PhD Pgm in Math Sci", "requirements": "Not for students who have taken MATH1030/1038.", "description": "This course is intended as the first course on algebra for students majoring in Articulated Bachelor of Science – Ph.D. Programme in Mathematical Sciences. The course emphasizes the fundamental concepts and principles in algebra, and focuses on rigorous reasoning of mathematical statements, computational techniques as well as applications.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "1113", "title": "Basic Physics I", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "Lecture\nInteractive Tutorial", "campus": "Main Campus", "academic_group": "Artic BSc PhD Pgm in Math Sci", "requirements": "Not for students who have taken PHYS1111 or 1113.", "description": "This introductory calculus-based course discusses the basic principles of mechanics, fluids and waves. Topics include: particle kinematics, force and motion, work and kinetic energy, potential energy, momentum, systems of particles and collisions, rotation, Newton’s law of gravitation, fluid statics and the dynamics of ideal fluids, oscillations, and waves. Students are advised to take this course concurrently with an introductory mathematics course that includes vectors and calculus.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "1122", "title": "Basic Physics II", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "Lecture\nInteractive Tutorial", "campus": "Main Campus", "academic_group": "Artic BSc PhD Pgm in Math Sci", "requirements": "Not for students who have taken PHYS1122. Pre-requisite: IMSC2018.", "description": "This introductory calculus-based course discusses the basic principles of optics, special relativity, and quantum physics and its applications, plus an introduction to particle physics. Topics include: Geometric optics, interference, diffraction, special relativity, quantum physics and its applications to atoms, molecules, solids, and nuclei, particle physics. Students are advised to take this course concurrently with a course in calculus.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "2018", "title": "Calculus I", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "Lecture\nInteractive Tutorial", "campus": "Main Campus", "academic_group": "Artic BSc PhD Pgm in Math Sci", "requirements": "Not for students who have taken any one of MATH2010/2018, 2020/2028. Co-requisite: IMSC1038.", "description": "This course is intended to introduce the basics of the calculus of functions of several variables. Topics include: vectors, geometry of Euclidean spaces, curves, limits, partial derivatives, differentiability, chain rule, first and second derivative test, maximum and minimum, Taylor polynomials, Lagrange multipliers, implicit function theorem.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "2028", "title": "Calculus II", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "Lecture\nInteractive Tutorial", "campus": "Main Campus", "academic_group": "Artic BSc PhD Pgm in Math Sci", "requirements": "Not for students who have taken MATH2020/2028. Pre-requisite: IMSC2018.", "description": "This is a continuation of IMSC2018. The following topics will be discussed: multiple integrals in n-dimensions: areas and n-volumes, surface areas, volumes of submanifolds and hypersurfaces in n-space, change of variables; vector analysis: line integrals, surface integrals, integration on submanifolds, Green theorem, divergence theorem and Stokes theorem in n-dimensions.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "2048", "title": "Algebra II", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "Lecture\nInteractive Tutorial", "campus": "Main Campus", "academic_group": "Artic BSc PhD Pgm in Math Sci", "requirements": "Not for students who have taken MATH2040/2048. Pre-requisite: IMSC1038.", "description": "This is a continuation of IMSC1038. Topics include: abstract vector spaces, linear transformations, matrix representation, nullity and rank, properties of determinants, diagonalization, Cayley-Hamilton theorem, inner product spaces, normal and self-adjoint operators, unitary and orthogonal operators, bilinear forms, dual spaces, canonical forms, spectral theorem.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "2058", "title": "Analysis I", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "Lecture\nInteractive Tutorial", "campus": "Main Campus", "academic_group": "Artic BSc PhD Pgm in Math Sci", "requirements": "Not for students who have taken MATH2050/2058. Co-requisite: IMSC1038.", "description": "This course is intended to provide conceptual understanding in the theory of functions of one or more real variables. Topics include: real numbers, real valued functions, set notations; limits of sequences (including limsup and liminf), convergence, Bolzano-Weierstrass, infinite series; limits of functions, continuous functions, uniform continuity.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "2068", "title": "Analysis II", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "Lecture\nInteractive Tutorial", "campus": "Main Campus", "academic_group": "Artic BSc PhD Pgm in Math Sci", "requirements": "Not for students who have taken MATH2060/2068. Pre-requisite: IMSC2058.", "description": "This is a continuation of IMSC2058. Topics include: differentiability in one or higher dimensions, mean-value theorem, Taylor theorem, convexity; integrability in one or higher dimensions, fundamental theorem of calculus, improper integrals, Fubini's theorem for double series and continuous functions; power series, radius of convergence, series for elementary functions, real analyticity; sequence and series of functions, uniform convergence.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}]