[{"code": "1300", "title": "Introduction to Learning Sciences", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "Classwork\nDiscussion\nLecture\nProject", "campus": "Main Campus", "academic_group": "Learning Design & Tech PC", "requirements": "", "description": "This course provides an overview of basic concepts and theories of learning sciences.First, concepts and theories of cognitive psychology related to learning are introduced, including but not limited to attention, language processing, working memory, long-term memory, meaningful learning, constructivism, knowledge representation, memory processes of encoding, retrieval, and forgetting.Second, evidence-based instructional strategies and principles based on research in learning sciences are discussed, such as attention/memory training, flipped classroom, speed reading, learning styles, game-based learning, feedback, worked examples, spacing and interleaving, influence of mood and anxiety, metacognition and self-regulation, and practice testing.", "outcome": "Upon completion of this course, students should be able to:1.  demonstrate an understanding of psychological theories of learning sciences and their relationship with instructional practices2.  describe, analyze, and evaluate evidence-based instructional strategies and/or principles based on research in learning sciences3.  apply effective evidence-based instructional strategies to foster students' learning (Individual course teachers may update the learning outcome as and whenever necessary.) 完成本科後，學生應該能夠：1.  展示對學習科學的心理學理論及其與教學實踐的關係的理解2.  描述、分析和評估基於學習科學的研究和以實證為基礎的教學策略和原則3.  應用有效而以實證為基礎的教學策略來促進學生的學習 （個別科目教師可在必要時更新學習成果。）", "syllabus": "Week 1: Course introduction; Basic concepts of learning sciences Week 2: Cognitive theories of learning sciencesWeek 3: Attention, memory, and cognitive trainingWeek 4: Language processing, text comprehension, and speed readingWeek 5: Desirable difficulty and feedbackWeek 6: Worked examples and analogical reasoningWeek 7: Emotion, anxiety, and cognitionWeek 8: Cognitive load, multimedia, and game-based learningWeek 9: Metacognition, self-regulated learning, and flipped classroomWeek 10: Spacing and InterleavingWeek 11: Practice testingWeek 12: Group presentationWeek 13: Wrap up (Individual course teachers may update the course syllabus as and whenever necessary.)", "required_readings": "(Please refer to the course outline of respective teacher for details.)1.  Schunk, D.H. (2019). Learning theories: An educational perspective (8th Ed.). NJ: Pearson. ", "recommended_readings": "(Please refer to the course outline of respective teacher for details.)1.  Anderson, L.W., Krathwohl, D.R., Airasian, P.W., Cruikshank, K.A., Mayer, R.E., Pintrich, P.R., Raths, J., & Wittrock, M.C. (Eds.). (2001). A taxonomy for learning, teaching, and assessing: A revision of Bloom’s taxonomy of educational objectives. NY: Longman.2.  Benassi, V.A., Overson, C.E. & Hakala, C.M. (2014). Applying science of learning in education: Infusing psychological science into the curriculum. Retrieved from the Society for the Teaching of Psychology web site: http://teachpsych.org/ebooks/asle2014/index.php3.  DeLozier, S.J., & Rhodes, M.G. (2017). Flipped classrooms: A review of key ideas and recommendations for practice. Educational Psychology Review, 29, 141-151.4.  Domjan, M. (2020). Principles of learning and behavior (7th Ed.). CA: Cengage.5.  Dunlosky, J., Rawson, K.A., Marsh, E.J., Nathan, M.J., & Willingham, D.T. (2013). Improving students’ learning with effective learning techniques: Promising directions from cognitive and educational psychology. Psychological Science in the Public Interest, 14.6.  Hacker, D.J., Dunlosky, J., & Graesser, A.C. (Eds.) (2009). Handbook of metacognition in education. NY: Routledge.7.  Halpern, D.F., Graesser, A., & Hakel, M. (2007). 25 Learning principles to guide pedagogy and the design of learning environments. Washington DC: Association for Psychological Science.8.  Hirsh-Pasek, K., Zosh, J.M., Golinkoff, R.M., Gray, J.H., Robb, M.B., & Kaufman, J. (2015). Putting education in \"Educational\" Apps: Lessons from the science of learning. Psychological Science in the Public Interest, 16.9.  Kozhevnikov, M., Evans, C., & Kosslyn, S. M. (2014). Cognitive style as environmentally sensitive individual differences in cognition: A modern synthesis and applications in education, business, and management. Psychological Science in the Public Interest, 15.10.  Mayer, R.E. (2008). Learning and instruction (2nd Ed.). NJ: Pearson.11.  Mayer, R.E. (2011). Applying the science of learning. MA: Pearson.12.  Mayer, R.E. (2020). Multimedia learning (3rd Ed.). UK: Cambridge University Press.13.  Mayer, R.E., & Alexander, P.A. (Eds.) (2011). Handbook of research on learning and instruction. NY: Routledge.14.  Ormrod, J.E. (2019). Human learning (8th Ed.). NJ: Pearson.15.  Pashler, H., Bain, P.M., Bottge, B.A., Graesser, A., Koedinger, K.R., McDaniel, M., & Metcalfe, J. (2007). Organizing instruction and study to improve student learning. Institute of Educational Sciences practice guide. Washington DC: National Center for Educational Sciences.16.  Pashler, H., McDaniel, M., Rohrer, D., & Bjork, R. (2009). Learning styles: Concepts and evidence. Psychological Science in the Public Interest, 9, 105-119.17.  Rayner, K., Schotter, E. R., Masson, M. E., Potter, M. C., & Treiman, R. (2016). So much to read, so little time: How do we read, and can speed reading help? Psychological Science in the Public Interest, 17.18.  Redick, T.S., Shipstead, Z., Wiemers, E.A., Melby-Lervåg, M., & Hulme, C. (2015). What’s working in working memory training? An educational perspective. Educational Psychology Review, 27, 617-633.19.  Schunk, D.H., & Greene, J.A. (Eds.) (2017). Handbook of self-regulation of learning and performance. (2nd Ed.). NY: Routledge.20.  Simons, D.J., Boot, W.R., Charness, N., Gathercole, S.E., Chabris, C.F., Hambrick, D.Z., & Stine-Morrow, E.A.L. (2016). Do “Brain-Training” Programs Work? Psychological Science in the Public Interest, 17, 103-186.21.  Waters, H.S., Schneider, W., & Borkowski, J. (Eds.) (2009). Metacognition, strategy use, and instruction. NY: Guilford Press.22.  Wixted, J.T. (2017). (Ed.) Cognitive psychology of memory. Vol. 2 of Learning and memory: A comprehensive reference (2nd Ed.). Oxford: Elsevier.23.  Zhang, L.F., Biggs, J., & Watkins, D. (2010). Learning and development of Asian students: What the 21st century teacher needs to think about. Singapore: Pearson.", "terms": {"2024-25 Term 2": {"--LEC (9228)": {"startTimes": ["10:30"], "endTimes": ["13:15"], "days": [4], "locations": ["Ho Tim Building 107"], "instructors": ["Professor TSE Chi Shing"], "meetingDates": ["9/1", "16/1", "23/1", "6/2", "13/2", "20/2", "27/2", "13/3", "20/3", "27/3", "3/4", "10/4", "17/4"]}}}, "assessments": {"Presentation": "10", "Project": "30", "Short answer test or exam": "30", "Selected response test or exam": "30"}}, {"code": "2100", "title": "Learning Design in New and Emerging Educational Contexts", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "Discussion\nLecture\nOthers\nProject", "campus": "Main Campus", "academic_group": "Learning Design & Tech PC", "requirements": "", "description": "This course aims to discuss what, why and how learning design elements can/ should be incorporated in learning environments to support effective learning in new and emerging educational contexts. Particularly, the focus of the course will be on examining the integration of learning design principles and approaches in accordance with the educational goals of the twenty-first century.", "outcome": "By the end of the course, participants will:1.  understand the rationales and underpinning theories behind various learning design principles;2.  employ appropriate learning design approaches to supporting multiple ways of learning in face-to-face and online settings;3.  evaluate strengths and weaknesses of various learning design principles and approaches with respect to various educational contexts;4.  gain pedagogical knowledge and technological skills related to learning design in new and emerging educational contexts.", "syllabus": "-  Principles of learning design-  Instructional analysis-  Technological pedagogical context knowledge-  Inquiry-based learning-  Flipped learning- Computer-supported collaborative learning- Project-based learning", "required_readings": "1.  Bergmann, J., & Sams, A. (2015). Flipped learning: Gateway to student engagement. International Society for Technology in Education.2.  Dirksen, J. (2015). Design for how people learn. New Riders.3.  Herring, M. C., Koehler, M. J., & Mishra, P. (Eds.) (2016). Handbook of technological pedagogical content knowledge (TPACK) for educators (2nd ed.). Routledge.4.  Howland, J., Jonassen, D., & Marra, R. (2012). Meaningful learning with technology (4th ed.). Cambridge University Press.5.  Lombardozzi, C. (2015). Learning environments by design. Association for Talent Development.6.  Mayer, R. E. (2020). Multimedia learning (3rd ed.). Cambridge University Press.7.  Merrill, M. D. (2013). First principles of instruction: Identifying and designing effective, efficient and engaging instruction. Wiley.8.  Spector, M. J., Barbara, B. L., & Childress, M. D. (Eds.) (2019). Learning, design and technology: An international compendium of theory, research, practice and policy. Springer.9.  West, R. E. (2018). Foundations of learning and instructional design technology: Historical roots and current trends. EdtechBooks.", "recommended_readings": "1.  Anderson, L. W., & Krathwohl, D. R. (Eds.). (2001). A taxonomy for learning, teaching, and assessing: A revision of Bloom's taxonomy of educational objectives. Longman.2.  Bower, M., & Jong, M. S. Y. (2020). Immersive virtual reality in education. British Journal of Education Technology, 51(6), 1981–1990.3.  Chi, M. T. H., & Wiley, R. (2014). The ICAP framework: Linking cognitive engagement to active learning outcomes. Educational Psychologist, 49(4), 219–243.4.  Diaz, P., Ioannou, A., Bhagat, K. K., & Spector, M. J. (Eds.). (2019). Learning in a Digital World: Perspective on Interactive Technologies for Formal and Informal Education. Springer.5.  Jong, M. S. Y., Chan, T., Hue, M. T., & Tam, V. (2018). Gamifying and mobilising social enquiry-based learning in authentic outdoor environments. Educational Technology & Society, 21(4), 277–292.6.  Keller, J. M. (2010). Motivational design for learning and performance: The ARCS model approach. Springer.7.  Koh, J. H. L., Chai, C. S., Wong, B., & Hong, H. Y. (2015). Design thinking for education: Conceptions and applications in teaching and learning. Springer.8.  Kolb, D. (2015). Experiential learning (2nd ed.). Pearson.9.  Prensky, M. (2016). Education to better their world: Unleashing the power of 21st-century kids. Teachers College Press.10.  Small, R. V., Arone, M. P., Stripling, B., & Berger, P. (2012). Teaching for inquiry: Engaging the learner within. Neal-Schuman.11.  Yu, S. Q., Ally, M., & Tsinakos, A. (2020). Emerging technologies and pedagogies in the curriculum. Springer.", "terms": {"2024-25 Term 1": {"--LEC (9344)": {"startTimes": ["8:30"], "endTimes": ["11:15"], "days": [4], "locations": ["Ho Tim Building G2"], "instructors": ["Professor CHIU Kin Fung"], "meetingDates": ["5/9", "12/9", "19/9", "26/9", "3/10", "10/10", "17/10", "24/10", "31/10", "7/11", "14/11", "21/11", "28/11"]}}}, "assessments": {"Classwork": "30", "Essays": "30", "Project": "40"}}, {"code": "2110", "title": "Educational Analytics", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "Discussion\nIndependent Study\nLecture\nProject\nWeb-enhanced Teaching\nWorkshop", "campus": "Main Campus", "academic_group": "Learning Design & Tech PC", "requirements": "", "description": "Analysis of learner data provides valuable insight into learning processes to understand and optimize learning environments. This enables universities, schools, and training organizations to improve the quality and overall efficiency of learning. This course will provide an introduction to analytics in learning and how it is being deployed in various contexts in education, including to inform educators, and to promote scientific discovery. Students will explore the logic of analytics, the basics of cleaning and using educational data, context analysis, and predictive models. This course will also discuss tools and analytics methods that educators need, and how to protect learner privacy and other rights.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "3100", "title": "Design Thinking as Scientific Inquiry", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "Discussion\nIndependent Study\nLecture\nProject\nWeb-enhanced Teaching\nWorkshop", "campus": "Main Campus", "academic_group": "Learning Design & Tech PC", "requirements": "", "description": "Design thinking as scientific inquiry is an innovative approach for developing user-centered innovative solutions in business and society. This course will discuss design thinking principles such as user participation, problem framing, prototype making, experimentation and evaluation, visualization and diversity, which are essential skills for management and innovation. It will also discuss how design thinking drives innovation and solves some of the most global and local complex problems, for example, develop new product/service development, and address strategic, operational, organizational and social issues. Upon completion, students are able to apply design thinking to their own situations and organizations, and plan for how to embed this type of thinking to drive innovation.", "outcome": "On successful completion of this course, students will be able to:1.  understand design thinking and scientific inquiry, their phases and operation, and their application in practice;2.  understand how design thinking principles solve different problems in different contexts;3.  recognize the value of design thinking and scientific inquiry to organizations, economies and society;4.  apply the design thinking as scientific inquiry to create and manage projects.", "syllabus": "There are five topics in this course-  Introduction to design thinking and scientific inquiry-  General approaches to design thinking-  Design thinking as scientific inquire approaches-  Design thinking techniques-  The impact of design thinking-  Implementations of design thinking", "required_readings": "1.  Bjögvinsson, E., Ehn, P., & Hillgren, P. A. (2012). Design things and design thinking: Contemporary participatory design challenges. Design issues, 28(3), 101-116.Henriksen, D., Richardson, C., & Mehta, R. (2017). Design thinking: A creative approach to educational problems of practice. Thinking skills and Creativity, 26, 140-153.2.  Johansson‐Sköldberg, U., Woodilla, J., & Çetinkaya, M. (2013). Design thinking: past, present and possible futures. Creativity and innovation management, 22(2), 121-146.3.  Liedtka, J. (2015). Perspective: Linking design thinking with innovation outcomes through cognitive bias reduction. Journal of product innovation management, 32(6), 925-938.", "recommended_readings": "1.  Brenner, W., Uebernickel, F., & Abrell, T. (2016). Design thinking as mindset, process, and toolbox. In Design thinking for innovation (pp. 3-21). Springer, Cham.2.  McCarthy, S. (2020). Design at Stanford: The D. school’s Daddy. In Research & Education in Design: People & Processes & Products & Philosophy (pp. 207-210). CRC Press.3.  Plattner, H., Meinel, C., & Weinberg, U. (2009). Design-thinking. Landsberg am Lech: Mi-Fachverlag.", "terms": {"2024-25 Term 2": {"--LEC (9230)": {"startTimes": ["14:30"], "endTimes": ["17:15"], "days": [3], "locations": ["Ho Tim Building G2"], "instructors": ["Dr. CHAN To"], "meetingDates": ["8/1", "15/1", "22/1", "5/2", "12/2", "19/2", "26/2", "12/3", "19/3", "26/3", "2/4", "9/4", "16/4"]}}}, "assessments": {"Essays": "30", "Online discussion or forum": "30", "Project": "40"}}, {"code": "3110", "title": "Digital Citizenship Education", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "Discussion\nIndependent Study\nLecture\nProject\nWeb-enhanced Teaching\nWorkshop", "campus": "Main Campus", "academic_group": "Learning Design & Tech PC", "requirements": "", "description": "A digital citizen is a person who develops the skills, literacy, competence to safely and effectively use the internet and digital technologies. It plays a powerful role in facilitating people learn, connect, engage with their community, and create more promising futures. This course will discuss competencies of digital citizenship such as digital literacy, artificial intelligence literacy, media literacy, and computational thinking. Students will design, develop, and evaluate a digital citizenship program is used by individuals, nonprofits, schools, and governments all over the world.", "outcome": "On successful completion of this course, students will be able to:1. describe and explain different literacies needed for digital citizens;2. understand the importance of the digital citizenships competencies in different context;3. design, develop and evaluate a digital citizenship education program.", "syllabus": "There are seven topics in this course:-Introduction to digital citizenship-Digital literacy-Media literacy-Artificial intelligence-Computational thinking skills-Privacy and ethical issue-Digital citizenship education project design and development", "required_readings": "1. Lauricella, A. R., Herdzina, J., & Robb, M. (2020). Early childhood educators’ teaching of digital citizenship competencies. Computers & Education, 158, 103989.2. Richardson, J., & Milovidov, E. (2019). Digital citizenship education handbook: Being online, well-being online, and rights online. Council of Europe.", "recommended_readings": "1. Richardson, J., & Milovidov, E. (2019). Digital citizenship education handbook: Being online, well-being online, and rights online. Council of Europe.2. List, A. (2019). Defining digital literacy development: An examination of pre-service teachers’ beliefs. Computers & Education, 138, 146-158.3. Long, D., & Magerko, B. (2020, April). What is AI literacy? Competencies and design considerations. In Proceedings of the 2020 CHI conference on human factors in computing systems (pp. 1-16).", "terms": {"2024-25 Term 2": {"--LEC (9229)": {"startTimes": ["13:30"], "endTimes": ["16:15"], "days": [1], "locations": ["Ho Tim Building G3"], "instructors": ["Professor CHIU Kin Fung"], "meetingDates": ["6/1", "13/1", "20/1", "27/1", "10/2", "17/2", "24/2", "10/3", "17/3", "24/3", "31/3", "7/4", "14/4"]}}}, "assessments": {"Online discussion or forum": "30", "Project": "30", "Report": "40"}}, {"code": "3120", "title": "Sustainability of Educational technology", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "Discussion\nIndependent Study\nLecture\nProject\nWeb-enhanced Teaching\nWorkshop", "campus": "Main Campus", "academic_group": "Learning Design & Tech PC", "requirements": "", "description": "Educational technologies improve teaching and learning through the application of educational technologies used in K-12 schools, higher education institutions, corporations, organizations, associations, governments and foundation. Their implementation and sustainability are crucial to their efficiencies. This course will discuss different related theories and models to promote educational technology. Students will recognize how to introduce and sustain educational technologies in the communities.", "outcome": "On successful completion of this course, students will be able to:1. describe and explain theories of educational technology innovation;2. understand how to sustain educational technology development in communities;3. design and develop an educational technology strategical plan.", "syllabus": "There are four topics in this course:-Introduction to educational technology and innovation-Organizational learning-Educational innovation diffusion​-Educational technology strategies plan ", "required_readings": "1. Niederhauser, D. S., Howard, S. K., Voogt, J., Agyei, D. D., Laferriere, T., Tondeur, J., & Cox, M. J. (2018). Sustainability and scalability in educational technology initiatives: Research-informed practice. Technology, Knowledge and Learning, 23(3), 507-523.2. Yuen, K. F., Cai, L., Qi, G., & Wang, X. (2021). Factors influencing autonomous vehicle adoption: An application of the technology acceptance model and innovation diffusion theory. Technology Analysis & Strategic Management, 33(5), 505-519.3. Basten, D., & Haamann, T. (2018). Approaches for organizational learning: A literature review. Sage Open, 8(3), 2158244018794224.", "recommended_readings": "1. Liu, Q., Geertshuis, S., & Grainger, R. (2020). Understanding academics' adoption of learning technologies: A systematic review. Computers & Education, 151, 103857.2. Ishak, R., & Mansor, M. (2020). The relationship between knowledge management and organizational learning with academic staff readiness for education 4.0. Eurasian Journal of Educational Research, 20(85), 169-184.", "terms": {"2024-25 Term 1": {"--LEC (9345)": {"startTimes": ["14:30"], "endTimes": ["17:15"], "days": [2], "locations": ["Ho Tim Building G3"], "instructors": ["Professor CHIU Kin Fung"], "meetingDates": ["3/9", "10/9", "17/9", "24/9", "8/10", "15/10", "22/10", "29/10", "5/11", "12/11", "19/11", "26/11"]}}}, "assessments": {"Online discussion or forum": "30", "Project": "30", "Report": "40"}}, {"code": "3200", "title": "Leading Innovations in Organizations in the Era of Globalization", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "Discussion\nLecture\nProject", "campus": "Main Campus", "academic_group": "Learning Design & Tech PC", "requirements": "", "description": "This course aims to provide a broad understanding of the importance of innovation to organizations and the role of innovative leadership in the contemporary society. Various types of innovation and models of organizations and leadership will be explored to elucidate their inter-relationships. Students will have an opportunity to examine the characteristics of innovative learning organizations with real-life examples including the organizational structure, culture and leadership strategies for organizational change. Key processes of organizational learning, teamwork, strategic development and knowledge management will be analyzed in specific contexts. Through reviewing a range of literature and applying it to multiple scenarios, students are encouraged to integrate theory with practice and develop their leadership capacity for driving innovation in different organizational settings.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "3500", "title": "Internship", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "Field Studies/Field-trip\nPracticum\nSeminar\nInteractive Tutorial", "campus": "Main Campus", "academic_group": "Learning Design & Tech PC", "requirements": "", "description": "This course is a form of experiential learning, which provides opportunities for students to put the knowledge and skills they have learned from the programme into practice via engaging in a real-life career in the learning design and technology industry. Areas of industry attachment include technology companies, e-learning service providers, training and development companies, universities, schools, libraries and governmental organizations. Students are expected to carry out their responsibilities as if they are full-time employees of the industry they are attached to. Evaluation of student performance will be based on multiple sources, such as participation in tutorials, internship performance, the internship report, and evaluation by the industry supervisor.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "3510", "title": "Educational Design Research (Research Method)", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "Classwork\nDiscussion\nLecture\nProject", "campus": "Main Campus", "academic_group": "Learning Design & Tech PC", "requirements": "", "description": "This course aims to provide an overview on various research methods (qualitative, quantitative and mixed methods) used in educational research and prepare students to conduct their own research project. The course will go through the steps in designing research topic and questions, searching and reviewing relevant literature, formulating research hypotheses, identifying suitable research tools and sampling methods, analyzing and interpreting research findings and writing up research reports with students. Students will also learn the principles of research ethics and procedures in obtaining ethics clearance at CUHK.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "4200", "title": "Educational Innovation and Society: A Comparative Perspective", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "Discussion\nLecture\nOthers", "campus": "Main Campus", "academic_group": "Learning Design & Tech PC", "requirements": "", "description": "Educational innovation can be found in processes, services, programmes and partnerships. Educational innovation improves teaching and learning, enhances wellbeing, ensures successful transitions and pathways, as well as alleviates inequity. This course will start with an introduction on the role of education in economic development followed by discussion on various forms of educational innovation in schooling systems including alternative schools. Case studies on innovative educational practice in different countries will be examined. Students will be asked to identify educational challenges that learners and teachers are grappling with. Guest lectures are offered by leaders of local or international social enterprises and foundations that practice and support educational innovations. Students will be invited to brainstorm and join social enterprises’ efforts to provide sustainable strategies to tackle development issues especially to that of educational equality. Evaluation on how educational innovations promote student learning will also be explored. At the end of the course, students will develop a proposal that advances current educational practices in our society reflecting community needs and addressing the social inequality and poverty issues.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "4210", "title": "Education, Technology and Human Development", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "Discussion\nExercise\nLecture\nOthers", "campus": "Main Campus", "academic_group": "Learning Design & Tech PC", "requirements": "", "description": "This course provides an introductory survey of the links between education, technological advancement and human development in the globe. While digital and technological innovation accelerates economic growth and plays a critical role for reducing poverty, it also trigger social inequality issues. Further, technological changes (such as computerization, artificial intelligence, etc.) will fundamentally alter the nature of professions and of high skilled jobs generally. The course starts with an overview of the current educational attainment and schooling investments across the world. This is followed by exploring the demand for human capital and educational investments aligned with economic development, public financing of education. Students will also be able to examine interactions between education, technology and development from social and economic perspectives on other issues, including compulsory education reform, manpower planning and curriculum reform, automation and its impact on jobs and labor market, gender gap in schooling and STEM subjects, welfare policy reforms and its impact on children.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "4300", "title": "Instructional Design for Students with SEN in Technology-Supported Learning Environments", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "Discussion\nLecture\nProject", "campus": "Main Campus", "academic_group": "Learning Design & Tech PC", "requirements": "Not for students who have taken EDUC4340.", "description": "This course aims to provide students with fundamental knowledge of selected areas of special needs (learning disabilities, autism spectrum disorder, attention deficit / hyperactivity disorder, emotional and behavioral disorder, and giftedness) and help them to understand possible learning difficulties children with these special needs would encounter. For each kind of special need, students will learn its characteristics, causes, and provision of special education in Hong Kong. Besides, this course will also prepare students for designing effective solutions using technology for children with learning, literacy, and cognitive challenges.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "4500", "title": "Project in Learning Design and Technology", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "Discussion\nIndependent Study\nLecture\nProject\nThesis Monitoring Course", "campus": "Main Campus", "academic_group": "Learning Design & Tech PC", "requirements": "Pre-requisite: LDTE3510.", "description": "This is a two-semester course for final year students of the programme. Under the guidance of project supervisors, students are required to complete an individual project pertaining to the applications of learning, design, and technology in education, workplace, or other organizational settings. They should draw on theoretically-informed and empirically-validated learning design frameworks to design innovative and authentic technology-enriched learning experiences for the participants so that the curricular goals are attained. They should propose a project in the field of Learning Design and Technology and execute that project from analysis to evaluation.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "(2110)", "title": "Educational Analytics\n\n** available as of 2023-07-01", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "Discussion\nIndependent Study\nLecture\nProject\nWeb-enhanced Teaching\nWorkshop", "campus": "Main Campus", "academic_group": "Learning Design & Tech PC", "requirements": "", "description": "Analysis of learner data provides valuable insight into learning processes to understand and optimize learning environments. This enables universities, schools, and training organizations to improve the quality and overall efficiency of learning. This course will provide an introduction to analytics in learning and how it is being deployed in various contexts in education, including to inform educators, and to promote scientific discovery. Students will explore the logic of analytics, the basics of cleaning and using educational data, context analysis, and predictive models. This course will also discuss tools and analytics methods that educators need, and how to protect learner privacy and other rights.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "(3100)", "title": "Design Thinking as Scientific Inquiry\n\n** available as of 2023-07-01", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "Discussion\nIndependent Study\nLecture\nProject\nWeb-enhanced Teaching\nWorkshop", "campus": "Main Campus", "academic_group": "Learning Design & Tech PC", "requirements": "", "description": "Design thinking as scientific inquiry is an innovative approach for developing user-centered innovative solutions in business and society. This course will discuss design thinking principles such as user participation, problem framing, prototype making, experimentation and evaluation, visualization and diversity, which are essential skills for management and innovation. It will also discuss how design thinking drives innovation and solves some of the most global and local complex problems, for example, develop new product/service development, and address strategic, operational, organizational and social issues. Upon completion, students are able to apply design thinking to their own situations and organizations, and plan for how to embed this type of thinking to drive innovation.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "(3500)", "title": "Internship\n\n** available as of 2023-07-01", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "Field Studies/Field-trip\nPracticum\nSeminar\nInteractive Tutorial", "campus": "Main Campus", "academic_group": "Learning Design & Tech PC", "requirements": "", "description": "This course is a form of experiential learning, which provides opportunities for students to put the knowledge and skills they have learned from the programme into practice via engaging in a real-life career in the learning design and technology industry. Areas of industry attachment include technology companies, e-learning service providers, training and development companies, universities, schools, libraries and governmental organizations. Students are expected to carry out their responsibilities as if they are full-time employees of the industry they are attached to. Evaluation of student performance will be based on multiple sources, such as participation in tutorials, internship performance, the internship report, and evaluation by the industry supervisor.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}]