[{"code": "2110", "title": "Pedagogical Content Knowledge in Science, Technology and the Environment", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "Classwork\nDiscussion\nLecture", "campus": "Main Campus", "academic_group": "Liberal Studies Pgm Comm", "requirements": "Pre-requisite: LSED2220 and 2230", "description": "This course aims at helping students to acquire pedagogical content knowledge in the Area of “Science, Technology and the Environment”. It enables students to acquire a deeper understanding of subject knowledge in this specific Area of Study, think about subject knowledge from the students’ perspectives, apply subject knowledge from the perspective of multidisciplinary teaching, and organize instructional strategies of issue-based teaching in relevant conceptual and contextual considerations.The focus will be placed on understanding the scientific and technological principles and social implications of “Public Health and Technology” and “Energy and the Environment”. Students will be guided to apply relevant subject knowledge and skills in these areas to discuss and enquire into various related issues in order to reach evidence-based judgment and decisions. The implications of the processes and the results from these enquiries on the learning and teaching of Liberal Studies will be fully discussed.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "2210", "title": "Pedagogical Content Knowledge in Society and Culture", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "Lecture\nOthers\nProject", "campus": "Main Campus", "academic_group": "Liberal Studies Pgm Comm", "requirements": "Pre-requisite: LSED2110 and 2310", "description": "This course aims at helping students to acquire pedagogical content knowledge in the Area of “Society and Culture”. It enables students to acquire a deeper understanding of subject knowledge in this specific Area of Study, think about subject knowledge from the students’ perspectives, apply subject knowledge from the perspective of multidisciplinary teaching, and organize instructional strategies of issue-based teaching in relevant conceptual and contextual considerations.The Area of Study includes the following modules: Hong Kong Today, Modern China and Globalization. The focus of this course will be placed on enabling students to analyze the human conditions in certain social development and cultural contexts, with reference to their related subject knowledge and concepts from multi-disciplinary perspectives. In addition, issues-based teaching will be adopted to facilitate the students to reflect on the contradictions and values which have been embedded in various phenomena.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "2220", "title": "Foundations of Disciplinary Knowledge and General Education", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "Discussion\nLecture\nOthers\nProject", "campus": "Main Campus", "academic_group": "Liberal Studies Pgm Comm", "requirements": "", "description": "This course aims to introduce the theoretical and pedagogical nature of Liberal Studies (LS) and its foundational knowledge to students. In the first part of the course, students will be provided an overview on the theoretical and pedagogical underpinnings of the subject, including the curriculum classification “integrated curriculum”; the guiding philosophical principles “constructivist and student-centered approaches”; and pedagogic practice “issue-enquiry approach.”.In the second part of the course, the liberal studies approach to knowledge and education will be applied to inquire into three areas of studies in the context of the twenty-first century. The areas are (1) self and personal development, (2) society and culture, and (3) science, technology and the environment. These three areas are basically in correspondence with the three areas of study stipulated in syllabus of the Liberal Studies in the Hong Kong senior-secondary curriculum. In each area, concepts and theories related to the areas of inquiry are introduced. It attempts to lay the pedagogical foundation for the teaching and learning of liberal studies in secondary schools in Hong Kong Special Administrative Region.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "2230", "title": "Liberal Studies and Methods of Inquiry", "career": "Undergraduate", "units": "2.00", "grading": "Graded", "components": "Discussion\nLecture\nOthers\nProject", "campus": "Main Campus", "academic_group": "Liberal Studies Pgm Comm", "requirements": "Co-requisite: LSED2220", "description": "This course aims to help students understand the nature of Liberal Studies and its theoretical and pedagogical foundations. Various perspectives on Liberal Studies and different interpretations of its genesis and its significance will be explored. Issue-based inquiry and its variations will be introduced and examined. The conceptual and pedagogical features of various methods of inquiry, including conceptual, factual, valuative and critical, will be explicated using issues related to Liberal Studies curriculum in Hong Kong secondary schools.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "2310", "title": "Pedagogical Content Knowledge in Self and Personal Development", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "Classwork\nDiscussion\nExercise\nLecture\nOthers\nProject\nInteractive Tutorial", "campus": "Main Campus", "academic_group": "Liberal Studies Pgm Comm", "requirements": "Pre-requisite: LSED2220 and 2230", "description": "This course aims to facilitate students’ acquisition of the pedagogical content knowledge in the area of \"Self and Personal Development\". It enables students to develop a more comprehensive understanding of the subject knowledge in this specific area of study, think about subject knowledge from the learners' perspectives, apply subject knowledge from the perspective of multi-disciplinary teaching, and organize instructional strategies of issue-based teaching.The focus will be placed on understanding personal development and interpersonal relationships in the context of family, peers, and society. Pedagogical strategies like group discussion, debate, role-play, news analysis and independent-enquiry studies, etc. will be introduced to illustrate how the various issues in the module can be addressed.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "2320", "title": "Independent Enquiry Studies (I): Research Methods", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "Discussion\nExercise\nField Studies/Field-trip\nLecture", "campus": "Main Campus", "academic_group": "Liberal Studies Pgm Comm", "requirements": "", "description": "This course aims to help students understand research process and common research methodology relevant to Independent Enquiry Studies (IES). It introduces student skills including: (a) develop research questions, (b) design a research plan to collect quantitative and/or qualitative data, (c) conduct basic statistical and qualitative data analyses and (d) interpret and discuss results. Students will carry out a group research project to consolidate these skills. These skills prepare students to conduct research projects independently.Assessment Criteria:Participation in Class Discussion & In-class Exercises (10%)Attendance & active participations are expected.Group project presentation (45%)Each group would conduct a 20-mins presentation and lead the following 10-mins Q&A section. 35% of the course assessment would be allocated to the group presentation, 5% would be marked on the basis of your constructive feedbacks or critical comments on others’ presentations during the Q&A sections, and another 5% would be given by your groupmates as peer-evaluation.Literature Review Assignment (45%)Each student is required to select a research paper from the group project reading and provide a critique with the following sections: • A brief and precise summary of the research background, objectives and the research design. [10%]• Critical comment on its strength and weakness. [12%]• What methodological and/or ethical issues would you like to raise for further discussion? [8%]• How does this research contribute to your group research project? [5%]• What further studies would you suggest? Please briefly describe and explain. [5%]• Format & Writing quality. [3% + 2%]", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "3110", "title": "Principles of C&I in LS/Citizenship and Social Development I: Theories", "career": "Undergraduate", "units": "2.00", "grading": "Graded", "components": "Classwork\nDiscussion\nLecture\nPracticum", "campus": "Main Campus", "academic_group": "Liberal Studies Pgm Comm", "requirements": "Pre-requisite: LSED2210", "description": "This course examines the theoretical foundation of multidisciplinary and issue-based teaching in the context of curriculum development in Hong Kong. It discusses the pedagogy of issue-based learning, with reference to the design of school-based integrated humanities curriculum and the development of teaching materials for Liberal Studies/Citizenship and Social Development in senior secondary curriculum.", "outcome": "By the end of the course, students will be able to  1. understand how integrated curriculum in Hong Kong are shaped by pedagogical innovations such as issue-based learning, and how it is different from conventional subjects which have strong academic traditions;  2. understand the possible options for and problems of curriculum mapping in the implementation of Liberal Studies/Citizenship and Social Development in Hong Kong;  3. understand the need to bridge the gap between school-based curriculum in junior secondary school and Liberal Studies/Citizenship and Social Development in senior secondary school from the perspective of assessment for learning;  4. reflect on previous experience of designing individual teaching package and reach a deeper understanding of assessment criteria for effective classroom teaching", "syllabus": "1. Lesson delivery and lesson observation: context of observation 2. Lesson delivery and lesson observation: practical teaching on direct teaching and lesson script 3. Lesson delivery and lesson observation: teaching practice on classroom interaction and teachable moments 4. Lesson delivery and lesson observation: junior secondary on how to use the blackboard 5. Lesson delivery and lesson observation: senior secondary on how to write a lesson plan 6. Concept formation and classroom environment: analysis of teaching videos from TP school 7. Concept formation and classroom environment: analysis of teaching videos from TP school 8. Concept formation and classroom environment: analysis of teaching videos from TP school 9. Concept formation and classroom environment: analysis of teaching videos from TP school 10. Direct teaching of one key concept: individual practical teaching 11. Direct teaching of one key concept: individual practical teaching 12. Direct teaching of one key concept: individual practical teaching", "required_readings": "-N/A-", "recommended_readings": "Nieto, S. (2003). What keeps teachers going? New York: Teachers College Press.  Palmer, P. (1998). The courage to teach: exploring the inner landscape of a teacher's life. San Francisco, Calif.: Jossey-Bass. Comfort, C. Z. (2006). Observing in Schools: A Guide for Students in Teacher Education. Issues in Teacher Education, 15(2), 87.   Barak, M., & Shakhman, L. (2008). Fostering higher-order thinking in science class: teachers' reflections. Teachers & Teaching, 14(3), 191-208. Mansueto, A. (2006). A Question-Centered Approach to Liberal Education. Liberal Education, 92(4), 48-53.  Latta, M. M., Buck, G., Leslie-Pelecky, D., & Carpenter, L. (2007). Terms of inquiry. Teachers & Teaching, 13(1), 21-41.   Havnes, A. (2009). Talk, planning and decision-making in interdisciplinary teacher teams: a case study. Teachers & Teaching, 15(1), 155-176. Jacobs, H. H. (1989). Interdisciplinary curriculum: Design and implementation. Alexandria, Va.: Association for Supervision and Curriculum Development.  Johnson, David W. and Johnson, Roger T. (1999). Learning together and alone: Cooperative, Competitive, and Individualistic Learning. Fifth Edition. Boston, Massachusetts: Allyn and Bacon.  Nikitian, S. (2006). Three strategies for interdisciplinary teaching: contextualizing, conceptualizing, and problem-centring. Journal of Curriculum Studies., 38 (3), 251-271.   Bartels, B. H. (1998). Integrating the disciplines in the elementary grades with problem-based learning (Vol. 64, pp. 9-14).  Williams, R. A., Zdravkovich, V., & Engleberg, I. (2002). Liberal Education: Why Now? Why for All? Liberal Education, 88(4), 34. Jacobs, J. (2008). The Odd Couple Reflections on Liberal Education. Liberal Education, 94(3), 50-55.", "terms": {"2021-22 Term 1": {"--LEC (5669)": {"startTimes": ["9:30"], "endTimes": ["11:15"], "days": [3], "locations": ["Esther Lee Bldg 204"], "instructors": ["Dr. CHAN To"], "meetingDates": ["8/9", "15/9"]}}}, "assessments": {"Essays": "30", "Others": "50", "Presentation": "20"}}, {"code": "3120", "title": "Principles of C&I in LS/Citizenship and Social Development II: Practice", "career": "Undergraduate", "units": "2.00", "grading": "Graded", "components": "Classwork\nDiscussion\nLecture\nPracticum", "campus": "Main Campus", "academic_group": "Liberal Studies Pgm Comm", "requirements": "Prerequisite:LSED3110", "description": "This course provides student-teachers close supervision in the application of various pedagogical methodologies related to issue-based and multidisciplinary teaching. It includes analysis of videotapes of issue-based teaching, opportunities for individual practical teaching and peer review of teaching design.", "outcome": "By the end of the course, students will be able to 1. develop active teaching strategies such as mind maps, concept maps, group discussion, active reading, active writing;  2. develop skills in lesson planning; 3. develop principles and teaching skills in microteaching;  4. perform and reflect on practical teaching.", "syllabus": "1. Assessment for learning: Re-visit LSED 3110 assignments 2. Assessment for learning: Question types and double marking 3. Assessment for learning: Marking experience and skills development 4. Assessment for learning: Teaching with Students scripts 5. Assessment for learning: Teaching with Students scripts 6. Voluntary marker and Community Involvement: Marking scripts of DSE students from grass root families 7. Voluntary marker and Community Involvement: Marking scripts of DSE students from grass root families  8. Practical Teaching: Assessment for learning 9. Practical Teaching: Induction  10. Practical Teaching: Reduction  11. Practical Teaching: Stimulation and role play 12. Practical Teaching: Reading data", "required_readings": "-N/A-", "recommended_readings": "- Beyer, Barry K. (1987). Practical strategies for the teaching of thinking. Boston; London: Allyn and Bacon.  - Eggen, Paul D. and Kauchak, Donald P. (2001). Strategies for teachers: Teaching content and thinking skills (4th ed.). Boston, Massachusetts: Allyn and Bacon. - Erickson, Lynn (2001). Stirring the head, heart and soul: Redefining curriculum and instruction. CA: Corwin Press. - Halpern, Diane F. (1997). Critical thinking across the curriculum: A brief edition of thought and knowledge. Mahwah, N.J.: L. Erlbaum Associates. - Kwo, Ora (1999). Activating peer support: A strategic resource for quality enhancement in the teaching practicum. Hong Kong: INSTEP, Faculty of Education, University of Hong Kong.", "terms": {"2021-22 Term 2": {"--LEC (4760)": {"startTimes": ["11:30", "11:30"], "endTimes": ["13:15", "13:15"], "days": [1, 3], "locations": ["Wong Foo Yuan Bldg 107A", "Wong Foo Yuan Bldg 107A"], "instructors": ["Dr. WAN Wai Yan", "Dr. WAN Wai Yan"], "meetingDates": ["10/1", "17/1", "24/1", "12/1", "19/1", "26/1"]}}}, "assessments": {"Essays": "20", "Others": "30", "Presentation": "50"}}, {"code": "3130", "title": "Principles of C&I in LS/Citizenship and Social Development III: Class Experience & Reflection", "career": "Undergraduate", "units": "2.00", "grading": "Graded", "components": "Classwork\nDiscussion\nLecture", "campus": "Main Campus", "academic_group": "Liberal Studies Pgm Comm", "requirements": "Co-requisite:LSED3120", "description": "This course uses both case method and narrative method to afford student-teachers the opportunity to reflect on their own classroom experiences from teaching practice. It involves student-teachers in the formation of teacher knowledge, with particular connections to personal and professional development.", "outcome": "By the end of the course, students will be able to 1. review classroom experience by using a case method which comprises four attributes: intention, chance, judgment and reflection;  2. revisit the nature of pedagogical content knowledge by using a narrative method which comprises four dimensions: practical experience, interpretation, reflection and transformation; 3. involve in case organization, case writing, case commentary and case conferences; 4. develop teacher knowledge through effective learning such as agency, reflection and collaboration.", "syllabus": "1. A student who I remember most; Students’ feedback and evaluation at the end of TP; Teaching Practice Re-visited; Individual Teaching Portfolio.  2. Self Portrait and Critical events during TP  3. Marking experience: Issue-based cluster; Ability cluster; Question type cluster  4. Case writing: the attributes of a case are intention-chance-judgment-reflection (2000 words/2500 characters)  5. Professional journal entitled Narrative of experience: metaphors of learning to become a Liberal Studies/Citizenship and Social Development teacher (2000 words/2500 characters)", "required_readings": "-NA-", "recommended_readings": "1.Shulman, Lee S. (2004) The wisdom of practice: essays on teaching, learning, and learning to teach. San Francisco : Jossey-Bass. 2.Moore, Alex. (2004) The good teacher : dominant discourses in teaching and teacher education. London : RoutledgeFalmer. 3.Hargreaves, A. & Fullan, M.F. (1992) Understanding Teacher Development. New York: Teachers College Press.  4.Schon, D.A. (1987) Educating the Reflective Practioner. San Francisco: Joseey Bass. 5.Hargreaves, A. and Fullan, M. (1992) Understanding teacher development. London : Cassell ; New York, N.Y. : Teachers College Press. 6.Gudmundsdottir, Sigrun. (1995) \"The Narrative Nature of Pedagogical Content Knowledge\" in McEwan, Hunter & Egan, Kieran ed.. Narrative in Teaching, Learning, and Research. New York & London: Teachers College, Columbia University. 7.Beattie, Mary. (2007) The Art of Learning to teach: Creating Professional Narratives. Upper Saddle River, N.J.: Pearson Merrill Prentice Hall.", "terms": {"2021-22 Term 2": {"--LEC (8934)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["TBA"], "instructors": ["Dr. WAN Wai Yan"], "meetingDates": ["10/01/2022 - 18/04/2022"]}}}, "assessments": {"Essays": "60", "Presentation": "40"}}, {"code": "4140", "title": "Principles of C&I in LS/Citizenship and Social Development IV: Instructional Design & Implementation", "career": "Undergraduate", "units": "2.00", "grading": "Graded", "components": "Classwork\nDiscussion\nLecture", "campus": "Main Campus", "academic_group": "Liberal Studies Pgm Comm", "requirements": "Prerequisite:LSED3130", "description": "The course examines the stages of building an outstanding teaching portfolio, which documents a coherent story of the student-teacher as a reflective practitioner. It investigates the complex process of implementing an instructional design with particular reference to individual differences and assessment for learning.", "outcome": "By the end of the course, participants will be able to: 1. understand the stages of portfolio growth: an off-track portfolio, an emerging portfolio, an on-track portfolio and an outstanding portfolio;  2. review their own portfolio and become more aware of the stages of professional development; 3. develop critical thinking skills in content selection and lesson planning;  4. acquire skills in catering for individual differences and assessment for learning.", "syllabus": "1. What are the values of Liberal Studies/Citizenship and Social Development? 2. What are the issues and difficulties with teaching Liberal Studies/Citizenship and Social Development? What are the solutions?  3. How to do issue analysis?  4. Video lesson study  5. Assessment of Liberal Studies/Citizenship and Social Development in HKDSE- issues and solutions  6. Assessment of Liberal Studies/Citizenship and Social Development in classroom  7. Reflections after TP", "required_readings": "- 曽榮光. (2014) 確認高中通識科的時代與教育意義：課程社會學的分析  http://hkier.fed.cuhk.edu.hk/journal/wp-content/uploads/2014/08/EJ_V42N1_141-160.pdf - Evans, Ronald W., Ed.; Saxe, David Warren, Ed. (1996) Handbook on Teaching Social Issues.", "recommended_readings": "Public health knowledge: - Schneider, M. (2011).Introduction to public health (3rd ed.). Sudbury, Mass.: Jones and Bartlett. - Nuffield Council on Bioethics (2007) Public health : ethical issues. Nuffield Council on Bioethics  Environmental knowledge: Speth, J. G. (2008). The bridge at the edge of the world: capitalism, the environment, and crossing from crisis to sustainability. New Haven: Yale University Press. (E book in CU library)  Teaching and learning about LS: - Samuel Totten and Jon E. Pedersen. (2012). Educating about Social Issues in the 20th and 21st Centuries : A Critical Annotated Bibliography - EU. Living with Controversy -Teaching controversy issues through education for democratic citizenship and human rights: Training pack for teachers. (uploaded in blackboard)  Critical Thinking: - Barry, V. E., & Rudinow, J. (2004). Invitation to critical thinking (5 ed.). New York: Thomson. - 梁光耀 (2013) 思考學堂, 中華書局(香港)有限公司 - 陶國璋 (2013) 思考的盲點, 匯智出版社", "terms": {"2021-22 Term 1": {"--LEC (6157)": {"startTimes": ["TBA", "15:30"], "endTimes": ["TBA", "18:15"], "days": ["TBA", 4], "locations": ["No Room Required", "Yasumoto Int'l Acad Park 509"], "instructors": ["Mr. CHEUNG Kelvin, \n\nProfessor LAU Kwok Chi", "Mr. CHEUNG Kelvin, \n\nProfessor LAU Kwok Chi"], "meetingDates": ["06/09/2021 - 29/11/2021", "9/9", "16/9", "23/9", "30/9", "7/10"]}}, "2022-23 Term 1": {"--LEC (5175)": {"startTimes": ["15:30", "TBA"], "endTimes": ["18:15", "TBA"], "days": [4, "TBA"], "locations": ["Wong Foo Yuan Bldg 402", "No Room Required"], "instructors": ["Professor LAU Kwok Chi", "Professor LAU Kwok Chi"], "meetingDates": ["8/9", "15/9", "22/9", "29/9", "6/10", "13/10", "20/10", "27/10", "05/09/2022 - 28/11/2022"]}}}, "assessments": {"Homework or assignment": "45", "Project": "55"}}, {"code": "4320", "title": "Independent Enquiry Studies II: Proposal and Project Report", "career": "Undergraduate", "units": "2.00", "grading": "Graded", "components": "Discussion\nIndependent Study\nOthers\nProject", "campus": "Main Campus", "academic_group": "Liberal Studies Pgm Comm", "requirements": "Co-requisite: LSED2320.", "description": "This course aims to provide individual support for students to conduct an Independent Enquiry Studies. Each student will go through stages of research experience: proposal, literature review, data collection, data analysis and report writing.Assessment Criteria: Class participation, presentation and thesis writing", "outcome": "1. Conduct literature review to support research questions 2. Develop plan for data collection 3. Analyze data and review research questions  4. Interpret data critically and discuss the findings 5. Evaluate quality of a proposal and a presentation 6. Develop problem solving skills", "syllabus": "1. identify what research question they want to know more for their research project,  2. formulate a research topic using literature review, 3. develop a manageable research plan to collect data to answer their research questions,  4. analyze collected data critically and comprehensively, 5. Interpret and discuss the data with respect to other research findings, theories, and local relevance.", "required_readings": "For reference only, please refer to the course outline of respective teacher for details.  Kincheloe, J. L. (1991). Teachers as researchers: qualitative inquiry as a path to empowerment. London: The Falmer Press. Matthews, B. & Ross, L. (2010). Research Methods: a practical guide for the social sciences. New York: Pearson. [electronic version of the book is available and you can read it in CUHK Mylibrary]", "recommended_readings": "For reference only, please refer to the course outline of respective teacher for details.  Bogdan, R. C. & Biklen, S. K. (2007). Qualitative research for education: An introduction to theories and methods. Boston: Pearson.  Bruner, J. (1996). Culture, mind, and education. In J. Bruner. The Culture of Education(pp.1-43). Cambridge, MA: Harvard University Press.  Cochran-Smith, M. & Lytle, S. L.(1993). Inside/outside: Teacher research and knowledge. New York: Teachers College Record.  Cohen, L., Manion, L., & Morrison, K. (2000). Research methods in education. New York: Routledge.  Creswell, J. (2005). Educational research: Planning, conducting and evaluating quantitative and qualitative research. New Jersey: Pearson.  Creswell, J. W. (2007). Qualitative inquiry and research design: Choosing among five approaches. Thousand Oaks: SAGE. Gall, M. D., Gall, J. P. & Borg, W. R. (2007). Educational research: An introduction. Boston: Pearson.  Henson, K. T. (2003). Teachers as researchers. In J. W. Gutherie (Ed), Encyclopedia of education (pp. 53-64). New York: Macmillan.  Merriam, S. B. (2001). Qualitative research and case study applications in education. San Francisco: Jossey-Bass.  Mitchell, I. (2003). Why do teacher research? Perspectives from four stakeholders. In A. Clarke & G. Erickson (Eds.), Teacher inquiry: Living the research in everyday practice (pp. 199-208). London: RoutledgeFamler.", "terms": {"2021-22 Term 2": {"-J01-PRJ (4660)": {"startTimes": ["TBA", "16:30"], "endTimes": ["TBA", "18:15"], "days": ["TBA", 2], "locations": ["No Room Required", "Wong Foo Yuan Bldg 107A"], "instructors": ["Mr. CHEUNG Kelvin, \n\nProfessor LAU Kwok Chi", "Mr. CHEUNG Kelvin, \n\nProfessor LAU Kwok Chi"], "meetingDates": ["07/03/2022 - 18/04/2022", "11/1", "18/1", "25/1"]}}, "2022-23 Term 2": {"-J01-PRJ (5153)": {"startTimes": ["16:30"], "endTimes": ["18:15"], "days": [4], "locations": ["Wong Foo Yuan Bldg 107A"], "instructors": ["Professor LAU Kwok Chi"], "meetingDates": ["12/1", "19/1"]}}}, "assessments": {"Presentation": "20", "Participation": "10", "Report": "70"}}, {"code": "4910", "title": "Independent Study I", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "Independent Study", "campus": "Main Campus", "academic_group": "Liberal Studies Pgm Comm", "requirements": "", "description": "Students will pursue independent study in selected topics and areas of Liberal Studies/Citizenship and Social Development under the supervision of a teacher as appointed by the board of the Faculty of Education. The contents of the course will depend on the original course to be substituted. Students are required to independently do the readings and complete the assignments stipulated by the teacher. Students and the teachers will meet regularly to discuss the progress of learning and the assignments. The workload and standards of the course is commensurate with the substitute course.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "4920", "title": "Independent Study II", "career": "Undergraduate", "units": "2.00", "grading": "Graded", "components": "Independent Study", "campus": "Main Campus", "academic_group": "Liberal Studies Pgm Comm", "requirements": "", "description": "Students will pursue independent study in selected topics and areas of Liberal Studies/Citizenship and Social Development under the supervision of a teacher as appointed by the board of the Faculty of Education. The contents of the course will depend on the original course to be substituted. Students are required to independently do the readings and complete the assignments stipulated by the teacher. Students and the teachers will meet regularly to discuss the progress of learning and the assignments. The workload and standards of the course is commensurate with the substitute course.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}]