[{"code": "1001", "title": "Introduction to Materials Science and Engineering I", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "Lecture\nInteractive Tutorial", "campus": "Main Campus", "academic_group": "Materials Sci & Erg PC", "requirements": "", "description": "We live in a materials world. Throughout history, human civilization has always been defined by the materials used: from the stone age, bronze age, and iron age. In the modern era, human lives have become even more intertwined with materials. This course will provide an overview of the science and engineering of materials. The first half of the course will introduce fundamental aspects of bonding, crystallography, and microstructures, all of which form the building blocks of all materials. Fundamental concepts including defects, diffusion, and phase diagram will also be introduced. The second half of the course will introduce different classes of materials and their defining characteristics and physical properties: metals, semiconductors, ceramics, polymers, and composites. It will bring students to the fascinating world of materials across different length scales from atoms to devices and applications, and different time scales from a historical perspective of materials developments at the beginning of civilizations to today’s complex materials.", "outcome": "By the end of this course, student is expected to be able to:1. Understand the basics of materials science, including how they are classified, their bonding, and their structures.2. Basic understanding of different classes of materials for different applications.3. Gain awareness of the techno-economic and sustainability aspect in materials.4. Evaluate the importance of Materials Science in engineering technologies from a broadercontext.", "syllabus": "Week 1.    Historical perspective of materials Week 2.    Atomic Structure and Bonding Week 3.    Crystallography and Structure – Perfection  Week 4.    Crystallography and Structure – Imperfection/Defects  Week 5.    Diffusion Week 6.    Phase Diagram Week 7.    Kinetics and Phase TransformationWeek 8.    Metals and Metal AlloysWeek 9.    Ceramic MaterialsWeek 10.    Polymers and CompositesWeek 11.    Electronic Materials and SemiconductorsWeek 12.    Optical and Magnetic MaterialsWeek 13.    Economic, Environmental, and Societal Issues in Materials Science and Engineering", "required_readings": "Provided by the course teacher(s) in the respective teaching term.", "recommended_readings": "1.    Materials Science and Engineering, 9th Edition, Willian D. Callister, David G. Rethwisch,2013, John Wiley & Sons Inc.2.    Introduction to Materials Science for Engineers, James F. Shackleford, 8th Edition, Global Edition", "terms": {"2025-26 Term 2": {"--LEC (5138)": {"startTimes": ["9:30", "9:30"], "endTimes": ["11:15", "10:15"], "days": [1, 3], "locations": ["Mong Man Wai Bldg 704", "Chen Kou Bun Bldg UG03"], "instructors": ["Professor Ady SUWARDI", "Professor Ady SUWARDI"], "meetingDates": ["5/1", "7/1", "12/1", "14/1", "19/1", "21/1", "26/1", "28/1", "2/2", "4/2", "9/2", "11/2", "23/2", "25/2", "9/3", "11/3", "16/3", "18/3", "23/3", "25/3", "30/3", "1/4", "8/4", "13/4", "15/4"]}, "-T01-TUT (5141)": {"startTimes": ["10:30"], "endTimes": ["11:15"], "days": [3], "locations": ["Wong Foo Yuan Bldg 603"], "instructors": ["Professor Ady SUWARDI"], "meetingDates": ["7/1", "14/1", "21/1", "28/1", "4/2", "11/2", "25/2", "11/3", "18/3", "25/3", "1/4", "8/4", "15/4"]}, "-T02-TUT (5140)": {"startTimes": ["10:30"], "endTimes": ["11:15"], "days": [3], "locations": ["Chen Kou Bun Bldg UG03"], "instructors": ["Professor Ady SUWARDI"], "meetingDates": ["7/1", "14/1", "21/1", "28/1", "4/2", "11/2", "25/2", "11/3", "18/3", "25/3", "1/4", "8/4", "15/4"]}, "-T03-TUT (5139)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["No Room Required"], "instructors": ["Professor Ady SUWARDI"], "meetingDates": ["05/01/2026 - 13/04/2026"]}}}, "assessments": {"Attendance": "5", "Examination": "50", "Selected response test or exam": "45"}}, {"code": "1002", "title": "Introduction to Materials Science and Engineering II", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "Lecture\nInteractive Tutorial", "campus": "Main Campus", "academic_group": "Materials Sci & Erg PC", "requirements": "", "description": "This course covers how materials are made, materials properties, and the intricate relationship between composition-processing-structures-properties of materials. The first half of the course encompasses mechanical, electrical, thermal, magnetic, and optical properties of materials. Fundamental factors defining materials properties such as chemical composition, processing, and structures will also be discussed in more details. The second half of the course covers materials processing for metals, semiconductors, ceramics, polymers, and composites. It aims at providing a basic understanding of how materials are made. Students will also be introduced to various applications of each class of materials. This course concludes with forward-looking discussion on the emerging role of AI for materials discovery and development.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "1801", "title": "Materials Laboratory", "career": "Undergraduate", "units": "2.00", "grading": "Graded", "components": "Laboratory", "campus": "Main Campus", "academic_group": "Materials Sci & Erg PC", "requirements": "", "description": "This course aims to provide students with basic hands-on experience in materials processing. Throughout the course, students will be introduced to 5 different sections, namely metals, semiconductors, ceramics, polymers, and composites. Each of the sections will provide hands-on experience on materials composition, materials processing, and basic structural features of materials. Students will also be encouraged to understand the intricate relationship of structure-property relationship in each section. This course concludes with a hands-on session of technological materials (i.e., simple electronic gadgets) to understand how different classes of materials are combined to provide multi-functional properties in our modern devices.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "2002", "title": "Introduction to Polymer Science", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "Lecture\nInteractive Tutorial", "campus": "Main Campus", "academic_group": "Materials Sci & Erg PC", "requirements": "", "description": "This introductory course provides a comprehensive overview of polymer science, emphasizing the fundamental principles that underpin the behavior and applications of polymers. Students will explore the intricate relationships between chemical structures, polymer synthesis methods, characterization techniques, and the physical and chemical properties of polymers. The course will also cover a wide array of polymer applications across multiple sectors, including energy, biomaterials, food packaging, lightweight electric vehicles, and construction. Furthermore, the impact of polymers on the ecosystem, strategies for reducing plastic waste, and the development of sustainable materials will be discussed.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "2202", "title": "Fundamentals of Inorganic Materials Processing", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "Lecture\nInteractive Tutorial", "campus": "Main Campus", "academic_group": "Materials Sci & Erg PC", "requirements": "", "description": "This course aims to introduce you to various processes for fabricating inorganic materials. It covers conventional manufacturing processes such as metalworking, forming, casting, ceramics sintering, as well as advanced processes (top-down and bottom-up approaches) to produce nanostructured inorganics.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "2601", "title": "Technology, Society and Engineering Practice", "career": "Undergraduate", "units": "2.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Materials Sci & Erg PC", "requirements": "Not for students who have taken ELEG2601", "description": "This course aims to provide students with a broad understanding about the significance and impact of science and technology to the human society, and about the roles and responsibilities of researchers and engineers in the fast-changing world. Topics to be covered include, but not limited to, Technology Evolution and Innovation; Social and Economic Development; Environment and Sustainability; Human Factors and Ethics in Engineering Design; Intellectual Properties. Through diverse learning activities, students will receive training in communication skills, project management, and teamwork, and guidance on career preparation and development. A primary goal of this course is to imbue students with a sense of social responsibility contributing to the betterment of mankind.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}]