[{"code": "5020", "title": "Frontiers in Materials Science", "career": "Postgraduate - Research", "units": "3.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Div of Material Science & Erg", "requirements": "For students in MSc Physics, MPhil-PhD Materials Sci & Erg or MPhil-PhD Physics", "description": "Current topics illustrating important research field in materials science will be discussed. Topics covered will include: energy materials, biomaterials, and computational material science. The course provides an introduction to the background concept, physical principles and applications of the relevant material systems.", "outcome": "Students at the end of the course are expected to have gained an appreciation of the fundamental concepts as well as the state of art methodologies in frontiers of materials research. They are expected to have gained the ability to operationalize these concepts in precise frameworks, and to have the ability to pursue these topics in further depth beyond this course. Some of the material will have to be learnt by the student on their own, and through this activity students will develop the capability and habit of self-directed learning.", "syllabus": "(1) Energy materials:  (a) Materials for light harvesting and applications: Fundamental concepts of photovoltaics; Principles of solar cell operation and efficiencies; Semiconductor materials for light harvesting and photovoltaic devices; Defects and doping of semiconducting materials for energy applications, including basic concepts of defects in semiconductors and defect engineering (optional); Light harvesting enhancement and plasmonic materials; Material requirement and device configurations of single junction device and tandem cells; Different generations of solar cell devices and their working principles, including crystalline silicon solar cells, thin film solar cells, organic, dye-sensitized cells and hybrid cells  (b) Materials for energy storage and applications: General introduction of battery industry and its advances; Highlight on Li-ion batteries (LiBs): Working principles (e.g., mechanisms of Li-ion intercalation and deintercalation); basic concepts and parameters of LiBs (e.g., capacity, energy density, power density, rate capacity, and cyclability); Common cathode and anode materials and their electrochemical properties; Ionic conductors; Materials Issues and safety aspects in sustainable Li-ion Batteries; State of art batteries beyond conventional LiBs.  (2) Biomaterials: Background concepts on biological systems (e.g., protein, cell, tissue); Classes of materials for medical applications including metals, polymer, hydrogel, ceramics, and biologically functional materials; Properties of biomaterials and characterizations; Interaction between biomaterials and biological systems (e.g., inflammation, and immune response etc.); Toxicology evaluation of the biomaterials; Applications of biomaterials (e.g., drug delivery, tissue engineering)", "required_readings": "Please refer to Recommended Readings.", "recommended_readings": "1. Tom Markvart & Luis Castaner, “Practical handbook of photovoltaics: fundamentals and applications” Elsevier, 2007 2. S.R. Wenham, M.A. Green, M.E. Watt, R. Corkish “Applied Photovoltaic” second edition, Earthscan, 2007 3. M.A. Green “Third Generation Photovoltaics Advanced Solar Energy Conversion” Springer, 2003  4. Antonio Luque “Handbook of Photovoltaic Science and Engineering” Wiley, 2003 5. S. H. Wei, Computational Materials Science Volume 30, Issues 3–4, August 2004, Pages 337–348 6. Zhu and Wei, “Overcoming doping bottleneck by using surfactant and strain”, Frontiers of Materials Science December 2011, Volume 5, Issue 4, pp 335-341  7. Tigran V. Shahbazyan; Mark I. Stockman (eds.), “Plasmonics: Theory and Applications” 2013.  8. Stefan A. Maier, “Plasmonics: Fundamentals and Applications”. New York, Springer. 2007. 9. Stefan Enoch, Nicolas Bonod (eds.), “Plasmonics: From Basics to Advanced Topics” Berlin, Heidelberg: Springer, 2012. 10. Matthew Pelton, Garnett Bryant, “Introduction to Metal-Nanoparticle Plasmonics”, New Jersey: John Wiley & Sons, Inc. 2013 11. Vincenzo Giannini, Antonio I. Fernández-Domínguez, Susannah C. Heck, Stefan, A. Maier, “Plasmonic Nanoantennas: Fundamentals and Their Use in Controlling the Radiative Properties of Nanoemitters”. Chemical Reviews 2011, 111, 3888-3912. 12. Seth M. Morton, Daniel W. Silverstein, Lasse Jensen, “Theoretical Studies of Plasmonics using Electronic Structure Methods” Chemical Reviews 2011, 111, 3962-3994. 13. Lukas Novotny, Niek van Hulst, Antennas for Light. Nature Photonics 2011, 5, 83-90. 14. Jon A. Schuller, Edward S. Barnard, Wenshan Cai, Young Chul Jun, Justin S. White, Mark l. Brongersma, “Plasmonics for Extreme Light Concentration and Manipulation”. Nature Materials 2010, 9, 193-204. 15. Dmitri K. Gramotnev, Sergey I. Bozhevolnyi, “Plasmonics beyond the Diffraction Limit”. Nature Photonics 2010, 4, 83-91. 16. Harry A. Atwater, Albert Polman,” Plasmonics for Improved Photovoltaic Devices”. Nature Materials 2010, 9, 205-213. 17. Allen J. Bard, Larry R. Faulkner, “Electrochemical Methods: Fundamentals and Applications”, 2nd Edition Wiley, 2001 18. Masaki Yoshio, Ralph J. Brodd, Akiya Kozawa, “Lithium-Ion Batteries: Science and Technologies”, Springer, 2009 19. Hyun Deog Yoo, Elena Markevich, Gregory Salitra, Daniel Sharon and Doron Aurbach, “On the challenge of developing advanced technologies for electrochemical energy storage and conversion” Materials Today, Volume 17, Number 3, 2014  (General introduction of batteries) 20. John B. Goodenough and Kyu-Sung Park, “The Li-Ion Rechargeable Battery: A Perspective”, J. Am. Chem. Soc., 2013, 135 (4), pp 1167–1176 (battery chemistry) 21. Vinodkumar Etacheri, Rotem Marom, Ran Elazari, Gregory Salitra and Doron Aurbach, “Challenges in the development of advanced Li-ion batteries: a review”, Energy Environ. Sci., 2011,4, 3243-3262 (electrode materials and their electrochemical properties) 22. Rotem Marom, S. Francis Amalraj, Nicole Leifer, David Jacob and Doron Aurbach “A review of advanced and practical lithium battery materials”, J. Mater. Chem., 2011, 21, 9938 (electrode materials and ionic conductors) 23. Peter G. Bruce, Stefan A. Freunberger, Laurence J. Hardwick, and Jean-Marie Tarascon, “Li–O2 and Li–S batteries with high energy storage” NATURE MATERIALS, VOL 11, 2012, 19-29 (state of art battery solution beyond conventional LiBs) 24. Buddy D. Ratner, Allan S. Hoffman, Frederick J. Schoen, Jack E. Lemons, “Biomaterials Science, Third Edition: An Introduction to Materials in Medicine” Academic Press, 2013 25. Johnna S. Temenoff (Author), Antonios G. Mikos, “Biomaterials: The Intersection of Biology and Materials Science” Prentice Hall, 2008", "terms": {"2024-25 Term 2": {"--LEC (1841)": {"startTimes": ["9:30", "9:30"], "endTimes": ["11:15", "10:15"], "days": [1, 5], "locations": ["Y.C. Liang Hall 106", "William M W Mong Eng Bldg 401"], "instructors": ["Professor GAO Yao, \n\nProfessor LI Quan", "Professor GAO Yao, \n\nProfessor LI Quan"], "meetingDates": ["6/1", "10/1", "13/1", "17/1", "20/1", "24/1", "27/1", "7/2", "10/2", "14/2", "17/2", "21/2", "24/2", "28/2", "3/3", "7/3", "10/3", "14/3", "17/3", "21/3", "24/3", "28/3", "31/3", "7/4", "11/4", "14/4"]}, "M-LEC (1842)": {"startTimes": ["9:30", "9:30"], "endTimes": ["10:15", "11:15"], "days": [5, 1], "locations": ["William M W Mong Eng Bldg 401", "Y.C. Liang Hall 106"], "instructors": ["Professor GAO Yao, \n\nProfessor LI Quan", "Professor GAO Yao, \n\nProfessor LI Quan"], "meetingDates": ["6/1", "10/1", "13/1", "17/1", "20/1", "24/1", "27/1", "7/2", "10/2", "14/2", "17/2", "21/2", "24/2", "28/2", "3/3", "7/3", "10/3", "14/3", "17/3", "21/3", "24/3", "28/3", "31/3", "7/4", "11/4", "14/4"]}}}, "assessments": {"Presentation": "52", "Test or quiz": "48"}}, {"code": "5040", "title": "Topics in Advanced Materials Research IV (Electron Microscopy: Principles, Techniques and Analysis)", "career": "Postgraduate - Research", "units": "3.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Div of Material Science & Erg", "requirements": "For students in MPhil-PhD Materials Sci & Erg; For students in MPhil-PhD Physics; For students in MSc Physics", "description": "This course is intended to provide basics of electron microscopy. Topics include: group theory and basics of crystal symmetry; electron diffraction and interpretation of crystal symmetry; wave optics and imaging principle of electron microscopy; high-resolution transmission electron microscopy; analytical electron energy microscopy; and laboratory demonstration of specific topics.", "outcome": "1. To master the principle of electron microscopes;2. To know the basic instrumentation of conventional electron microscope, and master the basic sample preparation methods;3. To master the basic knowledge of crystalline symmetry and group theory;4. To understand the theory of electron diffraction;5. To master the methods for the interpretation of crystal symmetry through electron diffraction patterns;6. To understand the principle of dark field/bright field imaging;7. To understand the theory of high-resolution electron microscopy;8. To master data analysis skill of high resolution electron microscopy images;9. To understanding energy dispersive x-ray, and master data analysis skills in identifying material composition;10. To understand electron energy loss spectroscopy method in identifying material chemical composition and electronic structures;11. To understand the state-of-the-art in situ techniques in monitoring dynamics of material structural/ compositional/ property changes;12. To analyze, judge and solve realistic problems and cases using combinational approaches (including diffraction pattern, dark field/bright field images, high resolution image, EDX, EELS, etc.);13. To develop an analytical mind towards materials characterization;14. To master basic experimental skills in using electron microscopy based techniques for practical material analysis projects.", "syllabus": "Principles of electron scattering and basics of electron microscopyGroup theory and basics of crystal symmetry;Electron diffraction and crystal symmetry interpretation from the reciprocal space; Comparison with x-ray diffraction;Wave optics and imaging principle of electron microscopy;Theory and interpretation of high-resolution electron microscopy;Analytical electron energy microscopy techniques including energy dispersive x-ray (EDX), electron energy loss spectroscopy (EELS), and various state-of-the-art in situ microscopy techniques.", "required_readings": "Lecture notes", "recommended_readings": "1. “Transmission Electron microscopy”, D. B. Williams and C. B. Carter, Plenum Press, New York and London2. “Electron Microscopy of Thin Crystals” By P. Hirsch et al., Krieger Publishing Company, Malabar, Florida3. “Transmission Electron Microscopy—Physics of image formation and microanalysis” L. Reimer, Springer-Verlag", "terms": {"2024-25 Term 1": {"--LEC (1981)": {"startTimes": ["9:30", "9:30"], "endTimes": ["11:15", "11:15"], "days": [3, 1], "locations": ["Yasumoto Int'l Acad Park 503", "Institute of Chin Studies L1"], "instructors": ["Professor LI Quan", "Professor LI Quan"], "meetingDates": ["2/9", "4/9", "9/9", "11/9", "16/9", "23/9", "25/9", "30/9", "2/10", "7/10", "9/10", "14/10", "16/10", "21/10", "23/10", "28/10", "30/10", "4/11", "6/11", "11/11", "13/11", "18/11", "20/11", "25/11", "27/11"]}, "M-LEC (1978)": {"startTimes": ["9:30", "9:30"], "endTimes": ["11:15", "11:15"], "days": [1, 3], "locations": ["Institute of Chin Studies L1", "Yasumoto Int'l Acad Park 503"], "instructors": ["Professor LI Quan", "Professor LI Quan"], "meetingDates": ["2/9", "4/9", "9/9", "11/9", "16/9", "23/9", "25/9", "30/9", "2/10", "7/10", "9/10", "14/10", "16/10", "21/10", "23/10", "28/10", "30/10", "4/11", "6/11", "11/11", "13/11", "18/11", "20/11", "25/11", "27/11"]}}}, "assessments": {"Examination": "40", "Others": "60"}}, {"code": "5080", "title": "Surface Science", "career": "Postgraduate - Research", "units": "3.00", "grading": "Graded", "components": "Laboratory\nLecture", "campus": "Main Campus", "academic_group": "Div of Material Science & Erg", "requirements": "For students in MPhil-PhD Materials Sci & Erg; For students in MPhil-PhD Physics; For students in MSc Physics", "description": "This course serves as an introduction to surface science. Major topics are: vacuum technology, electron-surface interactions, photon-surface interactions, ion-surface interactions, scanning probe microscopy and case studies in surface science.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "7210", "title": "Guided Study", "career": "Postgraduate - Research", "units": "1.00", "grading": "Graded", "components": "Interactive Tutorial", "campus": "Main Campus", "academic_group": "Div of Material Science & Erg", "requirements": "For students in MPhil-PhD Materials Sci & Erg", "description": "To carry out reading and presentation assignments to enhance learning and research skill.", "outcome": "1. To master advanced concepts and major theories of assigned topics.2. To develop ability in self-learning.", "syllabus": "Research work assigned by thesis supervisor.", "required_readings": "Journal articles and other research materials assigned by individual supervisors.", "recommended_readings": "", "terms": {"2024-25 Term 1": {"-T01-TUT (4184)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["No Room Required"], "instructors": ["Staff"], "meetingDates": ["02/09/2024 - 25/11/2024"]}}, "2024-25 Term 2": {"-T01-TUT (2452)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["No Room Required"], "instructors": ["Staff"], "meetingDates": ["06/01/2025 - 14/04/2025"]}}}}, {"code": "8003", "title": "Thesis Research", "career": "Postgraduate - Research", "units": "3.00", "grading": "Graded", "components": "Thesis Monitoring Course", "campus": "Main Campus", "academic_group": "Div of Material Science & Erg", "requirements": "For students in MPhil-PhD Materials Sci & Erg", "description": "In this course, a student is required to meet with his/her supervisor regularly who provides necessary guidance and supervision to write up a thesis and monitors the student's academic progress.", "outcome": "Students are expected to develop research skills, including theory and/or laboratory studies and data analysis as related to the students' thesis research.", "syllabus": "Research work assigned by thesis supervisor.", "required_readings": "Journal articles and other research materials assigned by individual supervisors.", "recommended_readings": "", "terms": {"2024-25 Term 1": {"-M01-TMC (2418)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["No Room Required"], "instructors": ["Staff"], "meetingDates": ["02/09/2024 - 25/11/2024"]}}, "2024-25 Term 2": {"-M01-TMC (2291)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["No Room Required"], "instructors": ["Staff"], "meetingDates": ["06/01/2025 - 14/04/2025"]}}}}, {"code": "8006", "title": "Thesis Research", "career": "Postgraduate - Research", "units": "6.00", "grading": "Graded", "components": "Thesis Monitoring Course", "campus": "Main Campus", "academic_group": "Div of Material Science & Erg", "requirements": "For students in MPhil-PhD Materials Sci & Erg", "description": "In this course, a student is required to meet with his/her supervisor regularly who provides necessary guidance and supervision to write up a thesis and monitors the student's academic progress.", "outcome": "Students are expected to develop research skills, including theory and/or laboratory studies and data analysis as related to the students' thesis research.", "syllabus": "   Research work assigned by thesis supervisor.   ", "required_readings": "Journal articles and other research materials assigned by individual supervisors.", "recommended_readings": "", "terms": {"2024-25 Term 1": {"-M01-TMC (4069)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["No Room Required"], "instructors": ["Staff"], "meetingDates": ["02/09/2024 - 25/11/2024"]}}, "2024-25 Term 2": {"-M01-TMC (2972)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["No Room Required"], "instructors": ["Staff"], "meetingDates": ["06/01/2025 - 14/04/2025"]}}}}, {"code": "8012", "title": "Thesis Research", "career": "Postgraduate - Research", "units": "12.00", "grading": "Graded", "components": "Thesis Monitoring Course", "campus": "Main Campus", "academic_group": "Div of Material Science & Erg", "requirements": "For students in MPhil-PhD Materials Sci & Erg", "description": "In this course, a student is required to meet with his/her supervisor regularly who provides necessary guidance and supervision to write up a thesis and monitors the student's academic progress.", "outcome": "Students are expected to develop research skills, including theory and/or laboratory studies and data analysis as related to the students' thesis research.", "syllabus": "Research work assigned by thesis supervisor.", "required_readings": "Journal articles and other research materials assigned by individual supervisors.", "recommended_readings": "", "terms": {"2024-25 Term 1": {"-M01-TMC (2419)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["No Room Required"], "instructors": ["Staff"], "meetingDates": ["02/09/2024 - 25/11/2024"]}}, "2024-25 Term 2": {"-M01-TMC (2290)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["No Room Required"], "instructors": ["Staff"], "meetingDates": ["06/01/2025 - 14/04/2025"]}}}}]