[{"code": "5000", "title": "Foundations of Public Health", "career": "Postgraduate - Taught", "units": "1.00", "grading": "Graded", "components": "Lecture\nInteractive Tutorial", "campus": "Main Campus", "academic_group": "Div of Public Health", "requirements": "For taught postgraduate students in:- \n(i) PgD Health Services Management and Public Health; (ii) PgD Public Health; (iii) MSc Health Education; (iv) Master of Public Health; or \n(v) MBA Health Care", "description": "This course is an introductory course for all students which aims to provide an overview on the history, basic concepts and current issues in the field of public health. Students will gain a broad, general understanding on how public health issues can be framed in the three interrelated domains of health protection, health improvement, and health services. This foundation course will equip students with an analytic lens that is essential for deeper learning in each of the three domains.", "outcome": "Understand the basic concept and characteristics of public health and social determinants of health. Understand the key functions of health system in analyzing public health issues; Understand the basic concept of population, society and global disparities of health and promoting equity; Understand the basic structures of health systems, in particular the challenges of NCDs & communicable diseases; Gain familiarity of concepts of environmental change and global health.", "syllabus": "   Lecture 1   Case Study 1   Lecture 2   Case Study 2   Lecture 3   Case Study 3   Lecture 4   Case Study 4  ", "required_readings": "Please refer to the course outline provided by course teacher", "recommended_readings": "Please refer to the course outline provided by course teacher", "terms": {"2024-25 Term 1": {"--LEC (1788)": {"startTimes": ["18:30", "18:30"], "endTimes": ["21:30", "21:30"], "days": [3, 2], "locations": ["Prince of Wales Hospital", "Prince of Wales Hospital"], "instructors": ["Dr. YUNG Ka Chun, \n\nProfessor CHAN Ying Yang Emily, \n\nProfessor POON Kwok Ming, \n\nProfessor WONG Yeung Shan Samuel, \n\nProfessor WU Yushan, \n\nProfessor YEOH Eng Kiong", "Dr. YUNG Ka Chun, \n\nProfessor CHAN Ying Yang Emily, \n\nProfessor POON Kwok Ming, \n\nProfessor WONG Yeung Shan Samuel, \n\nProfessor WU Yushan, \n\nProfessor YEOH Eng Kiong"], "meetingDates": ["27/8", "28/8", "3/9", "4/9"]}}}, "assessments": {"Attendance": "10", "Homework or assignment": "50", "Presentation": "40"}}, {"code": "5001", "title": "Introduction to Qualitative Research: Theories and Research Design", "career": "Postgraduate - Taught", "units": "2.00", "grading": "Graded", "components": "Lecture\nInteractive Tutorial", "campus": "Main Campus", "academic_group": "Div of Public Health", "requirements": "For student in MPH", "description": "This qualitative methods course will introduce students to the topical issues related to conducting qualitative research and allow for hands-on exposure to the methods of data collection and analysis used in this methodology", "outcome": "Student should be able to: Understand the definition and features of qualitative research Understand the philosophical basis of qualitative approaches and describe its applications Understand and apply the skills of conducting qualitative research: case study, observation, interview, focus group, and textual analysis Understand and apply the skills of data coding and interpretation in the analytical proce", "syllabus": "   Introduction to qualitative methods Study design and Sampling   Case Study & Observation   In-depth interviews             Interview guide development   Interview & Observation skills development & practice   Focus group   Inductive and deductivetextual analysis   Data analysis                          Coding   Qualitative writing   Final Exam  ", "required_readings": "Pope, Catherine; Mays, Nicholas (Eds.) (2020): Qualitative research in health care. Fourth edition. Hoboken: Wiley-Blackwell. (Ebook version is available via CUHK library.) ", "recommended_readings": " Qualitative Research Methods Braun, V., & Clarke, V. (2013). Successful qualitative research: A practical guide for beginners. sage. Creswell, J. W., & Poth, C. N. (2016). Qualitative inquiry and research design: Choosing among five approaches. Sage publications. Designing Qualitative Research Flick, U., von Kardoff, E., & Steinke, I. (Eds.). (2004). A companion to qualitative research. Sage. Hansen, E. C. (2020). Successful qualitative health research: a practical introduction. Routledge. Grounded Theory Corbin, J., & Strauss, A. (2014). Basics of qualitative research: Techniques and procedures for developing grounded theory. Sage publications. Foley, G., & Timonen, V. (2015). Using grounded theory method to capture and analyze health care experiences. Health services research, 50(4), 1195-1210. Interview Gubrium, J. F., Holstein, J. A., Marvasti, A. B., & McKinney, K. D. (Eds.). (2012). The SAGE handbook of interview research: The complexity of the craft. Sage Publications. Focus Group Krueger, R. A. (2014). Focus groups: A practical guide for applied research. Sage publications. Textual Analysis McKee, A. (2003). Textual analysis: A beginner's guide. Sage. Hsieh, H. F., & Shannon, S. E. (2005). Three approaches to qualitative content analysis. Qualitative health research, 15(9), 1277-1288. Data Analysis Braun, V., & Clarke, V. (2006). Using thematic analysis in psychology. Qualitative research in psychology, 3(2), 77-101. Gale, N. K., Heath, G., Cameron, E., Rashid, S., & Redwood, S. (2013). Using the framework method for the analysis of qualitative data in multi-disciplinary health research. BMC medical research methodology, 13(1), 1-8. Research Ethics Hammersley, M., & Traianou, A. (2012). Ethics in qualitative research: Controversies and contexts. Sage. Richards, H. M., & Schwartz, L. J. (2002). Ethics of qualitative research: are there special issues for health services research?. Family practice, 19(2), 135-139.9. Others Creswell, J. W., & Creswell, J. D. (2017). Research design: Qualitative, quantitative, and mixed methods approaches. Sage publications. Duarte, N. (2008). Slide: ology: The art and science of creating great presentations (Vol. 1). Sebastapol, CA: O’Reilly Media.", "terms": {"2024-25 Term 1": {"--LEC (1864)": {"startTimes": ["18:30"], "endTimes": ["21:30"], "days": [3], "locations": ["Prince of Wales Hospital"], "instructors": ["Professor DONG Dong"], "meetingDates": ["23/10", "30/10", "6/11", "13/11", "20/11", "27/11", "4/12", "11/12"]}}}, "assessments": {"Classwork": "30", "Examination": "30", "Project": "30", "Participation": "10"}}, {"code": "5002", "title": "Public Health Law", "career": "Postgraduate - Taught", "units": "2.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Div of Public Health", "requirements": "For students in Master of Public Health", "description": "This Course examines the role of law as a tool for public health both within Hong Kong and at international level.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "5004", "title": "Tuberculosis: Biology, Control and Policy", "career": "Postgraduate - Taught", "units": "1.50", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Div of Public Health", "requirements": "For TPg students in Master of Public Health / Postgraduate Diploma in Public Health", "description": "Tuberculosis (TB) has been declared as a public health threat by the WHO since 1990s, and the threat is recently more serious due to rapid development of multi-drug resistant TB and HIV/TB co-infection. The course will introduce TB microbiological, clinical and control aspects, and discuss TB epidemiology, evolution of control programmes, policies and practices both globally and locally. Health system and policy issues on TB control, regarding organisation, financing, payment, delivery will be widely explored. Examples on operational research over TB topics will be given.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "5005", "title": "Basic Human Physiology", "career": "Postgraduate - Taught", "units": "2.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Div of Public Health", "requirements": "For students in Master of Public Health", "description": "This course is a basic introduction to the human body for public health students without a bio-medical background. It is geared towards students with an undergraduate degree in the social sciences, arts and physical sciences. It will introduce the overview of basic scientific mechanisms, concepts and principles in health and in the pathogenesis of disease. It provides clinical scientific foundation for applications to the practice of public health. Professionals in the clinical health field such as physicians, nurses, dentists and allied health specialists will not be permitted to take this course for credit.", "outcome": "This course is a basic introduction to the human body for public health students without a bio-medical background. It is geared towards students with a undergraduate degree in the social sciences, arts and physical sciences. It will introduce the overview of basic scientific mechanisms, concepts and principles in health and in the pathogenesis of disease. It provides clinical scientific foundation for applications to the practice of public health. Professionals in the clinical health field such as physicians, nurses, dentists and allied health specialists will not be permitted to take this course for credit.", "syllabus": "   Introduction: cells, issuesCirculatory SystemDermatological system ISpecial Senses I   Reproductive and Urinary systems   Dermatological system IISpecial Senses IIRespiratory System   Gastrointestinal System   Musculoskeletal system    Endocrine systemDiabetes   Immune systemHematological system   Neurological System  ", "required_readings": "Please refer to the course outline provided by course teacher", "recommended_readings": "Please refer to the course outline provided by course teacher", "terms": {"2024-25 Term 1": {"--LEC (1842)": {"startTimes": ["9:30", "9:30", "9:30", "14:00", "9:30"], "endTimes": ["17:00", "12:30", "12:30", "17:00", "17:00"], "days": [4, 3, 2, 5, 1], "locations": ["Prince of Wales Hospital", "Prince of Wales Hospital", "Prince of Wales Hospital", "Prince of Wales Hospital", "Prince of Wales Hospital"], "instructors": ["Professor POON Kwok Ming, \n\nProfessor WONG Carmen, \n\nProfessor WONG Chi Sang", "Professor POON Kwok Ming, \n\nProfessor WONG Carmen, \n\nProfessor WONG Chi Sang", "Professor POON Kwok Ming, \n\nProfessor WONG Carmen, \n\nProfessor WONG Chi Sang", "Professor POON Kwok Ming, \n\nProfessor WONG Carmen, \n\nProfessor WONG Chi Sang", "Professor POON Kwok Ming, \n\nProfessor WONG Carmen, \n\nProfessor WONG Chi Sang"], "meetingDates": ["26/8", "27/8", "28/8", "29/8", "2/9", "3/9", "6/9"]}}}, "assessments": {"Homework or assignment": "20", "Short answer test or exam": "80"}}, {"code": "5006", "title": "Practice of Qualitative Research Methods", "career": "Postgraduate - Taught", "units": "1.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Div of Public Health", "requirements": "For TPg students under School of Public Health", "description": "The central goal of this course is to prepare students to enhance their knowledge and skills to design and conduct qualitative research projects and analyse qualitative data. The course begins with an advanced reflection about the theoretical and methodological foundations of different qualitative health research methods. It provides students with hands-on experience of designing an interview protocol, conducting in-depth interview, data analysis, and writing a qualitative report.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "5801", "title": "Climate Change and Planetary Health", "career": "Postgraduate - Taught", "units": "2.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Div of Public Health", "requirements": "For TPg students in Master of Public Health / Postgraduate Diploma in Public Health", "description": "Climate change is an important topic for public health practice. As the frequency and severity of climate-related disasters increase, in order to protect health and well-being, the need to understand and prepare for unforeseeable events is rapidly growing. This course provides an overview of issues in relation to climate change and health in the context of public health practice. It introduces important concepts of how to tackle climate change related health impacts and how to support community preparedness, response, policy formulation and implementation.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "5803", "title": "Development of Assessment instruments and questionnaire design", "career": "Postgraduate - Taught", "units": "1.50", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Div of Public Health", "requirements": "For TPg students under School of Public Health", "description": "This course aims to provide students with an understanding of the basic principles and procedures in designing questionnaires and health-related assessment instruments. The course includes basic principles and procedures in questionnaire design, psychometrics, validation of an assessment instrument, and related statistical issues. At the completion of the course, students are enabled to develop a simple questionnaire suitable for collecting information for their own research project or in a specific area of their own interest.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "5804", "title": "Ethics, Social Justice and Global Health", "career": "Postgraduate - Taught", "units": "1.50", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Div of Public Health", "requirements": "For students in Master of Public Health", "description": "This course will introduce students to basic ideas of public health ethics and justice and discusses how those ideas apply to global biomedical issues.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "5900", "title": "International Field Studies", "career": "Postgraduate - Taught", "units": "1.00", "grading": "Graded", "components": "Field Studies/Field-trip", "campus": "Main Campus", "academic_group": "Div of Public Health", "requirements": "For students in Master of Public Health", "description": "This module is designed to allow students to conduct field studies abroad and locally, and to receive academic credit for their supervised work and studies. Field studies may include supervised field visits, public health-related field work, collaborative projects with an organization involving international public health activities . Short courses offered in abroad which require presence in that setting will also be accepted. All projects must receive prior approval from the module coordinator in order to receive credit. All field studies must include some form of assessment that must receive prior approval from the module coordinator. Students are to be selected by the course coordinator and subject to mutual agreement with partner organization.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "5901", "title": "Exchange Study", "career": "Postgraduate - Taught", "units": "1.50", "grading": "Graded", "components": "Independent Study", "campus": "Main Campus", "academic_group": "Div of Public Health", "requirements": "For Master of Public Health and MSc Health Services Management students", "description": "Students enrolled in public health courses during their summer or winter terms in other universities can seek unit credits for their studies towards their MPH degree. Approval made on a case-by-case basis by the Concentration Coordinator after discussion with Curriculum Coordinator.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "6802", "title": "Global and Regional Perspectives on Noncommunicable Diseases Prevention and Control", "career": "Postgraduate - Taught", "units": "1.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Div of Public Health", "requirements": "For students in Master of Public Health", "description": "This course aims to provide students an in-depth understanding of the burden of noncommunicable diseases (NCDs) at the local, regional, and global scales. It equips students with the knowledge and tools to prevent and control NCDs and associated risk factors using effective public health strategies, as well as how to conduct NCD surveillance and research to assess and adapt interventions across diverse population settings.", "outcome": "After the course, students will be able to1. describe the NCD burden globally, regionally, and locally, and factors influencing the patterns and trajectories in different population settings.2. explain common risk factors and determinants of NCDs, and interactions among biological, social, environmental, and modifiable behavioral factors.3. identify public health strategies, including population and targeted interventions, to address NCDs and risk factors in various populations.4. discuss success factors and lessons from case studies of population interventions for preventing and controlling high-burden NCDs.5. demonstrate understanding of common NCD surveillance and research methods, and design a research study proposal for NCD surveillance in a population. ", "syllabus": "   Lecture 1 - NCD burden, risk factors and determinants   Lecture 2 - Population based approaches to the prevention and control of NCDs   Lecture 3 - Case studies on high burden and emerging NCDs   Lecture 4 - NCD surveillance and research methodologies   Lecture 5 - Preparation of written assignment  ", "required_readings": "Noncommunicable Diseases, Health Topics, World Health Organisation.https://www.who.int/health-topics/noncommunicable-diseases#tab=tab_1", "recommended_readings": "GBD 2019 Diseases and Injuries Collaborators. Global burden of 369 diseases and injuries in 204 countries and territories, 1990-2019: a systematic analysis for the Global Burden of Disease Study 2019. Lancet. 2020;396(10258):1204-1222. doi:10.1016/S0140-6736(20)30925-9A less visible pandemic. Lancet Regional Western Pacific. 2020. Available at https://www.thelancet.com/action/showPdf?pii=S2666-6065%2820%2930035-3Zhou M, Wang H, Zeng X, et al. Mortality, morbidity, and risk factors in China and its provinces, 1990-2017: a systematic analysis for the Global Burden of Disease Study 2017. Lancet. 2019;394(10204):1145-1158. doi:10.1016/S0140-6736(19)30427-1Hong Kong Population Health Survey 2020. Centre for Health Protection. Department of Health. The Government of the Hong Kong SAR. Available at https://www.chp.gov.hk/en/features/37474.htmlLi HCW, Ho LLK, Chung OKJ, Cheung AT, Xia W, Song P. A Descriptive Study on Multiple Health-Risk Behaviors among Chinese Adults in Hong Kong. Int J Environ Res Public Health. 2022;19(18):11393. Published 2022 Sep 10. doi:10.3390/ijerph191811393Towards elimination of cervical cancer – Human Papillomavirus (HPV) vaccination and cervical cancer screening in Asian National Cancer Centers Alliance (ANCCA) member countries. Lancet Regional Health Western Pacific.2023. Available at https://www.thelancet.com/journals/lanwpc/article/PIIS2666-6065(23)00178-5/fulltext“Best buys” and other recommended interventions for the prevention and control of NCDs. World Health Organisation. Update 2023. https://www.who.int/news/item/26-05-2023-more-ways--to-save-more-lives--for-less-money----world-health-assembly-adopts-more-best-buys--to-tackle-noncommunicable-diseasesNoncommunicable Disease Surveillance, Monitoring and Reporting. World Health Organisation. https://www.who.int/teams/noncommunicable-diseases/surveillance/systems-tools/steps", "terms": {"2024-25 Summer Session": {"--LEC (1038)": {"startTimes": ["18:30", "18:30", "18:30", "18:30", "18:30"], "endTimes": ["21:30", "21:30", "21:30", "21:30", "21:30"], "days": [1, 3, 4, 5, 2], "locations": ["Prince of Wales Hospital", "Prince of Wales Hospital", "Prince of Wales Hospital", "Prince of Wales Hospital", "Prince of Wales Hospital"], "instructors": ["Professor POON Kwok Ming", "Professor POON Kwok Ming", "Professor POON Kwok Ming", "Professor POON Kwok Ming", "Professor POON Kwok Ming"], "meetingDates": ["14/7", "15/7", "16/7", "17/7", "18/7"]}}}}, {"code": "6803", "title": "Practicum", "career": "Postgraduate - Taught", "units": "2.00", "grading": "Graded", "components": "Practicum", "campus": "Main Campus", "academic_group": "Div of Public Health", "requirements": "For students in Master of Public Health.", "description": "The practicum aims at providing a unique opportunity for students to gain familiarity with a variety of public health issues, programs, policies, and service delivery settings. Practicum experience allows students to integrate and apply the knowledge and skills they learned through coursework and prior experiences in a public health environment.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "6900", "title": "Master Capstone Project & Report", "career": "Postgraduate - Taught", "units": "6.00", "grading": "Graded", "components": "Lecture\nProject\nInteractive Tutorial", "campus": "Main Campus", "academic_group": "Div of Public Health", "requirements": "For students in Master of Public Health", "description": "Each student is required to develop and complete an individual project of a public health problem, under the direction of a supervisor in their chosen concentrations. The topic of each project should be relevant to the concentration selected. Students will be assigned a supervisor and are required to do presentations and to submit a final written report.", "outcome": "Upon satisfactory completion of the Capstone Project, all the students should be able to:  • conduct a proper literature review on a public health issue;  • develop a research protocol or practicum-based project plan;  • have practical, hands-on experience in the form of research or public health practice;  • perform data analysis or a systematic evaluation of a public health issue; • write a manuscript using standard journal format or an official report using institutional format; • orally present their work at a professional level; and  • create a professional poster for presentation at public health conferences.", "syllabus": "Please refer to the course outline for reference.", "required_readings": "Please contact your supervisor for required reading and recommended reading.", "recommended_readings": "", "terms": {"2024-25 Term 3": {"F-LEC (1183)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["Prince of Wales Hospital"], "instructors": ["Professor YIP Hon Kei"], "meetingDates": ["07/04/2025 - 09/06/2025"]}, "P-LEC (1182)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["Prince of Wales Hospital"], "instructors": ["Professor YIP Hon Kei"], "meetingDates": ["07/04/2025 - 09/06/2025"]}}}}]