[{"code": "1001", "title": "Foundations in Public Health", "career": "Undergraduate", "units": "2.00", "grading": "Graded", "components": "Lecture\nInteractive Tutorial", "campus": "Main Campus", "academic_group": "JC Sch of Pub Health Prim Care", "requirements": "PHPC1001 is double-coded with UGEC1920.\nNot for students who have taken MEDF1021, 1120, UGEC1920 or UGEC2930.", "description": "(UGEC1920 is double-coded with PHPC1001.)  This course will introduce undergraduate students to the discipline of public health and its basic academic framework, concept and methodology. The objective of the course is to provide a broad intellectual perspective of public health and presents both local and global public health challenges that are facing our society in the 21st century. The various academic disciplines within the domains of public health that include environmental health sciences, health policy and management, social and behavioral sciences and basic science will be introduced and discussed. The impact of these public health problems in relation to our society and our everyday lives will be emphasized. An analytic public health problem solving framework will be used to enable students to appreciate and learn the problem solving methodology in evaluating and appraising various public health problems.", "outcome": " By the end of this course, the students should be able to:   1. Define public health, identify its major domains, functions, and disciplines, and explain its historical development and contemporary achievements.  2. Describe the concepts of transitions, and analyze the impact, challenges, and strategies for controlling infectious and non-communicable diseases.  3. Examine the impact of physical activity and sedentary behavior on fall risks in older adults and assess interventions promoting physical activity and health among school-aged children.  4. Describe the ethical principles in health and healthcare, including social and distributive justice  5. Analyze the social determinants of health and health equity, and evaluate population health and high-risk intervention strategies.  6. Describe the basic concepts of health demography and analyze the associations between population attributes and population health   ", "syllabus": " 1. Overview and Foundation Concepts of Public Health 2. The Origins and Early History of Public Health  3. The Contemporary Achievements and Recent History of Public Health 4. Exercise is Medicine 5. Infectious Diseases 6. Physical activity and falls in older adults 7. Health System  8. Public Health Ethics and Justice 9. Health Equity  10. Social Determinants of Health 11. Population Health & Health Demography Current & Future Challenges", "required_readings": " Week 1: Overview and Foundation Concepts of Public Health Detels R, et al. Chapter 1.1 The scope and concerns of publilc health. Oxford Textbook of Public Health (5 ed.); 2011. Link:  http://oxfordmedicine.com/view/10.1093/med/9780199218707.001.0001/med-9780199218707-chapter-0101   Week 2: The Origins and Early History of Public Health Berridge V. Chapter 3. The origins of public health into the 1700s. Public Health: A Very Short Introduction; 2016. Oxford: Oxford University Press.    Week 3: The Contemporary Achievements and Recent History of Public Health Berridge V. Chapter 4. Sanitation to education: 1800-1900s. Public Health: A Very Short Introduction; 2016. Oxford: Oxford University Press.  Berridge V. Chapter 5. The rise of lifestyle: 1900-1980s. Public Health: A Very Short Introduction; 2016. Oxford: Oxford University Press.    Week 4: Exercise is Medicine Exercise is Medicine Hong Kong. Link: http://www.eim.hk/    Week 5: Infectious Diseases Schneider M-J. Chapter 9: The “Conquest” of Infectious Diseases. Introduction to Public Health (5th edition). Jones and Bartlett Publishers; Massachusetts; 2016. Read: pp. 117-124.    Week 6: Physical activity and falls in older adults Schneider M-J. Chapter 29: Public Health and the Aging Population. Introduction to Public Health (5th edition). Jones and Bartlett Publishers; Massachusetts; 2016. Read: pp. 469-481   Week 7: Health System Leung GM, Bacon-Shone J, eds. Parts II & III. Organisational, Management, and Quality of Care Issues. Hong Kong’s Health System: Reflections, Perspectives and Visions. HK: Hong Kong University Press; 2006. Read: pp. 137-144   Week 8: Public Health Ethics and Justice Campbell AV. Chapter 6. Justice. Bioethics the Basics. London & New York: Routledge; 2017. Read: pp. 137-159.   Week 9: Health Equity Macintyre S. The Black Report and beyond: what are the issues? Soc Sci Med. 1997 Mar;44(6):723-45. doi: 10.1016/s0277-9536(96)00183-9. PMID: 9080558.   Week 10: Social Determinants of Health Marmot M, Wilkinson RG. Chapter 1. Introduction. Social Determinants of Health (2nd edition). UK: Oxford University Press; 2006. Marmot M, Allen JJ. Social determinants of health equity. Am J Public Health. 2014 Sep;104 Suppl 4(Suppl 4):S517-9. doi: 10.2105/AJPH.2014.302200. PMID: 25100411; PMCID: PMC4151898.    Week 11: Population Health & Health Demography Rose G. Sick individuals and sick populations. Int J Epidemiol. 2001 Jun;30(3):427-32; discussion 433-4. doi: 10.1093/ije/30.3.427. PMID: 11416056.   Week 12: Current & Future Challenges/Final Recap [Reread] Detels R, et al. Chapter 1.1 The scope and concerns of publilc health. Oxford Textbook of Public Health (5 ed.); 2011. Link:  http://oxfordmedicine.com/view/10.1093/med/9780199218707.001.0001/med-9780199218707-chapter-0101 Schneider M-J. Chapter 31: Public Health in the Twenty-First Century: Achievements and Challenges. Introduction to Public Health (5th edition). Jones and Bartlett Publishers; Massachusetts; 2016.", "recommended_readings": " 1. Schneider M-J. Introduction to Public Health (5th edition) Jones and Bartlett Publishers; Massachusetts; 2016. 2. Berridge V. Public Health: A Very Short Introduction. UK: Oxford University Press; 2016. 3. Detels R, et al. Oxford Textbook of Public Health (5 ed.); 2011. Link: http://oxfordmedicine.com/view/10.1093/med/9780199218707.001.0001/med-9780199218707-chapter-0101 4. Griffiths SM, Tang JL, Yeoh EK, eds. Routledge Handbook of Global Public Health in Asia; 2014. 5. Leung GM, Bacon-Shone J, eds. Hong Kong's Health System: Reflections, Perspectives and Visions. HK: Hong Kong University Press; 2006. 6. Campbell AV. Bioethics the Basics. London & New York: Routledge; 2017. 7. Marmot M, Wilkinson RG. Social Determinants of Health (2nd edition). UK: Oxford University Press; 2006. 8. Rose GA. Rose's Strategy of Preventive Medicine: The Complete Original Text. Oxford University Press; 2008.  ", "terms": {"2024-25 Term 1": {"--LEC (8540)": {"startTimes": ["11:30"], "endTimes": ["13:15"], "days": [3], "locations": ["Mong Man Wai Bldg LT1"], "instructors": ["Professor CHUNG Roger Yat Nork"], "meetingDates": ["4/9", "11/9", "25/9", "2/10", "9/10", "16/10", "23/10", "30/10", "6/11", "13/11", "20/11", "27/11"]}}}, "assessments": {"Examination": "60", "Presentation": "40"}}, {"code": "1010", "title": "Anatomy & Physiology: Essential Human Body Functions", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "Lecture\nInteractive Tutorial", "campus": "Main Campus", "academic_group": "JC Sch of Pub Health Prim Care", "requirements": "", "description": "The course will cover the foundation concepts and basics of health science knowledge related to clinical medicine and specific to public health practice. It will provide an overview of basic knowledge from the molecular/cellular level to tissue, organ and organ system levels. The course will cover human physiology, anatomy, genetics as well as pathogenesis of diseases of public health importance. It aims to provide the foundation and essentials for understanding human body functions and the scientific basis in the design, rationalization and implementation of public health interventions.", "outcome": "1. Describe the fundamental concepts and principles of human anatomy and physiology as well as pathogenesis of diseases of public health importance of different body systems2. Establish the links from basic health science, normal body functions, disease development and ultimately formulation of disease prevention and control public health strategies3. Apply basic health science knowledge in the design, planning and implementation of public health programmes or initiatives", "syllabus": " Overview of basic human physiology and anatomy, organs and organ systems Cells, tissues and genetics and case studies Circulatory system and case studies Neurological system and case studies Human anatomy and physiology and public health interventions Hematological system Immune system Case studies of hematological and immune systems Interactive laboratory session on human anatomy", "required_readings": "Essential of Human Diseases and Conditions, Sixth EditionISBN: 978-0-323-22836-72016 by Elsevier, Inc.Freely available via CUHK library at https://julac-cuhk.primo.exlibrisgroup.com/permalink/852JULAC_CUHK/91edll/alma991015535299703407 Online resource of 3D anatomy illustrationsComplete Anatomy GuideMobile app or desktop version freely accessible via CUHK network athttps://libguides.lib.cuhk.edu.hk/completeanatomy", "recommended_readings": "To be advised by the course teacher", "terms": {"2024-25 Term 1": {"--LEC (8810)": {"startTimes": ["9:30"], "endTimes": ["12:15"], "days": [1], "locations": ["Y.C. Liang Hall 106"], "instructors": ["Professor POON Kwok Ming"], "meetingDates": ["2/9", "9/9", "16/9", "23/9", "30/9", "7/10", "14/10", "21/10", "28/10", "4/11", "11/11", "18/11", "25/11"]}}}, "assessments": {"Examination": "75", "Presentation": "25"}}, {"code": "1012", "title": "Anatomy & Physiology: Major Organ Systems", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "Lecture\nInteractive Tutorial", "campus": "Main Campus", "academic_group": "JC Sch of Pub Health Prim Care", "requirements": "Not for students who have taken PHPC1004.", "description": "The course will cover the basics of health sciences. It will introduce the overview of basic scientific mechanisms, concepts and principles in health and in the pathogenesis of disease. It provides clinical scientific foundation for applications to the practice of public health.", "outcome": "By the end of this course, students should be able to learn:  1. The fundamental principles of human biology, anatomy and physiology, including major diseases in each body system.  2. Personal, medical and public health strategies to combat and prevent these common diseases", "syllabus": " 1.       An introduction to the human body2.       The integumentary system3.       The special senses4.       The respiratory system5.       The digestive system6.       The urinary system7.       The male reproduction system8.       The endocrine system9.       The female reproductive system10.      The skeletal system11.      The muscular system", "required_readings": "Human biology, Daniel Chiras. Ninth edition Burlington, Massachusetts: Jones & Bartlett Learning 2019 Freely available at: https://julac-cuhk.primo.exlibrisgroup.com/permalink/852JULAC_CUHK/91edll/alma991039698708503407", "recommended_readings": "To be advised by the course teacher", "terms": {"2024-25 Term 2": {"--LEC (8186)": {"startTimes": ["10:30"], "endTimes": ["13:15"], "days": [1], "locations": ["Lee Shau Kee Archi Bldg G03"], "instructors": ["Professor ZHANG Dexing"], "meetingDates": ["6/1", "13/1", "20/1", "27/1", "10/2", "17/2", "24/2", "10/3", "17/3", "24/3", "31/3", "7/4", "14/4"]}}}, "assessments": {"Examination": "80", "Presentation": "20"}}, {"code": "1017", "title": "Principles of Infectious Diseases", "career": "Undergraduate", "units": "1.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "JC Sch of Pub Health Prim Care", "requirements": "Not for students who have taken PHPC1004.", "description": "This course provides an introduction to the causation, epidemiology and prevention and control of infectious diseases in a public health context. Essential microbiology and immunology would be included. Concepts of the relationship among agent, host and environment will be covered. Impacts of infectious diseases on society will be discussed. Illustrations will be given using both historical events and topical issues.", "outcome": "By the end of this course, student should be able to:  1. acquire basic concepts and knowledge in microbiology, pathogenesis, immunity against infectious diseases in human  2. appreciate the clinical presentations and principles of management of infectious diseases  3. understand the principles and public health strategies for control and prevention of infections  4. understand the interactions between infectious diseases, society and the environment", "syllabus": "     Introduction of infectious diseases and Microbiology An overview of Infectious Diseases in Hong Kong Transmission and epidemiology of infectious diseases Public Health Infrastructure of ID control Infectious disease surveillance Infection Control and Prevention Host response to infection and use of vaccines    ", "required_readings": "1)          LEE, S. S. (Shui Shan), Public health infectious disease    2)             Stefan Riedel, Jawetz Melnick & Adelbergs Medical Microbiology 28 E", "recommended_readings": "   1)          LEE, S. S. (Shui Shan), 傳染病點‧線‧面2) W. John W. Morrow, Vaccinology: Principles and Practice      ", "terms": {"2024-25 Term 2": {"--LEC (8902)": {"startTimes": ["15:30"], "endTimes": ["17:15"], "days": [1], "locations": ["T.Y.Wong Hall LT"], "instructors": ["Professor MOK Ka Pun"], "meetingDates": ["6/1", "13/1", "20/1", "27/1", "10/2", "17/2", "24/2", "10/3", "17/3", "24/3", "31/3", "7/4", "14/4"]}}}, "assessments": {"Examination": "90", "Participation": "10"}}, {"code": "1019", "title": "Induction Programme I", "career": "Undergraduate", "units": "1.00", "grading": "Distinction/Pass/Failure", "components": "Lecture", "campus": "Main Campus", "academic_group": "JC Sch of Pub Health Prim Care", "requirements": "", "description": "The course aims at providing students with a series of seminars and site visits to public health service providers including government departments, non-governmental organizations and the private sector. Through these activities, the students will be able to explore and understand the professional practices of public health.", "outcome": "By the end of this course, students should be able to: 1. familiarize with the multi-disciplinary nature of public health 2. have an insight into their future career 3. expand their networks with key stakeholders of public health  4. be prepared for the practicum in term 2 of 3rd year  ", "syllabus": "1. Site visits; 2. Quiz after visit", "required_readings": "To be advised by the course teacher", "recommended_readings": "To be advised by the course teacher", "terms": {"2024-25 Term 1": {"--LEC (9157)": {"startTimes": ["14:30"], "endTimes": ["18:15"], "days": [1], "locations": ["No Room Required"], "instructors": ["Dr. YUNG Ka Chun"], "meetingDates": ["2/9", "9/9", "16/9", "23/9", "30/9", "7/10", "14/10", "21/10", "28/10", "4/11", "11/11", "18/11", "25/11"]}}}, "assessments": {"Participation": "30", "Test or quiz": "70"}}, {"code": "1020", "title": "Induction Programme II", "career": "Undergraduate", "units": "1.00", "grading": "Distinction/Pass/Failure", "components": "Lecture", "campus": "Main Campus", "academic_group": "JC Sch of Pub Health Prim Care", "requirements": "Pre-requisite: PHPC1019.", "description": "This course is the continuation of PHPC1019. Seminars and site visits to different public health service providers will be arranged for students to understand and explore professional practices of public health.", "outcome": "   By the end of this course, students should be able to: 1. be familiarised with the multi-disciplinary nature of public health 2. consolidate theories learned 3. prepare for the research and practice-based courses in 3rd year 4. have an insight for their future career 5. expand student’s networks with key stakeholders of public health  ", "syllabus": "1. Site visits; 2. Quiz after visit", "required_readings": "To be advised by the course teacher", "recommended_readings": "To be advised by the course teacher", "terms": {"2024-25 Term 2": {"--LEC (8980)": {"startTimes": ["8:30"], "endTimes": ["12:15"], "days": [4], "locations": ["No Room Required"], "instructors": ["Dr. YUNG Ka Chun"], "meetingDates": ["9/1", "16/1", "23/1", "30/1", "6/2", "13/2", "20/2", "27/2", "6/3", "13/3", "20/3", "27/3", "3/4", "10/4", "17/4"]}}}, "assessments": {"Participation": "30", "Test or quiz": "70"}}, {"code": "1022", "title": "Lifestyle and Health", "career": "Undergraduate", "units": "2.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "JC Sch of Pub Health Prim Care", "requirements": "Not for students who have taken PHPC2008.", "description": "This course provides a substantive overview of the relationship between major lifestyle behaviors and health outcomes. The public health significance of those lifestyle behaviors will be discussed. The course will apply the basic concepts regarding different levels of prevention, the determinants of health, and conceptual frameworks of health promotion to understand the lifestyle behaviors This course aims to lay the foundations for students to understand different lifestyle behaviors through theoretical and practical perspectives.", "outcome": "By the end of this course, students should be able to: 1. Understand the importance of lifestyle behaviors in affecting people’s health outcomes  2. Understand the major contributors to people’s lifestyle behaviors  3. Apply concepts in prevention, health promotion, and behavioral theories to understand lifestyle behaviors 4. Familiarize themselves with current interventions, services, and policies regarding the lifestyle behaviors.", "syllabus": "1. Introduction: Lifestyle and Health2. Physical Activity3. Diet and Food Choice4. Alcohol Use5. Tobacco Use6. Addictive behaviors7. Sleep8. Health-seeking behaviors Future Directions", "required_readings": "To be advised by the course teacher.", "recommended_readings": "   Thirlaway, K., & Upton, D. (2009). The psychology of lifestyle: Promoting healthy behaviour. London: Routledge.Rippe, J. M. (2012). Encyclopedia of Lifestyle Medicine and Health. Sage Publications, Incorporated.Rippe, J. M. (2019). Lifestyle Medicine. Taylor & Francis Group.  ", "terms": {"2024-25 Term 1": {"--LEC (6419)": {"startTimes": ["9:30"], "endTimes": ["12:15"], "days": [4], "locations": ["Yasumoto Int'l Acad Park LT4"], "instructors": ["Professor YEUNG Chun Yiu"], "meetingDates": ["5/9", "12/9", "19/9", "26/9", "3/10", "10/10", "17/10", "24/10", "31/10", "7/11", "14/11", "21/11", "28/11"]}}}, "assessments": {"Essays": "30", "Examination": "60", "Participation": "10"}}, {"code": "2007", "title": "Nutrition for Health and Exercise", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "JC Sch of Pub Health Prim Care", "requirements": "Pre-requisites: MEDF1021or MEDF1120 or PHPC1001 or PHPC1012 or UGEC1920 or UGEC2930.", "description": "This course provides the foundation background of nutritional science and its application to the primary prevention of diet-related illness and to maximize physical exercise outcome. It will look into the importance of nutrition throughout the lifespan and in different population sub-groups. The wide variety of nutritional issues in both developed and developing countries will be discussed. It explores the relationship of diet to athletic performance. Nutrition support for exercise and the appropriate use of sports supplementation will also be covered.", "outcome": "   By the end of this course, students should be able to:1. acknowledge the scope and the potential implication of the study of nutrition in relation to health and physical exercise;2. demonstrate the basic scientific understanding of various foods and nutrients and their physiological functions;3. obtain an understanding of the importance of nutrition throughout the lifespan and in different population sub-groups;4. understand the role of nutrition in the prevention and management of various diet-related non-communicable diseases;   5. Demonstrate an understanding of sports nutrition and its application.  ", "syllabus": "1. Introduction to Nutrition & The Fundamentals (I): Carbohydrates2. The Fundamentals (II): Proteins and Lipids lipids  3. The Fundamentals (III): Vitamins, Minerals and Water water  4. The Fundamentals (IV): Elements of a healthy diet5. The Fundamentals (V): Nutritional assessment6. The Fundamentals (VI): Nutrition across the lifespan7. Nutrition for exercise (I): Fuel for exercise8. Nutrition for exercise (II): Nutritional needs for different types of sport and populations9. Nutrition for exercise (III): The performance nutrition10. Nutrition for health (I): Obesity as a global challenge11. Nutrition for health (II): Under-nutrition and food security12. Nutrition for health (III): Diet and cardiovascular disease13. Nutrition for health (IV): Diet and cancer", "required_readings": "1.           Personal nutrition. Marie A. Boyle, Sara Long Roth. 8th ed. Wadsworth Cengage Learning, 2013.2.           Sports and Exercise Nutrition. William D. McArdle, Frank I. Katch, Victor L. Katch. 4th ed. Wolters Kluwer, 20133.             ACSM’s Nutrition for Exercise Science. Dan Benardot. Wolters Kluwer. 2019", "recommended_readings": "4.           Human nutrition: a health perspective. Mary E. Barasi. 2nd ed. London: Arnold ; New York :Oxford University Press, 20035.           Nutrition and health. Tanya Carr, Koen Descheemaeker. Oxford; Malden, MA : Blackwell Science, 2002.6.           Nutritional status assessment: a manual for population studies. Flaminio Fidanza. Chapman & Hall. 1991.7.             Diet, Nutrition and the Prevention of Chronic Diseases WHO Technical Report No. 916, 2003 https://www.who.int/publications/i/item/924120916X", "terms": {"2024-25 Term 1": {"--LEC (8354)": {"startTimes": ["10:30"], "endTimes": ["13:15"], "days": [4], "locations": ["William M W Mong Eng Bldg 404"], "instructors": ["Dr. YUNG Ka Chun"], "meetingDates": ["5/9", "12/9", "19/9", "26/9", "3/10", "10/10", "17/10", "24/10", "31/10", "7/11", "14/11", "21/11", "28/11"]}}}, "assessments": {"Examination": "70", "Presentation": "30"}}, {"code": "2009", "title": "Environment and Work", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "JC Sch of Pub Health Prim Care", "requirements": "Not for students who have taken CHPR2001", "description": "This public health oriented course addresses how the environmental and occupational (work-related) factors affect human health and what we can do to prevent or minimize the negative impacts. Whereas environmental science tends to address how human beings affect the environment, this course focuses on how the environment affects human health. Topics include an introduction to the toxicology and environmental epidemiology methods in assessing the impact of environmental exposures on human health; how the physical, chemical or biological agents in the air, water, soil and food affect human health; the evaluation and control of common hazards in the work place; and the impacts of global environmental changes on health.", "outcome": "Upon completion of the course, the students will be expected to: 1.Discuss the history and definition of environmental health and occupational health 2.Describe epidemiology, toxicology and risk analysis methods to evaluate the impact of environmental exposures on human health 3.Define the major sources and types of hazards in the environment and workplaces4.Discuss the direct and indirect human health effects of major environmental and occupational agents5.Discuss the general principles of environmental pollution mitigation and occupational hazard control6.Discuss local, regional and international regulatory programs, guidelines and authorities on environmental and occupational health", "syllabus": "1. Introduction2. Exposure, dose and risk analysis3. Environmental hazard and health impact4. Natural environment and health5. Work and health6. Occupational disease and injury; Occupational legislation7. Written assignment guideline//mid-term exam8. Environmental health problems in Hong Kong9. Environmental health for all: global issues and international treaties10. Fundamentals of environmental epidemiology 11. Water and food safety12 . Solid and hazardous waste13. The atmosphere and air pollution", "required_readings": "Textbook: Essentials of Environmental Health. Robert H. Friis: Jones and Bartlett, c2019.", "recommended_readings": "To be advised by the course teacher", "terms": {"2024-25 Term 1": {"--LEC (8013)": {"startTimes": ["10:30"], "endTimes": ["13:15"], "days": [4], "locations": ["Mong Man Wai Bldg 707"], "instructors": ["Professor CHUNG Ming Kei"], "meetingDates": ["5/9", "12/9", "19/9", "26/9", "3/10", "10/10", "17/10", "24/10", "31/10", "7/11", "14/11", "21/11", "28/11"]}}}, "assessments": {"Essays": "20", "Examination": "80"}}, {"code": "2010", "title": "Health Care System & Policy", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "JC Sch of Pub Health Prim Care", "requirements": "", "description": "Healthcare systems are complex and multidisciplinary in nature. They need to meet population needs and may include a network of services such as prevention, diagnosis, treatment, rehabilitation, and health maintenance provided to individuals of all ages and with a range of needs. Policy plays an important role in maximizing the function of health care systems. This course is an introductory course on basic definitions and functions of health care systems. Using case studies, discussions and site visits, students will be able to develop understanding of policy and practice in health care.", "outcome": "Upon completion of the course, the students will be expected to:1. Describe the basic concepts and functions of health system                2. Classify the healthcare delivery provision in different levels               3. Recognize different healthcare financing mechanism and its characteristics4. Identify the basic elements of health policy and its impact on health care systems5. Discuss different types of resources required in the health system6. Compare and contrast how the contextual factors shaping the health systems", "syllabus": "1. Introduction of Health Systems  2. Healthcare Services3. Hospital Visit:: CU Medical Centre4. Long-term Care5. History of Healthcare Services6. NGO Site Visit: HK Kidney Foundation7. Healthcare Financing8. District Health Centre Visit 9. Health Policy I: Introduction10: Health Policy II: Health Care Reform11. Health Policy III: Case Discussion12. Healthcare Resources", "required_readings": "To be advised by the course teacher ", "recommended_readings": "1. Robin Gauld & Derek Gould. (2002). The Hong Kong health sector: Development & change2. Leung G.M. & Bacon-Shone J. (2006). Hong Kong's health system: reflections, perspectives and visions.3. Allot M. & Robb M. (2008). Understanding health & social care: an introductory reader. London: Sage in association with the Open University4. Carrin G. et al (2009). Health systems policy, finance, and organization. USA: Academic Press.5. Buse K., Mays N. & Walt G. (2012). Making health policy. New York: Open University Press.  6. Smith R.D. & Hanson K. (2012). Health systems in low-and middle-income countries: An economic & policy perspective. New York: Oxford University Press Inc", "terms": {"2024-25 Term 1": {"--LEC (8485)": {"startTimes": ["14:30"], "endTimes": ["17:15"], "days": [3], "locations": ["Y.C. Liang Hall 106"], "instructors": ["Professor WONG Lai Yi"], "meetingDates": ["4/9", "11/9", "25/9", "2/10", "9/10", "16/10", "23/10", "30/10", "6/11", "13/11", "20/11", "27/11"]}}}, "assessments": {"Examination": "50", "Presentation": "40", "Participation": "10"}}, {"code": "2011", "title": "Global Health", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "JC Sch of Pub Health Prim Care", "requirements": "Pre-requisite:PHPC1001 or MEDF1021 or UGEC1920 or UGEC2930", "description": "This course will introduce how public health principles may be applied to understand and examine health issues and initiatives in global settings.  Students will build up a knowledge base in global public health issues and will identify global health problems and devise possible solutions to these problems. Public health issues in specific countries will be identified and students will work in teams, develop critical thinking skills and expand their knowledge base in public health and provide possible solutions of global health issues. They will communicate their findings to each other and to the whole class in presentations. The contexts from which these public health issues arise in these countries would be compared and contrasted.  The course would provide opportunities for development of relevant attributes by the use of issue-based teaching approaches e.g. students will be engaged in learning tasks which require them to analyze in depth of a global health issue of specified countries, appreciate the complex nature of dynamics which shape global health issues and agenda, understand various perspectives of the stakeholders (nations, governments, non-government body, civil society etc.) and demonstrate the values of global citizenship, and come up with possible solutions which include defining goals, formulation of strategies/action plans, gathering and identification of resources needs and the skills to communicate with stakeholders.", "outcome": "Upon completion of the course, students will be expected to: 1. Be equipped with the knowledge base and skills to identify and analyze global health issues 2. Be aware of the contextual factors which come into play in global health issues and develop relevant attributes and skills to consider possible solutions 3. Demonstrate the role and responsibility of global citizenships and how individual might be related to the protection of global health 4. Identify key stakeholders in global health and its underlying decision-making dynamics, and able to engage with them 5. Understand current trends and thematic issues in global health and arouse international awareness 6. Examine and discuss key health priorities such as SDGs, Sendai Framework, Urban Agenda and Paris agreements in a global environment 7. Have divergent and convergent thinking to formulate solutions to address the global health challenges", "syllabus": "1) Introduction to Global Health2) Global Burden of Disease: Non-Communicable Diseases & Communicable Diseases3) Global Health Policy and Governance4) Poverty Reduction, Multilateral Financing for Global Health, Foreign Aid & Corruption5) Global Health and Justice6) One Health7) Health Demography: Globalization and Migration8) Globalization and Food Security9) Global Health Policy: The Control of Illegal Drugs10) Climate Change and Global Health11) Health in War, Disasters, and Emergencies12) Global Infectious Diseases and Pandemic Policies", "required_readings": "Textbook:1.           Kathryn H. Jacobsen. Introduction to Global Health. (3rd ed). Jones and Barlett Publishers, Inc. (2018)2.           Garrett Brown, Gavin Yamey, Sarah Wamala, eds. The handbook of global health policy. Wiley Blackwell, UK. (2014)3.           National Academies of Sciences, Engineering, and Medicine and National Academy of Medicine. 2022. Countering the Pandemic Threat Through Global Coordination on Vaccines: The Influenza Imperative. Washington, DC: The National Academies Press. https://doi.org/10.17226/26284 4.           Measuring the Global Burden of Disease: Philosophical Dimensions. Edited by Nir Eyal, Samia A. Hurst, Christopher J.L. Murray, S. Andrew Schroeder, Daniel Wikler Oxford University Press, UK. (2020) available online via google books. 5.           One Health: Integrated approach to 21st Century Challenges to Health. Edited by Joana C. Prata, Ana Isabel Ribeiro, Teresa Rocha-santos. 2022. DOI: 10.1016/B978-0-12-822794-7.00004-6 (available online)Articles:1.           UN Environment Programme. State of the climate. Climate action Note – data you need to know. 9 Nov 2021. Link: https://www.unep.org/explore-topics/climate-action/what-we-do/climate-action-note/state-of-climate.html2.           Gupta J. A History of International Climate Change Policy. September 2010. Wiley interdisciplinary reviews: Climate Change 1(5):636 – 653. DOI:10.1002/wcc.67 Link: https://www.researchgate.net/publication/229893868_A_History_of_International_Climate_Change_Policy 3.           Julie Lajoie. Understanding the measurement of Global Burden of Disease. National Collaborating Centre for Infectious Diseases. https://nccid.ca/wp-content/uploads/sites/2/2015/03/Global_Burden_Disease_Influenza_ENG.pdf 4.           The burden of antimicrobial resistance in the Americas in 2019: a cross-country systematic analysis. DOI: 10.1016/j.lana.2023.1005615.           Global, regional, and national burden of diabetes from 1990 to 2021, with projections of prevalence to 2050: a systematic analysis for the global burden of disease study 2021. DOI: 10.1016/S0140-6736(23)01301-66.             One Health Joint Plan of Action (2022-2026). Published by FAO/UNEP/WHO/OIE. Rome 2022. https://www.woah.org/app/uploads/2022/04/one-health-joint-plan-of-action-final.pdf", "recommended_readings": "1.           Kathryn H. Jacobsen, Introduction to Global Health. (3rd ed). Jones and Barlett Publishers, Inc. (2018)2.           Ed. Kelly Lee and Jeff Colin. Global Change and Health. Understanding Public Health. Open University Press. (2005)3.             Ed. Richard L. Skolnik. Essentials of Global Health. Jones and Bartlett Publishers. (2008/2015)", "terms": {"2024-25 Term 2": {"--LEC (8202)": {"startTimes": ["14:30"], "endTimes": ["17:15"], "days": [3], "locations": ["Mong Man Wai Bldg 702"], "instructors": ["Professor CHUNG Roger Yat Nork"], "meetingDates": ["8/1", "15/1", "22/1", "5/2", "12/2", "19/2", "26/2", "12/3", "19/3", "26/3", "2/4", "9/4", "16/4"]}}}, "assessments": {"Examination": "60", "Presentation": "40"}}, {"code": "2015", "title": "Biostatistics", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "Lecture\nInteractive Tutorial", "campus": "Main Campus", "academic_group": "JC Sch of Pub Health Prim Care", "requirements": "Not for students who have taken -COMM3110, DSME2010,2020,2011,2021, ECON2121, GRMD2102, PHPC1015, PSYC2010, SEEM2430, SPED2600, STAT2101,2102,2001 or 2006.", "description": "This course will introduce the basic biostatistics concepts and their applications in health data analysis. Emphasis will be placed on conceptual understanding of statistical approaches to medical data rather than on theory and equations. Students will learn the importance of the correct use of statistical methods in addressing questions of public health importance. The course will enable students to develop the statistical literacy necessary to interpret the vast amounts of information they must process for decision making. The biostatistics concepts will be taught together with a user-friendly software SPSS for performing basic statistical analyses.", "outcome": "   By the end of this course, student should be able to:   1. have an understanding of the fundamental concepts of probability and basic statistics.   2. apply this knowledge towards improved understanding of reports on research findings and better decision making.  ", "syllabus": "1. Introduction to descriptive statistics: Levels of measurement, measuring central tendency and variability, frequency tables.2. Statistical Charts and Probability3. Probability distributions: Normal, binomial4. Sampling distributions5. Estimation and confidence intervals6. Hypothesis testing: t-tests 7. Hypothesis testing: two-sample tests8. Hypothesis testing: Categorical data9. Nonparametric tests (I)10. Nonparametric tests (II)11. Correlation and simple linear regression12. Multiple linear regression I13. Multiple linear regression II", "required_readings": "Robert H. Riffenburgh and Daniel L. Gillen. Statistics in Medicine, Academic Press; 4th Edition, 2020", "recommended_readings": "Bland, Martin. An introduction to medical statistics. Oxford University Press (UK), 4th Edition, 2015.", "terms": {"2024-25 Term 1": {"A-LEC (8387)": {"startTimes": ["9:30"], "endTimes": ["12:15"], "days": [2], "locations": ["Institute of Chin Studies L1"], "instructors": ["Professor KWOK Kin On"], "meetingDates": ["3/9", "10/9", "17/9", "24/9", "8/10", "15/10", "22/10", "29/10", "5/11", "12/11", "19/11", "26/11"]}, "B-LEC (8014)": {"startTimes": ["9:30"], "endTimes": ["12:15"], "days": [2], "locations": ["Y.C. Liang Hall 106"], "instructors": ["Professor YIP Hon Kei"], "meetingDates": ["3/9", "10/9", "17/9", "24/9", "8/10", "15/10", "22/10", "29/10", "5/11", "12/11", "19/11", "26/11"]}}}, "assessments": {"Examination": "50", "Homework or assignment": "40", "Participation": "10"}}, {"code": "2016", "title": "Theories and Concepts of Health Behaviours", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "JC Sch of Pub Health Prim Care", "requirements": "Pre-requisite: PHPC1022 or PHPC2008.\nNot for students who have taken CHPR3002, 3008, 4008 or PHPC1016", "description": "The course lays the foundation for socio-medical behavioural sciences in public health. Contents of the course include the definitions of health and health as a socially constructed concept, some important theories that have been widely used in health promotion, interdisciplinary health concepts, as well as key concepts about health promotion.", "outcome": "By the end of this course, student should be able to:  1. understand the definitions and social constructions of health  2. understand basic health behavioral theories and how these theories can be used to formulate strategies for health improvement programs  3. demonstrate interdisciplinary understandings on health communication, positive psychology, and patient’s responses to illness  4. understand the key concepts of the planning process for health promotion", "syllabus": "1. Course Introduction, Social Construction of Health2. Fear Appeal Approach Health Belief Model, Introduction of group project3. Theory of Planned Behaviors, Stages of Change Model, Social Cognitive Theory4. Communication Theory, Diffusion of Innovations5. Social Marketing and Health Promotion 6. Introduction to Implementation Science7. Health Program Planning and Evaluation (I)8. Health Program Planning and Evaluation (II)", "required_readings": "Textbook: 1.             Glanz, K., Rimer, BK. (2005) Theory at a Glance: A Guide for Health Promotion Practice. United States National Cancer Institute. http://www.sbccimplementationkits.org/demandrmnch/wp-content/uploads/2014/02/Theory-at-a-Glance-A-Guide-For-Health-Promotion-Practice.pdf", "recommended_readings": "1. Nutbeam, D., Harris, E., and Wise, M. 2010. Theory in a nutshell: a guide to health promotion theory. (3rd Edition) McGraw-Hill Book Company Australia. 2.Glanz, K., Rimer, B.K., Viswanath, K. 2015. Health Behavior: Theory, Research and Practice (5th Edition) Jossey-Bass. 3. Cockerham, Willam C. Medical Sociology. Upper Saddler River, NJ: Prentice Hall. 15th Edition 4. Marmot, M. and Wilkinson, R.G.. 2006. Social Determinants of Health (2nd Edition). Oxford University Press. 5. Kotler, P., Lee N. 2015. Social marketing: Changing behaviors for good. (5th edition). Sage Publications, Inc. Thousand Oaks, California. 6. McKenzie, J, Neiger, B, Thackeray, R. 2016. Planning, implementing and evaluating health promotion programs: A primer. Pearson Education, Inc.7. Brownson, RC, Colditz, GA, Proctor, EK. 2012. Dissemination and implementation research in health: translating science to practice. Oxford", "terms": {"2024-25 Term 1": {"--LEC (8431)": {"startTimes": ["14:30"], "endTimes": ["17:15"], "days": [1], "locations": ["Lady Shaw Bldg LT3"], "instructors": ["Professor WANG Zixin"], "meetingDates": ["2/9", "9/9", "16/9", "23/9", "30/9", "7/10", "14/10", "21/10", "28/10", "4/11", "11/11", "18/11", "25/11"]}}}, "assessments": {"Examination": "70", "Project": "30"}}, {"code": "2017", "title": "Epidemiology", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "JC Sch of Pub Health Prim Care", "requirements": "Not for students who have taken PHPC1014.", "description": "This course aims to introduce the fundamental concepts and principles of epidemiological methods and their applicability to the field of healthcare research. Students will grasp the knowledge about the rationale, advantages and shortcomings of different types of epidemiological studies and the basic skills needed to conduct and critically interpret the results of such studies.", "outcome": "Upon completion of the course, the students are expected to be able to: 1.           describe and differentiate the commonly used study designs in epidemiological research and appreciate the advantages and shortcomings of each. 2.           describe and differentiate the commonly used sampling and data collection methods and appreciate the advantages and shortcomings of each. 3.           calculate and interpret the commonly used effect measures in epidemiological research.4.             explain with examples important methodological issues such as bias in epidemiological research which may affect interpretation of results.", "syllabus": "1. (1) Introduction to the course    (2) Introduction to epidemiological research issues with discussion of common sources of health data & introduction to research ethics2. Measures of disease occurrence, adjustment of rates3. Introduction to descriptive studies & cross-sectional studies4. Sampling methods5. Cohort studies6. Case-Control Studies 7. Confounding7. Intervention studies (community base, clinical trial)8. Data collection methods/ questionnaire design and item construction, creating scales, validity & reliability9. Evaluation of diagnostic and screening tests10. Effect modification, bias, and causal inference in epidemiology11. Brief overview of systematic reviews", "required_readings": "To be advised by the course teacher ", "recommended_readings": "1. Normal Vetter. Epidemiology and Public Health Medicine. Published by Elsevier Publishing, 1999.2. D. Coggon, Geoffrey Rose, DJP Barker. Epidemiology for the Uninitiated. Published by The BMJ, 2003. (Freely available from: https://www.bmj.com/about-bmj/resources-readers/publications/epidemiology-uninitiated)3. Margaret Somerville, K. Kumaran, Rob Anderson. Public Health and Epidemiology at a Glance, 2nd Edition. Published by John Wiley & Sons, Ltd, 2012. (Freely available from: www.aspu.edu.sy/laravel-filemanager/files/18/مراجع%20صيدلة/Public%20Health%20and%20Epidemiology%20at%20a%20Glance-%20Margaret%20Somerville%202012.pdf)", "terms": {"2024-25 Term 1": {"--LEC (8386)": {"startTimes": ["13:30"], "endTimes": ["16:15"], "days": [4], "locations": ["Mong Man Wai Bldg LT2"], "instructors": ["Professor YANG Zuyao"], "meetingDates": ["5/9", "12/9", "19/9", "26/9", "3/10", "10/10", "17/10", "24/10", "31/10", "7/11", "14/11", "21/11", "28/11"]}}}, "assessments": {"Examination": "60", "Homework or assignment": "35", "Participation": "5"}}, {"code": "2018", "title": "Infectious Diseases of Public Health Importance", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "JC Sch of Pub Health Prim Care", "requirements": "For students of new curriculum only.\nNot for studens who have taken PHPC1018.\nPre-requisite: PHPC1017.", "description": "The course provides an overview of the epidemiology and principles on prevention and control of infectious diseases of global and local public health importance. It covers major conventional infectious disease categories including respiratory, vector-borne, foodborne, vaccine-preventable, etc. as well as contemporary major infections including COVID-19. Biological features and characteristics, routes and risk factors for transmission, and specific public health issues on their prevention and control will be discussed. The perspectives of food safety and cancer prevention in relation to infection control will be introduced.", "outcome": "By the end of this course, student should be able to: 1. Describe and explain the spectrum, epidemiology, causative agents, risk and route of transmission of infectious diseases of global and local public health importance 2. Describe and discuss the general public health management, prevention and control strategies of these infectious diseases ", "syllabus": "1. Vaccine-preventable diseases2. Respiratory tract infections3. HIV/AIDS and Sexually transmitted infections4. Viral hepatitis5. Cancers and infections6. Foodborne infections and food safety7. Antimicrobial resistance and gut microbiota8. Viral hemorrhagic fever9. Tuberculosis10. The coronavirus infections - COVID-19 and also MERS and SARS11. Vector-borne infection12. Prevention and control of influenza including avian flu", "required_readings": "Textbook: Public Health Infectious Disease by Lee Shui-shanPublisher: Stanley Ho Centre for Emerging Infectious DiseasesFreely available via mobile App “Learning Public Health Infectious disease” (Authentication code = your 10-digit student number)iOS:  https://itunes.apple.com/us/app/learning‐phid‐free‐version/id1116560161Android: https://play.google.com/store/apps/details?id=com.ceid.phidfree", "recommended_readings": "To be advised by the course teacher", "terms": {"2024-25 Term 2": {"--LEC (8226)": {"startTimes": ["9:30"], "endTimes": ["12:15"], "days": [4], "locations": ["William M W Mong Eng Bldg 401"], "instructors": ["Professor POON Kwok Ming"], "meetingDates": ["9/1", "16/1", "23/1", "6/2", "13/2", "20/2", "27/2", "13/3", "20/3", "27/3", "3/4", "10/4", "17/4"]}}}, "assessments": {"Examination": "80", "Presentation": "20"}}, {"code": "2019", "title": "Practical Skills in Literature Search and Review", "career": "Undergraduate", "units": "1.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "JC Sch of Pub Health Prim Care", "requirements": "Pre-requisite: PHPC1001, MEDF1021 or UGEC1920 and PHPC2017.", "description": "This course will prepare the public health students with basic concepts of evidence-based healthcare. They will acquire skills in forming an answerable healthcare question, conducting literature search, and critical appraisal of research findings from epidemiological studies. Students are expected to demonstrate skills in performing literature search and critical appraisal independently.", "outcome": "By the end of this course, student should be able to:  1.Identify appropriate data source and search for trustworthy information of public health issues 2.Form an answerable research question 3.Understand the key elements in critically appraising epidemiological studies", "syllabus": "1. Introduction of Literature Search and Overview of Academic Search Database / Engines2. Introduction of Searching Techniques & Practical Experience on Literature Search (1)3. Introduction of Searching Techniques & Practical Experience on Literature Search (2)4. Literature Review & Application of reference management software (EndNote)", "required_readings": "Textbook: 1.           Ridley, D. (2012). The literature review: A step-by-step guide for students (2nd ed.). London: Sage (UK). 2.           Machi, L. A., & McEvoy, B. T. (2021). The literature review: Six steps to success. Fourth Edition. Thousand Oaks: Corwin Press.3.             Aveyard, H. (2023). Doing a Literature Review in Health and Social Care: A Practical Guide. 5th Edition. Open University Press.", "recommended_readings": "1.           CUHK Libguides: https://libguides.lib.cuhk.edu.hk/?b=t  2.           Temple University Libraries. Evidence Synthesis & Systematic Review: https://guides.temple.edu/c.php?g=78618&p=9741148   3.           University of Waterloo Library. Public Health and Kinesiology Research: Systematic reviews and more: https://subjectguides.uwaterloo.ca/c.php?g=695410&p=4932740  4.           YouTube Channel - Welch Medical Library. By Johns Hopkins University: https://www.youtube.com/user/welchlibrary 5.           Higgins J, Thomas J. “Cochrane Handbook for Systematic Reviews of Interventions. (Version 6)” 2019. https://training.cochrane.org/handbook   6.           Equator Network. Enhancing the QUAlity and Transparency Of health Research: https://www.equator-network.org/ 7.             Brownson, R. C., Fielding, J. E., & Maylahn, C. M. (2009). Evidence-based public health: a fundamental concept for public health practice. Annual review of public health, 30, 175-201. https://www.annualreviews.org/doi/full/10.1146/annurev.publhealth.031308.100134", "terms": {"2024-25 Term 2": {"--LEC (5753)": {"startTimes": ["16:30"], "endTimes": ["18:15"], "days": [4], "locations": ["Pi-Ch'iu Building Room 103"], "instructors": ["Professor ZHANG Dexing"], "meetingDates": ["9/1", "16/1", "23/1", "6/2", "13/2", "20/2", "27/2", "13/3", "20/3", "27/3", "3/4", "10/4", "17/4"]}}}}, {"code": "2020", "title": "Community-based Learning for Healthy Ageing", "career": "Undergraduate", "units": "3.00", "grading": "Distinction/Pass/Failure", "components": "Field Studies/Field-trip", "campus": "Main Campus", "academic_group": "JC Sch of Pub Health Prim Care", "requirements": "", "description": "This inspiring course provides valuable insight through interactive lectures, workshops, simulations, guest sharing, presentations, and service in a community setting. Through different learning activities, students will be able to develop an understanding of the challenges of ageing with chronic disease and obtain practical knowledge of self-care management with views from different stakeholders involved in the healthcare system. This course provides a unique community-based opportunity to apply knowledge and skills to enhance older adults’ health and improve their self-care experience. Upon completing this course, students will gain an overview of health and social care services and develop empathy for the needs of older adults.", "outcome": "Upon completion of the course, the students will be expected to:1. describe health and social care needs from the older adults' perspective 2. describe drug management and the problems of polypharmacy in the community 3. describe and apply the framework of self-care management and patient empowerment4. enhance communication skills with older adults through community services programme5. describe an overview of available resources in the community to promote health 6. apply an inter-disciplinary approach in delivering community service to strengthen self-care skills to promote older adults' health", "syllabus": "1.   Challenges of ageing 2.  Stereotypes of ageing3.  Introduction of age-friendly city4.  Introduction of chronic diseases5.  Application of medical equipment and assessment tools6.  End of life7.  Experience of ageing8.  Intergenerational communication9.   Community service10. Student reflective sharing", "required_readings": "To be advised by the course teacher", "recommended_readings": "To be advised by the course teacher", "terms": {"2024-25 Term 1": {"-F01-FLD (6675)": {"startTimes": ["10:30"], "endTimes": ["13:15"], "days": [4], "locations": ["Cheng Yu Tung Building 201"], "instructors": ["Mr. CHIU Cheuk Pong, \n\nProfessor WONG Lai Yi"], "meetingDates": ["5/9", "12/9", "19/9", "26/9", "3/10", "10/10", "17/10", "24/10", "31/10", "7/11", "14/11", "21/11", "28/11"]}}, "2024-25 Term 2": {"-F01-FLD (8566)": {"startTimes": ["10:30"], "endTimes": ["13:15"], "days": [4], "locations": ["Wu Ho Man Yuen Bldg 306"], "instructors": ["Mr. CHIU Cheuk Pong, \n\nProfessor WONG Lai Yi"], "meetingDates": ["9/1", "16/1", "23/1", "6/2", "13/2", "20/2", "27/2", "13/3", "20/3", "27/3", "3/4", "10/4", "17/4"]}}}, "assessments": {"Internship or practicum": "36", "Presentation": "36", "Participation": "28"}}, {"code": "3010", "title": "Health Care System Field Studies", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "Field Studies/Field-trip", "campus": "Main Campus", "academic_group": "JC Sch of Pub Health Prim Care", "requirements": "", "description": "This study tour is to give a great learning experience of how the health system works in other jurisdictions. With the study tour, students can gain first-hand experiences and grasp certain knowledge about the health system, its structure, governance, financing and service delivery provision in specific jurisdiction which may varies in each year depending on the site arrangement of corresponding study tour. Students will identify the strengths of the system, how it produces good outcome and what challenges it tackles in order to achieve the good health and high quality of healthcare in population. The study tour also ties policy with health system in a broader context. Students are required to select a study topic of interest, for example, healthcare financing and universal coverage, long term care, quality of healthcare delivery, and impact of policy in population health and then to review literature, to collect information from the places visited and seminar, and to deliver a presentation in the class.This course will be held during term breaks under the supervision of one or more faculty members. Students are responsible for all travel expenses in the study tour, including air fares, accommodation, food, transportation and travel insurance.The objectives of the course are three-fold: (1) to offer students a field-based education in their undergraduate programs for the extension of classroom learning through direct observation, sharing and experience;(2) to deepen students’ understanding on health system in a broader context including its structure, governance, financing and service delivery provision; and (3) to provide students a comprehensive view on local and regional public health issues in health system.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "3012", "title": "Public Health Ethics and Law", "career": "Undergraduate", "units": "1.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "JC Sch of Pub Health Prim Care", "requirements": "Pre-requisite: PHPC1001 or UGEC1920 or MEDF1021 or UGEC2930.", "description": "This course will introduce students to the basic concepts of ethics and law and explore their relevance to professional and clinical public health practices. It will introduce students to the role of ethics and law in promoting and protecting public health. Case studies will be used to highlight contemporary ethical and legal issues in public health in Hong Kong.", "outcome": "By the end of this course, students should be able to learn: 1. Understand basic ethical concepts and applications 2. Discuss contemporary ethical dilemmas in public health and health care scenarios 3. Understand basic legal terminology and sources of law in Hong Kong 4. Understand Hong Kong’s public health legislation 5. Understand the importance of ethics and law in protecting public health 6. Identify and analyze different approaches to decision-making in relation to public health dilemmas and the relevant ethics considerations 7. Demonstrate an understanding of public health as a public good in Hong Kong", "syllabus": "1. Introduction to ethics: what is it?2. Bioethics: Origin and Current Paradigms3. Moral theories in bioethics, Part 14. Moral theories in bioethics, Part 25. Moral theories in bioethics, Part 36. Moral theories, principles, and rules7. Public health law and ethics ", "required_readings": "1. Campbell AV. Bioethics the Basics. London & New York: Routledge; 2017.2. Beauchamp TL, Childress JF. Principles of Biomedical Ethics. 7th ed. New York: Oxford Press; 2013.  3. Gostin LO. Global Health Law In: Public Health Law and Ethics. 2nd ed. Berkerly: University of California Press; 2010: 233-281", "recommended_readings": "To be advised by the course teacher ", "terms": {"2024-25 Term 2": {"--LEC (8204)": {"startTimes": ["11:30"], "endTimes": ["13:15"], "days": [1], "locations": ["Y.C. Liang Hall 106"], "instructors": ["Professor CHUNG Roger Yat Nork"], "meetingDates": ["6/1", "13/1", "20/1", "27/1", "10/2", "17/2", "24/2", "10/3", "17/3", "24/3", "31/3", "7/4", "14/4"]}}}, "assessments": {"Examination": "60", "Presentation": "40"}}, {"code": "3014", "title": "Evidence Based Public Health and Healthcare", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "JC Sch of Pub Health Prim Care", "requirements": "For students of new curriculum only.\nNot for students who have taken PHPC2014.\nPre-requisites: PHPC2015 & PHPC2017.", "description": "Building on students’ skills in epidemiology and biostatistics, this module will introduce advanced concepts and skills in evidence-based public health and healthcare. Students will acquire the skills in turning public health and healthcare queries into focused questions on effectiveness, diagnostic and screening performances . Students will be equipped with skills to critically appraise the validity and generalizability of research findings, to synthesize evidence and to implement evidence into practice.", "outcome": "By the end of this course, student should be able to: Master advanced skills in practicing evidence based public health and healthcare, including the formulation of focused clinical questions, critique on the validity and generalizability of evidence, synthesis of evidence, and translating knowledge into action.", "syllabus": "1. Concepts in evidence based public health and healthcare2. Interpretation and application of pre-appraised evidence3. Critical appraisal of randomized trials4. Critical appraisal of systematic reviews5. Introduction to meta-analysis6. Preparation of the systematic review protocol group project 7. Critical appraisal of cross sectional studies8. Critical appraisal of observational studies9. Presenting, interpreting and writing up of randomized trial and systematic review findings10. Diagnostic test studies in evidence based public health and healthcare11. Prognostic studies in evidence based public health and healthcare12. Translating evidence into practice: Introduction to Implementation Science", "required_readings": "To be advised by the course teacher", "recommended_readings": "To be advised by the course teacher", "terms": {"2024-25 Term 2": {"--LEC (7625)": {"startTimes": ["9:30"], "endTimes": ["12:15"], "days": [3], "locations": ["Hui Yeung Shing Bldg 501"], "instructors": ["Professor WANG Zixin"], "meetingDates": ["8/1", "15/1", "22/1", "5/2", "12/2", "19/2", "26/2", "12/3", "19/3", "26/3", "2/4", "9/4", "16/4"]}}}, "assessments": {"Examination": "80", "Presentation": "20"}}, {"code": "3015", "title": "Practical Skills in the Public Health Management of Infectious Diseases", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "JC Sch of Pub Health Prim Care", "requirements": "Pre-requisites: PHPC1017", "description": "This course aims to acquaint students with practical knowledge and skills for prevention and control of infectious disease from public health perspectives. It covers principles and steps on investigating and controlling different types of infectious disease outbreak in various settings including practical skills and issues in the field. Local and global perspectives on infectious disease management will be discussed.", "outcome": "Upon completion of the course, the students should be able to: 1. Describe and discuss public health measures and management strategies of infectious diseases and outbreaks  2. Explain the principles and apply practical steps and specific methods for outbreak investigations and control 3. Interpret epidemiological data collected from the field and be able to draw appropriate conclusions and recommendations", "syllabus": "1. Outbreak control measures – contact tracing, quarantine, isolation2. Outbreak investigation and field epidemiology3. Institutional outbreaks 4. Infection control in long-term care facilities + Case study5. Travel and Infectious Diseases6. Food poisoning outbreak7. Practical vaccinology8. One Health9. Disaster and infectious disease10. International perspective on infectious disease control11. Laboratory methods and biosafety for infectious diseases", "required_readings": "Public Health Infectious Disease by Lee Shui-shanPublisher: Stanley Ho Centre for Emerging Infectious DiseasesFreely available via mobile App “Learning Public Health Infectious disease” (Authentication code = your 10-digit student number)iOS:  https://itunes.apple.com/us/app/learning‐phid‐free‐version/id1116560161Android: https://play.google.com/store/apps/details?id=com.ceid.phidfree CDC Yellow BookCenters for Disease Control and PreventionAvailable at https://wwwnc.cdc.gov/travel/yellowbook/2020/table-of-contents#60", "recommended_readings": "To be advised by the course teacher", "terms": {"2024-25 Term 2": {"--LEC (9193)": {"startTimes": ["9:30"], "endTimes": ["12:15"], "days": [2], "locations": ["Basic Med Sci Bldg LT"], "instructors": ["Professor POON Kwok Ming"], "meetingDates": ["7/1", "14/1", "21/1", "4/2", "11/2", "18/2", "25/2", "11/3", "18/3", "25/3", "1/4", "8/4", "15/4"]}}}, "assessments": {"Examination": "80", "Presentation": "20"}}, {"code": "3016", "title": "Environment and Health", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "JC Sch of Pub Health Prim Care", "requirements": "Pre-requisite: PHPC2009 or CHPR2001", "description": "This course addresses how environmental factors affect human health and what we can do to prevent or minimize the negative impacts. It examines the environmental health issues and recent development in industrialized and developing countries. It also covers risk analysis and communication, environmental health policy, and emerging environmental health problems.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "3017", "title": "Work and Health", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "JC Sch of Pub Health Prim Care", "requirements": "", "description": "This course adopts a systematic approach to the study of occupational health and hygiene, and addresses both the effects of work on health and the effects of health on work. It covers the scopes and principles of occupational health and hygiene, toxicological assessment and occupational exposure limits, principles of ergonomics, occupational diseases including cancers and the relevant legislations, exposure assessment and instrumentation, health risk assessment, occupational epidemiology, linkage of occupational and environmental health as well as sustainability.", "outcome": "Upon completion of the course, students will be expected to: 1. Be able to describe the scopes and principles of occupational health and hygiene;2. Understand common occupational hazards, occupational diseases and relevant legislations; 3. Know basic skills of health risk assessment and conducting occupational health hazards evaluation;4. Be conversant with the basic techniques in assessing occupational exposures, controlling occupational hazards, and occupational  epidemiology in practice;5. Be articulate in linkage of occupational and environmental health and workplace sustainability;", "syllabus": "1. An overview of occupational health and hygiene2. Chemical health hazards in the workplace3. Physical health hazards in the workplace4. Biological hazards in the workplace; Principles of ergonomics and prevention5. Toxicological assessment and occupational exposure limits;6. Hazard evaluation and instrumentation7. Occupational health practice (1) – conducting occupational safety and health (OSH) training at OSHC Academy (Tsing Yi)8. Control of hazards and safety issues;9. Occupational health practice (2) – conducting health hazard evaluation (HHE)10. Health risk assessment in occupational and environmental health; Occupational epidemiology in practice11. Occupational diseases, common cancers and the related occupation and environment12. Linking environmental health with occupational health, workplace wellness and sustainability;", "required_readings": "To be advised by the course teacher ", "recommended_readings": "To be advised by the course teacher", "terms": {"2024-25 Term 2": {"--LEC (8098)": {"startTimes": ["14:30"], "endTimes": ["17:15"], "days": [1], "locations": ["Mong Man Wai Bldg 706"], "instructors": ["Professor TSE Lap Ah"], "meetingDates": ["6/1", "13/1", "20/1", "27/1", "10/2", "17/2", "24/2", "10/3", "17/3", "24/3", "31/3", "7/4", "14/4"]}}}, "assessments": {"Examination": "70", "Project": "30"}}, {"code": "3018", "title": "Environmental Health Field Studies", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "Field Studies/Field-trip\nLecture", "campus": "Main Campus", "academic_group": "JC Sch of Pub Health Prim Care", "requirements": "Pre-requisite: CHPR2001 or PHPC2009 or PHPC3016", "description": "This field study course is supplementary to the three classroom-based courses CHPR2001, PHPC2009 and PHPC3016 on the environmental factors in public health. Students can gain first-hand experiences and grasp certain practical skills by conducting the field studies in Hong Kong, China and other areas. Environmental health is about how the environmental factors may adversely impact the public health and what we can do to prevent or minimize these impacts. By the scale, the hazards can be local (e.g., industrial and household pollution, traffic exhaust), regional (e.g., deteriorating regional air quality), or global (e.g., climate change); by the relationship to social development, the hazards can be traditional (e.g., household hygiene) or modern (e.g., new chemicals). Without field studies, the students may have difficulties in understand the broad scopes of environmental health practice. This course is to fill in this gap by conducting local and regional field studies and equipping the students with practical skills (e.g., air sampling techniques) in environmental monitoring, risk assessment and management. Students are first required to select a study topic of interest, for example air pollution and respiratory diseases, water pollution and metal industry, and social development and sustainability, and then to review literature, to collect information from the places visited, and to write up a final report.This course will be held during term breaks under the supervision of one or more faculty members. Students are responsible for all travel expenses in the field study, including transportation, food, accommodation, and travel insurance.The objectives of the course are three-fold: (1) to offer students a field-based education early in their undergraduate programs for the extension of classroom learning through direct observation and experience; (2) to deepen students’ understanding on relationships between environment and health, with emphasis on pollution, social development, and sustainability; and (3) to provide students a comprehensive view on local and regional public health issues.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "3024", "title": "Economics and Financing in Healthcare Systems", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "JC Sch of Pub Health Prim Care", "requirements": "", "description": "Should health care be privatized? Why is health insurance bad to your health? Who should pay the enormous cost of rare disease care? Finally, should I getting married or stay as single? All these questions are related to health economics (yes, even the last one). The course will introduce the key features in health economics analysis, such as demand and supply, equity vs efficiency, and cost-effectives analysis, a tool to prioritise health programs to efficiently maximise resources allocation. The course will also introduce healthcare financing and its impact on health care system. Students will be able to identify different models of healthcare financing around the world.", "outcome": " Upon completion of the course, the students will be expected to: 1. Understand basic concepts of economics and its application in different healthcare settings  2. Identify economic issues and use economic rationale to support argument in a healthcare policy debate 3. Apply economics to improve the equity and efficiency in the health sector 4. Explain how health care in Hong Kong and elsewhere is financed 5. Evaluate health programs and policies from an economic perspective", "syllabus": "  Introduction to health economics:   Supply and Demand of health and health care:  The supply of health care  Market failure and Pareto Efficiency  Introduction to health care financing  How to assess equity: from a health system perspective  Health care financing from global perspective  Introduction to economic evaluation  Health-related adjusted life years  Cost-effectiveness analysis (i)  Cost-effectiveness analysis (ii)", "required_readings": " 1. Stephen Morris, Nancy Devlin, David Parkin, Anne Spencer. “Economic Analysis in Health Care” (2nd Edition), Wiley 2007 2. Pablo Gottret and George Schieber. “Health Financing Revisited. A Practitioner’s Guide”. The World Bank, 2006. 3. Peter Muennig, Mark Bountavong. “Cost-Effectiveness Analysis in Health” 3rd Edition. Jossey-Bass.   Topic 1: Chapter 1, and Session 2.1, 2.2, 2.4, 2.5 Morris Topic 2: Session 2.3, 3.1, 3.2, 3.4 (partly) Morris Topic 3: Session 3.5, 4.1, 4.2, 4.3 (partly) Morris Topic 4: Session 2.6, 5.1, 5.2, 5.3, 5.4 5.5 Morris Topic 5: Chapter 1-3 Gottret Topic 6: Chapter 7 Morris Topic 7: Chapter 7-9 Gottret Topic 8: Chapter 2 Muennig Topic 9: Chapter 4, 8 Muennig Topic 10: Chapter 9 Muennig Topic 11: Chapter 9 Muennig  ", "recommended_readings": " 1. Marc J. Roberts, William Hsiao, Peter Berman and Michael R. Reich. “Getting Health Reform Right: A Guide to Improving Performance and Equity”. Oxford University Press. 2008. 2. Peter Muennig, Mark Bountavong. “Cost-Effectiveness Analysis in Health” 3rd Edition. Jossey-Bass. 3. Sherman Folland, Allen Goodman, Miron Stano, “The Economics of Health and Health Care” 7th Edition, Routledge  4. Richard Edlin, Christopher McCabe, Claire Hulme, Peter Hall, Judy Wright. “Cost Effectiveness Modelling for Health Technology Assessmen: A Practical Course”. (eBook) Adis, Springer, 2015 5. The World Health Report 2010, “Health Systems Financing: The Path to Universal Coverage.” WHO 6. Article lists for specific sessions will be given out before each session.", "terms": {"2024-25 Term 2": {"--LEC (9194)": {"startTimes": ["9:30"], "endTimes": ["12:15"], "days": [3], "locations": ["Wong Foo Yuan Bldg 107B"], "instructors": ["Professor YIP Hon Kei"], "meetingDates": ["8/1", "15/1", "22/1", "5/2", "12/2", "19/2", "26/2", "12/3", "19/3", "26/3", "2/4", "9/4", "16/4"]}}}, "assessments": {"Examination": "80", "Presentation": "10", "Test or quiz": "10"}}, {"code": "3026", "title": "Health Promotion in Practice - Social Marketing", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "JC Sch of Pub Health Prim Care", "requirements": "Pre-requisites: (PHPC1016 or PHPC2016) and (PHPC1022 or PHPC2008).", "description": "This course aims to equip students with practical skills to apply health promotion concepts and methodology to resolve real-life public health problems. The course will give a deep examination of commonly used behavioural health models and teach practical skills in designing, implementing and evaluating behavioural intervention programmes. It covers areas such as formative research, scoping, implementation process, frameworks of health promotion, health communication skills, methods of designing and disseminating health messages, use of appropriate health settings and strategies for community involvement. Social marketing will be used as the main framework, integrating with general health promotion methods such as scoping, setting, behavioural change techniques, health communication and evaluation methods. The course will also provide hands-on training on the complete process of health promotion programme development.", "outcome": "By the end of this course, students should be able to: 1. Apply health promotion concepts, theories and methods to practice. 2. Understand principles and applications of social marketing for health improvement. 3. Apply skills commonly used in health promotion such as needs assessment, engagement of stakeholders, program planning, implementation, dissemination and marketing, and evaluation. ", "syllabus": " Key stages involved in health promotion program planning process Mapping out the needs and assets in a community Program planning and Implementation (I) Program planning and Implementation (II) Needs assessment from the social marketing perspective Exchange in health promotion Social marketing-based intervention design 1 Social marketing-based intervention design 2 Overview of program evaluation Evaluation design Outcome and impact evaluation", "required_readings": "McKenzie, J, Neiger, B, Smeltzer, J. (2013) Planning, implementing and evaluating health promotion programs: A primer. 6th Edition. Pearson Education, Inc.", "recommended_readings": "Lee NR, Kotler P. Social Marketing: Changing Behaviors for Good. Fifth edition. Los Angeles: SAGE Publications, Inc; 2015. 584 p.", "terms": {"2024-25 Term 2": {"--LEC (6535)": {"startTimes": ["15:30"], "endTimes": ["18:15"], "days": [4], "locations": ["William M W Mong Eng Bldg 408"], "instructors": ["Professor WANG Zixin"], "meetingDates": ["9/1", "16/1", "23/1", "6/2", "13/2", "20/2", "27/2", "13/3", "20/3", "27/3", "3/4", "10/4", "17/4"]}}}, "assessments": {"Examination": "60", "Project": "35", "Participation": "5"}}, {"code": "3027", "title": "Qualitative Research", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "JC Sch of Pub Health Prim Care", "requirements": "Pre-requisite: PHPC1001 or UGEC1920 or MEDF1021or MEDF1120 or UGEC2930", "description": "Qualitative research in public health has become more important and is rapidly expanding. By adopting qualitative research approaches, in-depth social-cultural ideas in public health issues, which cannot be explained by quantitative methods alone, can be explained and explored. Obtaining the knowledge and skills of qualitative research methods enables students to better examine contemporary health problems in context.", "outcome": "Upon completion of the course, the students will be expected to:• Understand basic theories, concepts, and ethics of qualitative research • Understand the difference between qualitative and quantitative research methods • Understand the practical dimension of qualitative research: study design, conducting observation, in-depth interview, and focus group • Understand and apply the skills of data coding and interpretation in the analytical process • Obtain skills of writing qualitative research reports", "syllabus": "1. Introduction to qualitative research & Conceptual issues2. Qualitative research design & Sampling3. Method 1 – Observation methods4. Method 2 – In-depth interviews5. Method 3 - Focus Group6. Qualitative Data Analysis7. Applying Qualitative Methods to Studies on Public Health8. Interpretation and Presentation of Findings", "required_readings": "Textbook: Judith Green & Nicki Thorogood, 2018, Qualitative Methods for Health Research (4th edition), SAGE Publication", "recommended_readings": "Rosalin S Barbour, 2014. Introducing qualitative research: a student’s guide to the craft of qualitative research (2nd edition). SAGE Publication.John W. Creswell, 2017. Qualitative Inquiry and Research Design: Choosing Among Five Approaches (4th edition). SAGE Publication.URL: ", "terms": {"2024-25 Term 1": {"--LEC (8353)": {"startTimes": ["10:30"], "endTimes": ["13:15"], "days": [1], "locations": ["Y.C. Liang Hall 101"], "instructors": ["Professor DONG Dong"], "meetingDates": ["2/9", "9/9", "16/9", "23/9", "30/9", "7/10", "14/10", "21/10", "28/10", "4/11", "11/11", "18/11", "25/11"]}}}, "assessments": {"Classwork": "25", "Examination": "35", "Project": "40"}}, {"code": "3028", "title": "Practical Data Collection, Management and Analysis", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "JC Sch of Pub Health Prim Care", "requirements": "Pre-requisites: (CHPR3117 or PHPC1014 or PHPC2017) and (CHPR3115 or PHPC1015 or PHPC2015)", "description": "This course will provide practical hands-on training to students in data collection, management and analysis. Students will learn about questionnaire design, sample size calculation, data collection methods, data entry, data cleaning, data confidentiality, data analysis and presentation of results from quantitative public health studies. The course will emphasize the quantitative and computing skills necessary for students to carry out research projects. A popular and user-friendly statistical software, SPSS, will be used.", "outcome": "By the end of this course, students should be able to: 1. Design a structured questionnaire survey with research hypothesis 2. Collect data with questionnaire 3. Compile a data entry template, enter and manage data with SPSS4. Compile a quantitative research report 5. Conduct data analysis with hypothesis testing and regression models with SPSS 6. Investigate confounding and interaction with SPSS  ", "syllabus": "1. Before designing a questionnaire: What is your research question?2. Practical issues in questionnaire design3. Practical issues in conducting the survey4. Practical issues in data entry5. Data cleaning, recoding, management, and dealing with missing data6. Data analysis with SPSS: Descriptive analysis7. Power calculation Data analysis with SPSS – Paired t-test and ANOVA8. Data analysis with SPSS – Multiple logistic regression (I)9. Data analysis with SPSS – Multiple logistic regression (II)10. Data analysis with SPSS – Confounding, mediation and interaction 11. Quantitative research Report writing (I)12. Quantitative research Report writing (II)", "required_readings": "To be advised by the course teacher ", "recommended_readings": "To be advised by the course teacher ", "terms": {"2024-25 Term 2": {"--LEC (7626)": {"startTimes": ["13:30"], "endTimes": ["16:15"], "days": [4], "locations": ["Pi-Ch'iu Building Room 103"], "instructors": ["Professor KWOK Kin On"], "meetingDates": ["9/1", "16/1", "23/1", "6/2", "13/2", "20/2", "27/2", "13/3", "20/3", "27/3", "3/4", "10/4", "17/4"]}}}, "assessments": {"Others": "10", "Report": "90"}}, {"code": "3034", "title": "Applied Economics Evaluation in Health Care", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "JC Sch of Pub Health Prim Care", "requirements": "", "description": "Economic evaluation is a comparative science in which health interventions are compared in terms of both their costs and their effectiveness. In this course we will have a brief review of the basic principles, potential roles and limitations of economic evaluation. The course covers use of decision trees and state transition models, involving practical sessions in which participants develop, populate, and analyse cost-effectiveness models, using general software like Excel and more advance open access software like R. On completion of the course, students will have the necessary knowledge and materials to undertake a basic health economic evaluation; to explore methods for more complex evaluations; and to critically review the conduct and validity of presented or published evaluations.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "3415", "title": "Traditional, Complementary and Integrative Medicine", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "JC Sch of Pub Health Prim Care", "requirements": "Pre-requisites: PHPC2015 and PHPC2017", "description": "With increasing interest and usage of traditional, complementary and integrative medicine (TCIM) worldwide, it is recognized that public education is a key to promote safe and effective use of TCIM in the community. The World Health Organization Traditional Medicine Strategy 2014-23 has specified the strategic direction of: 1. Ensuring consumers of TCIM can make informed choices about self-health care. 2. Promoting proper use of TCIM products and services.This course aims to serve as an education intervention for achieving these two goals. Students will be introduced the basic theory and practice of popular forms of TCIM, and more importantly, be equipped with skills for assessing claims on the effectiveness and safety of various TCIM interventions. Finally, course will also briefly introduce the policy and regulatory aspects of TCIM in the modern healthcare system.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "4028", "title": "Health Care Quality", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "JC Sch of Pub Health Prim Care", "requirements": "Pre-requisite: PHPC1001 or 2010", "description": "This course will use the philosophy of health care quality in patient-centered care & safety to examine the roles of healthcare professions, patients and carers in the healthcare system; concept of care; and drivers for healthcare quality. Case scenario will be used to foster better understanding of the course content.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "4029", "title": "Health and Healthcare Organisation and Management", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "JC Sch of Pub Health Prim Care", "requirements": "", "description": "This is an introductory course on the management, organisational structure and behaviour, and leadership of health and healthcare organisations. This course will use lectures, case studies, and team-based learning to teach students about basic theories, skills, and concepts about managing people and situations in various healthcare and health-related settings. In addition to introducing students to how such organisations work on a business level, this course also emphasises on developing their leadership skills, working in a team, and communication skills which are necessary for future innovators in health.", "outcome": "By the end of this course, students should be able to: 1. Describe the basics of organisational management2. Identify the roles of human resources management, operational and financial management, quality improvement and information management3. Apply organisational behaviour and structure theories towards understanding local and international organisations4. Understand and explain the concept of strategic management and leadership principles5. Solve problems and make decisions for scenarios in health and healthcare settings", "syllabus": "1. Introduction to organisational management in the context of health and healthcare organisations2. Leadership•            Manager and managerial decision making in HCO3. Change management4. Conflict management and negotiation •            Strategy•            Team building and creating a high-performance workplace•            Programme management and project management5. Health care marketing; Motivating people in an organisation6. Application of management theory in government services7. Governance and internal control of non-governmental organisations8. Capacity building for non-governmental organisations9. Practical tips as health administrators; Risk assessment, management and communication", "required_readings": "Textbook: Amelung, V.E. (2019). Healthcare management: Managed care organisations and instruments (2nd ed.). Springer.Spath, P. (2022). Applying quality management in healthcare: a systems approach (5th ed.). Chicago, Illinois: Health Administration Press. Washington, DC: Association of University Programs in Health Administration.Swan, J., Newell, S., Nicolini, D. (2016). Mobilizing knowledge in healthcare: Challenges for management and organization. Oxford University Press. Kavaler, F., Alexander, R.S. (2014). Risk management in healthcare institutions: limiting liability and enhancing care (3rd ed). Burlington, MA: Jones & Bartelett Learning.", "recommended_readings": "To be advised by the course teacher", "terms": {"2024-25 Term 2": {"--LEC (6614)": {"startTimes": ["12:30"], "endTimes": ["15:15"], "days": [4], "locations": ["Basic Med Sci Bldg LT"], "instructors": ["Dr. YAU Zi May Susan"], "meetingDates": ["9/1", "16/1", "23/1", "6/2", "13/2", "20/2", "27/2", "13/3", "20/3", "27/3", "3/4", "10/4", "17/4"]}}}, "assessments": {"Examination": "60", "Presentation": "30", "Participation": "10"}}, {"code": "4031", "title": "Gender and Age-Related Healthcare", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "JC Sch of Pub Health Prim Care", "requirements": "Prerequisite:PHPC1001 or MEDF1021 or UGEC1920 or UGEC2930.", "description": "This course examines the interaction between gender and health. The course will utilize a life course framework to discuss public health issues across the life span including women of childbearing age, infants, children, adolescents, working adults and elderly. Broad topics will include gender roles, gender analysis, gender inequalities in health, empowerment, teen health, HIV, LGBT issues, reproductive health, sex workers, domestic workers and elderly abuse.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "4032", "title": "Digital Health and Entrepreneurship", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "JC Sch of Pub Health Prim Care", "requirements": "", "description": "Our students will be introduced to digital health, data analytics and their use and impact on public health. They will explore the implementation of computational technologies on healthcare, including electronic health portal, mobile health, and artificial intelligence applications. They will acquire practical skills on health data management and data presentation. Moreover, the key concepts and latest developments of entrepreneurship on healthcare technology will be introduced, and students will learn the skills of conducting pitch presentation for a healthcare product.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "4033", "title": "Medical Sociology", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "JC Sch of Pub Health Prim Care", "requirements": "", "description": "This course introduces students to major perspectives, theories, and methods in the field of sociology of health and medicine. We consider a variety of social, political, economic, and cultural factors to understand the topics of health, illness, and medicine instead of simply looking at the biological phenomena and medical knowledge. We will explore questions such as: What are the social meanings of illness? What is social production of health and illness? How do social ties and social capital affect health? How does the social environment interact with genes to influence health? What is medicalization and what are possible consequences of medicalization? How should health care systems be organized? In this course, we will examine some of these issues in the contexts of Chinese societies, such as mainland China and Hong Kong, and also offer comparative perspectives.", "outcome": "By the end of this course, students should be able to: 1. Capture an overview of major theories in the sociological study of health and medicine; 2. Explain how social factors influence health and wellbeing and shape health inequalities; 3. Describe social meanings of illness and the social consequences of defining behaviors and conditions as illnesses; 4. Aware of social functions of health organizations and institutions; 5. Critically evaluate empirical studies in the field of medical sociology; 6. Analyze health-related issues in Chinese societies from sociological perspectives. ", "syllabus": "1.     Introduction to medical sociology2.     Gender, sexuality, and health3.     Social stratification and health4.     Ethnicity, immigration, and health5.     Social change and drug abuse6.     Neighborhood influences on health7.     Social capital, social cohesion, and health8.     Genes, social environment, and health9.     Illness behavior and illness experience10.     Social construction of health and illness I11.     Social construction of health and illness II", "required_readings": "Cockerham, W. C. (2021). Medical Sociology (15th edition). Routledge", "recommended_readings": "1.           Armstrong, D. (2000). Social theorizing about health and illness. In G. L. Albrecht, R. Fitzpatrick, & S. C. Scrimshaw (Eds.), The Handbook of Social Studies in Health and Medicine (pp. 24-35). Sage Publications.2.           Arrow, K. J. (2004). Uncertainty and the welfare economics of medical care. World Health Organization. Bulletin of the World Health Organization, 82(2), 141. 3.           Austad, S. N., & Fischer, K. E. (2016). Sex differences in lifespan. Cell Metabolism, 23(6), 1022-1033.4.           Belsky, J., & Pluess, M. (2009). Beyond diathesis stress: Differential susceptibility to environmental influences. Psychological Bulletin, 135(6), 885.5.           Bird, C. E., Conrad, P., & Fremont, A. M. (2000). Medical sociology at the millennium. In C. E. Bird, P. Conrad, & A. M. Fremont (Eds.), Handbook of Medical Sociology (pp.1-10). Upper Saddle River, NJ: Prentice Hall.6.           Blumenthal, D., & Hsiao, W. (2015). Lessons from the East—China's rapidly evolving health care system. New England Journal of Medicine, 372(14), 1281-1285.7.           Brown, P. (1995). Naming and framing: The social construction of diagnosis and illness. Journal of Health and Social Behavior, 34-52. 8.           Caspi, A., Sugden, K., Moffitt, T. E., Taylor, A., Craig, I. W., Harrington, H., ... & Poulton, R. (2003). Influence of life stress on depression: Moderation by a polymorphism in the 5-HTT gene. Science, 301(5631), 386-389.9.           Cheung, Y. W. (1993). Approaches to ethnicity: Clearing roadblocks in the study of ethnicity and substance use. International Journal of the Addictions, 28(12), 1209-1226.10.         Cheung, Y. W. (2014). Substance abuse etiology. The Wiley Blackwell Encyclopedia of Health, Illness, Behavior, and Society, 2397-2400.11.         Conrad, P. (1992). Medicalization and social control. Annual Review of Sociology, 18(1), 209-232.12.         Conrad, P. (2005). The shifting engines of medicalization. Journal of Health and Social Behavior, 46(1), 3-14.13.         Conrad, P., Mackie, T., & Mehrotra, A. (2010). Estimating the costs of medicalization. Social Science & Medicine, 70(12), 1943-1947.14.         Duneier, M. (2006). Ethnography, the ecological fallacy, and the 1995 Chicago heat wave. American Sociological Review, 71(4), 679-688.15.         Eibner, C., & Evans, W. N. (2005). Relative deprivation, poor health habits, and mortality. Journal of Human Resources, 40(3), 591-620.16.         Heritage, J., & Maynard, D. W. (2006). Problems and prospects in the study of physician-patient interaction: 30 years of research. Annual Review of Sociology, 32, 351-374.17.         Kawachi, I., & Berkman, L. (2000). Social cohesion, social capital, and health. In L.F. Berkman & I. Kawachi (eds), Social Epidemiology (pp174-190), Oxford University Press18.         Krieger, N., Rowley, D. L., Herman, A. A., Avery, B., & Phillips, M. T. (1993). Racism, sexism, and social class: implications for studies of health, disease, and well-being. American Journal of Preventive Medicine, 9(6), 82-122.19.         Li, H., & Cheung, Y. W. (2021). Beyond ketamine: narratives of risk among young psychoactive drug users in Hong Kong. Journal of Substance Use, 26(5), 531-536.20.         Link, B. G., & Phelan, J. (1995). Social conditions as fundamental causes of disease. Journal of Health and Social Behavior, 80-94. 21.         Liu, H., & Guo, G. (2016). Opportunities and challenges of big data for the social sciences: The case of genomic data. Social Science Research, 59, 13-22.22.         Liu, K. Y., King, M., & Bearman, P. S. (2010). Social influence and the autism epidemic. American Journal of Sociology, 115(5), 1387-1434. 23.         Macintyre, S., & Ellaway, A. (2000). Ecological approaches: rediscovering the role of the physical and social environment. In L.F. Berkman & I. Kawachi (eds), Social Epidemiology (pp. 332–348), Oxford University Press24.         Rosenhan, D. L. (1973). On being sane in insane places. Science, 179(4070), 250-258.25.         Schneider, E. C., & Squires, D. (2017). From last to first-could the US health care system become the best in the world?. The New England Journal of Medicine, 377(10), 901-904.26.         Security Bureau (2021). Central Registry of Drug Abuse Seventy Report (2011-2020). Hong Kong: Narcotics Division, Security Bureau.27.         Suen, Y. T., Chan, R. C., & Wong, E. M. Y. (2020). Effects of general and sexual minority-specific COVID-19-related stressors on the mental health of lesbian, gay, and bisexual people in Hong Kong. Psychiatry Research, 292, 113365.28.         Wilkinson, R. G., & Pickett, K. E. (2006). Income inequality and population health: a review and explanation of the evidence. Social Science & Medicine, 62(7), 1768-1784.29.         Wong, I. O., Cowling, B. J., Lo, S. V., & Leung, G. M. (2009). A multilevel analysis of the effects of neighbourhood income inequality on individual self-rated health in Hong Kong. Social Science & Medicine, 68(1), 124-132.30.         Wu, C. (2021). Social capital and COVID-19: A multidimensional and multilevel approach. Chinese Sociological Review, 53(1), 27-54.31.           Yip, W., Subramanian, S. V., Mitchell, A. D., Lee, D. T., Wang, J., & Kawachi, I. (2007). Does social capital enhance health and well-being? Evidence from rural China. Social Science & Medicine, 64(1), 35-49.", "terms": {"2024-25 Term 1": {"--LEC (9303)": {"startTimes": ["11:30"], "endTimes": ["14:15"], "days": [3], "locations": ["Lee Shau Kee Archi Bldg G01"], "instructors": ["Dr. WANG Jingxuan, \n\nProfessor YANG Xue"], "meetingDates": ["4/9", "11/9", "25/9", "2/10", "9/10", "16/10", "23/10", "30/10", "6/11", "13/11", "20/11", "27/11"]}}}, "assessments": {"Classwork": "16", "Examination": "50", "Presentation": "34"}}, {"code": "4040", "title": "Special Topics in Public Health I", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "JC Sch of Pub Health Prim Care", "requirements": "", "description": "Special topics having significant impacts on the advancement of public health in the lecturer's field of expertise will be covered.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "4041", "title": "Special Topics in Public Health II", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "JC Sch of Pub Health Prim Care", "requirements": "", "description": "Special topics having significant impacts on the advancement of public health in the lecturer's field of expertise will be covered.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "4042", "title": "Special Topics in Public Health III", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "JC Sch of Pub Health Prim Care", "requirements": "", "description": "Special topics having significant impacts on the advancement of public health in the lecturer's field of expertise will be covered.", "outcome": "Subject to specialty of course teacher.", "syllabus": "Subject to specialty of course teacher.", "required_readings": "", "recommended_readings": "", "terms": {"2024-25 Term 2": {"--LEC (7478)": {"startTimes": ["14:30"], "endTimes": ["17:15"], "days": [1], "locations": ["Lee Shau Kee Building 212"], "instructors": ["Professor WONG Yeung Shan Samuel, \n\nProfessor ZHANG Dexing"], "meetingDates": ["6/1", "13/1", "20/1", "27/1", "10/2", "17/2", "24/2", "10/3", "17/3", "24/3", "31/3", "7/4", "14/4"]}}}}, {"code": "4043", "title": "Special Topics in Public Health IV", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "JC Sch of Pub Health Prim Care", "requirements": "", "description": "Special topics having significant impacts on the advancement of public health in the lecturer's field of expertise will be covered.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "4911", "title": "Primary Public Health Research I", "career": "Undergraduate", "units": "2.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "JC Sch of Pub Health Prim Care", "requirements": "Pre-requisites: PHPC2015 and 2017\nCo-requisite: PHPC3027 or 3028", "description": "Students will conduct a supervised primary research project in a chosen field of public health using quantitative or qualitative research method. In this module, students are expected to provide a research protocol and prepare for data collection.", "outcome": "After completing this course, students should be able to: 1. Study a public health problem by formulating relevant research hypotheses 2. Employ an appropriate design for the study 3. Identify study population 4. Demonstrate sampling strategy, sample size determination, and data analysis plan, and      5. Draw out the study implication to public health", "syllabus": "1. Project planning tutorial 2. Presentation for research protocol", "required_readings": "To be advised by the course teacher", "recommended_readings": "Research Ethics training. The Chinese University of Hong Kong (https://www.research-ethics.cuhk.edu.hk/orktsResearch/)", "terms": {"2024-25 Term 2": {"--LEC (5867)": {"startTimes": ["14:30"], "endTimes": ["18:15"], "days": [2], "locations": ["No Room Required"], "instructors": ["Professor CHONG Ka Chun, \n\nProfessor WONG Lai Yi"], "meetingDates": ["7/1", "14/1", "21/1", "28/1", "4/2", "11/2", "18/2", "25/2", "4/3", "11/3", "18/3", "25/3", "1/4", "8/4", "15/4"]}}}, "assessments": {"Essays": "55", "Others": "10", "Presentation": "35"}}, {"code": "4912", "title": "Primary Public Health Research II", "career": "Undergraduate", "units": "1.00", "grading": "Pass (P)/Fail (U)", "components": "Lecture", "campus": "Main Campus", "academic_group": "JC Sch of Pub Health Prim Care", "requirements": "Pre-requisite: PHPC4911", "description": "This module is a continuation of PHPC4911. Students will conduct a supervised primary research project in a chosen field of public health using quantitative or qualitative research method. In this module, students are expected to conduct pilot tests and collect data, and submit a progress report.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "4913", "title": "Primary Public Health Research III", "career": "Undergraduate", "units": "4.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "JC Sch of Pub Health Prim Care", "requirements": "Pre-requisite: PHPC4912", "description": "This module is a continuation of PHPC4912. Students will conduct a supervised primary research project in a chosen field of public health using quantitative or qualitative research method. In this module, students will conduct data analysis, and submit a research report.", "outcome": "After completing this course, students should be able to: 1. Implement data management and analysis2. Summarize research results and interpret research findings3. Illustrate possible strengths and limitations of conducted study 4. Conclude the study finding with implication to public health ", "syllabus": "1. Presentation for research progress 2. Data management and data analysis tutorial 3. Presentation for research results", "required_readings": "To be advised by the course teacher", "recommended_readings": "   Research Ethics training. The Chinese University of Hong Kong (https://www.research-ethics.cuhk.edu.hk/orktsResearch/)  ", "terms": {"2024-25 Term 1": {"--LEC (5932)": {"startTimes": ["14:30"], "endTimes": ["18:15"], "days": [2], "locations": ["No Room Required"], "instructors": ["Professor CHONG Ka Chun, \n\nProfessor WONG Lai Yi"], "meetingDates": ["3/9", "10/9", "17/9", "24/9", "1/10", "8/10", "15/10", "22/10", "29/10", "5/11", "12/11", "19/11", "26/11"]}}}, "assessments": {"Essays": "55", "Others": "10", "Presentation": "35"}}, {"code": "4921", "title": "Public Health Data Synthesis Research I", "career": "Undergraduate", "units": "1.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "JC Sch of Pub Health Prim Care", "requirements": "Pre-requisites: PHPC2015 & 2017. \nCo-requisites: PHPC3014 & 3028.", "description": "Students will conduct a supervised research project in a chosen field of public health using systematic review or secondary data analysis. In this module, students are expected to provide a research protocol.", "outcome": "After completing this course, students should be able to:    Study a public health problem by formulating relevant research hypotheses  Employ an appropriate design for the secondary data study   Identify study population for secondary data analysis or eligible studies for systematic review  Demonstrate the data analysis plan  Draw out the study implication to public health", "syllabus": "1. Project planning tutorial 2. Presentation for research protocol", "required_readings": "To be advised by the course teacher", "recommended_readings": "Research Ethics training. The Chinese University of Hong Kong (https://www.research-ethics.cuhk.edu.hk/orktsResearch/)", "terms": {"2024-25 Term 2": {"--LEC (5869)": {"startTimes": ["14:30"], "endTimes": ["18:15"], "days": [2], "locations": ["No Room Required"], "instructors": ["Professor CHONG Ka Chun, \n\nProfessor WONG Lai Yi"], "meetingDates": ["7/1", "14/1", "21/1", "28/1", "4/2", "11/2", "18/2", "25/2", "4/3", "11/3", "18/3", "25/3", "1/4", "8/4", "15/4"]}}}, "assessments": {"Essays": "55", "Others": "10", "Presentation": "35"}}, {"code": "4922", "title": "Public Health Data Synthesis Research II", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "JC Sch of Pub Health Prim Care", "requirements": "Pre-requisite: PHPC4921", "description": "This module is a continuation of PHPC4921. Students will conduct a supervised research project in a chosen field of public health using systematic review or secondary data analysis. In this module, students will complete data synthesis and submit a research report.", "outcome": "   After completing this course, students should be able to: 1. Implement comprehensive literature search, 2. Conduct data extraction, management and analysis, 3. Summarize research results and interpret research findings, 4. Illustrate possible strengths and limitations of conducted study, 5. Conclude the study finding with implication to public health   ", "syllabus": "1. Project planning tutorial 2. Presentation for research protocol", "required_readings": "To be advised by the course teacher", "recommended_readings": "   Research Ethics training. The Chinese University of Hong Kong (https://www.research-ethics.cuhk.edu.hk/orktsResearch/)  ", "terms": {"2024-25 Term 1": {"--LEC (5933)": {"startTimes": ["14:30"], "endTimes": ["18:15"], "days": [2], "locations": ["No Room Required"], "instructors": ["Professor CHONG Ka Chun, \n\nProfessor WONG Lai Yi"], "meetingDates": ["3/9", "10/9", "17/9", "24/9", "1/10", "8/10", "15/10", "22/10", "29/10", "5/11", "12/11", "19/11", "26/11"]}}}, "assessments": {"Essays": "55", "Others": "10", "Presentation": "35"}}, {"code": "4930", "title": "Public Health Practicum", "career": "Undergraduate", "units": "2.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "JC Sch of Pub Health Prim Care", "requirements": "", "description": "Students will be assigned to one of the collaborating public health service providers, including (but not limited to) government departments, non-governmental organizations and the private sectors, based on their declared preference. Prior to the engagement of practicum, each student must discuss his or her potential role and responsibilities with the site supervisor. All fieldwork can only be initiated after the prior approval of the course coordinator and site supervisor. Students are required to complete a minimum of 100 hours of fieldwork under the supervision of site supervisor.", "outcome": "After completing this course, students should be able to:1. Apply academic theories and acquired skills to community-based programme or service or evaluation in a real-life setting2. Understand the vision, missions, values, and the populations served by the designated organization3. Communicate public health concepts clearly in verbal and written forms and familiarize with multi-disciplinary public health practice4. Expand their networks with key stakeholders of public health", "syllabus": "1. Practicum plan presentation 2. Fieldwork practicum in a designated organization (at least 100 hours) 3. Poster presentation", "required_readings": "To be advised by the course teacher", "recommended_readings": "To be advised by the course teacher", "terms": {"2024-25 Term 1": {"--LEC (5934)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["No Room Required"], "instructors": ["Dr. YUNG Ka Chun"], "meetingDates": ["02/09/2024 - 25/11/2024"]}}}, "assessments": {"Internship or practicum": "40", "Presentation": "60"}}]