[{"code": "5001", "title": "Method and History of Religious Studies", "career": "Postgraduate - Research", "units": "3.00", "grading": "Graded", "components": "Lecture\nSeminar", "campus": "Main Campus", "academic_group": "Div of Religious Studies", "requirements": "For students in MPhil-PhD Religious Studies or Master of Divinity", "description": "This course will be built around readings concerning methodology and history of the discipline of the “History of Religions”. Study of selected figures and methodological approaches to religions, including phenomenological, psychological, structural, hermeneutical and sociological methods, will also be covered. The purpose of this course is to acquaint students with a sophisticated knowledge of the theories and methods in research on different forms of religious manifestations.", "outcome": "- Become well-versed in the theoretical vocabulary of the field of religious studies; - Deepen understanding of key theories, methods, concepts and issues in the academic study of religion; - Reflect on the relationship between religion and the human condition; - Engage in critical analysis of religious phenomena using the perspectives of key theories and methods in the academic study of religion; - Develop a critical yet sympathetic attitude in discussing religious phenomena", "syllabus": " A Point of Departure  : Jonathan Z. Smith. “Religion, Religions, Religious” in Critical   Terms for Religious Studies, Edited by Mark C. Taylor, Chicago, University of Chicago Press, 1998, pp. 269-284.       2.     Introduction to the Study of Religion                    Reading: Pals. Nine Theories of Religion, “Introduction”, pp. 1-14 3.     Animism and Magic: E. B. TYLOR AND J. G. FRAZERReading: Pals. Nine Theories of Religion, Ch. 1, pp. 15-48 4.     Religion and Personality: SIGMUND FREUDReading: Pals. Nine Theories of Religion, Ch. 2, pp. 49-80 5.    Society as Sacred: ÉMILE DURKHEIMReading: Pals. Nine Theories of Religion, Ch. 3, pp. 81-112 6.     Religion as Alienation: KARL MARXReading: Pals. Nine Theories of Religion, Ch. 4, pp. 113-142 7.     A Source of Social Action: MAX WEBERReading: Pals. Nine Theories of Religion, Ch. 5, pp. 143-184 8.     The Verdict of Religious Experience: WILLIAM JAMESReading: Pals. Nine Theories of Religion, Ch. 6, pp. 185-226 9.     The Reality of the Sacred: MIRCEA ELIADEReading: Pals. Nine Theories of Religion, Ch. 6, pp. 227-262 10.  Society’s “Construct of the Heart”: E. E. EVANS-PRITCHARD Reading: Pals. Nine Theories of Religion, Ch. 7, pp. 263-292 11.   Religion as Cultural System: CLIFFORD GEERTZ              Reading: Pals. Nine Theories of Religion, Ch. 8, pp. 293-324 12.   ConclusionReading: Pals. Nine Theories of Religion, “Conclusion”, pp. 292-323 13.   Post-script : James Murphy. “Beyond ‘Religion’ and ‘Spirituality’: Extending a ‘Meaning Systems’ Approach to Explore Lived Religion” in Archive for the Psychology of Religion (2017) 1-26. REMARKS: The syllabus and assessment type may vary depending on the teaching staff. ", "required_readings": "Basic text:     Daniel L. Pals. Nine Theories of Religion. 3rd Ed. Oxford: Oxford University Press, 2015.", "recommended_readings": "", "terms": {"2023-24 Term 1": {"--LEC (4210)": {"startTimes": ["14:30"], "endTimes": ["17:15"], "days": [4], "locations": ["Esther Lee Bldg 304"], "instructors": ["Professor James D FRANKEL"], "meetingDates": ["7/9", "14/9", "21/9", "28/9", "5/10", "12/10", "19/10", "26/10", "2/11", "9/11", "16/11", "23/11", "30/11"]}}}, "assessments": {"Essays": "50", "Presentation": "30", "Participation": "20"}}, {"code": "5005", "title": "Theories of Religious Studies", "career": "Postgraduate - Taught", "units": "3.00", "grading": "Graded", "components": "Lecture\nInteractive Tutorial", "campus": "Main Campus", "academic_group": "Div of Religious Studies", "requirements": "For students of MA in Religious Studies, Master of Divinity", "description": "From the establishment of the sociological endeavor, the study of religion has been central to the understanding of modern societies. This course will continue in this tradition by surveying the interactions between religion and society while developing the sociological and Anthropological approach to the study of religion as a social institution. In particular, we will look at the ways in which religion is transformed by, and plays a role in the transformation of, a global society. This course is designed to give students tools and concepts with which to understand the social organization of religion and the role of religion in society. We will focus on classical and emerging themes in the field, and analyze case studies that relate to them. Students will: -learn how religion is shaped by and, in turn, shapes the larger social field in which it exists;-become familiar with the dynamics of secularization, ecological theories, and other developments;-develop an understanding of the ways in which religion interacts with other social institutions such as the state and economy, and culture. ", "outcome": "Knowledge Outcomes: - Upon completion of the subject, student will be able to  - Understand the establishment of knowledge of Religious Studies and research ethics;  - Learn the key writers on Religious Studies;  - Understand the key theories of Religious Studies in classical themes;  - Learn the major issues in the field of Religious Studies in contemporary scholarship;  - Develop the critical thinking on the debates regarding religious diversity, migration and religion, religious movement and so on.", "syllabus": "Introduction and Overview  The Construction of a Subject  Foundation and Methods I: Foundation II: Economics and Religion Foundation II: Economics and Religion Secularization Individuals, Rituals, and Practices Religion and Gender Organizations and Collectivities  Migration and Religion Religion and Social Change (in Chinese Society) Religion and the Public  Urban and Ecological Approach", "required_readings": "• Robert A.Orsi,\"Snakes Alive: Resituating the Moral in the Study of Religion\", In Face of the Facts: Moral Inquiry in American Scholarship, Cambridge: Cambridge University Press, 1998, Pages: 201-226. • Clifford Geertz, \"Religion as a Cultural System,” Interpretation of Cultures, New York: Basic Book, 1973, Pages: 87-125. • Emile Durkheim, \"Introduction and Chapter 1\", Elementary Forms of Religious Life, Oxford: Oxford University Press, 2001. • 黎志添：<導論：宗教研究的歷史舆方法>，《宗教研究舆詮释學》。香港：香港中文大學出版社，2003，頁1-12。 • Max Weber, The Protestant Ethic and the Spirit of Capitalism, New York: W.W. Norton & Co, 2009. Chapter 4 and 5.  • Peter Berger, \"Chapters 1-4\", The Sacred Canopy, New York: Garden City, 1967, Pages: 3-101. • Jose Casanova, \"Chapters 1 and 2\", Public Religions in the Modern World, Chicago: University of Chicago, 1994.  • James Beckford, \"Accounting for conversion\", British Journal of Sociology 29:2（1978）249-262.  • 譚偉倫，<中國地方宗教儀式>，《中國地方宗教儀式論集》。譚偉倫主編。香港：香港中文大學崇基學院宗教與中國社會研究中心，2011，頁1-15。 • Janet Jacobs, \"Women, Ritual and Secrecy: The Creation of Crypto-Jewish Culture,\" JSSR, 35. 2 (1996) 97-108.  • Saba Mahmood. “Feminist Theory, Embodiment, and the Docile Agent: Some reflections On the Egyptian Islamic Revival.” Cultural Anthropology 16.2 (2001): 202-236. • Stephen Warner, \"The Place of the Congregation in the Contemporary American Religious Configuration\", American Congregations, Chicago: University of Chicago Press, 1994. Pp. 54-99.  • Eileen Barker, \"New Religious Movements: Their Incidence and Significance\", New Religious Movements: Challenge and Response, London: Routledge, 1999. • Zhe JI. \"Buddhist Institutional Innovations\" in Modern Chinese Religion II: 1850-2015. Pp. 731-766.  • Stephen Warner and Judith Wittner, eds. Gatherings in the Diaspora: Religious Communities and the New Immigration. Philadelphia: Temple University Press, 1998.  • Vincent Goossaert and David Palmer. The Religious Question in Modern China. Chicago: University of Chicago Press, 2010.  • Richard Madsen, Democracy's Dharma: Religious Renaissance and Political Develpment in Taiwan, Berkeley: University of California Press, 2007. • Ammernam, Studying congregations: a new handbook, Nashville : Abingdon Press, 1998.", "recommended_readings": "• Max Weber, \"Chapters 1-4\", The Sociology of Religion, Boston : Beacon Press,1993, Pages: 1-59. • Nancy Ammerman, Bible Believers: fundamentalists in the modern world, London: Rutgers University Press, 1987.  • Peter Berger, \"Chapters 5-7\", The Sacred Canopy, New York: Garden City, 1967, Pages: 105-174.  • Bryan Wilson, Religion in Secular Society，London: Watts, 1966. • Ortner, \"Theory in Anthropology Since the 1960's \", Comparative Studies in Society and History 26:1(1984) 126-166.  • Robert Wuthnow, The Restructuring of American Religion, Princeton: Princeton University Press, 1988. • Jody Shapiro Davie, Women in the Presence, Philadelphia: University of Pennsylvania Press,1995.  • David Martin, Pentecostalism: The World Their Parish, Oxford: Blackwell Publishers, 2002. • Robert Weller, Alternate Civilities: Democracy and Culture in China and Taiwan, Boulder: Westview Press, 1999. • 邢福增，梁家麟：《五十年代三自運動的研究》，香港：建道神學院，1996. • 邢福增，《新酒與舊皮袋：中國宗教立法與<宗教事務條例解讀>》，香港：中文大學崇基學院宗教與中國社會研究中心，2006。", "terms": {"2023-24 Term 1": {"--LEC (4240)": {"startTimes": ["19:00"], "endTimes": ["21:30"], "days": [3], "locations": ["Esther Lee Bldg 401"], "instructors": ["Professor GUO Ting"], "meetingDates": ["6/9", "13/9", "20/9", "27/9", "4/10", "11/10", "18/10", "25/10", "1/11", "8/11", "15/11", "22/11", "29/11"]}}}, "assessments": {"Essays": "70", "Presentation": "30"}}, {"code": "5115", "title": "Reading on Chinese Religious Texts", "career": "Postgraduate - Research", "units": "3.00", "grading": "Graded", "components": "Seminar", "campus": "Main Campus", "academic_group": "Div of Religious Studies", "requirements": "For students in MPhil-PhD Religious Studies or Master of Divinity", "description": "This course centres on the study of the literature of the Han Dynasty which is formative of the chief religious concepts such as cosmology, anthropology and soteriology, with the aim of understanding of the principles of religious theory construction in traditional China.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "5118", "title": "Studies on Chinese Buddhism", "career": "Postgraduate - Taught", "units": "3.00", "grading": "Graded", "components": "Lecture\nSeminar", "campus": "Main Campus", "academic_group": "Div of Religious Studies", "requirements": "For students in MA Religious Studies or MA Buddhist Studies", "description": "This course studies major traditions in Chinese Buddhism including Chan, Pure Land, Huayen and Tiantai Buddhism. We also seek to understand the Chinese Buddhist tradition by utilizing some recent researches in the field. Some examples are the research on northern school of Chan Buddhism by John McRae and Bernard Faure, on Pure Land Buddhism by Luis Gomez and Richard Payne, on Buddhism in the Song especially Tiantai Buddhism by Peter Gregory and Daniel Getz. Secondary sources will be used together with selected primary sources to stimulate discussion in class.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "5121", "title": "Popular Religion in China", "career": "Postgraduate - Taught", "units": "3.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Div of Religious Studies", "requirements": "For students in MA Religious Studies or Master of Divinity", "description": "Recent researches on Chinese religion show that the term “three religions” or sanjiao monastic Buddhism, priestly Daoism, and Confucian philosophy - is not adequate to describe Chinese religiosity. To subsume several thousand years of Chinese religious experience under the term of “three religions”, in effect, is to exclude the vast majority of Chinese religious behaviour. In reality, only a few elite orient their lifestyles to the Buddhist or Taoist concepts of transcendence. Over emphasis on the intellectual and spiritual world of the scholarly official, the gentry and the literate elite, overlooks religious practices and beliefs of ordinary people, the peasants and the labourers who are the majority of the Chinese population. This course studies Chinese religion from the , traditional economy and village temples of various local societies in China.perspective of local society in South China. By making use of recent ethnographical studies on China, we examine Chinese religion from a holistic approach involving the analysis of lineage", "outcome": "Knowledge: - The understanding of religion both in the historical settings and contemporary contexts, in Mainland - Learn the popular religion in Mainland Skills: - Communication and presentation (oral and written) skills; - Critical and analytical skills; Attitude: - A heightened sensitivity to the religious dimension of human life, society and culture; - An analytical capability of the plurality and complexity of religious phenomena; - A critical yet sympathetic understanding and appreciation of different religious traditions, especially those to which one does not belong.", "syllabus": " 課程介紹：民間宗教的概念 民間宗教研究回顧：理論與方法 神聖的時間及空間：香港節誕醮會為例  神與人：關帝、張桓侯信仰與社區崇祀                                        考察（I）張飛誕                                                                                從華南到東南亞地區之民間宗教：德教                                         二十世紀興起的救世團體：世界紅卍字會                          　    民間宗教經典：善書                　　　　　　　                  　 從燙手山芋到地方名片：民間信俗申請非物質文化遺產 考察（II）扶鸞團體德教紫和閣                                                  臺、 澳地區民間宗教：哪吒等神祇信仰                                     香港地區民間宗教：黄大仙信仰", "required_readings": "The reading list will be updated if deem necessary. Always check the most updated version via the department's website (course outline). 柯若樸（Philip Clart）著、盛洋譯＜中國民間宗教的基本形態和傳承方式＞，《文化遺產》2013年第6期。 歐大年（Daniel L. Overmyer）＜中國民間宗教的秩序和內在理性＞，《香港中文大學崇基學院宗教與中國社會研究中心通訊》第三期，1998年12月。 格文（John Lagerwey）＜中國宗教的合理性＞，《法國漢學》第四輯，北京 : 中華書局, 1999，頁338-354。 路遙等著《中國民間信仰研究述評》，上海 : 上海人民出版社, 2012。 范純武、 王見川、 高致華＜戰後臺灣民間宗教研究的回顧與前瞻＞，《文史哲》2009年第1期，頁75-88。 http://www.iqh.net.cn/info.asp?column_id=5711 康豹（Paul Katz）＜西方學界研究中國社區宗教傳統的主要動態＞，《文史哲》2009年第 58-74。 李世瑜《社會歷史學文集》，天津 : 天津古籍出版社, 2006。 Daniel L. Overmyer, Religions of China : the world as a living system , San Francisco : Harper & Row, c1986..K.Yang, Religion in Chinese society; a study of contemporary social functions of religion and some of their historical factors ,Berkeley, University of California Press, 1961. 馬西沙編《當代中國宗教研究精選叢書˙民間宗教卷》，民族出版, 2008。 酒井忠夫、胡小偉等著《民間信仰與社會生活》，上海 : 上海人民出版社, 2011。 李遠國、劉仲宇，許尚樞《道教與民間信仰》，上海 : 上海人民出版社, 2011。 王見川、皮慶生著《中國近世民間信仰：宋元明清》，上海人民出版社，2010年。 復旦大學文史研究院編《「民間」何在，誰之「信仰」》，北京 : 中華書局， 2009。 吉岡義豊著《現代中國の諸宗教——民眾宗教の系譜》（アジア佛敎史 中國編：3），東京：佼成出版社, 1974。 酒井忠夫著作集6《近現代中国における宗教結社の研究》，東京 : 国書刊行会, 2002。 柯若樸（Philip Clart）主編《中國民間宗教、民間信仰研究之中歐視角》， 臺北 : 博揚文化事業有限公司, 2012。 柯若樸著、謝惠英譯＜中國宗教研究中“民間宗教”的概念：回顧與展望＞，載《輔仁大學第四屆漢學國際研討會“中國宗教研究：現況與展望”論文集》，2007，頁222- 223。 宗樹人、夏龍等主編 ; 吳正選譯《中國人的宗教生活》，香港 : 香港大學出版社, 2014。 李向平等主編《中國信仰研究》第1輯，上海 : 上海人民出版社, 2011。 Stephan Feuchtwang, Popular religion in China : the imperial metaphor, Richmond : Curzon, 2001. 王斯福著；趙旭東譯《帝國的隱喻 : 中國民間宗教》，江蘇人民出版社, 2009。 韋思諦(Stepehn C. Averill) 編、陳仲丹等譯《中國大眾宗教》，江蘇人民出版社, 2006。 鄭振滿、陳春聲編《民間信仰與社會空間》，福州市 : 福建人民出版社, 2003。 John Lagerwey (ed.), Religion and Chinese society , Hong Kong : Chinese University Press ; Paris : Ecole francaise d'Extreme-Orient, c2004. Jean Law & Barbara E. Ward,  Chinese festivals in Hong Kong. H.K. South China Morning Post, 1982.（3rd ed. , Hong Kong: MCCM Creations, 2005） 蔡志祥、韋錦新編《延續與變革——香港社區建醮傳統的民族誌》，中文大學出版社，2014． 李幹忱《破除迷信全書》，基督教美以美會1924年出版，臺北 : 臺灣學生書局，1989。 Poon Shuk Wah, Negotiating religion in modern China : state and common people in Guangzhou, 1900-1937, Hong Kong : Chinese University of Hong Kong, 2011. 許地山《扶箕迷信底研究》，長沙：商務印書館，1941。 焦大衛(David K.Jordan), 歐大年(Daniel L. Overmyer)合著 ; 周育民譯《飛鸞：中國民間教派面面觀》，香港 : 中文大學出版社, 2005。 志賀市子《中国のこっくりさん : 扶鸞信仰と華人社会》，東京：大修館書店, 2003。 渡邊欣雄著、周星譯《漢族的民俗宗敎 : 社會人類學的硏究》， 天津人民出版社, 1998。 陳景熙、張禹東主編《學者觀德教》，北京：社會科學文獻出版社，2011。 游子安主編《弘道展慈——香江道慈八十載》（危丁明、鍾潔雄撰文），香港紅卍字會， 2011． 游子安＜道慈南洋：1930年代以來世界紅卍字會在星、馬地區的推展＞，《漢學研究學刊》第3卷，吉隆坡：馬來亞大學中文系，2012年10月。 李天錫《華僑華人民間信仰研究》，北京 : 中國文聯, 2004。 酒井忠夫著；劉岳兵、何英鶯、孫雪梅譯《中國善書研究：增補版》，南京 : 江蘇人民出版社, 2010。 游子安《勸化金箴——清代善書研究》，天津人民出版社，1999。 游子安《善與人同——明清以來的慈善與教化》，北京：中華書局，2005。 游子安《善書與中國宗教：游子安自選集》，臺北：博揚，2012。 朱新屋＜20世紀以來中國善書研究的回顧與展望＞，《西華師範大學學報》（哲學社會 科學版），2014年第1期。 Prasenjit Duara, “ Superscribing Symbols: The Myth of Guandi, Chinese God of War” , Journal of Asian Studies, 47 no.4(1988). 《關帝文獻匯編》，北京：國際文化出版公司, 1995。 盧曉衡主編：《關羽、關公和關聖：中國歷史文化中的關羽學術研討會論文集》，北京：社會科學文獻出版社，2002。 王見川、蘇慶華、劉文星編《近代的關帝信仰與經典：兼談其當玉皇的緣由》，臺北：博揚文化，2010。 二階堂善弘著；劉雄峰譯《元帥神研究》，齊魯書社，2014。 胡國年《澳門哪吒信仰》，香港 : 三聯書店(香港)有限公司, 2013。 游子安主編《香江顯迹——嗇色園歷史與黄大仙信仰》，香港：嗇色園，2006。 王宏剛、王海冬等著《新時期的民間信仰》，哈爾濱 : 黑龍江教育出版社, 2013。 蕭放＜文化遺產視野下的民間信仰＞，《探索與爭鳴》2010.5。http://www.chinesefolklore.org.cn/blog/?uid-28-action-viewspace-itemid-15879 王宵冰、林海聰＜媽祖：從民間信仰到非物質文化遺產＞，《文化遺產》2013年第6期。http://wubingan.chinafolklore.org/web/index.php?NewsID=12085 王見川主編《民間宗敎》第一至三輯，台北 : 南天書局, 1995-1997。 金澤、陳進國主編《宗教人類學》第一至四輯（至2013年），北京：社會科學文獻出版社，2010。 《媽祖與民間信仰 : 研究通訊 》第一至四輯（至2013年），台灣新港奉天宫世界媽祖文化研究暨文獻中心，臺北市 : 博揚文化事業有限公司。 王見川、林萬傳主編《明淸民間宗敎經卷文獻》，臺北 : 新文豐, 1999。 王見川、侯沖、楊淨麟、游子安等主編《民間私藏：中國民間信仰、民間文化資料彙編（第２輯），臺北：博 揚文化，2013。 中國宗教歷史文獻集成編纂委員會編纂《三洞拾遺》，合肥：黃山書社，2005。", "recommended_readings": "The reading list will be updated if deem necessary. Always check the most updated version via the department's website (course outline).", "terms": {"2023-24 Term 1": {"--LEC (4189)": {"startTimes": ["19:00"], "endTimes": ["21:30"], "days": [1], "locations": ["Esther Lee Bldg 307"], "instructors": ["Professor YAU Chi On"], "meetingDates": ["4/9", "11/9", "18/9", "25/9", "9/10", "16/10", "30/10", "6/11", "13/11", "20/11", "27/11"]}}}, "assessments": {"Essays": "60", "Presentation": "20", "Report": "20"}}, {"code": "5123", "title": "Taoist Thought", "career": "Postgraduate - Taught", "units": "3.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Div of Religious Studies", "requirements": "For students in MA Religious Studies or Master of Divinity", "description": "This course aims to introduce the thought and doctrine of religious Taoism. Topics that constitute the essences of Taoist doctrine such as the idea of Tao, Taoist gods, Taoist cosmology, Taoist philosophy of life and nature, the value and meaning of life, the function of ritual and self-cultivation, and ethics will be surveyed. Selected issues in modern scholarship on Taoist doctrine will also be touched on.", "outcome": "- 認識道教的思想及信仰內容; - 體驗道教在中國文化中的位置; - 明白道教修道的基本概念; - 思考道教的社會功能及對實際生活中的影響。", "syllabus": "一、        歷史 「道教」的定義 道教的起源與先秦老子信仰 漢代道教組織的出現與發展 六朝至隨唐的道教及其特徵 宋金元時期的道教及其特徵 明清代道教及其特徵二、        道教思想 道教的宇宙論及「道」一元論 道教的神譜及鬼神觀 道教的身體與生死觀 道教的道德觀、倫理觀與善惡 道教戒律思想。 道教的科儀及其拯救思想", "required_readings": "The reading list will be updated if deem necessary. Always check the most updated version via the department's website (course outline). Komjathy, Louis. Daoism: a Guide for the Perplexed. Bloomsbury Publishing, 2014.", "recommended_readings": "The reading list will be updated if deem necessary. Always check the most updated version via the department's website (course outline). [日]小林正美：《中國的道教》。濟南：齊魯書社，2010。 [日]丹波元胤：《醫籍考》。北京：學苑出版社，2007。 [日]吉元昭治著，楊字譯：《道教與不老不死長壽醫學》。四川：成都出版社，1992。 [日]志賀市子著，宋軍譯，志賀市子譯校：《香港道教與扶乩信仰──歷史與認同》。香港：香港中文大學出版社，2013。 [法]戴思博（Despeux, Catherine）著、李國強譯：《〈修真圖〉──道教與人體》。濟南：齊魯書社，2012。 [美]康豹（Katz, Paul R.）：《多面相的神仙──永樂宮的呂洞賓信仰》。濟南：齊魯書社，2010。 [美]羅浩（Roth, Harold D）著，邢文主編：《原道──《內業》與道家神秘主義基礎》。北京：學苑出版社，2009。 [德]衛禮賢（Wilhelm, Richard）著，鄧小松譯：《金花的秘密──中國生命之書》。收有[瑞士]榮格撰（Jung, Carl）序。合肥：黃山書社，2011。 丁原明、白如祥、李延倉合著：《早期全真道教哲學思想論綱》。濟南：齊魯書社，2011。 丁常春：《伍守陽內丹思想研究》。成都：巴蜀書社，2007。 孔令宏：《宋代理學與道家、道教》。北京：中華書局，2006。 尹志華：《王常月學案》。濟南：齊魯書社，2011。 巴瑞特（(Barrett, Timothy）著，曾維加譯：《唐代道教──中國歷史上黃金時期的宗教與帝國》。濟南：齊魯書社，2012。 戈國龍：《全真道學術研究報告第三輯──性命雙修論》。香港：青松出版社，2009。 戈國龍：《道教內丹學溯源》。北京：中央編譯出版社，2012。 王沐：《內丹養生功法指要》。北京：東方出版社，2011。 田合祿、田峰合著：《周易真原──中國最古老的天文科學體系》。太原：山西科學技術出版社，2004。 任繼愈主編：《中國道教史》。中國：中國社會科學出版社，2001。 朱展炎：《馴服自我──王常月修道思想研究》。四川：巴蜀書社，2009。 朱越利主編：《理論‧視角‧方法──海外道教學研究》。濟南：齊魯書社，2013。 朱越利主編：《道教說略》。北京：北京燕山出版社，2009。 余國藩著，李奭學譯：《餘國藩西遊記論集》。臺北：聯經出版事業，1989。 吳亞魁：《江南全真道教》。香港：中華書局，2006。 吳銳：《神守傳統與道教起源》。臺北：東大，2008。 李崇高：《道教與科學》。北京：宗教文化出版社，2008。 李零：《中國方術考》。北京：人民中國出版社，1993。 李遠國：《神霄雷法──道教神霄派沿革與思想》。四川：四川心人民出版社，2003。 李養正：《道教綜論》。香港：香港道教學院，2001。 李養生：《道教理義與《周易》關係述論》。香港：青松出版社，2005。 沈文華著，詹石窗編：《內丹生命哲學研究》。北京：東方出版社，2006。 于德潤：《長生久視──中華傳統內丹學的現代轉化》。北京：光明日報出版社，2010。 林富士：《中國中古時期的宗教與醫療》。北京：中華書局，2012。 南懷瑾：《靜坐修道與長生不老》。上海：復旦大學出版社，2002。 胡孚琛：《丹道仙術入門》。北京：社會科學文獻出版社，2009。 胡孚琛：《道學通論》。北京：社會科學文獻出版社，2009。 胡孚琛主編：《中華道教大辭典》。北京：中國社會出版社，1995。 胡海牙、武國忠主編：《陳攖寧仙學精要》。北京：宗教文化出版社，2008。 胡喬木總編：《中國大百科全書‧宗教卷》。北京：中國大百科全書出版社，1988。 范家偉：《六朝隋唐醫學之傳承與整合》。香港：香港中文大學，2004。 范家偉：《北宋校正醫書局新探──以國家與醫學為中心》。香港：中華書局，2014。 卿希泰：《中國道教史》第四冊 。四川：四川人民出版社，1996。 袁康就：《鍾呂內丹道德觀研究》。北京：宗教文化出版社，2004。 張志堅：《道教神仙與內丹學》。北京：宗教文化出版社，2003。 張廣保：《唐宋內丹道教》。上海：上海文化出版社，2001。 張廣保：《道家的根本道論與道教的心性學》。成都：巴蜀書社，2008。 郭武：《丘處機學案》。濟南：齊魯書社，2011。 郭健：《取經之道與務本之道──《西遊記》內丹學發微》。四川：巴蜀書社，2008。 陳禾源：《丹道修煉與養生學》。北京：社會科學文獻出版，2007。 程雅君：《金元四大醫家與道家道教》。四川：巴蜀書社，2006。 程樂松：《即神即心：真人之誥與陶弘景的信仰世界》。北京：中國人民大學出版社，2010。 遊子安：《道風百年──香港道教與道觀》。香港：道教文化資料庫-文利出）社，2002。 蓋建民：《道教醫學》。北京：宗教文化出版社，2001。 劉力紅：《思考中醫》。桂林：廣西師範大學出版社，2006。 劉永霞：《茅山宗師陶弘景的道與術》。北京：社會科學文獻出版社，2010。 劉紹雲：《宗教律法與社會秩序：以道教戒律為例的研究》。四川：巴蜀書社，2009。 蔡波林：《神藥之殤：道教丹術轉型的文化闡釋》。四川：巴蜀出版社， 2008.8。 蔣朝君：《道教科技思想史科舉要──以《道藏》為中心的考察》。北京：科學出版社，2012。 黎志添：《廣東地方道教研究：道觀，道士及科儀》。香港：中文大學出版社，2007。 蕭進銘：《反身體道──內丹密契主義研究》。台灣：新文豐出版社，2009。 賴錫三：《丹道與易道──內丹的性命修煉與先天易學》。台灣：新文豐，2010。 霍克功：《內丹解碼──李西月西派內丹學研究》。北京：人民出版社，2008。 繆天綬：《宋元學案》。台灣：商務印書局，2009。 薜芳芸：《宋代文人通醫現象研究》。山西：山西人民出版社，2012。 謝路軍：《中國道教文化》。北京：九州出版社，2008。唐長孺﹕〈魏晉期間北方天師道的傳播〉，收入氏著﹕《魏晉南北朝論拾遺》。 萬晴川、萬思蔚：〈論宋前道教小說中的仙境敘事與圖像的互文關系〉，《重慶三峽學院學報》2017年2期。 陳偉強：〈意象飛翔：《上清大洞真經》所述之存思修煉〉，收入《中國文化研究所學報》2011年53期（7）：217-248。 蓋建民：〈道教「尚醫」考析〉，《中國哲學史》2001年第4期，頁58-63。 黎志添：〈第五章：道教的生死觀──「既知生，復知死」〉，《了解道教》(三聯書局，2016) ，頁230-274。 韓吉紹：〈煉丹術與宋代醫用丹方〉，收入《自然科學史研究》第27卷第3期（2008）：337-352。 魏燕利：〈道教導引術的歷史演變探析〉，《四川大學學報（哲學社會科學版）》2016年5期。 黎志添﹕〈從打齋儀式看道教對死亡的處理──一個死魂遠遊旅程的救濟：拔罪、救苦、度亡及成仙〉，收入梁美儀、張燦輝合編：《凝視死亡──死與人間的多元省思》(香港：中文大學出版社，2005)，頁55-78。 張澤洪：第一章：〈齋醮儀式源流及其影〉《道教齋醮符咒儀式》(四川：巴蜀書社，1999), 頁1-74。 陳耀庭：〈破獄度人—論燈儀的形成及其社會思想內容〉《道家文化研究》第五輯，頁303-316。 黎志添：〈香港道教齋醮中的超幽施食儀式〉，收入氏著：《廣東地方道教研究—道觀、道士及科儀》，頁223-239。 施舟人﹕〈道教清約〉，《法國漢學》第七輯 (2002)，頁149-167。 黎志添：〈香港新界建醮儀式研究—道壇、道士及科儀本的歷史〉，收入氏著：《廣東地方道教研究—道觀、道士及科儀》，香港：中文大學出版社，2007，頁183-208。 黎志添：〈《先天斛食濟煉幽科》考：一部廣東道教科儀本的文本源流研究〉，《中國文化研究所學報》，第 51期 （2010），頁117-142。 祝逸雯：〈鄭思肖《太極祭鍊內法》研究－在法師身中完成的濟度儀式〉，收入《漢學研究》第43卷4期(2016)，頁35-61。 [日]橫手裕：〈宋元道教的內丹養生法〉，收入黎志添主編：《道教圖像、考古與儀式──宋代道教的演變與特色》，香港：中文大學，2016，頁313-350。 龔揚民、白彬：〈貴州遵義南宋楊粲墓道教因素試析〉，《四川文物》2013年4期。 朱越利: 〈呂洞賓、劉海蟾等北宋參同清修內丹家〉, 收於《道教研究學報: 宗教、歷史與社會》2009年第一期。 [日]志賀市子:〈地方道教之形成: 廣東地區扶鸞結社運動之興起與演變(1838-1953)〉, 載於《宗教研究學報》第 2期2010, 頁231-67。 [意]莫尼卡 (Esposito, Monica):〈\"清代道藏\"——江南蔣元庭《道藏輯要》之研究〉, 載於《宗教學研究》第 3期, 2010。頁17-27。 劉明：〈 淺談文昌帝君與文昌文化〉，《天府新論》2012年5期。 [日]志賀市子著，宋軍譯，志賀市子譯校：《香港道教與扶乩信仰──歷史與認同》(香港：香港中文大學出版社，2013)，頁33-70。 黎志添: 〈清代四種《呂祖全書》與呂祖扶乩道壇的關係〉, 收於《中央研究院中國文哲研究集刊》第二十四期2013年3月, 頁183-230。 尾崎正治﹕〈道教經典〉，《道教》第一卷，福井康順，山崎密，木村英一，酒井忠夫編，朱越利譯 (上海﹕上海古籍出版社，1990)，頁60-99。 程樂松：〈華僑與楊羲:「真人之誥」的靈媒考辨〉，《中國道教》2010年1期。 柳存仁﹕〈《道藏》之性質〉，《中國文哲研究通訊》二期(1992)，頁1-15。 王承文﹕〈古靈寶經的「三洞」思想與東晉南朝之際道教的整合〉，收入王氏著《敦煌古靈寶經與晉唐道教》(北京﹕中華書局，2002)，頁159-266。 ", "terms": {"2023-24 Term 1": {"--LEC (4241)": {"startTimes": ["19:00"], "endTimes": ["21:30"], "days": [4], "locations": ["Hui Yeung Shing Bldg G05"], "instructors": ["Professor LAI Chi Tim"], "meetingDates": ["7/9", "14/9", "21/9", "28/9", "5/10", "12/10", "19/10", "26/10", "2/11", "9/11", "16/11", "23/11", "30/11"]}}}, "assessments": {"Essays": "40", "Presentation": "40", "Report": "20"}}, {"code": "5126", "title": "History of Taoism I", "career": "Postgraduate - Research", "units": "3.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Div of Religious Studies", "requirements": "For students in MPhil-PhD Religious Studies", "description": "This course studies the early and medieval histories of religious Taoism during the period from the Six Dynasties until Tang Dynasty. The important historical development of the sects of the Way of Celestial Master, the Lingbao and the Shangqiing will be covered.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "5127", "title": "History of Taoism II", "career": "Postgraduate - Research", "units": "3.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Div of Religious Studies", "requirements": "For students in MPhil-PhD Religious Studies", "description": "This course will survey the developments of religious Taoism in late imperial China. The course will focus on the rise and spread of such new Taoist movements as the Quanzhen (Complete Perfection) school and Jingming (Pure Illumination) school, as well as the continuing penetration of the Zhengyi (Orthodox Unity) school into the national politics and local society.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "5129", "title": "Taoism and Chinese Culture", "career": "Postgraduate - Taught", "units": "3.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Div of Religious Studies", "requirements": "For students in MA Religious Studies or Master of Divinity", "description": "This course aims at a general study of Taoism in Chinese cultural context. The focus is on Taoist elements and values in Chinese art, music, drama, and literature. This will allow students not only to study Taoism as one of Chinese religious traditions, but also to understand the intersections of Taoism and various aspects of Chinese culture. No prior knowledge of Taoism is assumed.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "5131", "title": "Biblical Hermeneutics in Asian Perspectives", "career": "Postgraduate - Research", "units": "3.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Div of Religious Studies", "requirements": "For students in MPhil-PhD Religious Studies or Master of Divinity or MA Christian Studies", "description": "The course will focus on the recent development in biblical interpretation in Asia in the larger context of theological endeavours and religious studies of Asian scholars in their coming to terms with the diversity of Asian realities. Adequate attention will be paid to methodological issues in relation to the pluralistic religio-cultural traditions and the complex socio-political experiences of the Asian peoples. Biblical interpretation developed in various Asian countries will also be studied.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "5132", "title": "Advanced Biblical Exegesis I", "career": "Postgraduate - Research", "units": "3.00", "grading": "Graded", "components": "Classwork\nLecture", "campus": "Main Campus", "academic_group": "Div of Religious Studies", "requirements": "For students in MPhil-PhD Religious Studies or Master of Divinity", "description": "This course will focus on exegesis of selected passages from the Hebrew Bible or the New Testament. It would be an advantage if students have gone through either Hebrew Exegesis or New Testament Greek Exegesis.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "5133", "title": "Advanced Biblical Exegesis II", "career": "Postgraduate - Research", "units": "3.00", "grading": "Graded", "components": "Classwork\nLecture", "campus": "Main Campus", "academic_group": "Div of Religious Studies", "requirements": "For students in MPhil-PhD Religious Studies or Master of Divinity", "description": "This course will focus on exegesis of selected passages from the Hebrew Bible or the New Testament. It would be an advantage if students have gone through either Hebrew Exegesis or New Testament Greek Exegesis.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "5134", "title": "Gender Critical Interpretation of the Bible", "career": "Postgraduate - Research", "units": "3.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Div of Religious Studies", "requirements": "For students in MPhil-PhD Religious Studies or Master of Divinity or MA Christian Studies", "description": "The course introduces the approaches to reading and interpreting the Bible for the sake of gender equality and justice. It looks into the effects of gender injustice in the history of biblical interpretation and theology, and promotes interpreting the Bible with sensitivity towards gender inclusivity. It will cover both feminist and masculinity interpretations of the Bible.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "5135", "title": "Religion and Literature of the Bible", "career": "Postgraduate - Research", "units": "3.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Div of Religious Studies", "requirements": "For MPhil-PhD Religious Studies", "description": "This course is an advanced study of the biblical text (the Hebrew Bible and/or the New Testament) in the light of the contemporary critical biblical scholarship. The religious and cultural issues of ancient Israel and/or the early Christian church are to be tackled.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "5139", "title": "Readings in Semitic Languages", "career": "Postgraduate - Research", "units": "3.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Div of Religious Studies", "requirements": "For students in MPhil-PhD Religious Studies", "description": "This course is designed to introduce student to Semitic languages relating to the Hebrew Bible. Students will read some long and some short excerpts from either a) Aramaic and its many offshoots including Syriac, or b) Ugaritic or c) Akkadian, with its 2500-year-old history, or e) Classical Arabic, with elementary readings from the Qur’an or f) a comparative study of various Semitic languages which are similar. The direction the course will take depends upon the students’ needs and interests. This course will have in mind both the student of the Hebrew Bible, and the student who wants to gain a wider knowledge of the thought of ancient West Asia. In both cases, knowledge of Hebrew is required.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "5143", "title": "Contemporary Issues in Ethics, Society and Religion", "career": "Postgraduate - Taught", "units": "3.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Div of Religious Studies", "requirements": "For students in MA Religious Studies", "description": "This course attempts to explore the complexity of contemporary issues raised by ethics and society through a religious perspective. How religious thinking can be enriched and challenged by issues of bioethical, business, legal and political nature.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "5146", "title": "Religious Education and Personal Growth", "career": "Postgraduate - Taught", "units": "3.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Div of Religious Studies", "requirements": "For students in MA Religious Studies", "description": "This course will attempt to study some of the modern developmental theories such as Piaget’s cognitive developmental theory, Erikson’s socio-psychological theory, Kohlberg’ s moral developmental theory and Fowlers’ faith developmental theory. Special attention will be given to the evaluation of their signifi cance to education in a religious context.", "outcome": "Upon completing the course, students should be able to: - Comprehend the developmental themes throughout the life span and the related theories of developmental psychology.  - Understand the theories related to moral, faith and spiritual development.  Self-examine the student’s own understanding and philosophy of religious education.  - Self-examine the student’s stage of personal and spiritual development, reflecting on the implications for her/his role as a religious educator.  - Critically apply concepts in developmental psychology to specific educational contexts.", "syllabus": " Course Introduction: Different Perspectives on Human Growth / Personal Development The Goal of Human Growth / Personal Development from Religious Perspectives Religion and Identity Formation Religion and Moral Development Religion and Faith Development Religion and Spiritual Development in Childhood and Adolescence Gender Issues in Human Development Death and Dying (Guest Speaker; To be Confirmed) Religious Practices for Spiritual Development Conclusion", "required_readings": "The reading list will be updated if deem necessary. Always check the most updated version via the department's website (course outline). Grimmitt, Michael. Religious Education and Human Development: the Relationship between studying Religions and Personal, Social and Moral Education. England: McCrimmon Pub., 1987.", "recommended_readings": "The reading list will be updated if deem necessary. Always check the most updated version via the department's website (course outline).", "terms": {"2023-24 Term 1": {"--LEC (4242)": {"startTimes": ["19:00"], "endTimes": ["21:30"], "days": [2], "locations": ["Hui Yeung Shing Bldg G04"], "instructors": ["Dr. CHOW Wai Yin"], "meetingDates": ["5/9", "12/9", "19/9", "26/9", "3/10", "10/10", "17/10", "24/10", "31/10", "7/11", "14/11", "21/11", "28/11"]}}}, "assessments": {"Discussion": "20", "Essays": "45", "Presentation": "35"}}, {"code": "5219", "title": "The Hebrew Bible in Contexts", "career": "Postgraduate - Taught", "units": "3.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Div of Religious Studies", "requirements": "For students in MA Religious Studies", "description": "This course aims at introducing students to the approaches to reading the Hebrew Bible (The Christian Old Testament) in its literary, socio-political and religio-cultural contexts. The literary setting and historical background will be surveyed and explored in order to enhance students’ understanding of the text and the dynamics of the reading process.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "5273", "title": "Catholic Social Ethics", "career": "Postgraduate - Taught", "units": "3.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Div of Religious Studies", "requirements": "For students in MA Religious Studies or Master of Divinity", "description": "This course attempts to examine the principles and ways of Church’s responses to social issues from the Catholic faith tradition. Topics include the relationship between morality and spirituality, the foundation of social ethics, the methods of theological reflection and pastoral actions. Particular attention is given to Catholic Social Teachings and its development, and its perspectives on issues like human rights, economic justice and globalization, work and labour, ecology, political participation, racism, women’s status and so on. Catholic social movements and individuals will also be introduced.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "5300", "title": "The Study of Islam", "career": "Postgraduate - Taught", "units": "3.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Div of Religious Studies", "requirements": "For students in MA Religious Studies or Master of Divinity", "description": "This course will introduce the basic concepts of Islam to the students i.e. fundamentals of faith, rituals of worship, Seerah of the Prophet of Islam, Islamic Civilization and Muslim contribution to different cultures. It will help the students to understand the contemporary issues in the light of Islamic teachings and the methodogical issues in Islamic Studies. The course has been designed for such students who have never studied Islamic Studies so far.", "outcome": "Knowledge: - Understand the basic concepts of Islam; - Understand the contemporary issues in the light of Islamic teachings and methodological issues in Islamic Studies. Skills: - Communication and presentation (oral and written) skills; - Critical and analytical skills; - Research skills.  Attitude:  - A heightened sensitivity to the religious dimension of human life, society and culture; - An analytical capability of the plurality and complexity of religious phenomena related to Islam; - A critical yet sympathetic understanding and appreciation of Islam.", "syllabus": " The Roots of Islam: Pre-Islamic Arabia (Jāhiliyya); Judeo-Christian connections; Neighboring civilizations. Muhammad and the Early Muslim Community Qurʾān Ḥadīth and Sunna Islām: Submission as Orthopraxy; An Umma on the Five Pillars Islamic Law: Sharīʿa and Fiqh Islamic Theology: Kalām Islamic Sectarianism: The Sunni-Shīʿa Schism Islamic Mysticism: The Ṣūfī Tradition Islamic Modernism and Revivalism Women and Gender in Islam Fundamentalism and Extremism in Islam", "required_readings": "The reading list will be updated if deem necessary. Always check the most updated version via the department's website (course outline). Ali, Abdullah Yusuf, trans. The Qur'an Translation. Tahrike Tarsile Qur'an; 25th edition, 2009. (If you have another translation of the Qurʾān, you may use it, or an online version, instead.) Goldziher, Ignaz. Introduction to Islamic Theology and Law (Modern Classics in Near Eastern Studies). (Paperback) Translated by Andras and Ruth Hamori. Princeton, NJ: Princeton University Press, 1981. Sachiko Murata and William C. Chittick, The Vision of Islam. St. Paul, MN: Paragon House, 1994.", "recommended_readings": "The reading list will be updated if deem necessary. Always check the most updated version via the department's website (course outline). Sachiko Murata and William C. Chittick, “Preface” in The Vision of Islam (St. Paul, MN: Paragon House, 1994), ix-xiii. Peter J. Awn, “Faith and Practice” and Fazlur Rahman, “The Message and the Messenger,” in Islam: The Religious & Political Life of a World Community, ed. Marjorie Kelly (New York: Praeger, 1984), 1-3, 28-32.“Pre-Islamic Poetry,” Trans. by Michael Sells. “Introduction,” in The Vision of Islam, xix-xxiv. “Traditional Muslim Chronology of Muhammad’s Life”. Fazlur Rahman, “Muhammad, The Prophet of God,” in Islam: The Religious & Political Life of a World Community, 32-42. “Excerpt From Dante’s Inferno and a 17th c. French Traveler’s Account”. “Introduction,” in The Vision of Islam, xiv-xix. Abdullah Yusuf Ali, The Qur'an Translation (Tahrike Tarsile Qur'an; 25th edition, 2009), Sūra 1, 2, 4, 7, 9, 12, 18, 26, 75-114. “The Message,” in Islam: The Religious & Political Life of a World Community, 42-54. “Introduction,” and “The Koran and Sunna,” in The Vision of Islam, xxv-xxxix, 28-30. Roy P. Mottahedeh, “Qur’an and Sunna,” in Islam: The Religious & Political Life of a World Community, 57-59. “Selected Hadīth”. “Part I: ISLAM,” in The Vision of Islam, 3-27. Peter J. Awn, “Philosophical Theology and the First Pillar of Islam” and“Islamic Praxis and the Four Remaining Pillars of Islam,” in Islam:  The Religious & Political Life of a World Community, 3-13. Ignaz Goldziher, “The Development of Law,” in Introduction to Islamic Theology and Law, trans. Andras and Ruth Hamori (Princeton, NJ: Princeton University Press, 1981), 31-66. “Law,” in Textual Sources for the Study of Islam, 105-115. “The Growth and Development of Dogmatic Theology,” in Introduction to Islamic Theology and Law, 67-114. “The Sects,” in Introduction to Islamic Theology and Law, 167-229. Peter J. Awn, “Diversity in the Umma: Shi’ism,” in Islam: The Religious & Political Life of a World Community, 14-17. “Theoretical Sufism,” “Philosophy,” “The Two Poles of Understanding,” and “Sufism’s Vision,” in The Vision of Islam, 246-257, 262-264. Peter J. Awn, “Sufism,” in Islam: The Religious & Political Life of a World Community, 17-22. “Sufi Ascetical Texts” “Ch. 10 The Contemporary Situation,” in The Vision of Islam, 329-335. Voll, John O., Ch. 8: “Muslim Responses to Colonialism,” in Islam: The Religious & Political Life of a World Community, 157-172. “Modernist Islamic Texts”. Ch. 4, “Rights and Roles of Women: Some Controversies,” in Amina Wadud, Qurʿan and Woman: Rereading the Sacred Text from a Woman’s Perspective. New York: Oxford University Press, 1999, pp. 62-93. Ch. 6, “‘Reduce but do not destroy’: Female ‘Circumcision’ in Islamic Societies,” in Kecia Ali, Sexual Ethics and Islam: Feminist Reflections on Qurʿan, Hadith and Jurisprudence. Oxford: Oneworld, 2006, pp. 97-111. Albertini, Tamara. “The Seductiveness of Certainty: The Destruction ofIslam's  Intellectual Legacy by the Fundamentalists,” in Philosophy East and West, Vol. 53, No. 4 (Oct., 2003), pp. 455-470. Wood, Graeme. “What ISIS Really Wants,” in The Atlantic, March, 2015 Issue.", "terms": {"2023-24 Term 2": {"--LEC (4401)": {"startTimes": ["19:00"], "endTimes": ["21:30"], "days": [4], "locations": ["Esther Lee Bldg 308"], "instructors": ["Professor James D FRANKEL"], "meetingDates": ["11/1", "18/1", "25/1", "1/2", "8/2", "22/2", "29/2", "7/3", "14/3", "21/3", "28/3", "11/4", "18/4"]}}}, "assessments": {"Discussion": "35", "Essays": "45", "Participation": "20"}}, {"code": "5312", "title": "Hindu Visions of Divinity", "career": "Postgraduate - Taught", "units": "3.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Div of Religious Studies", "requirements": "For students in MA Religious Studies", "description": "Hindu religious traditions offer a rich variety of concepts as well as visualizations of divinity, from highly abstracted and nuanced notions of the Deity to highly tangible and specific images seen and elaborately venerated in temples. By close readings of classical sacred texts (in translation), viewing iconography, and discussion of India’s historical and social contexts in which texts and images have been embedded, this course will explore the fascinating amalgam of ritual, yoga, textual exegesis, and devotionalism of the Hindu religious world.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "5314", "title": "Buddhism and Culture", "career": "Postgraduate - Taught", "units": "3.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Div of Religious Studies", "requirements": "For students of MA in Religious Studies or MA in Buddhist Studies", "description": "This course provides an overview of the historical development of Buddhist culture in Asia. Main features elements of Buddhism in the diversified culture is highlighted. Theoretical foundations of Buddhist philosophy is delivered at the beginning, with reference to the development of the various Buddhist traditions, such as Theravada, Mahayana and Vajrayana. Their impact, evolution and integration on and into different cultures are being studies, with reference to the contemporary Buddhist practices. Comparisons amongst various cultural elements would be made, providing a greater in depth understanding of the different aspects of Buddhist Culture and the dynamism of Buddhism in its adaptation to different cultures. The course will end with discussing the role of Buddhism in its influence in reshaping the culture of modern society, highlighting facts that will help in the formation of a harmonious society.", "outcome": "※ Knowledge Outcomes: Upon completion of the subject, students will be able to: (1) enlarge and refine their understanding of the doctrines and notions in three Buddhist traditions: Indian, Chinese and Japanese; (2) appreciate the role of Buddhism in traditional cultures and in contemporary cultures; (3) describe how cultural values, rites, customs and institutions interact with  religious beliefs.  ※ Attitude Outcomes: (1) nurture a larger sensitivity to the contributing role of religions in human culture and history; (2) develop skills in analytical reading, formal writing, and critical thinking.", "syllabus": "1. Course Introduction; The Historical and Early Context of Buddhism, The story of the Buddha 2. An Overview: The position of Buddhism in Indian and Chinese cultures; The personalities of Indian and Chinese cultures 3. Buddhism and caste system 4. Buddhism and non-violence 5. Women in Buddhism 6. Buddhist translation in China 7. Buddhism and domestic moral concepts 8. Buddhism and Chinese literature 9. Japanese Buddhist culture 10. Buddhism and Food 11. Buddhist Medicine and Nourishing of Life 12. Buddhism and folk culture; Zen Koan and humour", "required_readings": "Lamotte, Etienne. “The Buddha, His Teachings and His Sangha”. In Bechert & Gombrich, eds. The World of Buddhism, pp. 41-58;  The “Death and Parinirvāṇa of the Buddha”. In John Strong, The Experience of Buddhism: sources and interpretations. Belmont. Calif. : Wadsworth Pub. Co.,1995, pp. 45-50;  于凌波：《向知識分子介紹佛教》，Ch. 3。莆田：福建莆田廣化寺，1990。 Tan Chung & Geng Yinzeng, India and China: Twenty Centuries of Civilizational  Interaction and Vibrations. ch. 4. New Delhi: Centre for Studies in Civilizations, 2005.  中村元著，林太、馬小鶴譯：《東方民族的思維方法》，臺北：淑馨，1991。 Harold Coward, “Gandhi, Ambedkar, and Untouchability”. Harold Coward ed,  Indian Critiques of Gandhi. pp. 41-66. Albany: State University of New York Press.  2003.   尚會鵬：《種姓與印度教社會》，第一、二章，北京：北京大學，2001。 Ludwig Alsdorf, The History of Vegetarianism and Cow-Veneration in India.  Trans. From German by Gal Patil, Revised by Nichola Hayton. London, NY:  Routledge. 2010.  巴弟帕卡薩(Bodhipaksa)著，林珍如譯：《佛陀吃肉嗎？》，臺北：法鼓文化， 2004。  愚子：〈尊重生命，慈悲不殺〉，《五戒現代觀‧上》，頁1-58，北京：宗 教文化，2004。 Ed. Peter N. Gregory & Susanne Mrozik, Women Practicing Buddhism: American  Experiences. pp. 159-174. Boston: Wisdom Publications, 2008.   釋恒清：《菩提道上的善女人》，臺北：東大圖書，1995。 王鐵鈞：《中國佛典翻譯史稿》，北京：中央編譯，2006。 曹仕邦：《中國佛教譯經史論集》，頁137-175，臺北：東初，1992(民81)。 Prabodh Chandra Bagchi, India and China: A Thousand Years of Cultural Relations. ch. V. New Delhi: Munshiram Manoharlal, 2008. 方立天：《中國佛教文化》，第九章及第十一章。 Y. V. Dahiya, Hinduism and Buddhism in Perspective. ch. 2. New Delhi: Munshiram Manoharlal, 2008. Shoko Watanabe, Japanese Buddhism; a critical appraisal. pp. 111-126. Tokyo :  Kokusai Bunka Shinkåokai (Japan Cultural Society), 1970.  張曼濤主編：《日韓佛教研究》，頁15-37，臺北：大乘文化，1978(民67)。  村上重良著，張大柘譯：《宗教與日本現代化》，頁111-232，高雄：佛光，  1993(民82)。  楊曾文主編：《日本近現代佛教史》，第二章，杭州：浙江人民，1996。 Huang, Y., Ang, C.Y.W. “Vegetarian foods for Chinese Buddhists: Religious and philosophical bases of food choices” in Food technology, 1992, vol. 46, no.10, pp. 105-108.  林伯謙(1998)，〈北傳佛教與中國素食文化〉，《東吳中文學報》第 4 期，頁 93-138。 張萍，〈唐代的斷屠釣〉，《中國典籍與文化》，2002(4)。 Hinduism and Buddhism in Perspective. ch. 5.  Miranda Shaw, Buddhist Goddesses of India. pp. 1-13. New Delhi: Munshiram Manoharlal, 2006. Youru Wang, Linguistic strategies in Daoist Zhuangzi and Chan Buddhism : the other way of speaking. London, chapters 7 & 10; New York : RoutledgeCurzon, 2003. 方立天：《中國佛教文化》，第十三章。 劉淑芬：〈林葬──中古佛教露屍葬研究之一〉，《中古的佛教與社會》，上海：上海古籍，2008。 周裕鍇著：《禪宗語言》。下篇: 第三至五章。杭州: 浙江人民出版社，1999。", "recommended_readings": "", "terms": {"2023-24 Term 2": {"--LEC (4402)": {"startTimes": ["19:00"], "endTimes": ["21:30"], "days": [5], "locations": ["Esther Lee Bldg 403"], "instructors": ["Dr TONG Sau Lin"], "meetingDates": ["12/1", "19/1", "26/1", "2/2", "16/2", "23/2", "1/3", "8/3", "15/3", "22/3", "5/4", "12/4", "19/4"]}}}, "assessments": {"Attendance": "10", "Essays": "80", "Participation": "10"}}, {"code": "5316", "title": "Studies of Humanistic Buddhism", "career": "Postgraduate - Taught", "units": "3.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Div of Religious Studies", "requirements": "For students of MA in Religious Studies", "description": "From more than 2500 years, Buddhism has spread almost all parts of the world, and undergone the developments from Primitive Buddhism, Theravada, Mahayana, to Tantriyana. In the contemporary world, Humanistic Buddhism has become one of the mainstreams of Buddhist developments. And the ideas and practices for the welfare of society and benefit of humanity have dominated Buddhist activities. This course designed to study the development of Humanistic Buddhism, including the history, thoughts, and practices. This course is divided into three parts yet each part is organically connected with the others. We first investigate the basic doctrines of traditional Buddhism related to the arising and practice of humanistic Buddhism, such as the Four Noble Truth, the Dependent-Origination, the ideas and practices of Bodhisattva. Having understood the doctrinal foundation of Humanistic Buddhism, we then examine the history of humanistic Buddhism in the early Republic era (1912-1949). Social, political, religious, as well as economic background in which Humanistic Buddhism arose will be discussed so that students could have holistic picture about the interaction between Buddhist institutions and society then. The teaching and practice of some pioneers of Humanistic Buddhism, such as Ven. Taixu will be examined to reveal the contents of Humanistic Buddhism. Towards the end of semester, we explore the contemporary developments of humanistic Buddhism in general, and Foguan Shan Buddhism in particular.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "5322", "title": "Research Paper in Religious Studies", "career": "Postgraduate - Taught", "units": "3.00", "grading": "Graded", "components": "Project", "campus": "Main Campus", "academic_group": "Div of Religious Studies", "requirements": "For students in MA Religious Studies;Pre-requisite: RELS5005", "description": "The research paper in Religious Studies, which is planned with our faculty and those faculty members in relevant fields, allows students to develop some of the ideas and skills they have acquired during their study with us. Every student must write a research paper in Religious Studies of not less than 15,000 words (in Chinese or English) on an approved topic under individualized supervision. Students will be able to acquire some fundamental skills and methodologies of doing research and writing a dissertation in Religious Studies. They will also be better equipped for an application for MPhil/PhD programmes. Even though there will be group and individual supervision to guide students through from start to finish, this is largely a self-taught course and student initiative is most important.", "outcome": "Knowledge Outcomes:  - In-depth understanding of a chosen topic in Religious Studies  - Research on and organization of primary and original materials  Skills Outcomes:  - Independent study - Construction of proposal and thesis through research and reading - Articulation of theory and practice Attitude Outcomes:  - Confidence in independent research - Sound judgment on selecting research topics and source materials", "syllabus": " Introduction. Research proposal. How to write an abstract and academic paper? / Methods 2. Three group meetings At least two consultation meetings with supervisors.", "required_readings": "The required readings depend on the research topic. Always check the most updated version via the department's website (course outline).", "recommended_readings": "The recommended readings depend on the research topic. Always check the most updated version via the department's website (course outline).", "terms": {"2023-24 Term 2": {"-J01-PRJ (2905)": {"startTimes": ["19:00"], "endTimes": ["21:30"], "days": [3], "locations": ["Yasumoto Int'l Acad Park 403"], "instructors": ["Dr. CHOW Wai Yin"], "meetingDates": ["10/1", "17/1", "24/1", "31/1", "7/2", "21/2", "28/2", "6/3", "13/3", "20/3", "27/3", "3/4", "10/4", "17/4"]}}}, "assessments": {"Attendance": "10", "Essays": "80", "Report": "10"}}, {"code": "5323", "title": "Life and Death in World Religions", "career": "Postgraduate - Taught", "units": "3.00", "grading": "Graded", "components": "Field Studies/Field-trip\nLecture", "campus": "Main Campus", "academic_group": "Div of Religious Studies", "requirements": "For students in MA Religious Studies", "description": "The problem of life and death constitutes the core concern of practically all religions of the world. The values and beliefs that relate to life and death have far-reaching impacts on different dimensions of religious practice. This course takes a thematic approach by examining and comparing the issues of life and death in some major religions in the world, including mainly the Indian, Chinese and Abrahamic traditions. The emphases and peculiarities of each religion will be illustrated from the doctrinal, textual, ritual and symbolic perspectives. Through the study of religion in different cultures, students will be equipped with a broadened horizon and fundamental framework for taking more advanced courses in all area of religious studies.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "5325", "title": "Christianity in Chinese Literature", "career": "Postgraduate - Taught", "units": "3.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Div of Religious Studies", "requirements": "For students in MA Religious Studies", "description": "This course adopts an innovative approach to examine the interactions between Christianity and Chinese literature from the 19th to early 20th centuries. Literary texts to be analyzed include mainly the late Qing missionary novels, and works of May Fourth writers (such as Lu Xun, Bing Xin and Xu Dishan). This course aims to widen the students’ perspectives in the indigenization of Christianity in Chinese religious and literary contexts, the rhetorical influences of the Bible on the emergence of modern Chinese literature, and the interdisciplinary study of literature and religion.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "5326", "title": "Chinese Religion and Literature", "career": "Postgraduate - Taught", "units": "3.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Div of Religious Studies", "requirements": "For students in MA Religious Studies", "description": "Chinese literature has long been intertwined with religion. While Confucian, Buddhist and Daoist thoughts permeates classical Chinese literature, a large number of works constitute a lively epitome of Chinese religious culture. This course aims to investigate the interactive relationship between Chinese religion and literature. Students will be guided to examine the literary value and rhetorical devices of Chinese religious classics and the ways in which religious thoughts and symbols shape the themes, narratives and language of the literary works. Texts selected for reading include Chinese religious classics like The Lotus Sutra and The Divine Classic of Nan Hua, classical novels such as The Story of the Stone and The Journey to the West, as well as Chan/Zen and Daoist poetry.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "5327", "title": "Wisdom in Religious Classics", "career": "Postgraduate - Taught", "units": "3.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Div of Religious Studies", "requirements": "For the students of MA in Religious Studies", "description": "The classics of different religious traditions offer a wealth of knowledge, insight and wisdom about nature, reality and life. The store of ancient wisdom accumulated in various cultures is oftentimes still relevant to our contemporary contexts. This course takes a textual and story approach by examining the notions and themes of wisdom in some major religions of the world. Through guided reading of selected passages from the religious classics, students may draw from the well of profound wisdom to stimulate their reflection on the approach of life, the way of looking at the world, and the recurring issues facing humanity. Texts selected for reading may include Zhuangzi, the Lotus Sutra, the Bible and the Quran, the Bhagavad Gītā, and so forth. The exact list of texts may be modified by the teacher who offers the course in a particular year.", "outcome": "Upon successful completion of this course, students should be able to: 1.Enhance their ability to have a critical and yet sympathetic understanding and appreciation of different religious traditions;  2.Understand the notions of wisdom in major world religions in their historical and cultural settings and apply them in contemporary contexts;  3.Engage in a critical analysis of religious classics from textual and comparative perspectives.", "syllabus": "1. Interpreting religious classics 2. Notions and themes of wisdom  3. Wisdom in Zhuangzi: Harmony between human and nature in “The Happiness of Fish” 4. Wisdom in Zhuangzi: Transformation of life in “The Butterfly Dream”  5. Wisdom in the Lotus Sutra: Attachment and enlightenment in “The Parable of the Burning House”  6. Wisdom in the Lotus Sutra: Delusion and truth in “The Parable of the Poor Son”  7. Wisdom in the Bible: Making sense of loss and suffering in Job 8. Wisdom in the Bible: Futility and transience of life in Ecclesiastes  9. Wisdom in the Quran: Submission of human will to God’s will 10. Wisdom in the Quran: Mercy and moral behaviour in daily living 11. Wisdom in the Bhagavad Gītā: War as the allegory of struggling human soul  12. Wisdom in the Bhagavad Gītā: Yoga as the path of enlightenment and transcendence  13. Conclusion", "required_readings": "", "recommended_readings": "Afridi, Maulana Mohammad Razi Khan and Mohammad Ilyas Navaid, eds.   Encyclopaedia of Quranic Studies. New Delhi: Anmol Publications, 2006. Brodd, Jeffery and Gregory Sobolewski. World Religions: A Voyage of Discovery.   Winona, Minn.: Saint Mary's Press, 2003. Cole, Alan, \"Simplicity for the Sophisticated: Re-reading the Daode Jing for the  Polemics of Ease and Innocence,\" in History of Religions, August 2006, pp. 1-49. Conze, Edward. Buddhist Wisdom Books: Containing the \"Diamond Sutra\" and the   \"Heart Sutra\" (new edition). London: Thorsons, 1975. Coogan, Michael D. A Brief Introduction to the Old Testament. New York: Oxford   University Press, 2009. Cornille, Catherine, ed. Song Divine: Christian Commentaries on the Bhagavad Gītā.   Grand Rapids, Michigan: Wm. B. Eerdmans Publishing Co., 2006.  Crenshaw, J. L. Old Testament Wisdom: An Introduction. Louisville, Ky.:   Westminster John Knox Press, 2010. Crenshaw, J. L. \"The Wisdom Literature\", in Douglas A. Knight and Gene M. Tucker,  eds. The Hebrew Bible and Its Modern Interpreters. Philadelphia, Pa.: Fortress Press, 1985. Eliade, Mircea, translated by Willard R. Trask. A History of Religious Ideas. Chicago:   University of Chicago Press, 1984. Feldmeier, Peter and Leo D. Lefebure. The Path of Wisdom: A Christian Commentary  on the Dhammapada. Grand Rapids, Michigan: Wm. B. Eerdmans Publishing Co., 2011. Fox, Douglass. The Heart of Buddhist Wisdom: A Translation of the Heart Sutra with  Historical Introduction and Commentary. Lewiston and Queenston Lampeter: Edwin Mellen Press, 1985. Geshe Kelsang Gyatso. Heart of Wisdom: An Explanation of the Heart Sutra. London:   Tharpa Publications, 2001. Jung, Carl, translated by R. F. C. Hull. Answer to Job. Princeton, N.J.: Princeton   University Press, 1973. Kaltenmark, Max, translated by Roger Greaves. Lao Tzu and Taoism. Stanford:   Stanford University Press, 1969. Klaus, Hilmar. The Tao of Wisdom. Laozi-Daodejing. Aachen: Verlag Mainz, 2009. Klostermaier, Klaus K. A Concise Encyclopedia of Hinduism. Oxford: Oneworld,   1998. Kohn, Livia and Michael LaFargue, eds. Lao-Tzu and the Tao-Te-Ching. Albany:   State University of New York Press, 1998. Lefebure Leo D. The Buddha and the Christ: Explorations in Buddhist and Christian   Dialogue. Maryknoll, N.Y. : Orbis Books, 1993. Marcus, Paul. Ancient Religious Wisdom, Spirituality, and Psychoanalysis. Westport,   Conn.: Praeger, 2003. Murphy, R. E. The Tree of Life: An Exploration of Biblical Wisdom Literature. New   York: Doubleday, 1990. Neville, Robert Cummings, ed. Ultimate Realities. Albany: State University of New   York Press, 2001. Neville, Robert Cummings, ed. The Human Condition. Albany: State University of   New York Press, 2001. Neville, Robert Cummings, ed. Religious Truth. Albany: State University of New   York Press, 2001. Nhat Hanh, Thich. The Heart of Understanding: Commentaries on the   Prajñaparamita Heart Sutra. Berkeley, Calif.: Parallax Press, 2009. Nursi, Said, translated by Huseyin Akarsu. The Gleams: Reflections on Qur'anic   Wisdom and Spirituality. Somerset, N.J.: Tughra Books, 2008.  Oldmeadow, Harry. Light from the East: Eastern Wisdom for the Modern West.   Indiana: World Wisdom Inc., 2007. Palmer, E. H. trans. The Wisdom of the Koran. New York: Citadel Press, 2001. Perdue, Leo. The Sword and the Stylus: An Introduction to Wisdom in the Age of   Empires. Grand Rapids, Mich.: W. B. Eerdmans Pub. Co., 2008. Perdue, Leo. Wisdom and Creation: the Theology of Wisdom Literature. Nashville:   Abingdon Press, 1994. Setzer, Claudia. The Quotable Soul: Inspiring Quotations Crossing Time and Culture.   New York: Wiley, 1994. Theodor, Ithamar. Exploring the Bhagavad Gītā: Philosophy, Structure, and Meaning.   Farnham, Surrey: Ashgate Publishing Ltd., 2010. Van Buitenen, J. A. B. The Bhagavadgītā in the Mahābhārata: Text and Translation.   Chicago: University of Chicago Press, 1981.   何躍青編著：《心經的智慧》，臺北：廣達文化事業有限公司，2007。 林松：《〈古蘭經〉在中國》，銀川：寧夏人民出版社，2007。 孟欣：《老子哲學與人生智慧》，青島︰青島出版社，2006。 星雲大師︰《般若心經的生活觀》，台北︰有鹿文化事業有限公司，2010。 陳俊偉，謝文郁，樊美筠編：《東西方的人生智慧觀》，香港︰天道書樓，2005。 陳鼓應︰《老子今註今譯及評介》，台北︰台灣商務印書館，1991。 陳鼓應︰《莊子今註今譯》，台北︰台灣商務印書館，1999。 張易編著：《道家的智慧》，臺北：廣達文化事業有限公司，2009。 張保勝譯：《薄伽梵歌》，北京：中國社會科學出版社，2007。 葉舟編著：《老子的智慧》，臺北：廣達文化事業有限公司，2007。 葉舟編著：《佛經的智慧》，臺北：廣達文化事業有限公司，2006。 黃儀章：《活出智慧人生︰舊約智慧書資訊研究︰箴言約伯記傳道書》，香港︰天道書樓有限公司，2004。 新元、豔品編著：《古蘭經智慧物語》，北京︰大眾文藝出版社，1999。 詹衡宇：《禪的人生智慧》，瀋陽︰萬卷出版公司，2005。 濟群：《心經的人生智慧》，蘭州︰甘肅民族出版社，2007。 戴浩輝︰《智慧文學導論》，香港︰道聲出版社，2008。", "terms": {"2023-24 Term 2": {"--LEC (4395)": {"startTimes": ["19:00"], "endTimes": ["21:30"], "days": [2], "locations": ["Esther Lee Bldg 307"], "instructors": ["Dr. CHOW Wai Yin"], "meetingDates": ["9/1", "16/1", "23/1", "30/1", "6/2", "20/2", "27/2", "5/3", "12/3", "19/3", "26/3", "2/4", "9/4", "16/4"]}}}, "assessments": {"Essays": "60", "Others": "10", "Presentation": "30"}}, {"code": "5328", "title": "Taoism, Health and Nourishing of Life", "career": "Postgraduate - Taught", "units": "3.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Div of Religious Studies", "requirements": "for the students of MA in Religious Studies", "description": "This course is designed to explore the rich heritage of Taoist self-cultivation tradition. The course begins with an understanding of Taoist cosmology and its correlation with human body by indepth reading of major Taoist texts, e.g. Inner Chapters of Baopu zi neipian, Wuzhen pian, Lingbao bifa, and Jinhua zongzhi. Students of this course will be taught how are how Taoist concept of qi shapes the understanding of health and perfection of human body, and develops the practices of self cultivation, e.g. inner alchemy, meditation, qigong exercises and etc. The approach of this course emphasizes lecture, discussion of reading materials and practice.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "5329", "title": "Buddhism, Right Mindfulness and Meditation", "career": "Postgraduate - Taught", "units": "3.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Div of Religious Studies", "requirements": "For the students of MA in Religious Studies", "description": "Centering on the notion of “right mindfulness”, this course aims to introduce students to the core topics on the Buddhist way to inner peace and happiness. The course will therefore address subjects such as affliction, self and no-self, the middle way, right mindfulness, and etc. Furthermore, the course will touch upon some common issues in modern life, and will investigate how they can gain inspirations from Buddhist perspectives, whether theoretical or practical. Towards the middle and the end of the course, students will learn essential methods of meditation based on Buddhist mindfulness. Students will thereby acquire an initial experience of meditation and take the benefits of meditative concentration into every aspect of their life.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "5331", "title": "Special Topic in Religious Studies I", "career": "Postgraduate - Taught", "units": "3.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Div of Religious Studies", "requirements": "For the students of MA in Religious Studies", "description": "The specific topics of this course vary from year to year, depending on the expertise of the teacher of that particular year. Generally, they can be topics and issues related to different religious traditions, religion and society, religion and culture, or religion and life.", "outcome": "The learning outcomes depend on the topic", "syllabus": "The specific topics of this course vary from year to year, depending on the expertise of the teacher of that particular year. Generally, they may be more advanced themes and theories related to different religious traditions, religion and society, religion and culture, or religion and life.", "required_readings": "The required readings depend on the topic. Always check the most updated version via the department's website (course outline).", "recommended_readings": "The recommended readings depend on the topic.Always check the most updated version via the department's website (course outline).", "terms": {"2023-24 Term 2": {"--LEC (4384)": {"startTimes": ["19:00"], "endTimes": ["21:30"], "days": [1], "locations": ["Esther Lee Bldg 206"], "instructors": ["Professor GUO Ting"], "meetingDates": ["8/1", "15/1", "22/1", "29/1", "5/2", "19/2", "26/2", "4/3", "11/3", "18/3", "25/3", "8/4", "15/4"]}}}}, {"code": "5332", "title": "Special Topic in Religious Studies II", "career": "Postgraduate - Taught", "units": "3.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Div of Religious Studies", "requirements": "For the students of MA in Religious Studies", "description": "The specific topics of this course vary from year to year, depending on the expertise of the teacher of that particular year. Generally, they may be more advanced themes and theories related to different religious traditions, religion and society, religion and culture, or religion and life.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "5333", "title": "Field Studies of Religious Culture", "career": "Postgraduate - Taught", "units": "3.00", "grading": "Graded", "components": "Others", "campus": "Main Campus", "academic_group": "Div of Religious Studies", "requirements": "For students of MA in Religious Studies.", "description": "Integrating classroom learning with field work in relation to religious culture, this course is designed to help students truly comprehend textual knowledge and develop deeper insights into religious understanding by engaging in the spatial, geographical and material dimensions of particular religious traditions. This is a three-credit course in which the majority of the academic work is accomplished through group study and travel to some carefully selected religious sites, whether overseas or domestic. It aims to provide students with a lively and effective learning experience at an off-campus location for a minimum of three overnights, and enhances the student’s classroom learning through first-hand exposure to the religious relics and material culture. Each study tour will be organized and headed by experienced members of teaching staff. The specific sites of visit will depend on the subject and theme of study designed by the teacher who offers the course in a particular year.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "5335", "title": "Understanding Religion through Film", "career": "Postgraduate - Taught", "units": "3.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Div of Religious Studies", "requirements": "For students in MA in Religious Studies", "description": "This course is designed to assist students in recognizing religious concepts, east and west, through analyzing movies that seem to have to do with “religion” per se. The course will help students explore how religion may be treated as an integral human phenomena and how religion involves the fullness of the human world through film watching.In addition, the course provides students with opportunities to think critically about a wide range of meanings concerning the existence of human beings through particular films. A religious notion of interpretation will be taken to examine how the meanings are constructed and transmitted to viewers through various visual narrative forms and symbols. It also encourages students to appreciate the form of cinematic aesthetics and symbols from the interdisciplinary perspectives.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "6001", "title": "Graduate Seminar I", "career": "Postgraduate - Research", "units": "3.00", "grading": "Graded", "components": "Seminar", "campus": "Main Campus", "academic_group": "Div of Religious Studies", "requirements": "For students in MPhil-PhD Religious Studies", "description": "The purpose of this course is to give first-year M. Phil. and Ph.D. students an opportunity to report on and discuss their independent research and thesis writing.", "outcome": "- Engage in literary analysis of texts and images related to graduate students’ research topics; - Acquire critical familiarity with the uses and limitations of major theoretical approaches and frameworks for analysis of the topics concerned", "syllabus": "1. Introduction2. Lecture3. Discussion of paper4. Discussion of paper5. Discussion of paper6. Preparing literature survey7. Preparing research paper8. Literature survey9. Literature survey 10. Literature survey11. Research paper12. Research paper13. Research paper The syllabus and assessment type may vary according to the teaching staff and year of offering. Please refer to the course outline for details. ", "required_readings": "The reading list may vary depending of the teaching staff and the year of offering.Please refer to the course outline for details.", "recommended_readings": "The reading list may vary depending of the teaching staff and the year of offering.Please refer to the course outline for details.", "terms": {"2023-24 Term 2": {"-S01-SEM (4271)": {"startTimes": ["10:30"], "endTimes": ["13:15"], "days": [3], "locations": ["Wong Foo Yuan Bldg 107A"], "instructors": ["Professor LAI Chi Tim"], "meetingDates": ["10/1", "17/1", "24/1", "31/1", "7/2", "21/2", "28/2", "6/3", "13/3", "20/3", "27/3", "3/4", "10/4", "17/4"]}}}, "assessments": {"Essays": "60", "Presentation": "20", "Report": "20"}}, {"code": "6002", "title": "Graduate Seminar II", "career": "Postgraduate - Research", "units": "3.00", "grading": "Graded", "components": "Seminar", "campus": "Main Campus", "academic_group": "Div of Religious Studies", "requirements": "For students in MPhil-PhD Religious Studies", "description": "The purpose of this course is to give second-year M. Phil. and Ph.D. students an opportunity to report on and discuss their independent research and thesis writing.", "outcome": "- Engage in literary analysis of texts and images related to graduate students’ research topics; - Acquire critical familiarity with the uses and limitations of major theoretical approaches and frameworks for analysis of the topics concerned", "syllabus": "1. Course introduction2. Class discussion3. Presentation preparation4. Presentation preparation5. Presentation preparation6. Presentation and discussion7. Presentation and discussion8. Presentation and discussion9. Presentation and discussion10. Presentation and discussion11. Course conclusion The syllabus and assessment type may vary according to the teaching staff and year of offering. Please refer to the course outline for details. ", "required_readings": "The reading list may vary depending of the teaching staff and the year of offering.Please refer to the course outline for details.", "recommended_readings": "The reading list may vary depending of the teaching staff and the year of offering.Please refer to the course outline for details.", "terms": {"2023-24 Term 1": {"-S01-SEM (4198)": {"startTimes": ["14:30"], "endTimes": ["17:15"], "days": [5], "locations": ["Lady Shaw Bldg LT3"], "instructors": ["Professor LAI Pan Chiu"], "meetingDates": ["8/9", "15/9", "22/9", "29/9", "6/10", "13/10", "20/10", "27/10", "3/11", "10/11", "17/11", "24/11", "1/12"]}}}, "assessments": {"Discussion": "20", "Essays": "60", "Presentation": "20"}}, {"code": "6113", "title": "Chinese Religions: Seminar I", "career": "Postgraduate - Research", "units": "3.00", "grading": "Graded", "components": "Seminar", "campus": "Main Campus", "academic_group": "Div of Religious Studies", "requirements": "For students in MPhil-PhD Religious Studies", "description": "Discussion in seminar setting on selected issues related to studies of Chinese religions. Emphasis will be placed on the interactions among different religious traditions in local Chinese society. Students are allowed to take these courses for more than once, and gain the units each time they pass the course. The specific content will be designed by the teacher who offers the courses.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "6114", "title": "Chinese Religions: Seminar II", "career": "Postgraduate - Research", "units": "3.00", "grading": "Graded", "components": "Seminar", "campus": "Main Campus", "academic_group": "Div of Religious Studies", "requirements": "For students in MPhil-PhD Religious Studies", "description": "Discussion in seminar setting on selected issues related to studies of Chinese religions. Emphasis will be placed on the interactions among different religious traditions in local Chinese society. Students are allowed to take these courses for more than once, and gain the units each time they pass the course. The specific content will be designed by the teacher who offers the courses.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "6115", "title": "Buddhist Studies: Seminar I", "career": "Postgraduate - Research", "units": "3.00", "grading": "Graded", "components": "Seminar", "campus": "Main Campus", "academic_group": "Div of Religious Studies", "requirements": "For students in MPhil-PhD Religious Studies", "description": "This seminar examines Buddhism as a dynamic process of borrowing, conflict and interaction between and within traditions that have been identified as Buddhist. We will begin by studying some representative works of both primary and secondary source (such as those put together by Donald Lopez in his Buddhism in Practice). Specific themes and topics will then be chosen in accordance with students’ interest for in-depth examination. The specific content will be designed by the teacher who offers the courses.", "outcome": "- Acquire basic knowledge of Buddhist studies;  - Develop skills in analytical reading, formal writing and critical thinking; - Relate Buddhist concepts and persuasions to their ethical cultivation and views of life as well as to their coexistence with the nature.", "syllabus": "The syllabus and assessment type may vary according to the teaching staff and year of offering. Please refer to the course outline for details.", "required_readings": "The reading list may vary depending of the teaching staff and the year of offering.Please refer to the course outline for details.", "recommended_readings": "The reading list may vary depending of the teaching staff and the year of offering.Please refer to the course outline for details.", "terms": {"2023-24 Term 1": {"-S01-SEM (1374)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["No Room Required"], "instructors": ["Professor TAM Wai Lun"], "meetingDates": ["04/09/2023 - 27/11/2023"]}}}, "assessments": {"Essays": "60", "Presentation": "40"}}, {"code": "6116", "title": "Buddhist Studies: Seminar II", "career": "Postgraduate - Research", "units": "3.00", "grading": "Graded", "components": "Seminar", "campus": "Main Campus", "academic_group": "Div of Religious Studies", "requirements": "For students in MPhil-PhD Religious Studies", "description": "This seminar examines Buddhism as a dynamic process of borrowing, conflict and interaction between and within traditions that have been identified as Buddhist. We will begin by studying some representative works of both primary and secondary source (such as those put together by Donald Lopez in his Buddhism in Practice). Specific themes and topics will then be chosen in accordance with students’ interest for in-depth examination. The specific content will be designed by the teacher who offers the courses.", "outcome": "- Acquire basic knowledge of Buddhist studies;  - Develop skills in analytical reading, formal writing and critical thinking; - Relate Buddhist concepts and persuasions to their ethical cultivation and views of life as well as to their coexistence with the nature.", "syllabus": "The syllabus and assessment type may vary according to the teaching staff and year of offering. Please refer to the course outline for details.", "required_readings": "The reading list may vary depending of the teaching staff and the year of offering.Please refer to the course outline for details.", "recommended_readings": "The reading list may vary depending of the teaching staff and the year of offering.Please refer to the course outline for details.", "terms": {"2023-24 Term 2": {"-S01-SEM (9407)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["No Room Required"], "instructors": ["Professor TAM Wai Lun"], "meetingDates": ["08/01/2024 - 15/04/2024"]}}}, "assessments": {"Essays": "60", "Presentation": "40"}}, {"code": "6121", "title": "Taoist Studies: Seminar I", "career": "Postgraduate - Research", "units": "3.00", "grading": "Graded", "components": "Seminar", "campus": "Main Campus", "academic_group": "Div of Religious Studies", "requirements": "For students in MPhil-PhD Religious Studies", "description": "Discussion in seminar setting on selected issues related to Taoism. Readings may include Taoist Canon, Taoist ritual manuscripts, and recent scholars’ work on Taoist studies. Students are allowed to take these courses for more than once, and gain the units each time they pass the course. The specific content will be designed by the teacher who offers the courses.", "outcome": "- Acquire basic knowledge of Taoist studies;  - Develop skills in analytical reading, formal writing and critical thinking; - Relate Taoist concepts and persuasions to their ethical cultivation and views of life as well as to their coexistence with the nature", "syllabus": "The syllabus and assessment type may vary according to the teaching staff and year of offering. Please refer to the course outline for details.", "required_readings": "The reading list may vary depending of the teaching staff and the year of offering.Please refer to the course outline for details.", "recommended_readings": "The reading list may vary depending of the teaching staff and the year of offering.Please refer to the course outline for details.", "terms": {"2023-24 Term 1": {"-S01-SEM (9513)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["TBA"], "instructors": ["Professor LAI Chi Tim"], "meetingDates": ["04/09/2023 - 27/11/2023"]}}}, "assessments": {"Essays": "60", "Presentation": "40"}}, {"code": "6122", "title": "Taoist Studies: Seminar II", "career": "Postgraduate - Research", "units": "3.00", "grading": "Graded", "components": "Seminar", "campus": "Main Campus", "academic_group": "Div of Religious Studies", "requirements": "For students in MPhil-PhD Religious Studies", "description": "Discussion in seminar setting on selected issues related to Taoism. Readings may include Taoist Canon, Taoist ritual manuscripts, and recent scholars’ work on Taoist studies. Students are allowed to take these courses for more than once, and gain the units each time they pass the course. The specific content will be designed by the teacher who offers the courses.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "6131", "title": "Biblical Studies: Seminar I", "career": "Postgraduate - Research", "units": "3.00", "grading": "Graded", "components": "Seminar", "campus": "Main Campus", "academic_group": "Div of Religious Studies", "requirements": "For students in MPhil-PhD Religious Studies", "description": "Discussion in seminar setting on special issues related to biblical studies. Students are allowed to take these courses for more than once, and gain the units each time they pass the course.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "6132", "title": "Biblical Studies: Seminar II", "career": "Postgraduate - Research", "units": "3.00", "grading": "Graded", "components": "Lecture\nSeminar", "campus": "Main Campus", "academic_group": "Div of Religious Studies", "requirements": "For students in MPhil-PhD Religious Studies", "description": "Discussion in seminar setting on special issues related to biblical studies. Students are allowed to take these courses for more than once, and gain the units each time they pass the course.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "6140", "title": "Christian Studies: Seminar I", "career": "Postgraduate - Research", "units": "3.00", "grading": "Graded", "components": "Lecture\nSeminar\nInteractive Tutorial", "campus": "Main Campus", "academic_group": "Div of Religious Studies", "requirements": "For students in MPhil-PhD Religious Studies", "description": "Discussion in seminar setting on specific issues related to Christian studies. Students are allowed to take these courses for more than once, and gain the units each time they pass the course. The specific content will be designed by the teacher who offers the courses.", "outcome": "- Be able to study the classical Christian studies;  - Acquire knowledge on the historical background and the main trends of development;  - Develop skills in analytical reading of some of the classical texts of Christian studies", "syllabus": "1         Introduction2        Theological & Philosophical Approaches to Religious DiversityReading: Chapters 1-3, 賴品超。《宗教都是殊途同歸？宗教研究與漢語神學的視角》。香港：道風書社，2020.11（出版中）。3         Comparative Studies of Religions    Reading: Chapters 4-6, 賴品超。《宗教都是殊途同歸？》。4         Chinese and Western Theologies of Religious Diversity  Reading: Chapters 7-9, 賴品超。《宗教都是殊途同歸？》。5         Pluralistic Understanding of Salvation(s)                Reading: Chapters 10-12, 賴品超。《宗教都是殊途同歸？》。6       Student presentation journal article / book chapter7       Student presentation journal article / book chapter8       Student presentation journal article / book chapter9        Buddhism and Christianity                Reading: (1) Lai, Pan-chiu. “Christian Mission and Buddhists.” Oxford Handbook of Mission Studies, edited by Kirsteen Kim and Alison Fitchett Climenhaga (Oxford: Oxford University Press, forthcoming 2021); (2) Lai, Pan Chiu and Rouyan Gu. “Self-love and Altruistic Love in Bodhicaryāvatāra: A Christian Theological Reflection.” The Brill Companion to Comparative Theology, edited by Pim Valkenburg (Leiden: Brill, forthcoming 2021); 10       Christian Theology and Public IssuesReading: (1) Lai, Pan-chiu. “Political Forgiveness: A Contextual and Multidisciplinary Dialogue with Reinhold Niebuhr.” Theology Today (forthcoming October 2020), forthcoming; (2) Lai, Pan-chiu. “Ecological Heritage of Protestantism in Chinese Christian Perspective.” Submitted to Ching Feng (New Series) 18.2 (forthcoming 2021).11     Student presentation of paper12      Student presentation of paper13      Student presentation of paper The syllabus and assessment type may vary according to the teaching staff and year of offering. Please refer to the course outline for details.", "required_readings": "The reading list may vary depending of the teaching staff and the year of offering.Please refer to the course outline for details.", "recommended_readings": "The reading list may vary depending of the teaching staff and the year of offering.Please refer to the course outline for details.", "terms": {"2023-24 Term 1": {"-S01-SEM (9450)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["No Room Required"], "instructors": ["Miss LI Shuen Man, \n\nProfessor YAM Cheuk Yin Colten"], "meetingDates": ["04/09/2023 - 27/11/2023"]}}}, "assessments": {"Discussion": "10", "Essays": "70", "Presentation": "20"}}, {"code": "6145", "title": "History of Christianity: Seminar I", "career": "Postgraduate - Research", "units": "3.00", "grading": "Graded", "components": "Lecture\nSeminar", "campus": "Main Campus", "academic_group": "Div of Religious Studies", "requirements": "For students in MPhil-PhD Religious Studies", "description": "Discussion in seminar setting on specific issues related to history of Christianity. Students are allowed to take these courses for more than once, and gain the units each time they pass the course.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "6146", "title": "History of Christianity: Seminar II", "career": "Postgraduate - Research", "units": "3.00", "grading": "Graded", "components": "Lecture\nSeminar", "campus": "Main Campus", "academic_group": "Div of Religious Studies", "requirements": "For students in MPhil-PhD Religious Studies", "description": "Discussion in seminar setting on specific issues related to history of Christianity. Students are allowed to take these courses for more than once, and gain the units each time they pass the course.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "6147", "title": "Chinese Christianity: Seminar I", "career": "Postgraduate - Research", "units": "3.00", "grading": "Graded", "components": "Seminar", "campus": "Main Campus", "academic_group": "Div of Religious Studies", "requirements": "For students in MPhil-PhD Religious Studies", "description": "This seminar course aims to reconsider various Christian doctrines from Chinese religious, philosophic and socio-cultural contexts. Students are allowed to take these courses for more than once, and gain the units each time they pass the course. The specific content will be designed by the teacher who offers the courses.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "6148", "title": "Chinese Christianity: Seminar II", "career": "Postgraduate - Research", "units": "3.00", "grading": "Graded", "components": "Seminar", "campus": "Main Campus", "academic_group": "Div of Religious Studies", "requirements": "For students in MPhil-PhD Religious Studies", "description": "This seminar course aims to reconsider various Christian doctrines from Chinese religious, philosophic and socio-cultural contexts. Students are allowed to take these courses for more than once, and gain the units each time they pass the course. The specific content will be designed by the teacher who offers the courses.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "6149", "title": "Christian Studies: Seminar II", "career": "Postgraduate - Research", "units": "3.00", "grading": "Graded", "components": "Lecture\nInteractive Tutorial", "campus": "Main Campus", "academic_group": "Div of Religious Studies", "requirements": "For students in MPhil-PhD Religious Studies", "description": "Discussion in seminar setting on specific issues related to Christian studies. Students are allowed to take these courses for more than once, and gain the units each time they pass the course. The specific content will be designed by the teacher who offers the courses.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "6151", "title": "Religion and Society: Seminar I", "career": "Postgraduate - Research", "units": "3.00", "grading": "Graded", "components": "Lecture\nSeminar", "campus": "Main Campus", "academic_group": "Div of Religious Studies", "requirements": "For students in MPhil-PhD Religious Studies", "description": "Discussion in seminar setting on specific issues related to Religion and Society. Students are allowed to take these courses for more than once, and gain the units each time they pass the course.", "outcome": "- Engage in literary analysis of texts and images related to topics in religion and society; - Acquire critical familiarity with the uses and limitations of major theoretical approaches and frameworks for analysis of topics in religion and society", "syllabus": "The syllabus and assessment type may vary according to the teaching staff and year of offering. Please refer to the course outline for details.", "required_readings": "The reading list may vary depending of the teaching staff and the year of offering.Please refer to the course outline for details.", "recommended_readings": "The reading list may vary depending of the teaching staff and the year of offering.Please refer to the course outline for details.", "terms": {"2023-24 Term 1": {"-S01-SEM (4203)": {"startTimes": ["14:30"], "endTimes": ["17:15"], "days": [1], "locations": ["William M W Mong Eng Bldg 706"], "instructors": ["Professor Douglas Matthew GILDOW"], "meetingDates": ["4/9", "11/9", "18/9", "25/9", "9/10", "16/10", "30/10", "6/11", "13/11", "20/11", "27/11"]}}}, "assessments": {"Essays": "60", "Presentation": "40"}}, {"code": "6152", "title": "Religion and Society: Seminar II", "career": "Postgraduate - Research", "units": "3.00", "grading": "Graded", "components": "Lecture\nSeminar", "campus": "Main Campus", "academic_group": "Div of Religious Studies", "requirements": "For students in MPhil-PhD Religious Studies", "description": "Discussion in seminar setting on specific issues related to Religion and Society. Students are allowed to take these courses for more than once, and gain the units each time they pass the course.", "outcome": "- Engage in literary analysis of texts and images related to topics in religion and society; - Acquire critical familiarity with the uses and limitations of major theoretical approaches and frameworks for analysis of topics in religion and society", "syllabus": "The syllabus and assessment type may vary according to the teaching staff and year of offering. Please refer to the course outline for details.", "required_readings": "The reading list may vary depending of the teaching staff and the year of offering.Please refer to the course outline for details.", "recommended_readings": "The reading list may vary depending of the teaching staff and the year of offering.Please refer to the course outline for details.", "terms": {"2023-24 Term 2": {"-S01-SEM (4389)": {"startTimes": ["14:30"], "endTimes": ["17:15"], "days": [5], "locations": ["Y.C. Liang Hall G01"], "instructors": ["Professor LAI Pan Chiu"], "meetingDates": ["12/1", "19/1", "26/1", "2/2", "16/2", "23/2", "1/3", "8/3", "15/3", "22/3", "5/4", "12/4", "19/4"]}}}, "assessments": {"Essays": "60", "Presentation": "40"}}, {"code": "6160", "title": "Islamic Studies: Seminar I", "career": "Postgraduate - Research", "units": "3.00", "grading": "Graded", "components": "Seminar", "campus": "Main Campus", "academic_group": "Div of Religious Studies", "requirements": "For students in MPhil-PhD in Religious Studies", "description": "This seminar examines Islam as a religion and civilization characterized by dynamics of borrowing, conflict, and interaction between and within traditions that are identified as “Islamic”. We will begin by studying some representative works of both primary and secondary source. Specific themes and topics will then be chosen in accordance with students’ interest for in-depth examination. The specific content will be designed by the teacher who offers the course.", "outcome": " To become well-versed in theoretical and practical vocabulary of the field of Islamic Studies; To deepen understanding of key theories, methods, concepts, and issues in the academic study of Islam; To understand the history, scriptures, doctrines, and practices of the Islamic tradition; Reading and analyzing primary source material from the Islamic tradition, including scriptures, legal, philosophical and mystical texts, etc.; Reading and analyzing scholarly texts in the academic study of Islam; Writing scholarly materials in genres appropriate to the field of the academic study of Islam, including research papers, exegetical essays, etc. To develop a critical yet sympathetic attitude in discussing subjects in Islamic Studies.", "syllabus": "Week 1: Meaning(s) of IslamWeek 2: Locating Islam in Time and SpaceWeek 3: Sharia and OrthopraxyWeek 4: Kalam and OrthodoxyWeek 5: SectarianismWeek 6: Sufism: Devotional PietyWeek 7: Political Islam   Week 8: Islamic Societies/StatesWeek 9: Is there an Islamic Culture?Week 10: Gender and Sexuality in IslamWeek 11: Islamic Revival(s) and Reform(s)Week 12: Islam and GlobalizationWeek 13: Islam in the Media", "required_readings": "Ali, Abdullah Yusuf, trans. The Qur'an Translation. Tahrike Tarsile Qur'an; 25th edition, 2009. (Or another approved translation of the Qurʾān).Ayoob, Mohammed. The Many Faces of Political Islam: Religion and Politics in the Muslim World. Ann Arbor: University of Michigan Press, 2008.Black, Antony. The History of Islamic Political thought:Ffrom the Prophet to the Present. 2nd ed. Edinburgh: Edinburgh University Press, 2011.Dabashi, Hamid. Shi'ism: A Religion of Protest. Cambridge, MA: Harvard University Press, 2012.Choueiri, Youssef M. ed. A Companion to the History of the Middle East. Oxford: Blackwell, 2005.Dabashi, Hamid. Shi'ism: A Religion of Protest. Cambridge, MA: Harvard University Press, 2012.Esposito, John L., ed. The Oxford History of Islam. Oxford: Oxford University Press, 2000.Fierro, Maribel, ed. The New Cambridge History of Islam. Cambridge: Cambridge University Press, 2008.Goldziher, Ignaz. Introduction to Islamic Theology and Law (Modern Classics in Near Eastern Studies). (Paperback) Translated by Andras and Ruth Hamori. Princeton, NJ: Princeton University Press, 1981.Haider, Najam. Shi'i Islam: An Introduction. Cambridge: Cambridge University Press, 2014.Hodgson, Marshall G. S. The Venture of Islam, Vol. 1. Chicago: Chicago Univ. Press, 1977.Hoyland, Robert G. In God's Path: The Arab Conquests and the Creation of an Islamic Empire. Oxford: Oxford University Press, 2015.Lapidus, Ira M. A History of Islamic Societies. Cambridge: Cambridge University Press, 1997.Murata, Sachiko and William C. Chittick, The Vision of Islam. St. Paul, MN: Paragon House, 1994.Schulze, Reinhard. A Modern History of the Islamic World. London; New York: I.B. Tauris, 2000. ", "recommended_readings": "Bennison, Amira. The Great Caliphs: The Golden Age of the 'Abbasid Empire. New Haven: Yale University Press, 2009.Choueiri, Youssef M. ed. A Companion to the History of the Middle East. Oxford: Blackwell, 2005.Mahmood, Saba. Politics of Piety: The Islamic Revival and the Feminist Subject. Princeton, New Jersey: Princeton University Press, 2011.Mottahedeh, Reza. The Mantle of the Prophet: Religion and Politics in Iran. New York: Pantheon Books, 1985.Wickham, Carrie. The Muslim Brotherhood: Evolution of an Islamist Movement. Princeton, New Jersey: Princeton University Press, 2013.", "terms": {"2023-24 Term 1": {"-S01-SEM (4212)": {"startTimes": ["10:30"], "endTimes": ["13:15"], "days": [4], "locations": ["Esther Lee Bldg 204"], "instructors": ["Professor James D FRANKEL"], "meetingDates": ["7/9", "14/9", "21/9", "28/9", "5/10", "12/10", "19/10", "26/10", "2/11", "9/11", "16/11", "23/11", "30/11"]}}}, "assessments": {"Essays": "60", "Presentation": "30", "Participation": "10"}}, {"code": "8003", "title": "Thesis Research", "career": "Postgraduate - Research", "units": "3.00", "grading": "Graded", "components": "Thesis Monitoring Course", "campus": "Main Campus", "academic_group": "Div of Religious Studies", "requirements": "For students in MPhil-PhD Religious Studies", "description": "In this course, a student is required to meet with his/her supervisor regularly who provides necessary guidance and supervision to write up a thesis and monitors the student’s academic progress.", "outcome": "- Engage in research related to students’ research topics by attending conferences, conducting field works, participating in exchange programmes, regular meetings with supervisors, presentations and scholarly exchange with peers and visiting academic parties", "syllabus": "The syllabus and assessment type may vary according to the teaching staff. ", "required_readings": "The reading list may vary depending of the teaching staff and the year of offering. ", "recommended_readings": "The reading list may vary depending of the teaching staff and the year of offering. ", "terms": {"2023-24 Term 1": {"-M01-TMC (2101)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["No Room Required"], "instructors": ["Staff"], "meetingDates": ["04/09/2023 - 27/11/2023"]}}, "2023-24 Term 2": {"-M01-TMC (2124)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["No Room Required"], "instructors": ["Staff"], "meetingDates": ["08/01/2024 - 15/04/2024"]}}}, "assessments": {"Discussion": "50", "Participation": "50"}}, {"code": "8006", "title": "Thesis Research", "career": "Postgraduate - Research", "units": "6.00", "grading": "Graded", "components": "Thesis Monitoring Course", "campus": "Main Campus", "academic_group": "Div of Religious Studies", "requirements": "For students in MPhil-PhD Religious Studies", "description": "In this course, a student is required to meet with his/her supervisor regularly who provides necessary guidance and supervision to write up a thesis and monitors the student’s academic progress.", "outcome": "- Engage in research related to students’ research topics by attending conferences, conducting field works, participating in exchange programmes, regular meetings with supervisors, presentations and scholarly exchange with peers and visiting academic parties", "syllabus": "The syllabus and assessment type may vary according to the teaching staff.", "required_readings": "The reading list may vary depending of the teaching staff.", "recommended_readings": "The reading list may vary depending of the teaching staff.", "terms": {"2023-24 Term 1": {"-M01-TMC (2102)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["No Room Required"], "instructors": ["Staff"], "meetingDates": ["04/09/2023 - 27/11/2023"]}}, "2023-24 Term 2": {"-M01-TMC (2554)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["No Room Required"], "instructors": ["Staff"], "meetingDates": ["08/01/2024 - 15/04/2024"]}}}, "assessments": {"Discussion": "50", "Participation": "50"}}, {"code": "8012", "title": "Thesis Research", "career": "Postgraduate - Research", "units": "12.00", "grading": "Graded", "components": "Thesis Monitoring Course", "campus": "Main Campus", "academic_group": "Div of Religious Studies", "requirements": "For students in MPhil-PhD Religious Studies", "description": "In this course, a student is required to meet with his/her supervisor regularly who provides necessary guidance and supervision to write up a thesis and monitors the student’s academic progress.", "outcome": "- Engage in research related to students’ research topics by attending conferences, conducting field works, participating in exchange programmes, regular meetings with supervisors, presentations and scholarly exchange with peers and visiting academic parties", "syllabus": "The syllabus and assessment type may vary according to the teaching staff.", "required_readings": "The reading list may vary depending of the teaching staff.", "recommended_readings": "The reading list may vary depending of the teaching staff.", "terms": {"2023-24 Term 1": {"-M01-TMC (2100)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["No Room Required"], "instructors": ["Staff"], "meetingDates": ["04/09/2023 - 27/11/2023"]}}, "2023-24 Term 2": {"-M01-TMC (2555)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["No Room Required"], "instructors": ["Staff"], "meetingDates": ["08/01/2024 - 15/04/2024"]}}}, "assessments": {"Discussion": "50", "Participation": "50"}}]