[{"code": "5001", "title": "Method and History of Religious Studies", "career": "Postgraduate - Research", "units": "3.00", "grading": "Graded", "components": "Lecture\nSeminar", "campus": "Main Campus", "academic_group": "Div of Religious Studies", "requirements": "For students in MPhil-PhD Religious Studies or Master of Divinity", "description": "This course will be built around readings concerning methodology and history of the discipline of the “History of Religions”. Study of selected figures and methodological approaches to religions, including phenomenological, psychological, structural, hermeneutical and sociological methods, will also be covered. The purpose of this course is to acquaint students with a sophisticated knowledge of the theories and methods in research on different forms of religious manifestations.", "outcome": "- Become well-versed in the theoretical vocabulary of the field of religious studies; - Deepen understanding of key theories, methods, concepts and issues in the academic study of religion; - Reflect on the relationship between religion and the human condition; - Engage in critical analysis of religious phenomena using the perspectives of key theories and methods in the academic study of religion; - Develop a critical yet sympathetic attitude in discussing religious phenomena", "syllabus": " A Point of Departure  : Jonathan Z. Smith. “Religion, Religions, Religious” in Critical   Terms for Religious Studies, Edited by Mark C. Taylor, Chicago, University of Chicago Press, 1998, pp. 269-284.       2.     Introduction to the Study of Religion                    Reading: Pals. Nine Theories of Religion, “Introduction”, pp. 1-14 3.     Animism and Magic: E. B. TYLOR AND J. G. FRAZERReading: Pals. Nine Theories of Religion, Ch. 1, pp. 15-48 4.     Religion and Personality: SIGMUND FREUDReading: Pals. Nine Theories of Religion, Ch. 2, pp. 49-80 5.    Society as Sacred: ÉMILE DURKHEIMReading: Pals. Nine Theories of Religion, Ch. 3, pp. 81-112 6.     Religion as Alienation: KARL MARXReading: Pals. Nine Theories of Religion, Ch. 4, pp. 113-142 7.     A Source of Social Action: MAX WEBERReading: Pals. Nine Theories of Religion, Ch. 5, pp. 143-184 8.     The Verdict of Religious Experience: WILLIAM JAMESReading: Pals. Nine Theories of Religion, Ch. 6, pp. 185-226 9.     The Reality of the Sacred: MIRCEA ELIADEReading: Pals. Nine Theories of Religion, Ch. 6, pp. 227-262 10.  Society’s “Construct of the Heart”: E. E. EVANS-PRITCHARD Reading: Pals. Nine Theories of Religion, Ch. 7, pp. 263-292 11.   Religion as Cultural System: CLIFFORD GEERTZ              Reading: Pals. Nine Theories of Religion, Ch. 8, pp. 293-324 12.   ConclusionReading: Pals. Nine Theories of Religion, “Conclusion”, pp. 292-323 13.   Post-script : James Murphy. “Beyond ‘Religion’ and ‘Spirituality’: Extending a ‘Meaning Systems’ Approach to Explore Lived Religion” in Archive for the Psychology of Religion (2017) 1-26. REMARKS: The syllabus and assessment type may vary depending on the teaching staff. ", "required_readings": "Basic text:     Daniel L. Pals. Nine Theories of Religion. 3rd Ed. Oxford: Oxford University Press, 2015.", "recommended_readings": "", "terms": {"2024-25 Term 1": {"--LEC (1392)": {"startTimes": ["14:30"], "endTimes": ["17:15"], "days": [4], "locations": ["Esther Lee Bldg 304"], "instructors": ["Professor James D FRANKEL"], "meetingDates": ["5/9", "12/9", "19/9", "26/9", "3/10", "10/10", "17/10", "24/10", "31/10", "7/11", "14/11", "21/11", "28/11"]}}}, "assessments": {"Essays": "50", "Presentation": "30", "Participation": "20"}}, {"code": "5005", "title": "Theories of Religious Studies", "career": "Postgraduate - Taught", "units": "3.00", "grading": "Graded", "components": "Lecture\nInteractive Tutorial", "campus": "Main Campus", "academic_group": "Div of Religious Studies", "requirements": "For students of MA in Religious Studies, Master of Divinity", "description": "From the establishment of the sociological endeavor, the study of religion has been central to the understanding of modern societies. This course will continue in this tradition by surveying the interactions between religion and society while developing the sociological and Anthropological approach to the study of religion as a social institution. In particular, we will look at the ways in which religion is transformed by, and plays a role in the transformation of, a global society. This course is designed to give students tools and concepts with which to understand the social organization of religion and the role of religion in society. We will focus on classical and emerging themes in the field, and analyze case studies that relate to them. Students will: -learn how religion is shaped by and, in turn, shapes the larger social field in which it exists;-become familiar with the dynamics of secularization, ecological theories, and other developments;-develop an understanding of the ways in which religion interacts with other social institutions such as the state and economy, and culture. ", "outcome": "Knowledge Outcomes: - Upon completion of the subject, student will be able to  - Understand the establishment of knowledge of Religious Studies and research ethics;  - Learn the key writers on Religious Studies;  - Understand the key theories of Religious Studies in classical themes;  - Learn the major issues in the field of Religious Studies in contemporary scholarship;  - Develop the critical thinking on the debates regarding religious diversity, migration and religion, religious movement and so on.", "syllabus": "Introduction and Overview  The Construction of a Subject  Foundation and Methods I: Foundation II: Economics and Religion Foundation II: Economics and Religion Secularization Individuals, Rituals, and Practices Religion and Gender Organizations and Collectivities  Migration and Religion Religion and Social Change (in Chinese Society) Religion and the Public  Urban and Ecological Approach", "required_readings": "• Robert A.Orsi,\"Snakes Alive: Resituating the Moral in the Study of Religion\", In Face of the Facts: Moral Inquiry in American Scholarship, Cambridge: Cambridge University Press, 1998, Pages: 201-226. • Clifford Geertz, \"Religion as a Cultural System,” Interpretation of Cultures, New York: Basic Book, 1973, Pages: 87-125. • Emile Durkheim, \"Introduction and Chapter 1\", Elementary Forms of Religious Life, Oxford: Oxford University Press, 2001. • 黎志添：<導論：宗教研究的歷史舆方法>，《宗教研究舆詮释學》。香港：香港中文大學出版社，2003，頁1-12。 • Max Weber, The Protestant Ethic and the Spirit of Capitalism, New York: W.W. Norton & Co, 2009. Chapter 4 and 5.  • Peter Berger, \"Chapters 1-4\", The Sacred Canopy, New York: Garden City, 1967, Pages: 3-101. • Jose Casanova, \"Chapters 1 and 2\", Public Religions in the Modern World, Chicago: University of Chicago, 1994.  • James Beckford, \"Accounting for conversion\", British Journal of Sociology 29:2（1978）249-262.  • 譚偉倫，<中國地方宗教儀式>，《中國地方宗教儀式論集》。譚偉倫主編。香港：香港中文大學崇基學院宗教與中國社會研究中心，2011，頁1-15。 • Janet Jacobs, \"Women, Ritual and Secrecy: The Creation of Crypto-Jewish Culture,\" JSSR, 35. 2 (1996) 97-108.  • Saba Mahmood. “Feminist Theory, Embodiment, and the Docile Agent: Some reflections On the Egyptian Islamic Revival.” Cultural Anthropology 16.2 (2001): 202-236. • Stephen Warner, \"The Place of the Congregation in the Contemporary American Religious Configuration\", American Congregations, Chicago: University of Chicago Press, 1994. Pp. 54-99.  • Eileen Barker, \"New Religious Movements: Their Incidence and Significance\", New Religious Movements: Challenge and Response, London: Routledge, 1999. • Zhe JI. \"Buddhist Institutional Innovations\" in Modern Chinese Religion II: 1850-2015. Pp. 731-766.  • Stephen Warner and Judith Wittner, eds. Gatherings in the Diaspora: Religious Communities and the New Immigration. Philadelphia: Temple University Press, 1998.  • Vincent Goossaert and David Palmer. The Religious Question in Modern China. Chicago: University of Chicago Press, 2010.  • Richard Madsen, Democracy's Dharma: Religious Renaissance and Political Develpment in Taiwan, Berkeley: University of California Press, 2007. • Ammernam, Studying congregations: a new handbook, Nashville : Abingdon Press, 1998.", "recommended_readings": "• Max Weber, \"Chapters 1-4\", The Sociology of Religion, Boston : Beacon Press,1993, Pages: 1-59. • Nancy Ammerman, Bible Believers: fundamentalists in the modern world, London: Rutgers University Press, 1987.  • Peter Berger, \"Chapters 5-7\", The Sacred Canopy, New York: Garden City, 1967, Pages: 105-174.  • Bryan Wilson, Religion in Secular Society，London: Watts, 1966. • Ortner, \"Theory in Anthropology Since the 1960's \", Comparative Studies in Society and History 26:1(1984) 126-166.  • Robert Wuthnow, The Restructuring of American Religion, Princeton: Princeton University Press, 1988. • Jody Shapiro Davie, Women in the Presence, Philadelphia: University of Pennsylvania Press,1995.  • David Martin, Pentecostalism: The World Their Parish, Oxford: Blackwell Publishers, 2002. • Robert Weller, Alternate Civilities: Democracy and Culture in China and Taiwan, Boulder: Westview Press, 1999. • 邢福增，梁家麟：《五十年代三自運動的研究》，香港：建道神學院，1996. • 邢福增，《新酒與舊皮袋：中國宗教立法與<宗教事務條例解讀>》，香港：中文大學崇基學院宗教與中國社會研究中心，2006。", "terms": {"2024-25 Term 1": {"--LEC (1065)": {"startTimes": ["19:00"], "endTimes": ["21:30"], "days": [3], "locations": ["Esther Lee Bldg 302"], "instructors": ["Professor GUO Ting"], "meetingDates": ["4/9", "11/9", "25/9", "2/10", "9/10", "16/10", "23/10", "30/10", "6/11", "13/11", "20/11", "27/11", "4/12"]}}}, "assessments": {"Essays": "70", "Presentation": "30"}}, {"code": "5115", "title": "Reading on Chinese Religious Texts", "career": "Postgraduate - Research", "units": "3.00", "grading": "Graded", "components": "Seminar", "campus": "Main Campus", "academic_group": "Div of Religious Studies", "requirements": "For students in MPhil-PhD Religious Studies or Master of Divinity", "description": "This course centres on the study of the literature of the Han Dynasty which is formative of the chief religious concepts such as cosmology, anthropology and soteriology, with the aim of understanding of the principles of religious theory construction in traditional China.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "5118", "title": "Studies on Chinese Buddhism", "career": "Postgraduate - Taught", "units": "3.00", "grading": "Graded", "components": "Lecture\nSeminar", "campus": "Main Campus", "academic_group": "Div of Religious Studies", "requirements": "For students in MA Religious Studies or MA Buddhist Studies", "description": "This course studies major traditions in Chinese Buddhism including Chan, Pure Land, Huayen and Tiantai Buddhism. We also seek to understand the Chinese Buddhist tradition by utilizing some recent researches in the field. Some examples are the research on northern school of Chan Buddhism by John McRae and Bernard Faure, on Pure Land Buddhism by Luis Gomez and Richard Payne, on Buddhism in the Song especially Tiantai Buddhism by Peter Gregory and Daniel Getz. Secondary sources will be used together with selected primary sources to stimulate discussion in class.", "outcome": "Knowledge outcomes - By the end of the course, students will have basic understanding of sinicization of Chinese Buddhism; understand the ideas and ideals of the great Buddhist masters in ancient China. Skill outcomes - Students will be able to develop skills in analytical reading, formal writing and critical thinking. Attitude outcomes - Students will relate Buddhist concepts and persuasions to their ethical cultivation and views of life as well as to their coexistence with the nature.", "syllabus": "1. Course introduction/ Introduction of the development and sources  2. The Previous Fruitful Result of the Research of Chinese Buddhism 3. Introduction to Buddhism: Brief History and Major Doctrine 4. The Entry of Buddhism to China 5. The Rise of the Eight Schools of Chinese Buddhism 6. Chan School of Chinese Buddhist 7. North and South Schools of Chan Buddhism 8. The Belief of Pure Land 9. Buddhism in the Sung 10. The Development of the Lay Buddhism 11. Humanistic Buddhism in Modern World 12. Practices of Buddhist Rituals 13. Contemporary Buddhism in Hong Kong", "required_readings": "*Zürcher, Erik (1959), The Buddhist Conquest of China. The Spread and Adaptation of Buddhism in Early Medieval China, Leiden (Brill), 2 delen, vol. 1: Text, vol. 2: Notes, bibliography, indexes, (Sinica Leidensia, vol. 11). Chen, Kenneth K. S. (1964), Buddhism in China, a historical survey (Princeton, N.J.: Princeton University Press). * -------------------------- (1973) Chinese Transformation of Buddhism (Princeton Uni. Press). *方立天 (1988),《中國佛教與傳統文化》(上海：上海人民出版社), 頁47-94. *方立天 (1988),《中國佛教與傳統文化》(上海：上海人民出版社), 頁69-94. *中村元主編 (1984),《中國佛教發展史》上 (臺北：天華出版事業),頁238-266. *方立天 (1988),《中國佛教與傳統文化》(上海：上海人民出版社), 頁69-94. *中村元主編 (1984),《中國佛教發展史》上 (臺北：天華出版事業),頁238-266. 黃偉雄，〈菩提達摩在中國禪宗史的地位〉載於《國際佛學研究第二期》（1992.12出版），頁12-27。(http://ccbs.ntu.edu.tw/FULLTEXT/JR-BJ006/bj6_2_01.htm) 楊維中(2002)，〈從南宗與北宗心性思想的差別看禪宗的正式形成〉，載於《中國禪學》(http://www.guoxue.com/magzine/zgcx/zgcx115.htm)  楊維中(1999)，〈佛性與禪悟---南宗禪三系心性思想的區別〉載於《哲學雜誌》第三十期 (http://ccbs.ntu.edu.tw/FULLTEXT/JR-MISC/misc093495.htm) *汪娟(1992.07)，〈唐代彌勒信仰與佛教諸宗派的關係〉載於《中華佛學學報》，第五期，pp.193-231。 *方立天(1998)，〈人生理想境界的追求─中國佛教淨土思潮的演變與歸趣〉，載《法鼓文化》，頁287-304。 *Gregory, Peter N. and Daniel A. Getz, Jr. edit. (1999), Buddhism in the Sung (Honolulu: University of Hawaii Press), ‘Introduction’. *釋聖嚴﹕〈明末居士佛教〉載於《華岡佛學學報》第五期，頁11網上版﹕(http://www.chibs.edu.tw/publication/c_index.htm) 溫金柯：〈臺灣居士佛教的展望〉，載江燦騰、龔鵬程主編之《臺灣佛教的歷史與文化》，(台灣﹕靈鷲山般若文教基金會國際佛學文化出版社, 1994)。 藍吉富編：〈當代中國人的佛教研究〉，載江燦騰主編之《商鼎佛學名著選刊》（一），商鼎文化出版社, 1993。 *Don Pittman, Toward A modern Chinese Buddhism: Taixu’s Reforms. Honolulu: University of Havai’i Press, 2001: 13-60. *Chandler, Stuart, ‘Buddhism in China and Taiwan: The dimensions of Contemporary Chinese Buddhism’ in Berkwitz, Stephen C. (ed.), Buddhism in World Cultures: Comparative Perspectives (Santa Barbara (US): ABC-CLIO, 2006), pp.169-194. 陳兵, 鄧子美﹕《二十世紀中囯佛敎》 (北京市: 民族出版社, 2000),pp.196-217. 林子青﹕《中國佛敎規儀》(台北: 長春樹出版社, 1988). *Yo, Hsiang-Chou. (2001), “Chinese Buddhist Confessional Rituals: Their Origin and Spiritual Implications” in Kalupahana, David J. edited. 2001. Buddhist thought and ritual (Delhi: Motilal Banarsidass). Teiser, S. F. (1988), The Ghost Festival in Medieval China (Princeton: Princeton University Press). *牧田諦亮﹕〈水陸法會小考〉，載楊曾文、方廣錩編﹕《佛教與歷史文化》(北京﹕宗教文化出版社，2001)。 Stevenson, Daniel B., 'Text, Image, and Transformation in the History of Shuilu fahui, the Buddhist Rite for Deliverance of Creatures of Water and Land', in Marsha Weidner (ed.), Cultural Intersections in Later Chinese Buddhism (Honolulu: University of Hawaii Press, 2001), pp.30-70.  *Kwong, Chungwah, The Public Role of Religion in Post-Colonial Hong Kong: An Historical Overview of Confucianism, Taoism, Buddhism, and Christianity (Asian Thought and Culture, 53; New York: Peter Lang, 2002). *釋永明﹕《香港佛教與佛寺》 (香港﹕寶蓮禪寺, 1993). 葉文意﹕〈初期的香港佛教發展史﹕ 由晚清至1937〉, 載於《法相學會集刊》, Nov., 1992. 高永霄﹕〈香港佛教史〉, 載於《法相學會集刊》, Nov., 1992.", "recommended_readings": "", "terms": {"2024-25 Term 1": {"--LEC (1064)": {"startTimes": ["19:00"], "endTimes": ["21:30"], "days": [4], "locations": ["Hui Yeung Shing Bldg G04"], "instructors": ["Staff"], "meetingDates": ["5/9", "12/9", "19/9", "26/9", "3/10", "10/10", "17/10", "24/10", "31/10", "7/11", "14/11", "21/11", "28/11"]}}}, "assessments": {"Attendance": "5", "Essays": "65", "Presentation": "25", "Participation": "5"}}, {"code": "5121", "title": "Popular Religion in China", "career": "Postgraduate - Taught", "units": "3.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Div of Religious Studies", "requirements": "For students in MA Religious Studies or Master of Divinity", "description": "Recent researches on Chinese religion show that the term “three religions” or sanjiao monastic Buddhism, priestly Daoism, and Confucian philosophy - is not adequate to describe Chinese religiosity. To subsume several thousand years of Chinese religious experience under the term of “three religions”, in effect, is to exclude the vast majority of Chinese religious behaviour. In reality, only a few elite orient their lifestyles to the Buddhist or Taoist concepts of transcendence. Over emphasis on the intellectual and spiritual world of the scholarly official, the gentry and the literate elite, overlooks religious practices and beliefs of ordinary people, the peasants and the labourers who are the majority of the Chinese population. This course studies Chinese religion from the , traditional economy and village temples of various local societies in China.perspective of local society in South China. By making use of recent ethnographical studies on China, we examine Chinese religion from a holistic approach involving the analysis of lineage", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "5123", "title": "Taoist Thought", "career": "Postgraduate - Taught", "units": "3.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Div of Religious Studies", "requirements": "For students in MA Religious Studies or Master of Divinity", "description": "This course introduces the system of religious thought of Taoism in China. Topics that include Taoist ideas such as the Tao, Taoist gods, Taoist cosmology, human life and nature, canon, life after death, ritual and self-cultivation, and moral values will be examined.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "5126", "title": "History of Taoism I", "career": "Postgraduate - Research", "units": "3.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Div of Religious Studies", "requirements": "For students in MPhil-PhD Religious Studies", "description": "This course studies the early and medieval histories of religious Taoism during the period from the Six Dynasties until Tang Dynasty. The important historical development of the sects of the Way of Celestial Master, the Lingbao and the Shangqiing will be covered.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "5127", "title": "History of Taoism II", "career": "Postgraduate - Research", "units": "3.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Div of Religious Studies", "requirements": "For students in MPhil-PhD Religious Studies", "description": "This course will survey the developments of religious Taoism in late imperial China. The course will focus on the rise and spread of such new Taoist movements as the Quanzhen (Complete Perfection) school and Jingming (Pure Illumination) school, as well as the continuing penetration of the Zhengyi (Orthodox Unity) school into the national politics and local society.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "5129", "title": "Taoism and Chinese Culture", "career": "Postgraduate - Taught", "units": "3.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Div of Religious Studies", "requirements": "For students in MA Religious Studies or Master of Divinity", "description": "This course aims at a general study of Taoism in Chinese cultural context. The focus is on Taoist elements and values in Chinese art, music, drama, and literature. This will allow students not only to study Taoism as one of Chinese religious traditions, but also to understand the intersections of Taoism and various aspects of Chinese culture. No prior knowledge of Taoism is assumed.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "5131", "title": "Biblical Hermeneutics in Asian Perspectives", "career": "Postgraduate - Research", "units": "3.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Div of Religious Studies", "requirements": "For students in MPhil-PhD Religious Studies or Master of Divinity or MA Christian Studies", "description": "The course will focus on the recent development in biblical interpretation in Asia in the larger context of theological endeavours and religious studies of Asian scholars in their coming to terms with the diversity of Asian realities. Adequate attention will be paid to methodological issues in relation to the pluralistic religio-cultural traditions and the complex socio-political experiences of the Asian peoples. Biblical interpretation developed in various Asian countries will also be studied.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "5132", "title": "Advanced Biblical Exegesis I", "career": "Postgraduate - Research", "units": "3.00", "grading": "Graded", "components": "Classwork\nLecture", "campus": "Main Campus", "academic_group": "Div of Religious Studies", "requirements": "For students in MPhil-PhD Religious Studies or Master of Divinity", "description": "This course will focus on exegesis of selected passages from the Hebrew Bible or the New Testament. It would be an advantage if students have gone through either Hebrew Exegesis or New Testament Greek Exegesis.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "5133", "title": "Advanced Biblical Exegesis II", "career": "Postgraduate - Research", "units": "3.00", "grading": "Graded", "components": "Classwork\nLecture", "campus": "Main Campus", "academic_group": "Div of Religious Studies", "requirements": "For students in MPhil-PhD Religious Studies or Master of Divinity", "description": "This course will focus on exegesis of selected passages from the Hebrew Bible or the New Testament. It would be an advantage if students have gone through either Hebrew Exegesis or New Testament Greek Exegesis.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "5134", "title": "Gender Critical Interpretation of the Bible", "career": "Postgraduate - Research", "units": "3.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Div of Religious Studies", "requirements": "For students in MPhil-PhD Religious Studies or Master of Divinity or MA Christian Studies", "description": "The course introduces the approaches to reading and interpreting the Bible for the sake of gender equality and justice. It looks into the effects of gender injustice in the history of biblical interpretation and theology, and promotes interpreting the Bible with sensitivity towards gender inclusivity. It will cover both feminist and masculinity interpretations of the Bible.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "5135", "title": "Religion and Literature of the Bible", "career": "Postgraduate - Research", "units": "3.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Div of Religious Studies", "requirements": "For MPhil-PhD Religious Studies", "description": "This course is an advanced study of the biblical text (the Hebrew Bible and/or the New Testament) in the light of the contemporary critical biblical scholarship. The religious and cultural issues of ancient Israel and/or the early Christian church are to be tackled.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "5139", "title": "Readings in Semitic Languages", "career": "Postgraduate - Research", "units": "3.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Div of Religious Studies", "requirements": "For students in MPhil-PhD Religious Studies", "description": "This course is designed to introduce student to Semitic languages relating to the Hebrew Bible. Students will read some long and some short excerpts from either a) Aramaic and its many offshoots including Syriac, or b) Ugaritic or c) Akkadian, with its 2500-year-old history, or e) Classical Arabic, with elementary readings from the Qur’an or f) a comparative study of various Semitic languages which are similar. The direction the course will take depends upon the students’ needs and interests. This course will have in mind both the student of the Hebrew Bible, and the student who wants to gain a wider knowledge of the thought of ancient West Asia. In both cases, knowledge of Hebrew is required.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "5143", "title": "Contemporary Issues in Ethics, Society and Religion", "career": "Postgraduate - Taught", "units": "3.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Div of Religious Studies", "requirements": "For students in MA Religious Studies", "description": "This course attempts to explore the complexity of contemporary issues raised by ethics and society through a religious perspective. How religious thinking can be enriched and challenged by issues of bioethical, business, legal and political nature.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "5146", "title": "Religious Education and Personal Growth", "career": "Postgraduate - Taught", "units": "3.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Div of Religious Studies", "requirements": "For students in MA Religious Studies", "description": "This course will attempt to study some of the modern developmental theories such as Piaget’s cognitive developmental theory, Erikson’s socio-psychological theory, Kohlberg’ s moral developmental theory and Fowlers’ faith developmental theory. Special attention will be given to the evaluation of their signifi cance to education in a religious context.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "5219", "title": "The Hebrew Bible in Contexts", "career": "Postgraduate - Taught", "units": "3.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Div of Religious Studies", "requirements": "For students in MA Religious Studies", "description": "This course aims at introducing students to the approaches to reading the Hebrew Bible (The Christian Old Testament) in its literary, socio-political and religio-cultural contexts. The literary setting and historical background will be surveyed and explored in order to enhance students’ understanding of the text and the dynamics of the reading process.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "5273", "title": "Catholic Social Ethics", "career": "Postgraduate - Taught", "units": "3.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Div of Religious Studies", "requirements": "For students in MA Religious Studies or Master of Divinity", "description": "This course attempts to examine the principles and ways of Church’s responses to social issues from the Catholic faith tradition. Topics include the relationship between morality and spirituality, the foundation of social ethics, the methods of theological reflection and pastoral actions. Particular attention is given to Catholic Social Teachings and its development, and its perspectives on issues like human rights, economic justice and globalization, work and labour, ecology, political participation, racism, women’s status and so on. Catholic social movements and individuals will also be introduced.", "outcome": "Knowledge: - Understand the social ethics of Catholic; Skills: - Communication and presentation (oral and written) skills; - Critical and analytical skills; - Research skills.  Attitude:  - A heightened sensitivity to the religious dimension of human life, society and culture; - An analytical capability of the plurality and complexity of Catholic; - A critical yet sympathetic understanding and appreciation of Catholic.", "syllabus": " Introduction to Catholic social ethics The human person, natural law, and human rights Theology of the Church Care for the poor, Christian teaching, and the Eucharistic life History of Catholic social ethics I History of Catholic social ethics II Principles of Catholic social ethics Family, work, economy, & immigration I Family, work, economy, & immigration II The political community War, peace, and the international community Creation and care for the environment", "required_readings": "The reading list will be updated if deem necessary. Always check the most updated version via the department's website (course outline).Excerpts from the following Catholic documents (in English or Chinese): Compendium of the Social Doctrine of the Church (2004) The Catetchism of the Catholic Church (1992) Key texts from Popes or councils of past 150 years (e.g., Rerum Novarum, Gaudium et Spes, Populorum Progressio)Excerpts from the following texts and documents (mostly in English): Old and New Testaments; Basil the Great, Sermon to the Rich; Gregory of Nazianus, On Love for the Poor; John Chrystostom, Sermons on Wealth and Poverty; Gary Anderson, Charity: The Place of the Poor in the Biblical Tradition (Yale, 2013); Robert Louis Wilken, The First Thousand Years: A Global History of Christianity (Yale, 2012); J. Brian Benestad, Church, State, and Society: An Introduction to Catholic Social Doctrine (Catholic University of America, 2011).Most of the required readings are from the Catechism of the Catholic Church (CCC), the Compendium of the Social Doctrine of the Church (CSD), or the document Gaudium et Spes. They can be found in both English and Chinese on the Vatican website, www.vatican.va. Other readings will be distributed electronically.Catechism of the Catholic Church (CCC): http://www.vatican.va/archive/ccc/index.htmCompendium of the Social Doctrine of the Church (CSD): http://www.vatican.va/roman_curia/pontifical_councils/justpeace/documents/rc_pc_justpeace_compendio-dott-soc_en.htmlGaudium et Spes (GS): http://www.vatican.va/archive/hist_councils/ii_vatican_council/index.htm", "recommended_readings": "The reading list will be updated if deem necessary. Always check the most updated version via the department's website (course outline).", "terms": {"2024-25 Term 1": {"--LEC (1066)": {"startTimes": ["19:00"], "endTimes": ["21:30"], "days": [5], "locations": ["Esther Lee Bldg 206"], "instructors": ["Dr. LAM Wing Kwan Anselm"], "meetingDates": ["6/9", "13/9", "20/9", "27/9", "4/10", "18/10", "25/10", "1/11", "8/11", "15/11", "22/11", "29/11", "6/12"]}}}, "assessments": {"Attendance": "15", "Essays": "45", "Report": "40"}}, {"code": "5300", "title": "The Study of Islam", "career": "Postgraduate - Taught", "units": "3.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Div of Religious Studies", "requirements": "For students in MA Religious Studies or Master of Divinity", "description": "This course will introduce the basic concepts of Islam to the students i.e. fundamentals of faith, rituals of worship, Seerah of the Prophet of Islam, Islamic Civilization and Muslim contribution to different cultures. It will help the students to understand the contemporary issues in the light of Islamic teachings and the methodogical issues in Islamic Studies. The course has been designed for such students who have never studied Islamic Studies so far.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "5312", "title": "Hindu Visions of Divinity", "career": "Postgraduate - Taught", "units": "3.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Div of Religious Studies", "requirements": "For students in MA Religious Studies", "description": "Hindu religious traditions offer a rich variety of concepts as well as visualizations of divinity, from highly abstracted and nuanced notions of the Deity to highly tangible and specific images seen and elaborately venerated in temples. By close readings of classical sacred texts (in translation), viewing iconography, and discussion of India’s historical and social contexts in which texts and images have been embedded, this course will explore the fascinating amalgam of ritual, yoga, textual exegesis, and devotionalism of the Hindu religious world.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "5314", "title": "Buddhism and Culture", "career": "Postgraduate - Taught", "units": "3.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Div of Religious Studies", "requirements": "For students of MA in Religious Studies or MA in Buddhist Studies", "description": "This course provides an overview of the historical development of Buddhist culture in Asia. Main features elements of Buddhism in the diversified culture is highlighted. Theoretical foundations of Buddhist philosophy is delivered at the beginning, with reference to the development of the various Buddhist traditions, such as Theravada, Mahayana and Vajrayana. Their impact, evolution and integration on and into different cultures are being studies, with reference to the contemporary Buddhist practices. Comparisons amongst various cultural elements would be made, providing a greater in depth understanding of the different aspects of Buddhist Culture and the dynamism of Buddhism in its adaptation to different cultures. The course will end with discussing the role of Buddhism in its influence in reshaping the culture of modern society, highlighting facts that will help in the formation of a harmonious society.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "5316", "title": "Studies of Humanistic Buddhism", "career": "Postgraduate - Taught", "units": "3.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Div of Religious Studies", "requirements": "For students of MA in Religious Studies", "description": "From more than 2500 years, Buddhism has spread almost all parts of the world, and undergone the developments from Primitive Buddhism, Theravada, Mahayana, to Tantriyana. In the contemporary world, Humanistic Buddhism has become one of the mainstreams of Buddhist developments. And the ideas and practices for the welfare of society and benefit of humanity have dominated Buddhist activities. This course designed to study the development of Humanistic Buddhism, including the history, thoughts, and practices. This course is divided into three parts yet each part is organically connected with the others. We first investigate the basic doctrines of traditional Buddhism related to the arising and practice of humanistic Buddhism, such as the Four Noble Truth, the Dependent-Origination, the ideas and practices of Bodhisattva. Having understood the doctrinal foundation of Humanistic Buddhism, we then examine the history of humanistic Buddhism in the early Republic era (1912-1949). Social, political, religious, as well as economic background in which Humanistic Buddhism arose will be discussed so that students could have holistic picture about the interaction between Buddhist institutions and society then. The teaching and practice of some pioneers of Humanistic Buddhism, such as Ven. Taixu will be examined to reveal the contents of Humanistic Buddhism. Towards the end of semester, we explore the contemporary developments of humanistic Buddhism in general, and Foguan Shan Buddhism in particular.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "5322", "title": "Research Paper in Religious Studies", "career": "Postgraduate - Taught", "units": "3.00", "grading": "Graded", "components": "Project", "campus": "Main Campus", "academic_group": "Div of Religious Studies", "requirements": "For students in MA Religious Studies;Pre-requisite: RELS5005", "description": "The research paper in Religious Studies, which is planned with our faculty and those faculty members in relevant fields, allows students to develop some of the ideas and skills they have acquired during their study with us. Every student must write a research paper in Religious Studies of not less than 15,000 words (in Chinese or English) on an approved topic under individualized supervision. Students will be able to acquire some fundamental skills and methodologies of doing research and writing a dissertation in Religious Studies. They will also be better equipped for an application for MPhil/PhD programmes. Even though there will be group and individual supervision to guide students through from start to finish, this is largely a self-taught course and student initiative is most important.", "outcome": "Knowledge Outcomes:  - In-depth understanding of a chosen topic in Religious Studies  - Research on and organization of primary and original materials  Skills Outcomes:  - Independent study - Construction of proposal and thesis through research and reading - Articulation of theory and practice Attitude Outcomes:  - Confidence in independent research - Sound judgment on selecting research topics and source materials", "syllabus": " Introduction. Research proposal. How to write an abstract and academic paper? / Methods 2. Three group meetings At least two consultation meetings with supervisors.", "required_readings": "The required readings depend on the research topic. Always check the most updated version via the department's website (course outline).", "recommended_readings": "The recommended readings depend on the research topic. Always check the most updated version via the department's website (course outline).", "terms": {"2024-25 Term 2": {"-J01-PRJ (3260)": {"startTimes": ["19:00"], "endTimes": ["21:30"], "days": [3], "locations": ["Yasumoto Int'l Acad Park 403"], "instructors": ["Dr. CHOW Wai Yin"], "meetingDates": ["8/1", "15/1", "22/1", "5/2", "12/2", "19/2", "26/2", "5/3", "12/3", "19/3", "26/3", "2/4", "9/4", "16/4"]}}}, "assessments": {"Attendance": "10", "Essays": "80", "Report": "10"}}, {"code": "5323", "title": "Life and Death in World Religions", "career": "Postgraduate - Taught", "units": "3.00", "grading": "Graded", "components": "Field Studies/Field-trip\nLecture", "campus": "Main Campus", "academic_group": "Div of Religious Studies", "requirements": "For students in MA Religious Studies", "description": "The problem of life and death constitutes the core concern of practically all religions of the world. The values and beliefs that relate to life and death have far-reaching impacts on different dimensions of religious practice. This course takes a thematic approach by examining and comparing the issues of life and death in some major religions in the world, including mainly the Indian, Chinese and Abrahamic traditions. The emphases and peculiarities of each religion will be illustrated from the doctrinal, textual, ritual and symbolic perspectives. Through the study of religion in different cultures, students will be equipped with a broadened horizon and fundamental framework for taking more advanced courses in all area of religious studies.", "outcome": "Upon successful completion of this course, students should be able to: - Understand the issues of life and death in major religions of the world in their historical settings and contemporary contexts;  - Enhance their ability to have a critical and yet sympathetic understanding and appreciation of different religious traditions;  - Engage in a critical analysis of religions from doctrinal, textual and ritual perspectives.", "syllabus": " Introduction: Religion, Death and the Meaning of Life Death and Afterlife in Ancient Egypt, Near East and Ancient Greek Thought Death and Afterlife in Judaism Understanding of Death in Early Church Fathers Death, Eternal Life and Hope in Christianity Death and afterlife in Chinese Religions Life, Death, and Afterlife in Taoism Islamic Images of Life, Death and Afterlife Hindu Views on Life and Death Buddhist View on Life and Death: Bardo", "required_readings": "The reading list will be updated if deem necessary. Always check the most updated version via the department's website (course outline). Obayashi, H., ed. Death and Afterlife: Perspectives of World Religions. New York: Greenwood Press, 1992.", "recommended_readings": "The reading list will be updated if deem necessary. Always check the most updated version via the department's website (course outline). Angelika Cedzich, “Ghost and Demons, Law and Order: Grave Quelling Tests and Early Taoist Liturgy,” Taoist Resources 4 (1993) no.2 , 23-35. Bailey, L.R. “The Old Testament View of Life After Death.” Themelios, vol. 11 (1986), no. 2 George E. Mendenhall, “From Witchcraft to Justice: Death and Afterlife in the Old Testament,” Death and After Life: Perspectives of World Religions. Hiroshi Obayashi, “Death and eternal life in Christianity,” Death and After Life: Perspectives of World Religions. Jerrold S. Cooper, “The Fate of Mankind: Death and Afterlife in Ancient Mesopotamia.” (Chapter 2) In Death and After Life: Perspectives of World Religions. Edited by Hiroshi Obayahsi. Pricenton, 1992 Judith Berling, “Death and Afterlife in Chinese Religions.” (Chapter 13) In Death and After Life: Perspectives of World Religions. Thomas J. Hopkins, “Hindu Views on Life and Death.” (Chapter 10) In Death and After Life: Perspectives of World Religions. William C. Chittick, “Your sight Today is Piercing.” (Chapter 9) In Death and After Life: Perspectives of World Religions. 林中澤, 陳賢哲. \"早期拉丁教父的死亡觀評析.\" 暨南學報(哲學社會科學版) 2 (2011). 索甲仁波切著，鄭振煌譯：《西藏生死書》，第七至八章，臺北市：張老師，1996。 鄭志明. \"傳統社會生命教育的生死信仰.\" 第四屆台灣密宗國際學術研討會 (2008): 1-29. 黎志添：〈從打齋儀式看道教對死亡的處理──一個死魂遠遊旅程的救濟：拔罪、救苦、度亡及成仙〉，收入梁美儀、張燦輝合編：《凝視死亡──死與人間的多元省思》。香港：中文大學出版社，2005，頁 55-78。", "terms": {"2024-25 Term 1": {"--LEC (4461)": {"startTimes": ["19:00"], "endTimes": ["21:30"], "days": [1], "locations": ["Esther Lee Bldg 403"], "instructors": ["Dr TONG Sau Lin, \n\nDr. CHOW Wai Yin"], "meetingDates": ["2/9", "9/9", "16/9", "23/9", "30/9", "7/10", "14/10", "21/10", "28/10", "4/11", "11/11", "18/11", "25/11"]}}}, "assessments": {"Attendance": "15", "Discussion": "10", "Essays": "45", "Presentation": "30"}}, {"code": "5325", "title": "Christianity in Chinese Literature", "career": "Postgraduate - Taught", "units": "3.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Div of Religious Studies", "requirements": "For students in MA Religious Studies", "description": "This course adopts an innovative approach to examine the interactions between Christianity and Chinese literature from the 19th to early 20th centuries. Literary texts to be analyzed include mainly the late Qing missionary novels, and works of May Fourth writers (such as Lu Xun, Bing Xin and Xu Dishan). This course aims to widen the students’ perspectives in the indigenization of Christianity in Chinese religious and literary contexts, the rhetorical influences of the Bible on the emergence of modern Chinese literature, and the interdisciplinary study of literature and religion.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "5326", "title": "Chinese Religion and Literature", "career": "Postgraduate - Taught", "units": "3.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Div of Religious Studies", "requirements": "For students in MA Religious Studies", "description": "Chinese literature has long been intertwined with religion. While Confucian, Buddhist and Daoist thoughts permeate classical Chinese literature, a large number of works constitute a lively epitome of Chinese religious culture. This course aims to investigate the interactive relationship between Chinese religion and literature. Students will be guided to examine the ways in which religious thoughts and symbols shape the themes, narratives and language of the literary works. Texts selected for reading mainly include Chinese classical novels such as The Journey to the West and The Story of the Stone.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "5327", "title": "Life Wisdom in Religious Classics", "career": "Postgraduate - Taught", "units": "3.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Div of Religious Studies", "requirements": "For the students of MA in Religious Studies", "description": "The classics of different religious traditions offer a wealth of knowledge, insight and wisdom about nature, reality and life. The store of ancient wisdom accumulated in various cultures is oftentimes still relevant to our contemporary contexts. This course takes a textual and story approach by examining the notions and themes of wisdom in some major religions of the world. Through guided reading of selected passages from the religious classics, students may draw from the well of profound wisdom to stimulate their reflection on the approach of life, the way of looking at the world, and the recurring issues facing humanity. Texts selected for reading may include Zhuangzi, the Lotus Sutra, the Bible and the Quran, the Bhagavad Gītā, and so forth. The exact list of texts may be modified by the teacher who offers the course in a particular year.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "5328", "title": "Taoism, Health and Nourishing of Life", "career": "Postgraduate - Taught", "units": "3.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Div of Religious Studies", "requirements": "for the students of MA in Religious Studies", "description": "This course is designed to explore the rich heritage of Taoist self-cultivation tradition. The course begins with an understanding of Taoist cosmology and its correlation with human body by indepth reading of major Taoist texts, e.g. Inner Chapters of Baopu zi neipian, Wuzhen pian, Lingbao bifa, and Jinhua zongzhi. Students of this course will be taught how are how Taoist concept of qi shapes the understanding of health and perfection of human body, and develops the practices of self cultivation, e.g. inner alchemy, meditation, qigong exercises and etc. The approach of this course emphasizes lecture, discussion of reading materials and practice.", "outcome": "Upon successful completion of this course, students should be able to:  - Understand the development of Taoist cultivation practice and its religious meaning in China.  - Analyze Taoism’s worldview with respect to the cosmos, human existence, health, and cultivation practice. - Analyze Taoism’s healthy and moral life with respect to its cultivation practices.  - Compare and contrast Taoism and Western philosophy under the categories of human life, health and cultivation.", "syllabus": "1. Introduction: What is Keeping the One? 2. Qi, Cosmology, and Human Body  3. History of Daoist Tradition of Inner Alchemy *  4. Taoism, Illness, and Perfection of life  5. Health and Body in Taoism and the West  6. Reading on the Inner Chapters of Baopu zi neipian  7. Reading on the Wuzhen pian  8. Reading on the Lingbao bifa  9. Reading on the Jinhua zongzhi  10. Taoist Inner Alchemy Practice  11. Taijiquan, Qigong and Taoism  12. Field Study: Taoist Self-Cultivation Practice in Hong Kong Taoist Communities 13. Conclusion", "required_readings": "General References  Schipper, Kristofer. The Taoist Body. Berkeley: University of California Press, 1993. Robinet, Isabelle. The World Upside Down: Essays on Taoist Internal Alchemy, ed. and tr. By Fabrizio Pregadio. Mountain View, CA: Golden Elixir Press, 2011.", "recommended_readings": "Other References  Eskildsen, Stephen. Asceticism in Early Taoist Religion. Albany: State University of New York Press, 1998. Fromm, Mallory. Qi Energy for Health and Healing. New York, NY: Avery, 2003. Kohn, Livia. Myth and Meaning in Early Taoism: The Theme of Chaos (Hun-tun). Daoism and Chinese Culture. Cambridge. MA: Three Pines Press, 2001. Kohn, Livia. The Taoist Experience: An Anthology. Albany: State University of New York Press, 1993. Kohn, Livia. Early Chinese Mysticism: Philosophy and Soteriology in the Taoist Tradition. Princeton: Princeton University Press, 1992. Robinet, Isabelle. Taoism: Growth of a Religion. Stanford: Stanford University Press, 1997. Robinet, Isabelle. Taoist Meditation: the Mao-shan Tradition of Great Purity, tr. by Julian F. Pas and Norman Girardot. Albany: State University of New York Press, 1993. Wong, Eva. The Tao of Health, Longevity, and Immortality: The Teachings of Immortals Chung and Lü. Boston: Shambhala, 2000.  李遠國：《中國道教氣功養生大全》。成都市：四川辭書出版社，1991。 張廣保：《金元全真道內丹心性學》。北京：生活、讀書、新知三聯書店，1995。 胡孚琛，呂錫琛：《道學通論：道家‧道教‧丹道》。北京：社會科學文獻出版社，2004。  胡孚琛，呂錫琛：《道學通論：道家‧道教‧仙學》。北京市：社會科學文獻出版社，1999。  胡衛國、宋天彬（著）：《道教與中醫》。台北市：文津出版社，1997。  張振國：《返朴歸真：道教與人生》。上海：上海書店出版社，2003。  陳禾原：《丹道修煉與養生學》。北京：社會科學文獻出版社，2006。 陳攖寧：《道教與養生》。北京：華文出版社，2000。  黎志添：〈《抱朴子內篇》的歷史意義：葛洪神仙思想的宗教社會意義〉，《清華學報》29 (1999) ，頁35-58。", "terms": {"2024-25 Term 1": {"--LEC (1075)": {"startTimes": ["19:00"], "endTimes": ["21:30"], "days": [2], "locations": ["Esther Lee Bldg 401"], "instructors": ["Professor LAI Chi Tim"], "meetingDates": ["3/9", "10/9", "17/9", "24/9", "8/10", "15/10", "22/10", "29/10", "5/11", "12/11", "19/11", "26/11", "3/12"]}}}, "assessments": {"Essays": "40", "Others": "20", "Presentation": "40"}}, {"code": "5329", "title": "Buddhism, Right Mindfulness and Meditation", "career": "Postgraduate - Taught", "units": "3.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Div of Religious Studies", "requirements": "For the students of MA in Religious Studies", "description": "Centering on the notion of “right mindfulness”, this course aims to introduce students to the core topics on the Buddhist way to inner peace and happiness. The course will therefore address subjects such as affliction, self and no-self, the middle way, right mindfulness, and etc. Furthermore, the course will touch upon some common issues in modern life, and will investigate how they can gain inspirations from Buddhist perspectives, whether theoretical or practical. Towards the middle and the end of the course, students will learn essential methods of meditation based on Buddhist mindfulness. Students will thereby acquire an initial experience of meditation and take the benefits of meditative concentration into every aspect of their life.", "outcome": "※ Knowledge Outcomes: Upon completion of the subject, students will be able to: (1) enlarge and refine their understanding of the fundamental doctrines of the Buddhist way to liberation; (2) understand the key concepts and principles in Buddhist meditation techniques; (3) experience an initial grasp of insight meditation exercise; (4) demonstrate critical reflections on the relation between the Buddhist ultimate truth and worldly truth.  ※ Attitude Outcomes: (1) nurture a larger sensitivity to the value of religious practice in human life; (2) relate their personal growth and everyday life to Buddhist meditation practice so as to develop a sense of mindfulness and cultivate a constructive outlook on the self, life and the world.", "syllabus": "1. An Overview: Buddhist Perspective of Spiritual Growth and Happiness  2. Affliction, Desire and Impermanence 3. The Idea of No-Self: What Buddhism Teaches about the Self? 4. Enlightened Truth, Worldly Truth and Wisdom of the Middle Way 5. Right Understanding and Right Mindfulness 6. Insight Meditation and Discovery of the Inner Self 7. Outside-Class Meditation Exercise  8. Buddhist view of Self-Actualisation and Secular Achievements 9. Buddhist Attitude toward Lay Ethics 10. Cultivating Good Interpersonal Relationship with Metta Meditation (慈心禪) 11. Outside-Class Meditation Exercise 12. Group Presentation 13. The Power of Being Present: Inspirations of Zen Koans", "required_readings": "Ajahn Sumedho, The Mind and the Way: Buddhist Reflections on Life. Boston: Wisdom, 1995.  Ayya Khema, Who Is My Self? A Guide to Buddhist Meditation. Boston: Wisdom, 1997. Charles S. Prebish and Damien Keown, Introducing Buddhism. New York :  Routledge, 2006. Dales S. Wright, The Six Perfections: Buddhism and the Cultivation of Character. Oxford ; New York : Oxford University Press, 2009. Damien Keown, Buddhist Ethics: A Very Short Introduction. Oxford ; New York : Oxford University Press, 2005.  Ed. Damien Keown, Contemporary Buddhist Ethics, Richmond : Curzon, 2000. John W. Schroeder, Skillful Means: The Hearts of Buddhist Compassion. Honolulu: University of Hawai’i Press, 2001. Leslie Kawamura, “The Middle Path According to the Kāśyapaparivarta-sūtra”.ed. Jonathan A. Silk, Wisdom, Compassion, and the Search for Understanding: The Buddhist Studies Legacy of Gadjin M. Nagao. Honolulu: University of  Hawai’i Press, 2000.  Lobsang Gyatso, Bodhicatta: Cultivating the Compassionate Mind of Enlightenment. Ithaca, New York: Snow Lion, 1997. Peter Harvey, The Selfless Mind. Surrey : Curzon Press, 1995.  Pérez Remón, Joaquín, Self and Non-Self in Early Buddhism. The Hague: Mouton, 1980. Phra Thēpwēthī (Prayut), trans. Grant A. Olson, Buddhadhamma : natural laws and values for life. Albany : State University of New York Press, 1995.  Sarah Shaw, Buddhist meditation : an anthology of texts from the Pāli canon. London ; New York : Routledge, 2006.  Sarah Shaw, Introduction to Buddhist Meditation. London and New York: Routledge. 2009. Susan Blackmore, Ten Zen Questions. Oxford: Oneworld, 2009. Thict Nhat Hanh, The Heart of the Buddha’s Teaching: Transforming Suffering into Peace, Joy and Liberation. New York : Broadway Books, 1999. Thich Nhat Hanh, edited by Arnold Kotler, Peace is every step : the path of mindfulness in everyday life. New York, N.Y. : Bantam Books, 1991. Tse-fu Kuan, Mindfulness in early Buddhism : new approaches through psychology and textual analysis of Pali, Chinese and Sanskrit sources. London ; New York : Routledge, 2008.  一行禪師：《一行禪師釋佛：正念，從現在開始》，北京：中國長安， 2005。 王仲堯：《慈善喜捨 : 佛教財富觀》，北京: 宗教文化，2004。 印順：《學佛三要》，台北：正聞，1983(民72)。 印順：《中觀今論》，台北：正聞，1971(民60)。 阿姜查著，賴隆彥譯：《阿姜查的禪修世界‧慧》，台北：橡樹林，2004(民93)。  吳怡：《公案禪語》，台北：東大，1991(民80)。 波卡仁波切著，吳嘉真等譯：《照見清淨心：禪修入門指引》,台北：張老師，1999。 愚子：《五戒現代觀‧上》，北京：宗教文化，2004。 聖嚴法師：《公案100》，台北：法鼓文化，2001。 聖嚴法師：《法鼓全集》七之十四〈八正道〉，台北：法鼓文化，2005(民94)。 聖嚴法師：《是非要温柔》，台北：法鼓文化，1999(民88)。", "recommended_readings": "", "terms": {"2024-25 Term 2": {"--LEC (1060)": {"startTimes": ["19:00"], "endTimes": ["21:30"], "days": [5], "locations": ["Hui Yeung Shing Bldg G04"], "instructors": ["Dr TONG Sau Lin"], "meetingDates": ["10/1", "17/1", "24/1", "7/2", "14/2", "21/2", "28/2", "7/3", "14/3", "21/3", "28/3", "11/4", "25/4"]}}}, "assessments": {"Essays": "50", "Others": "20", "Presentation": "30"}}, {"code": "5331", "title": "Special Topic in Religious Studies I", "career": "Postgraduate - Taught", "units": "3.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Div of Religious Studies", "requirements": "For the students of MA in Religious Studies", "description": "The specific topics of this course vary from year to year, depending on the expertise of the teacher of that particular year. Generally, they can be topics and issues related to different religious traditions, religion and society, religion and culture, or religion and life.", "outcome": "The learning outcomes depend on the topic", "syllabus": "The specific topics of this course vary from year to year, depending on the expertise of the teacher of that particular year. Generally, they may be more advanced themes and theories related to different religious traditions, religion and society, religion and culture, or religion and life.", "required_readings": "The required readings depend on the topic. Always check the most updated version via the department's website (course outline).", "recommended_readings": "The recommended readings depend on the topic.Always check the most updated version via the department's website (course outline).", "terms": {"2024-25 Term 2": {"--LEC (4431)": {"startTimes": ["19:00"], "endTimes": ["21:30"], "days": [2], "locations": ["Hui Yeung Shing Bldg G04"], "instructors": ["Staff"], "meetingDates": ["7/1", "14/1", "21/1", "4/2", "11/2", "18/2", "25/2", "4/3", "11/3", "18/3", "25/3", "1/4", "8/4", "15/4"]}}}}, {"code": "5332", "title": "Special Topic in Religious Studies II", "career": "Postgraduate - Taught", "units": "3.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Div of Religious Studies", "requirements": "For the students of MA in Religious Studies", "description": "The specific topics of this course vary from year to year, depending on the expertise of the teacher of that particular year. Generally, they may be more advanced themes and theories related to different religious traditions, religion and society, religion and culture, or religion and life.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "5333", "title": "Field Studies of Religious Culture", "career": "Postgraduate - Taught", "units": "3.00", "grading": "Graded", "components": "Others", "campus": "Main Campus", "academic_group": "Div of Religious Studies", "requirements": "For students of MA in Religious Studies.", "description": "Integrating classroom learning with field work in relation to religious culture, this course is designed to help students truly comprehend textual knowledge and develop deeper insights into religious understanding by engaging in the spatial, geographical and material dimensions of particular religious traditions. This is a three-credit course in which the majority of the academic work is accomplished through group study and travel to some carefully selected religious sites, whether overseas or domestic. It aims to provide students with a lively and effective learning experience at an off-campus location for a minimum of three overnights, and enhances the student’s classroom learning through first-hand exposure to the religious relics and material culture. Each study tour will be organized and headed by experienced members of teaching staff. The specific sites of visit will depend on the subject and theme of study designed by the teacher who offers the course in a particular year.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "5335", "title": "Understanding Religion through Film", "career": "Postgraduate - Taught", "units": "3.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Div of Religious Studies", "requirements": "For students in MA in Religious Studies", "description": "This course is designed to assist students in recognizing religious concepts, east and west, through analyzing movies that seem to have to do with “religion” per se. The course will help students explore how religion may be treated as an integral human phenomena and how religion involves the fullness of the human world through film watching.In addition, the course provides students with opportunities to think critically about a wide range of meanings concerning the existence of human beings through particular films. A religious notion of interpretation will be taken to examine how the meanings are constructed and transmitted to viewers through various visual narrative forms and symbols. It also encourages students to appreciate the form of cinematic aesthetics and symbols from the interdisciplinary perspectives.", "outcome": "Upon successful completion of the course, students are expected to:  Knowledge Outcomes: 1. the components of religious worldviews common to most religions; 2. understand how religion and film intersect;  Attitude Outcomes: 1. higher sensitivity to the contributing role of religions in human culture and history; 2. move beyond viewing films as mere entertainment to understanding them as multi-layered texts  Skill Outcomes: 1. develop skills in analytical reading, formal writing, and critical thinking 2. critically evaluate particular cinematic works in their various forms through the lenses of Religious  Studies.", "syllabus": "1. Course introduction: How Religion and film intersect? Weiner, Robert G, “Film & Religion: An Introduction”, in The Journal of Popular Culture, 2009, Vol.42(3), pp.583-584. Wright, Melanie J, Religion and Film : An Introduction. Chapters I & II. London ; New York : I.B. Tauris, New York : Distributed in the U.S. by Palgrave Macmillan, 2007.  2. Shawshank’s Redemption (1994): Hope and Redemption Paul V.M. Flesher, Robert Torry, “Violence and Redemption, “ in Film & religion : an introduction. Chapter 8, Nashville, TN : Abingdon Press, 2007.  3. The Exorcist (1973): Religion and Science Alister E. McGrath, Science and Religions: A New Introduction, Wiley Blackwell. Part III, 18, 23, 24 徐英瑾等主編：《科學與宗教：二十一世紀的對話──英美四名家復旦演講集》第四講、第六講，上海：復旦大學出版社，2008。  4. Life of Pi (2012): What is Religion? Berger, Peter L. 1969: The Sacred Canopy : Elements of a Sociological Theory of Religion (New York) (中譯：《神聖的帷幕 : 宗教社會學理論的要素 》（台北：商周，2003）, pp. 37-62. Mircea Eliade, The Sacred And the Profane: The Nature of Religious Myth, Symbolism,and Ritual Within Life and Culture. New York: A Harvest/HBJ Book, 1957, pp. 8-113。(中譯本──伊利亞德著，楊素娥譯：《聖與俗──宗教的本質》。台北：桂冠圖書，2001, 第一章及第二章)  5. Life of Pi (2012): Religious Plurality John Hick著，陳志平、王志成譯: 《理性與信仰：宗教多元論諸問題》(Problems of Religious Pluralism) (成都：四川人民出版社，2003) ，第三章，頁31-51。  6. Simon of the Desert (1965): Celibacy in Religious Traditions Edited by Carl Olson, Celibacy and Religious Traditions [electronic resource] . Chapter 1, New York : Oxford University Press, 2007.  7. Samsara (2001) : Indulgence or Abstinence? David Webster, The philosophy of desire in the Buddhist Pali canon. pp. 1-17. London ; New York : Routledge Curzon, 2005. 呂大吉：〈概說宗教禁欲主義〉，《中國社會科學》，頁159-174，1989年5月。  8. Running On Karma (2003): Karma and Reincarnation  Richard Gombrich, How Buddhism Began: the conditioned genesis of the early teachings. Ch. II. Atlantic Highlands, N.J. : Athlone Press, 1996. 平川彰：《印度佛教史》，pp.61-68。臺北市：商周出版，2002。  印順法師：《佛法概論》，第十一章。上海：上海古籍出版社，1998。(electronic resource)  9. Zen (禅)(2009): Zen and Buddha Nature 波卡仁波切著，吳嘉真等譯：《照見清淨心：禪修入門指引》，第四至六章，台北：張老師，1999。 Siderits, Mark, “Does a Table Have Buddha-Nature?” Philosophy East and West, 2013, Vol.63(3), pp.373-386.  10. Departures (禮儀師の奏鳴曲)(2008): Religion, Death and the Meaning of Life Bolt, Peter G. “Life, Death, and the Afterlife in the Greco-Roman World.” In Life in the Face of Death: The Resurrection Message of the New Testament. Grand Rapids: Eerdmans, 1991. Swenson, “The Dignity of Human Life.” In The Meaning of Life. p.20. Edited by E. D. Klemke. New York: Oxford University Press, 1981.  11. 千と千尋の神隠し(2001): Souls, Ghosts and Death Rebecca L. Stein, The Anthropology of Religion, Magic, and Witchcraft, pp. 161-188. Boston : Pearson/A and B, 2008  12. The Truman Show (1998) : What is Self?  Dharm P. S. Bhawuk, “Indian Concept of Self,” in Spirituality and Indian Psychology: Lessons from the Bhagavad-Gita, pp. 65-91, New York : Springer 2011. Peter Harvey, The Selfless Mind. chapters 1-4, Surrey : Curzon Press, 1995.  13. 春去春又來 (2003): The three Poisons (Greed, Anger and Ignorance) and Buddhist ethics 楊斐芬：〈電影《春去春又來》的佛教倫理觀〉，建國科技大學《第六屆職業倫理與職業道德教育研討會》，2009年5月。 Damien Keown, Buddhist ethics : a very short introduction. Oxford ; New York : Oxford University Press, 2005.", "required_readings": "Weiner, Robert G, “Film & Religion: An Introduction”, in The Journal of Popular Culture, 2009, Vol.42(3), pp.583-584. Wright, Melanie J, Religion and Film : An Introduction. Chapters I & II. London ; New York : I.B. Tauris, New York : Distributed in the U.S. by Palgrave Macmillan, 2007.  Paul V.M. Flesher, Robert Torry, “Violence and Redemption, “ in Film & religion : an introduction. Chapter 8, Nashville, TN : Abingdon Press, 2007.  Alister E. McGrath, Science and Religions: A New Introduction, Wiley Blackwell. Part III, 18, 23, 24 徐英瑾等主編：《科學與宗教：二十一世紀的對話──英美四名家復旦演講集》第四講、第六講，上海：復旦大學出版社，2008。  Berger, Peter L. 1969: The Sacred Canopy : Elements of a Sociological Theory of Religion (New York) (中譯：《神聖的帷幕 : 宗教社會學理論的要素 》（台北：商周，2003）, pp. 37-62. Mircea Eliade, The Sacred And the Profane: The Nature of Religious Myth, Symbolism,and Ritual Within Life and Culture. New York: A Harvest/HBJ Book, 1957, pp. 8-113。(中譯本──伊利亞德著，楊素娥譯：《聖與俗──宗教的本質》。台北：桂冠圖書，2001, 第一章及第二章)  John Hick著，陳志平、王志成譯: 《理性與信仰：宗教多元論諸問題》(Problems of Religious Pluralism) (成都：四川人民出版社，2003) ，第三章，頁31-51。  Edited by Carl Olson, Celibacy and Religious Traditions [electronic resource] . Chapter 1, New York : Oxford University Press, 2007.  David Webster, The philosophy of desire in the Buddhist Pali canon. pp. 1-17. London ; New York : Routledge Curzon, 2005. 呂大吉：〈概說宗教禁欲主義〉，《中國社會科學》，頁159-174，1989年5月。  Richard Gombrich, How Buddhism Began: the conditioned genesis of the early teachings. Ch. II. Atlantic Highlands, N.J. : Athlone Press, 1996. 平川彰：《印度佛教史》，pp.61-68。臺北市：商周出版，2002。  印順法師：《佛法概論》，第十一章。上海：上海古籍出版社，1998。(electronic resource)  波卡仁波切著，吳嘉真等譯：《照見清淨心：禪修入門指引》，第四至六章，台北：張老師，1999。 Siderits, Mark, “Does a Table Have Buddha-Nature?” Philosophy East and West, 2013, Vol.63(3), pp.373-386.  Bolt, Peter G. “Life, Death, and the Afterlife in the Greco-Roman World.” In Life in the Face of Death: The Resurrection Message of the New Testament. Grand Rapids: Eerdmans, 1991. Swenson, “The Dignity of Human Life.” In The Meaning of Life. p.20. Edited by E. D. Klemke. New York: Oxford University Press, 1981.  Rebecca L. Stein, The Anthropology of Religion, Magic, and Witchcraft, pp. 161-188. Boston : Pearson/A and B, 2008  Dharm P. S. Bhawuk, “Indian Concept of Self,” in Spirituality and Indian Psychology: Lessons from the Bhagavad-Gita, pp. 65-91, New York : Springer 2011. Peter Harvey, The Selfless Mind. chapters 1-4, Surrey : Curzon Press, 1995.  楊斐芬：〈電影《春去春又來》的佛教倫理觀〉，建國科技大學《第六屆職業倫理與職業道德教育研討會》，2009年5月。 Damien Keown, Buddhist ethics : a very short introduction. Oxford ; New York : Oxford University Press, 2005.", "recommended_readings": "*Highly recommended  (I) On Religion * Claude Levi‐Strauss, Myth and Meaning, London: Routledge and K.Paul, 1978. (中譯本：李維斯陀，楊德睿譯：《神話與意義》(台北：麥田出版社, 2001。)  Emile, Durkeim. Elementary Form of Religious Life, translated by Karen E. Fields, Book III, pp.303‐448, New York: The Free Press, 1995. (中譯本：涂爾幹著，芮傳明、趙學元譯：《宗教生活的基本形式》，台北：桂冠圖書股份有限公司。第三篇，頁 339‐507 。)  * Turner, Victor, The Ritual Process: Structure and Anti‐Structure, Ithaca, N.Y.: Cornell University Press, 1969.  Ricoeur, Paul, The Symbolism of Evil, Boston: Beacon Press, 1967, part II, 161‐358.  [中譯本(1) 保羅．里克爾著、翁紹軍譯：《惡的象徵》下篇：〈起源的神話和終結的神話〉，頁 167‐386。台北：桂冠圖書：1992。或中譯本(2) 保羅．里克爾著、公車譯：《惡的象徵》下篇〈 起 源的神話和終結的神話〉，頁 163‐371。上海：上海人民出版社，2003。]   Wolf, Arthur P, \"Gods, Ghosts, and Ancestors,\" in Religion and Ritual in Chinese Society, ed. Arthur P. Wolf (Stanford: Stanford University Press, 1974), 131-182.  * Geertz, Clifford, “Religion as a Cultural System,” The Interpretation of Cultures (New York: Basic Books, 1973).  (II) On Film * Bordwell, David and Kristin Thompson, Film Art: An Introduction, New York: McGraw Hill, 1996.   (Reserved at UL)  Corrigan, Timothy, A Short Guide to Writing about Film, 2nd ed, San Francisco, CA: HarperCollins, 1994. Giannetti, Louis, Understanding Movies, New Jersey: Person Prentice Hall, 2008. 大衛‧博維爾著，何慧玲譯，李焯桃編：《香港電影王國》。香港：洪葉書店，2001。   (III) On Religion and Film  Bandy, Mary Lea and Antonio Monda, editors, The Hidden God: Film and Faith. New York: The Museum of Modern Art, 2003. Fielding, Julien R. Discovering World Religions At 24 Frames Per Second. Lanham, Md. : Scarecrow Press, 2008. Flesher, Paul V. M. and Robert Torry, Film and Religion: An Introduction, Nashville, TN: Abingdon, 2007. Gabler, Neal, Life the Movie: How Entertainment Conquered Reality. New York: Alfred A. Knopf, 1998. Holloway, Richard. Beyond the Image: Approaches to the Religious Dimension in the Cinema .Geneva: WCC,1977.  Hoover, Stewart and Knut Lundby, eds. Rethinking Media, Religion and Culture. London: Sage, 1997.  * Lyden, John C., Film as Religion: Myths, Morals, and Rituals, New York and London: New York University Press, 2003.  * Plate, S. Brent, editor, Representing Religion in World Cinema: Filmmaking, Mythmaking, Culture Making. New York: Palgrave Macmillan, 2003.  Warren, Michael, Seeing Through Media: A Religious View of Communications and Cultural Analysis. Harrisburg, PA: Trinity, 1997.  侯軍：《基督教與西方電影》。北京：文化藝術出版社，2006。  Lebeau, Vicky, 陳儒修、鄭玉菁譯。《佛洛伊德看電影》。台北：書林出版有限公司，2004。  鄭泰丞：《電影觀賞：現世的宗敎意含》。台北市：桂冠圖書股份有限公司，2001。", "terms": {"2024-25 Term 2": {"--LEC (4438)": {"startTimes": ["19:00"], "endTimes": ["21:30"], "days": [4], "locations": ["Hui Yeung Shing Bldg G05"], "instructors": ["Staff"], "meetingDates": ["9/1", "16/1", "23/1", "6/2", "13/2", "20/2", "27/2", "6/3", "13/3", "20/3", "27/3", "3/4", "10/4", "17/4"]}}}, "assessments": {"Essays": "60", "Presentation": "40"}}, {"code": "5337", "title": "Religion and Global Politics", "career": "Postgraduate - Taught", "units": "3.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Div of Religious Studies", "requirements": "For MA Religious Studies", "description": "This course surveys major topics in the religious studies approach to religion and global politics. The first objective of the course is to familiarise students with the existing theoretical literature and empirical research. The second objective to evaluate recent research on the role of religious actors, institutions, and ideologies in policymaking, state-building, democratic politics, social movements, and other political processes.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "5338", "title": "Religion, Gender, and Sexuality", "career": "Postgraduate - Taught", "units": "3.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Div of Religious Studies", "requirements": "For MA Religious Studies", "description": "Are religion and sex always at odds? Do gods have genders? How can political leaders be celebrated as supreme dads? What can we learn from Foucault’s History of Sexuality, Antonio Gramsci’s prison writings, and Weber, Mahmood, Sedgwick…?This course examines religion, gender and sexuality as crucial systems of power that shape our world. Students will develop an understanding of religion and gender as both subjects and as categories of analysis. As categories of analysis, students will use gender and religion to interrogate cultural production and social systems, paying close attention to how gender and religion intersect with other categories of social difference. Students will connect the assigned academic readings to “real-life” examples in the news, media, and their own lives, thereby producing new theoretical understandings of gender, religion, and sexuality in the contexts of Hong Kong, Asia, and the world.", "outcome": "Upon completion of the subject, students will be able to:  Identify key scholars in the field and their theories, both classic and emerging   Demonstrate in depth knowledge of religion and gender as intersectional categories of analysis   Actively reflect upon ordinary/accepted modes of thinking about gender, sexuality and religion, construct new modes of thinking oriented toward change   Demonstrate a critical, intersectional awareness of gender and religion in the social and cultural contexts of Hong Kong, Asia, and the world   Develop critical reading skills of academic literature on religion and gender, including reading, analysing, and summarising the argument of secondary literature; selecting and analysing primary materials including visual contents   Develop communication skills through class discussion and writing assignments   Develop research skills  Develop transferrable skills including critical thinking, analysis of media coverage, and public speaking.", "syllabus": "Week 1 IntroSource: Amazon Source: MP Weekly, https://www.mpweekly.com/culture/wp-content/uploads/2016/11/h161126yan025.jpg Telling stories: contexualise, contexualise, contexualise.Are religion and gender/sexuality always at odds? What can a gender perspective tell us about religion, culture, history, and our future?Recommended readings:《圣杯与剑：我们的历史，我们的未来》The Chalice and the Blade: Our History, Our Future，Riane Eisler，译者: 程志民, 2009.Angels in America 美國天使, 2003; original play by Tony Kushner, 1991–92.基恩之家聖誕文告 @RTHK自己人, https://www.youtube.com/watch?v=LF67erZU4Jk Part I USEFUL CONCEPTSWeek 2 Foucault on sexuality and confession Foucault, Michel. 2016. “Scientia Sexualis.” In The Bloomsbury Reader in Religion, Sexuality, and Gender.Week 3 Max Weber on charismatic authorityWeber, Max. 2020. “The Three Types of Legitimate Domination.” Essays in Economic Sociology. Princeton University Press.Week 4 Antonio Gramsci on hegemonyGramsci, Antonio. Selections from the Prison Notebooks, 144–6.Connell, R. W. and James W. Messerschmidt. 2005. “Hegemonic Masculinity: Rethinking the Concept.” Gender and Society, Vol. 19, No. 6, pp. 829–859.Week 5 Janet Gyatso and Miranda Shaw on sex Source: Wikipedia.Readings:Gyatso, Janet. 2019. “Sex.” In The Bloomsbury Reader in Religion, Sexuality, and Gender.Shaw, Miranda. 1994. “Chapter 1.” In Passionate Enlightenment: Women in Tantric Buddhism, 3–19. Princeton, NJ: Princeton University Press. Week 6 Saba Mahmood on agencyReadings:Mahmood, Saba. 2004. Politics of Piety: The Islamic Revival and the Feminist Subject. Princeton University Press. Introduction. 《东方学》与中东女性主义研究：一份综述。结绳志，2023.Week 7 Eve Sedgwick on closet and affectSedgwick, Eve. 2008. “Epistemology of the Closet.” Bao, Hongwei. In Memory of Eve Sedgwick 紀念賽菊蔻: https://www.chinaindiefilm.org/in-memory-of-eve-sedgwick-in-defence-of-sissy-boys/Will be mentioned in lecture: Sedgwick, Eve. 2003. Pedagogy of Buddhism. In Touching Feeling.Crossley, James. “‘All Religions Are against LGBTQ Rights’.” In Stereotyping Religion II, edited by Brad Stoddard and Craig Martin, 33–48. Part II FROM CONCEPTS TO QUESTIONS Week 8 Do gods have gender(s)?Huang, C. Julia, Elena Valussi, and David A. Palmer. 2011. “Gender and Sexuality in Chinese Religious Life.” In Chinese Religious Life, edited by David A. Palmer, Glenn Shive and Philip Wickeri. OUP, 107–123.  Lodi, Hafsa. 2023. “The Muslim Women Using Feminine Pronouns for Allah.” The Revealer. Will be mentioned in lecture:Nelsen, Hart M., Neil H. Cheek, and Paul Au. 1985. “Gender Differences in Images of God.” Journal for the scientific study of religion 24(4): 396–402.Buddhist Masculinities. 2023. Edited by Megan Bryson and Kevin Buckelew. Columbia UP.Week 9 The F word (and the I word) Source: A–Z quotes, https://www.azquotes.com/author/49440-Jakucho_Setouchi Videos and podcasts:「為同志證婚的女權法師：所有歧視都是邪惡的」,wainao, https://www.wainao.me/wainao-watches/taiwanese-Buddhist-feminist-Shih-Chao-hwei-LGBT.Malory Nye, Intersectionality and religion, Religion Bites: https://medium.com/religion-bites-podcast/013-intersectionality-and-religion-3ec64c149b5c.Readings:Smith, Leslie Dorrough. “‘Conservative Religions Oppress Women (While Liberal Religions Don’t)’”. In Stereotyping Religion II, edited by Brad Stoddard and Craig Martin, 95–106.Singh, Jakeet. “Religious Agency and the Limits of Intersectionality.” Hypatia 30.4 (2015): 657–674.Further readings:Parker, Julie Faith. 2013. “Blaming Eve Alone: Translation, Omission, and Implications of עמה in Genesis 3:6b.” Journal of Biblical Literature 132(4) 729–747.姜貞吟. 2021. 《女歸成神：性別與宗族／親、族群之間的多重交織》. 性別、宗族／親與公私領域的交織.Week 10 Beyond #MeToo and Netflix: Religion and Sexual/Gender Violence Lucia, Amanda. “Guru Sex: Charisma, Proxemic Desire, and the Haptic Logics of the Guru-Disciple Relationship.” Journal of the American Academy of Religion 86.4 (2018): 953–988. Further readings:Huang, Chang-Ling. 2021. “#MeToo in East Asia: The Politics of Speaking Out.” Politics & Gender 17(3): 483–490. Week 11 Religion and (Hegemonic) Masculinities Source: https://wmoov.com/movie/post/32601 Film clips: Lee, Joon-I, dir. k思悼 사도 The Throne, 2014.Readings:Deuchler, Martina. “Elitism and Ideology”, in The Confucian Transformation of Korea: A Study of Society and Ideology. Cambridge, Mass: Council on East Asian Studies, Harvard University, 1992.Du, Yue. 2021. Introduction: Filial Piety beyond Confucianism. In State and Family in China. Cambridge University Press.Further readings for your interest:郑炳说，2023.《权力与人：思悼世子之死与朝鲜王室》，上海书店出版社，丁晨楠，叶梦怡譯.Roose, Joshua M. 2021. The New Demagogues: Religion, Masculinity and the Populist Epoch. Bloomsbury. Intro.Webster, Joseph. 2022. The Religion of Orange Politics: Protestantism and Fraternity in Contemporary Scotland. Manchester: MUP. Intro.  Week 12 Guest speaker or presentation  Week 13 Presentation  ", "required_readings": "The reading list will be updated if deem necessary. Always check the most updated version via the department’s website (course outline). The Bloomsbury Reader in Religion, Sexuality, and Gender.", "recommended_readings": "The reading list will be updated if deem necessary. Always check the most updated version via the department’s website (course outline).  Keeping it 101: A Killjoy’s introduction to Religion Podcast   时差 in-betweenness #07 酷兒，跨性別，情感理論 | Queer theory, affect, transgender politics https://shicha.buzzsprout.com/1171871/6139246-07-queer-theory-affect-transgender-politicsDu, Yue. 2021. State and Family in China. Cambridge University Press.《被埋沒的足跡: 中國性別史研究入門》（中国ジェンダー史研究入門）作者：小濱正子/ 下倉涉/ 佐佐木愛/ 高嶋航/ 江上幸子編，譯者： 姚毅/ 施厚羽/ 鄭威/ 邵迎建/ 白玉冬/ 張文昌/ 梁雯/ 瞿艷丹/ 王天馳/ 柳雨春/ 等。國立臺灣大學出版中心，2020年。Wilcox, Melissa M. 2020. Queer Religiosities: An Introduction to Queer and Transgender Studies in Religion. Rowman & Littlefield. Introduction. 《不只是厭女》Down Girl: The Logic of Misogyny，作者：凱特‧曼恩Kate Manne，譯者： 巫靜文，麥，2019年。Jinhua Jia, Xiaofei Kang, and Ping Yao (eds.). 2015. Gendering Chinese Religion Subject, Identity, and Body. SUNY. Abu-Lughod, Lila. 2013. Do Muslim Women Need Saving? Cambridge, MA: Harvard University Press.Huang, C Julia, Elena Valussi, and David A. Palmer. 2011. Gender and Sexuality. In Chinese Religious Life, edited by David A. Palmer et al. OUP.Riane Eisler,《圣杯与剑：我们的历史，我们的未来》The Chalice and the Blade: Our History, Our Future, 译者: 程志民, 2009.Deuchler, Martina. 1995. The Confucian Transformation of Korea: A Study of Society and Ideology. Harvard University Press. ", "terms": {"2024-25 Term 2": {"--LEC (1231)": {"startTimes": ["19:00"], "endTimes": ["21:30"], "days": [1], "locations": ["Hui Yeung Shing Bldg G04"], "instructors": ["Professor GUO Ting"], "meetingDates": ["6/1", "13/1", "20/1", "27/1", "10/2", "17/2", "24/2", "3/3", "10/3", "17/3", "24/3", "31/3", "7/4", "14/4"]}}}, "assessments": {"Essays": "55", "Project": "35", "Participation": "10"}}, {"code": "6001", "title": "Graduate Seminar I", "career": "Postgraduate - Research", "units": "3.00", "grading": "Graded", "components": "Seminar", "campus": "Main Campus", "academic_group": "Div of Religious Studies", "requirements": "For students in MPhil-PhD Religious Studies", "description": "The purpose of this course is to give first-year M. Phil. and Ph.D. students an opportunity to report on and discuss their independent research and thesis writing.", "outcome": "- Engage in literary analysis of texts and images related to graduate students’ research topics; - Acquire critical familiarity with the uses and limitations of major theoretical approaches and frameworks for analysis of the topics concerned", "syllabus": "1. Introduction2. Lecture3. Discussion of paper4. Discussion of paper5. Discussion of paper6. Preparing literature survey7. Preparing research paper8. Literature survey9. Literature survey 10. Literature survey11. Research paper12. Research paper13. Research paper The syllabus and assessment type may vary according to the teaching staff and year of offering. Please refer to the course outline for details. ", "required_readings": "The reading list may vary depending of the teaching staff and the year of offering.Please refer to the course outline for details.", "recommended_readings": "The reading list may vary depending of the teaching staff and the year of offering.Please refer to the course outline for details.", "terms": {"2024-25 Term 2": {"-S01-SEM (1951)": {"startTimes": ["10:30"], "endTimes": ["13:15"], "days": [3], "locations": ["Esther Lee Bldg 204"], "instructors": ["Professor LAI Chi Tim"], "meetingDates": ["8/1", "15/1", "22/1", "5/2", "12/2", "19/2", "26/2", "5/3", "12/3", "19/3", "26/3", "2/4", "9/4", "16/4", "23/4"]}}}, "assessments": {"Essays": "60", "Presentation": "20", "Report": "20"}}, {"code": "6002", "title": "Graduate Seminar II", "career": "Postgraduate - Research", "units": "3.00", "grading": "Graded", "components": "Seminar", "campus": "Main Campus", "academic_group": "Div of Religious Studies", "requirements": "For students in MPhil-PhD Religious Studies", "description": "The purpose of this course is to give second-year M. Phil. and Ph.D. students an opportunity to report on and discuss their independent research and thesis writing.", "outcome": "- Engage in literary analysis of texts and images related to graduate students’ research topics; - Acquire critical familiarity with the uses and limitations of major theoretical approaches and frameworks for analysis of the topics concerned", "syllabus": "1. Course introduction2. Class discussion3. Presentation preparation4. Presentation preparation5. Presentation preparation6. Presentation and discussion7. Presentation and discussion8. Presentation and discussion9. Presentation and discussion10. Presentation and discussion11. Course conclusion The syllabus and assessment type may vary according to the teaching staff and year of offering. Please refer to the course outline for details. ", "required_readings": "The reading list may vary depending of the teaching staff and the year of offering.Please refer to the course outline for details.", "recommended_readings": "The reading list may vary depending of the teaching staff and the year of offering.Please refer to the course outline for details.", "terms": {"2024-25 Term 1": {"-S01-SEM (1396)": {"startTimes": ["14:30"], "endTimes": ["17:15"], "days": [5], "locations": ["Lady Shaw Bldg LT3"], "instructors": ["Professor LAI Pan Chiu"], "meetingDates": ["6/9", "13/9", "20/9", "27/9", "4/10", "18/10", "25/10", "1/11", "8/11", "15/11", "22/11", "29/11", "6/12"]}}}, "assessments": {"Discussion": "20", "Essays": "60", "Presentation": "20"}}, {"code": "6113", "title": "Chinese Religions: Seminar I", "career": "Postgraduate - Research", "units": "3.00", "grading": "Graded", "components": "Seminar", "campus": "Main Campus", "academic_group": "Div of Religious Studies", "requirements": "For students in MPhil-PhD Religious Studies", "description": "Discussion in seminar setting on selected issues related to studies of Chinese religions. Emphasis will be placed on the interactions among different religious traditions in local Chinese society. Students are allowed to take these courses for more than once, and gain the units each time they pass the course. The specific content will be designed by the teacher who offers the courses.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "6114", "title": "Chinese Religions: Seminar II", "career": "Postgraduate - Research", "units": "3.00", "grading": "Graded", "components": "Seminar", "campus": "Main Campus", "academic_group": "Div of Religious Studies", "requirements": "For students in MPhil-PhD Religious Studies", "description": "Discussion in seminar setting on selected issues related to studies of Chinese religions. Emphasis will be placed on the interactions among different religious traditions in local Chinese society. Students are allowed to take these courses for more than once, and gain the units each time they pass the course. The specific content will be designed by the teacher who offers the courses.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "6115", "title": "Buddhist Studies: Seminar I", "career": "Postgraduate - Research", "units": "3.00", "grading": "Graded", "components": "Seminar", "campus": "Main Campus", "academic_group": "Div of Religious Studies", "requirements": "For students in MPhil-PhD Religious Studies", "description": "This seminar examines Buddhism as a dynamic process of borrowing, conflict and interaction between and within traditions that have been identified as Buddhist. We will begin by studying some representative works of both primary and secondary source (such as those put together by Donald Lopez in his Buddhism in Practice). Specific themes and topics will then be chosen in accordance with students’ interest for in-depth examination. The specific content will be designed by the teacher who offers the courses.", "outcome": "- Acquire basic knowledge of Buddhist studies;  - Develop skills in analytical reading, formal writing and critical thinking; - Relate Buddhist concepts and persuasions to their ethical cultivation and views of life as well as to their coexistence with the nature.", "syllabus": "The syllabus and assessment type may vary according to the teaching staff and year of offering. Please refer to the course outline for details.", "required_readings": "The reading list may vary depending of the teaching staff and the year of offering.Please refer to the course outline for details.", "recommended_readings": "The reading list may vary depending of the teaching staff and the year of offering.Please refer to the course outline for details.", "terms": {"2024-25 Term 1": {"-S01-SEM (9610)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["No Room Required"], "instructors": ["Professor TAM Wai Lun"], "meetingDates": ["02/09/2024 - 25/11/2024"]}}}, "assessments": {"Essays": "60", "Presentation": "40"}}, {"code": "6116", "title": "Buddhist Studies: Seminar II", "career": "Postgraduate - Research", "units": "3.00", "grading": "Graded", "components": "Seminar", "campus": "Main Campus", "academic_group": "Div of Religious Studies", "requirements": "For students in MPhil-PhD Religious Studies", "description": "This seminar examines Buddhism as a dynamic process of borrowing, conflict and interaction between and within traditions that have been identified as Buddhist. We will begin by studying some representative works of both primary and secondary source (such as those put together by Donald Lopez in his Buddhism in Practice). Specific themes and topics will then be chosen in accordance with students’ interest for in-depth examination. The specific content will be designed by the teacher who offers the courses.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "6121", "title": "Taoist Studies: Seminar I", "career": "Postgraduate - Research", "units": "3.00", "grading": "Graded", "components": "Seminar", "campus": "Main Campus", "academic_group": "Div of Religious Studies", "requirements": "For students in MPhil-PhD Religious Studies", "description": "Discussion in seminar setting on selected issues related to Taoism. Readings may include Taoist Canon, Taoist ritual manuscripts, and recent scholars’ work on Taoist studies. Students are allowed to take these courses for more than once, and gain the units each time they pass the course. The specific content will be designed by the teacher who offers the courses.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "6122", "title": "Taoist Studies: Seminar II", "career": "Postgraduate - Research", "units": "3.00", "grading": "Graded", "components": "Seminar", "campus": "Main Campus", "academic_group": "Div of Religious Studies", "requirements": "For students in MPhil-PhD Religious Studies", "description": "Discussion in seminar setting on selected issues related to Taoism. Readings may include Taoist Canon, Taoist ritual manuscripts, and recent scholars’ work on Taoist studies. Students are allowed to take these courses for more than once, and gain the units each time they pass the course. The specific content will be designed by the teacher who offers the courses.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "6131", "title": "Biblical Studies: Seminar I", "career": "Postgraduate - Research", "units": "3.00", "grading": "Graded", "components": "Seminar", "campus": "Main Campus", "academic_group": "Div of Religious Studies", "requirements": "For students in MPhil-PhD Religious Studies", "description": "Discussion in seminar setting on special issues related to biblical studies. Students are allowed to take these courses for more than once, and gain the units each time they pass the course.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "6132", "title": "Biblical Studies: Seminar II", "career": "Postgraduate - Research", "units": "3.00", "grading": "Graded", "components": "Lecture\nSeminar", "campus": "Main Campus", "academic_group": "Div of Religious Studies", "requirements": "For students in MPhil-PhD Religious Studies", "description": "Discussion in seminar setting on special issues related to biblical studies. Students are allowed to take these courses for more than once, and gain the units each time they pass the course.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "6140", "title": "Christian Studies: Seminar I", "career": "Postgraduate - Research", "units": "3.00", "grading": "Graded", "components": "Lecture\nSeminar\nInteractive Tutorial", "campus": "Main Campus", "academic_group": "Div of Religious Studies", "requirements": "For students in MPhil-PhD Religious Studies", "description": "Discussion in seminar setting on specific issues related to Christian studies. Students are allowed to take these courses for more than once, and gain the units each time they pass the course. The specific content will be designed by the teacher who offers the courses.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "6145", "title": "History of Christianity: Seminar I", "career": "Postgraduate - Research", "units": "3.00", "grading": "Graded", "components": "Lecture\nSeminar", "campus": "Main Campus", "academic_group": "Div of Religious Studies", "requirements": "For students in MPhil-PhD Religious Studies", "description": "Discussion in seminar setting on specific issues related to history of Christianity. Students are allowed to take these courses for more than once, and gain the units each time they pass the course.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "6146", "title": "History of Christianity: Seminar II", "career": "Postgraduate - Research", "units": "3.00", "grading": "Graded", "components": "Lecture\nSeminar", "campus": "Main Campus", "academic_group": "Div of Religious Studies", "requirements": "For students in MPhil-PhD Religious Studies", "description": "Discussion in seminar setting on specific issues related to history of Christianity. Students are allowed to take these courses for more than once, and gain the units each time they pass the course.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "6147", "title": "Chinese Christianity: Seminar I", "career": "Postgraduate - Research", "units": "3.00", "grading": "Graded", "components": "Seminar", "campus": "Main Campus", "academic_group": "Div of Religious Studies", "requirements": "For students in MPhil-PhD Religious Studies", "description": "This seminar course aims to reconsider various Christian doctrines from Chinese religious, philosophic and socio-cultural contexts. Students are allowed to take these courses for more than once, and gain the units each time they pass the course. The specific content will be designed by the teacher who offers the courses.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "6148", "title": "Chinese Christianity: Seminar II", "career": "Postgraduate - Research", "units": "3.00", "grading": "Graded", "components": "Seminar", "campus": "Main Campus", "academic_group": "Div of Religious Studies", "requirements": "For students in MPhil-PhD Religious Studies", "description": "This seminar course aims to reconsider various Christian doctrines from Chinese religious, philosophic and socio-cultural contexts. Students are allowed to take these courses for more than once, and gain the units each time they pass the course. The specific content will be designed by the teacher who offers the courses.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "6149", "title": "Christian Studies: Seminar II", "career": "Postgraduate - Research", "units": "3.00", "grading": "Graded", "components": "Lecture\nInteractive Tutorial", "campus": "Main Campus", "academic_group": "Div of Religious Studies", "requirements": "For students in MPhil-PhD Religious Studies", "description": "Discussion in seminar setting on specific issues related to Christian studies. Students are allowed to take these courses for more than once, and gain the units each time they pass the course. The specific content will be designed by the teacher who offers the courses.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "6151", "title": "Religion and Society: Seminar I", "career": "Postgraduate - Research", "units": "3.00", "grading": "Graded", "components": "Lecture\nSeminar", "campus": "Main Campus", "academic_group": "Div of Religious Studies", "requirements": "For students in MPhil-PhD Religious Studies", "description": "Discussion in seminar setting on specific issues related to Religion and Society. Students are allowed to take these courses for more than once, and gain the units each time they pass the course.", "outcome": "- Engage in literary analysis of texts and images related to topics in religion and society; - Acquire critical familiarity with the uses and limitations of major theoretical approaches and frameworks for analysis of topics in religion and society", "syllabus": "The syllabus and assessment type may vary according to the teaching staff and year of offering. Please refer to the course outline for details.", "required_readings": "The reading list may vary depending of the teaching staff and the year of offering.Please refer to the course outline for details.", "recommended_readings": "The reading list may vary depending of the teaching staff and the year of offering.Please refer to the course outline for details.", "terms": {"2024-25 Term 1": {"-S01-SEM (2121)": {"startTimes": ["14:30"], "endTimes": ["17:15"], "days": [1], "locations": ["Esther Lee Bldg 304"], "instructors": ["Professor LAI Pan Chiu"], "meetingDates": ["2/9", "9/9", "16/9", "23/9", "30/9", "7/10", "14/10", "21/10", "28/10", "4/11", "11/11", "18/11", "25/11"]}}}, "assessments": {"Essays": "60", "Presentation": "40"}}, {"code": "6152", "title": "Religion and Society: Seminar II", "career": "Postgraduate - Research", "units": "3.00", "grading": "Graded", "components": "Lecture\nSeminar", "campus": "Main Campus", "academic_group": "Div of Religious Studies", "requirements": "For students in MPhil-PhD Religious Studies", "description": "Discussion in seminar setting on specific issues related to Religion and Society. Students are allowed to take these courses for more than once, and gain the units each time they pass the course.", "outcome": "- Engage in literary analysis of texts and images related to topics in religion and society; - Acquire critical familiarity with the uses and limitations of major theoretical approaches and frameworks for analysis of topics in religion and society", "syllabus": "The syllabus and assessment type may vary according to the teaching staff and year of offering. Please refer to the course outline for details.", "required_readings": "The reading list may vary depending of the teaching staff and the year of offering.Please refer to the course outline for details.", "recommended_readings": "The reading list may vary depending of the teaching staff and the year of offering.Please refer to the course outline for details.", "terms": {"2024-25 Term 2": {"-S01-SEM (1403)": {"startTimes": ["14:30"], "endTimes": ["17:15"], "days": [5], "locations": ["Y.C. Liang Hall G01"], "instructors": ["Professor LAI Pan Chiu"], "meetingDates": ["10/1", "17/1", "24/1", "7/2", "14/2", "21/2", "28/2", "7/3", "14/3", "21/3", "28/3", "11/4", "25/4", "2/5"]}}}, "assessments": {"Essays": "60", "Presentation": "40"}}, {"code": "6160", "title": "Islamic Studies: Seminar I", "career": "Postgraduate - Research", "units": "3.00", "grading": "Graded", "components": "Seminar", "campus": "Main Campus", "academic_group": "Div of Religious Studies", "requirements": "For students in MPhil-PhD in Religious Studies", "description": "This seminar examines Islam as a religion and civilization characterized by dynamics of borrowing, conflict, and interaction between and within traditions that are identified as “Islamic”. We will begin by studying some representative works of both primary and secondary source. Specific themes and topics will then be chosen in accordance with students’ interest for in-depth examination. The specific content will be designed by the teacher who offers the course.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "8003", "title": "Thesis Research", "career": "Postgraduate - Research", "units": "3.00", "grading": "Graded", "components": "Thesis Monitoring Course", "campus": "Main Campus", "academic_group": "Div of Religious Studies", "requirements": "For students in MPhil-PhD Religious Studies", "description": "In this course, a student is required to meet with his/her supervisor regularly who provides necessary guidance and supervision to write up a thesis and monitors the student’s academic progress.", "outcome": "- Engage in research related to students’ research topics by attending conferences, conducting field works, participating in exchange programmes, regular meetings with supervisors, presentations and scholarly exchange with peers and visiting academic parties", "syllabus": "The syllabus and assessment type may vary according to the teaching staff. ", "required_readings": "The reading list may vary depending of the teaching staff and the year of offering. ", "recommended_readings": "The reading list may vary depending of the teaching staff and the year of offering. ", "terms": {"2024-25 Term 1": {"-M01-TMC (3071)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["No Room Required"], "instructors": ["Staff"], "meetingDates": ["02/09/2024 - 25/11/2024"]}}, "2024-25 Term 2": {"-M01-TMC (2976)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["No Room Required"], "instructors": ["Staff"], "meetingDates": ["06/01/2025 - 14/04/2025"]}}}, "assessments": {"Discussion": "50", "Participation": "50"}}, {"code": "8006", "title": "Thesis Research", "career": "Postgraduate - Research", "units": "6.00", "grading": "Graded", "components": "Thesis Monitoring Course", "campus": "Main Campus", "academic_group": "Div of Religious Studies", "requirements": "For students in MPhil-PhD Religious Studies", "description": "In this course, a student is required to meet with his/her supervisor regularly who provides necessary guidance and supervision to write up a thesis and monitors the student’s academic progress.", "outcome": "- Engage in research related to students’ research topics by attending conferences, conducting field works, participating in exchange programmes, regular meetings with supervisors, presentations and scholarly exchange with peers and visiting academic parties", "syllabus": "The syllabus and assessment type may vary according to the teaching staff.", "required_readings": "The reading list may vary depending of the teaching staff.", "recommended_readings": "The reading list may vary depending of the teaching staff.", "terms": {"2024-25 Term 1": {"-M01-TMC (3072)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["No Room Required"], "instructors": ["Staff"], "meetingDates": ["02/09/2024 - 25/11/2024"]}}, "2024-25 Term 2": {"-M01-TMC (3904)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["No Room Required"], "instructors": ["Staff"], "meetingDates": ["06/01/2025 - 14/04/2025"]}}}, "assessments": {"Discussion": "50", "Participation": "50"}}, {"code": "8012", "title": "Thesis Research", "career": "Postgraduate - Research", "units": "12.00", "grading": "Graded", "components": "Thesis Monitoring Course", "campus": "Main Campus", "academic_group": "Div of Religious Studies", "requirements": "For students in MPhil-PhD Religious Studies", "description": "In this course, a student is required to meet with his/her supervisor regularly who provides necessary guidance and supervision to write up a thesis and monitors the student’s academic progress.", "outcome": "- Engage in research related to students’ research topics by attending conferences, conducting field works, participating in exchange programmes, regular meetings with supervisors, presentations and scholarly exchange with peers and visiting academic parties", "syllabus": "The syllabus and assessment type may vary according to the teaching staff.", "required_readings": "The reading list may vary depending of the teaching staff.", "recommended_readings": "The reading list may vary depending of the teaching staff.", "terms": {"2024-25 Term 1": {"-M01-TMC (3070)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["No Room Required"], "instructors": ["Staff"], "meetingDates": ["02/09/2024 - 25/11/2024"]}}, "2024-25 Term 2": {"-M01-TMC (3905)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["No Room Required"], "instructors": ["Staff"], "meetingDates": ["06/01/2025 - 14/04/2025"]}}}, "assessments": {"Discussion": "50", "Participation": "50"}}]