[{"code": "5710", "title": "Fundamental Robotics and Systems", "career": "Postgraduate - Taught", "units": "3.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Div of Mechan & Automation Erg", "requirements": "For students in MSc Robotics", "description": "\"Fundamental Robotics and Systems\" is a foundational course in our Master's program, designed to provide students with an in-depth understanding of essential robotics principles and systems. This course is indispensable for students keen on advanced studies or careers in robotics.The course will concentrate on fundamental technical concepts of robotics, including robotic kinematics, dynamics, sensors, actuators, robotic programming, and basic applications of AI and machine learning in robotics.", "outcome": "Upon successful completion of this course, students will be able to: 1. Understand fundamental principles and systems in robotics, including kinematics, dynamics, sensors, and actuators.2. Understand basic skills in robot programming using languages such as Python and C++, and frameworks like ROS.3. Gain knowledge about the basic applications of AI and machine learning in robotics, including supervised, unsupervised, and reinforcement learning.4. Develop a basic understanding of multi-robot systems, including aspects of communication, coordination, and control.5. Grasp the concepts and implications of human-robot interaction and stay informed about the future trends in robotics.", "syllabus": "The details will be provided by the course instructor.Teaching Plan:    Weeks   Course Topics     1   Introduction to Robotics and Systems: Definition, Scope, Trends, Importance     2   Robotic Kinematics: Forward/Inverse Kinematics, Jacobian     3   Robotic Dynamics: Dynamics Models, Newton-Euler and Lagrange-Euler formulations     4   Sensors in Robotics: Types, Working Principles, Applications     5   Actuators in Robotics: Electric, Hydraulic and Pneumatic Actuators     6   Basic Control Theories in Robotics: PID Control, Feedforward Control     7   Introduction to Robot Programming: Basics of ROS, Python, C++     8   Basics of AI in Robotics: Supervised Learning, Unsupervised Learning     9   Introduction to Machine Learning in Robotics: Reinforcement Learning Concepts     10   Multi-Robot Systems: Communication, Coordination, Control     11   Human-Robot Interaction: Basic Concepts and Social Implications     12   Future of Robotics: Overview of Advanced Topics and Emerging Trends    ", "required_readings": "1.Peter Corke, \"Robotics, Vision and Control: Fundamental Algorithms in MATLAB\", 2nd Edition, Springer, 2017.2.Siciliano, B., Sciavicco, L., Villani, L., Oriolo, G., \"Robotics: Modelling, Planning and Control\", 4th Edition, Springer, 2013", "recommended_readings": "The details will be provided by the course instructor.", "terms": {"2025-26 Term 1": {"--LEC (3745)": {"startTimes": ["18:30"], "endTimes": ["21:15"], "days": [2], "locations": ["Yasumoto Int'l Acad Park LT7"], "instructors": ["Professor LAU Tat Ming"], "meetingDates": ["2/9", "9/9", "16/9", "23/9", "30/9", "21/10", "28/10", "4/11", "11/11", "18/11", "25/11", "2/12", "9/12"]}}}, "assessments": {"Examination": "40", "Homework or assignment": "40", "Test or quiz": "20"}}, {"code": "5720", "title": "Experimental Robotics", "career": "Postgraduate - Taught", "units": "3.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Div of Mechan & Automation Erg", "requirements": "For students in MSc Robotics", "description": "The primary objective of this course is to equip students with the foundational and practical knowledge necessary for executing real-world robotic systems. It aims to help students understand the needs and requirements of robotic experiments and applications, teaching them about various hardware components, software architectures, and development tools.The course covers the following main topics: foundations of robotic systems, robot electronics, sensors and actuators in robotics, robot networking and data communication, introduction to robot operating system (ROS), advanced ROS programming, interfacing with sensors and actuators, robot sensing and control, measurement devices for robot performance, robot experiment setup, operations in robot experiments.", "outcome": "Upon successful completion of this course, students will be able to:1. Understand the hardware components that are required for an operational robot.2. Understand how to use software design and architectures for developing software for robot autonomy. 3. Gain practical experience on developing practical robot systems.4. Learn how to design and perform experiments using robot systems", "syllabus": "The details will be provided by the course instructor. Teaching Plan   Weeks Course Topics   1 Foundations of Robotic Systems: Robot mechanisms, hardware components, system architecture   2 Robot Electronics: Embedded systems, microcontrollers, microprocessors   3 Sensors and Actuators in Robotics: Sensor types, actuator types, sensor-actuator interfacing   4 Robot Networking and Data Communication: Network protocols, data transmission, network security   5 Introduction to ROS: ROS architecture, ROS nodes, ROS topics   6 Advanced ROS Programming: ROS services, ROS actions, ROS debugging tools   7 Interfacing with Sensors and Actuators: Sensor data acquisition, actuator control, sensor-actuator integration   8 Robot Sensing and Control: Sensor fusion, feedback control, control algorithms   9 Measurement Devices for Robot Performance: Performance metrics, measurement tools, data analysis   10 Robot Experiment Setup: Experiment design, safety considerations, experiment execution   11 Operations in Robot Experiments: Data collection, troubleshooting, result interpretation   12 Summary and Revision: Key concepts review, practical skills recap, future trends in robotics  ", "required_readings": "There is no textbook that can satisfy the needs of this course. The course contents will be organized in the form of lecture notes, as well as a list of recommended readings.", "recommended_readings": "Morgan Quigley, Brian Gerkey, and William D. Smart, \"Programming Robots with ROS: A Practical Introduction to the Robot Operating System,\" 1st Edition, O'Reilly Media, 2015.", "terms": {"2025-26 Term 2": {"--LEC (9578)": {"startTimes": ["18:30"], "endTimes": ["21:15"], "days": [3], "locations": ["Lady Shaw Bldg LT2"], "instructors": ["Professor CHEN Fei"], "meetingDates": ["7/1", "14/1", "21/1", "28/1", "4/2", "11/2", "25/2", "4/3", "11/3", "18/3", "25/3", "1/4", "8/4", "15/4"]}}}, "assessments": {"Project": "60", "Test or quiz": "40"}}, {"code": "5730", "title": "Autonomous Mobile Robots", "career": "Postgraduate - Taught", "units": "3.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Div of Mechan & Automation Erg", "requirements": "For students in MSc Robotics", "description": "The course \"Autonomous Mobile Robots,\" aims to provide students with an in-depth understanding of autonomous robots principles and applications. This course is particularly relevant for students targeting careers in robotics, AI, or related fields, given the growing integration of autonomous mobile robots across various industries.The curriculum covers key areas such as fundamentals of autonomous mobile robots, robot perception, robot localization, mapping, path planning, robot control, multi-robot systems, robot navigation, robot communication, autonomous aerial robots, autonomous ground robots, future of autonomous robots.", "outcome": "Upon successful completion of this course, students will be able to: 1. Understand the principles of autonomous mobile robotics.2. Gain basic experience working with autonomous mobile robotic systems.3. Understand the design, control, and optimize the performance of autonomous mobile robotic systems.4. Comprehend advanced topics in autonomous mobile robotics.5. Develop the basic capability to solve complex problems in the field of autonomous mobile robotics.", "syllabus": "The details will be provided by the course instructor. Teaching Plan    Weeks   Course Topics     1   Fundamentals of Autonomous Mobile Robots: Basic concepts, types of robots, robot architectures.     2   Robot Perception: Sensors for autonomous robots, sensory data processing, feature extraction.     3   Robot Localization: Localization techniques, probabilistic localization, Kalman Filters, Particle Filters.     4   Mapping: Occupancy grids, SLAM (Simultaneous Localization And Mapping), map representation.     5   Path Planning: Graph-based planning, grid-based planning, potential field methods.     6   Robot Control: Control architectures, PID control, adaptive control.     7   Multi-Robot Systems: Multi-robot coordination, swarm robotics, distributed algorithms.     8   Robot Navigation: Navigation architectures, obstacle avoidance techniques, navigation in dynamic environments.     9   Robot Communication: Inter-robot communication, wireless communication protocols, networked robotics.     10   Robot manipulation: robot grasping, robot manipulation, visual servoing manipulation     11   Autonomous Robots: wheeled robots, legged robots, UAVs, autonomous cars.     12   Future of Autonomous Robots: Current research trends, real-world applications, ethical considerations.    ", "required_readings": "There is no textbook that can satisfy the needs of this course. The course contents will be organized in the form of lecture notes, as well as a list of recommended readings.", "recommended_readings": "Siegwart, R., Nourbakhsh, I.R., Scaramuzza, D., \"Autonomous Mobile Robots,\" 2nd edition, MIT Press, 2011.", "terms": {"2025-26 Term 2": {"--LEC (3711)": {"startTimes": ["18:30"], "endTimes": ["21:15"], "days": [5], "locations": ["Chen Kou Bun Bldg LT3"], "instructors": ["Staff"], "meetingDates": ["9/1", "16/1", "23/1", "30/1", "6/2", "13/2", "27/2", "6/3", "13/3", "20/3", "27/3", "10/4", "17/4", "24/4"]}}}, "assessments": {"Examination": "40", "Homework or assignment": "40", "Test or quiz": "20"}}, {"code": "5740", "title": "Robot Mechanism and Actuation", "career": "Postgraduate - Taught", "units": "3.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Div of Mechan & Automation Erg", "requirements": "For students in MSc Robotics", "description": "The goal of this course is to introduce various types of actuators and mechanisms that would enable robots to perform a multitude of tasks within manipulation. This course will teach both the fundamental working principles of different mechanisms and actuators and the practical design and implementation of such devices. This course will include the following main topics: different types of actuators (including motors, pneumatics, hydraulics, smart materials), transmission mechanisms (including cable-driven systems, gears and belt drives), parallel mechanisms, closed-loop mechanisms, robot grippers and hands, vacuum grippers, and flexible and soft mechanisms.", "outcome": "Upon successful completion of this course, students will be able to:1. Understand the different types of actuators that can be used for robotic systems.2. Understand the different types of mechanisms that can actuate a robot3. Understand the different types of end-effector mechanisms for robot manipulation.4. Gain practical experience of how different mechanisms are suitable for different application settings. 5. Develop the capability to solve complex problems in academic research, industrial applications, or new technology development in the robotics field.", "syllabus": "The details will be provided by the course instructor. Teaching Plan    Weeks   Course Topics     1   Robot Actuators - Traditional: Motors, Pneumatics, Hydraulics     2   Robot Actuators - Modern: Smart Materials, Electroactive Polymers, Shape Memory Alloys     3   Robot Transmission Mechanisms - Linkages, Closed Chain: Cable-Driven Systems, Gears, Belt Drives     4   Robot Transmission Mechanisms - Rigid and Cable Actuation: Worm Drives, Harmonic Drives, Capstan Drives     5   Parallel Mechanisms: Stewart Platforms, Delta Robots, Hexapods     6   Robot Grippers and Vacuums: Mechanical Grippers, Vacuum Grippers, Magnetic Grippers     7   Robot Hands - Part 1: Anthropomorphic Hands, Adaptive Grippers, Underactuated Hands     8   Robot Hands - Part 2: Tactile Sensing, Grasp Planning, Dexterous Manipulation     9   Flexible and Soft Mechanisms - Part 1: Soft Actuators, Elastomer Sensors, Soft Robotics     10   Flexible and Soft Mechanisms - Part 2: Fluidic Actuators, Bending Actuators, Soft Grippers     11   Applications of Manipulation: Industrial Robotics, Service Robotics, Surgical Robotics     12   Summary and Revision: Key Concepts Recap, Practical Applications, Future Trends   ", "required_readings": "There is no textbook that can satisfy the needs of this course. The course contents will be organized in the form of lecture notes, as well as a list of recommended readings.", "recommended_readings": "1. Siciliano, B., Sciavicco, L., Villani, L., Oriolo, G., \"Robotics: Modelling, Planning and Control\", 4th Edition, Springer, 20132. Spong, M. W., Hutchinson, S., Vidyasagar, M., \"Robot Modeling and Control\", 2nd Edition, Wiley, 2020", "terms": {"2025-26 Term 1": {"--LEC (3704)": {"startTimes": ["18:30"], "endTimes": ["21:15"], "days": [3], "locations": ["Lady Shaw Bldg LT5"], "instructors": ["Professor CHENG Shing Shin"], "meetingDates": ["3/9", "10/9", "17/9", "24/9", "8/10", "15/10", "22/10", "5/11", "12/11", "19/11", "26/11", "3/12"]}}}, "assessments": {"Project": "40", "Test or quiz": "60"}}, {"code": "5750", "title": "Micro-nano and Soft Robotics", "career": "Postgraduate - Taught", "units": "3.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Div of Mechan & Automation Erg", "requirements": "For students in MSc Robotics", "description": "This course aims to systematically introduce the fundamental knowledge of emerging and interdisciplinary research fields—micro-/nanorobotics and soft robotics. Through a combination of theoretical learning and practical operations, students will gain a comprehensive understanding of the historical development and state-of-the-art of this field, as well as acquire skills related to designing and manufacturing micro-nano and soft robots. The main topics covered in this course are as follows: historical development and basic principles of micro-nano and soft robots; structural design, material selection, actuation methods, and motion control of micro-nano and soft robots; applications of micro-nano and soft robots in fields such as biomedicine and engineering. Throughout the course, students will not only grasp the fundamental concepts of small-scale robotics and soft robotics, but also learn how to design and construct these robots firsthand. The comprehensive learning experience provided by this course can foster students’ scientific and technological innovation thinking, as well as enhance their practical skills, providing a solid foundation for their future research and/or work in related fields.", "outcome": "By successfully completing this course, students will achieve the following learning outcomes:1. Gain a comprehensive and thorough understanding of micro-nano and soft robots, including their historical development, basic definitions, working mechanisms, and design principles.2. Learn the characteristics of different types of micro-nano and soft robots, including aspects like fabrication methods, substrate materials, structural design, and actuation strategies3. Understand the applications of micro-nano and soft robots in biomedicine and engineering, as well as the opportunities and challenges that the field faces in the future.4. Acquire key technologies in the design and fabrication of micro-nano and soft robots, such as modeling and simulation, 3D printing, material synthesis, and microelectronic techniques, and gain relevant experience through practical operation.5. Develop the ability to engage in scientific research, technological development, and product design related to the field of small-scale robotics.", "syllabus": "The details will be provided by the course instructor. Teaching Plan     Weeks   Course Topics     1   Introduction to micro-nanorobotics: brief history and definition.     2   Fundamentals of micro-nanorobotics: scaling law, force analysis, design, and fabrication.     3   Actuation of micro-nanorobotic: wireless control, self-propulsion, and field-driven.     4   Micro-nanorobotic swarms: generation, locomotion, and pattern transformation.     5   Biomedical applications of micro-nanorobotics: targeted delivery, medical imaging, accelerated thrombolysis, biofilm removal, assisted embolization.     6   Introduction to soft robotics: history, definition, characteristics, and working principle.     7   Design and fabrication of soft robotics: molding, 3D printing techniques, Semiconductor and microelectronic techniques, modular assembly.     8   Actuation of soft robotics: magnetic, acoustic, light, thermal, chemical, and biohybrid.     9   Various types of soft robotics: silicone elastomers-based, carbon-based, hydrogels-based, liquid crystal network and elastomer-based, and flexible ferrofluid-based.     10   Applications of soft robotics: biomedical applications, intelligent electronics, micromanipulation, and sensing.     11   Selected topics discussion     12   Project presentation and summary   ", "required_readings": "There is no textbook that can satisfy the needs of this course. The course contents will be organized in the form of lecture notes, as well as a list of recommended readings.", "recommended_readings": "1. Li Zhang, Shihao Yang, Qianqian Wang, Dongdong Jin. Magnetic Micro and Nanorobot Swarms: From Fundamentals to Applications, Singapore, Springer Singapore, ISBN: 978-981-99-3035-7, 2023.2. Li Zhang, Jiachen Zhang, Neng Xia, Yue Dong. Untethered Miniature Soft Robots: Materials, Fabrications, and Applications, John Wiley & Sons, ISBN: 978-352-73-5177-0, 2023.3. Sitti Metin. Mobile microrobotics. MIT Press, ISBN:978-026-20-3643-6, 2017.", "terms": {"2025-26 Term 1": {"--LEC (3705)": {"startTimes": ["18:30"], "endTimes": ["21:15"], "days": [4], "locations": ["Lady Shaw Bldg LT2"], "instructors": ["Professor ZHANG Li"], "meetingDates": ["4/9", "11/9", "18/9", "25/9", "2/10", "9/10", "16/10", "23/10", "30/10", "6/11", "13/11", "20/11", "27/11", "4/12", "11/12"]}}}, "assessments": {"Examination": "60", "Homework or assignment": "20", "Presentation": "20"}}, {"code": "5760", "title": "Robot Learning", "career": "Postgraduate - Taught", "units": "3.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Div of Mechan & Automation Erg", "requirements": "For students in MSc Robotics", "description": "The main goal of this course is to comprehensively introduce the principles and technical methods used in modern robot learning and control techniques. This course will not only teach students how to use data-driven methods to design, control and optimize robot systems through theoretical learning and practical operations, but will also delve into relevant basic knowledge and skills, to ensure that students can fully master and apply these important skills. Practical assignments will give students the opportunity to implement these techniques on simulated and real robot systems, providing them with a comprehensive educational experience.This course will include the following main topics: robot kinematics and dynamics, optimal control, reinforcement learning in robots, teaching learning, embodied intelligent learning, trajectory optimization and robot perception, human-robot interactive and collaborative learning used in robot control and perception, machine learning, etc.", "outcome": "Upon successful completion of this course, students will be able to:1. Understand the principles and techniques of robot learning, optimization, and control thoroughly.2. Acquire the ability to apply techniques like optimal control, reinforcement learning, and trajectory optimization in the design and optimization of robotic systems.3. Gain practical experience by implementing learned techniques on real and simulated robotic systems.4. Comprehend advanced topics in robotics, such as multi-robot systems, human-robot interaction, and the use of machine learning in robot control and perception.5. Develop the capability to solve complex problems in academic research, industrial applications, or new technology development in the robotics field.", "syllabus": "The details will be provided by the course instructor. Teaching Plan      Weeks   Course Topics     1   Basics of robot learning and control: kinematics, dynamics, quadratic cost function, Gauss–Newton algorithm, Jacobian matrices, control laws.     2   Robot sensing and data: sensors, datasets, physics modeling, robot simulation, sensor fusion, data interpretation.     3   Robot trajectory: encoding, basis functions, trajectory planning, path following, obstacle avoidance.     4   Robot trajectory optimization: movement primitives, cost minimization, constraints handling, dynamic programming.     5   Robot reinforcement learning: Q-learning, policy gradient, deep deterministic policy gradient, Monte Carlo method, exploration vs exploitation, reward shaping.     6   Robot imitation learning: behavior cloning, inverse reinforcement learning, learning from demonstration, kinesthetic teaching, model-free vs model-based approaches.     7   Robot embodied intelligence learning: humanoid robot, embodiment intelligence, sensorimotor learning, embodied cognition.     8   Human-robot interaction and collaboration: teleoperation, collaboration, shared autonomy, user interfaces, cooperative control.     9   Robot learning control: control primitives, linear quadratic tracking, iterative linear quadratic tracking, PID control, model predictive control.     10   Robots with generative AI: robot perception, robot manipulation, large language models, generative models, image synthesis.     11   Selected topics discussion: current research trends, case studies, industry applications.     12   Project presentation and summary: project execution, report writing, presentation skills, project review and feedback.    ", "required_readings": "There is no textbook that can satisfy the needs of this course. The course contents will be organized in the form of lecture notes, as well as a list of recommended readings.", "recommended_readings": "1. Steven L. Brunton, J. Nathan Kutz, “Data-Driven Science and Engineering: Machine Learning, Dynamical Systems, and Control”.", "terms": {"2025-26 Term 2": {"--LEC (3675)": {"startTimes": ["18:30"], "endTimes": ["21:15"], "days": [2], "locations": ["Lady Shaw Bldg LT1"], "instructors": ["Staff"], "meetingDates": ["6/1", "13/1", "20/1", "27/1", "3/2", "10/2", "24/2", "3/3", "10/3", "17/3", "24/3", "31/3", "14/4"]}}}, "assessments": {"Homework or assignment": "60", "Project": "40"}}, {"code": "5770", "title": "Unmanned Systems", "career": "Postgraduate - Taught", "units": "3.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Div of Mechan & Automation Erg", "requirements": "For students in MSc Robotics", "description": "\"Unmanned Systems\" is a cutting-edge course as a response to the rapid technological advancements and increasing industry demands in this domain. This course aims to provide students with a comprehensive understanding of theoretical foundations and practical implementations of unmanned systems, for example unmanned aerial vehicle (UAV), remotely operated vehicle (ROV), autonomous driving vehicles. The course is specifically designed to expose students to the challenges and opportunities present in the design, control, and application of unmanned systems, thereby preparing them for impactful careers in this rapidly evolving field.The course will cover essential technical elements including introduction to unmanned systems, system architecture, autonomous control, sensors for unmanned systems, sensor fusion, path planning, navigation systems, AI for unmanned systems, unmanned aerial vehicles, underwater and surface vehicles, autonomous driving vehicles, future challenges and opportunities.", "outcome": "Upon successful completion of this course, students will be able to:1. Understand the essential components and design principles of unmanned systems, including their types, characteristics, and applications.2. Gain knowledge of autonomous control algorithms and levels, as well as system stability factors in unmanned systems.3. Acquire skills in integrating and using various types of sensors in unmanned systems, and learn data fusion techniques for sensor data.4. Master various path planning algorithms and obstacle avoidance techniques in dynamic environments.5. Develop an understanding of the role and application of AI in unmanned systems, including machine learning algorithms and AI decision-making processes.", "syllabus": "The details will be provided by the course instructor. Teaching Plan      Weeks   Course Topics     1   Introduction to Unmanned Systems: Types of unmanned systems, basic characteristics, applications.     2   System Architecture: System components, interconnection and interaction, design principles.     3   Autonomous Control: Control algorithms, autonomy levels, system stability.     4   Sensors for Unmanned Systems: Types of sensors, sensor integration, data acquisition.     5   Sensor Fusion: Data fusion techniques, sensor fusion algorithms, benefits and challenges.     6   Path Planning: Path planning algorithms, obstacle avoidance, dynamic path planning.     7   Navigation Systems: GPS, INS, SLAM, sensor-based navigation.     8   AI for Unmanned Systems: Role of AI, machine learning algorithms, AI in decision-making.     9   Unmanned Aerial Vehicles: UAV types, UAV control, UAV applications.     10   Underwater and Surface Vehicles: ROV, AUV, ASV, control and applications.     11   Autonomous Driving Vehicles: ADAS, autonomous driving levels, key technologies.     12   Future Challenges and Opportunities: Emerging technologies, ethical considerations, industry trends.    ", "required_readings": "There is no textbook that can satisfy the needs of this course. The course contents will be organized in the form of lecture notes, as well as a list of recommended readings.", "recommended_readings": "Thrun, Sebastian, Wolfram Burgard, and Dieter Fox. \"Probabilistic Robotics.\" MIT Press, 2005.", "terms": {"2025-26 Term 2": {"--LEC (3732)": {"startTimes": ["18:30"], "endTimes": ["21:15"], "days": [1], "locations": ["Li Koon Chun Hall LT1"], "instructors": ["Professor CHEN Xi"], "meetingDates": ["5/1", "12/1", "19/1", "26/1", "2/2", "9/2", "23/2", "2/3", "9/3", "16/3", "23/3", "30/3", "13/4", "20/4"]}}}, "assessments": {"Homework or assignment": "60", "Project": "40"}}, {"code": "5780", "title": "Special Topics in Advanced Robotics", "career": "Postgraduate - Taught", "units": "3.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Div of Mechan & Automation Erg", "requirements": "For students in MSc Robotics", "description": "Robotics is a rapidly evolving field, with new technologies emerging every day. The course offers students timely and updated coverage of a wide range of topics relevant to robotics tapping on the latest and diverse range of developments in the repertoire of the subject area, such as the delivery of a measured collation of advanced and unconventional robotics designs applied to real problems of a diverse nature and which are not easily and directly available from standard literature. The nature of the course allows the flexibility for recent topics, problems and solutions to be shared with the students.Topics might include but not limited to cutting-edge technologies in robotics platforms, unmanned systems, modeling and control, communications systems, vision systems, sensing and information processing, navigation and path planning, information fusion, multi-agent robotics systems, mission management, machine intelligence, artificial intelligence, human-machine collaboration, and digital twins systems, as well as innovative application case studies.", "outcome": "Upon successful completion of this course, students will be able to:1. Understand the principles and techniques of specific topics in robotics systems thoroughly.2. Acquire the ability to design specific robotics systems for special applications. 3. Gain the first-hand experience on the latest development in robotics research areas.4. Develop research interests in the related fields.5. Develop the capability to solve complex problems in academic research, industrial applications, or new technology development in the robotics field.", "syllabus": "Up-to-date topics will be delivered every week.  ", "required_readings": "There is no textbook that can satisfy the needs of this course. The course contents will be organized in the form of lecture notes, as well as a list of recommended readings.", "recommended_readings": "To be determined on the actual topics selected.", "terms": {"2025-26 Term 2": {"--LEC (3677)": {"startTimes": ["18:30"], "endTimes": ["21:15"], "days": [4], "locations": ["TBA"], "instructors": ["Staff"], "meetingDates": ["8/1", "15/1", "22/1", "29/1", "5/2", "12/2", "26/2", "5/3", "12/3", "19/3", "26/3", "2/4", "9/4", "16/4"]}}}, "assessments": {"Homework or assignment": "60", "Report": "40"}}, {"code": "5790", "title": "Commercialization and Entrepreneurship", "career": "Postgraduate - Taught", "units": "3.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Div of Mechan & Automation Erg", "requirements": "For students in MSc Robotics; Exclusion: AIMS5760 or CMSC5730 or ENGG3802 or ENGG3803 or ENGG5700 or ESTR3502 or FTEC5570 or IEMS5712 or IERG5340 or SEEM3450", "description": "This course, \"Entrepreneurship in Robotics\", acknowledges the growing role of high technologies such as robotics in various sectors and the increasing demand for innovators and entrepreneurs in this dynamic field. This course aims to bridge the gap between technical expertise in the technical field and the entrepreneurial skills needed to bring innovative ideas to market.The course will cover key aspects of entrepreneurship tailored specifically to the robotics sector. Topics will include: introduction to advanced technologies, identifying market opportunities in robotics, understanding the process of commercializing a robotics product, company setup and navigating the legal and regulatory landscape, team formation, product identification, project management, Business Model for robotics, sales and marketing, account and finance, budgeting and funding, business plan and investment deck, and final presentation for astartup. Practical aspects of starting and running a start-up, such as team building, fundraising, and pitching to investors, will also be covered.", "outcome": "Upon successful completion of this course, students will be able to:1. Understand the fundamentals of entrepreneurship specifically tailored to a specific sector, including identifying market opportunities, and commercializing a product.2. Acquire knowledge on the legal and regulatory landscape impacting robotics, including patents and intellectual property.3. Gain practical skills related to starting and running a start-up, such as team building, fundraising, and pitching to investors.4. Master techniques for developing business and financial plans, marketing and sales strategies, and customer relations and support for a robotics start-up.5. Develop insights on scaling a robotics start-up and understanding emerging trends and future opportunities in robotics and entrepreneurship.", "syllabus": "The details will be provided by the course instructor. Teaching Plan      Weeks   Course Topics     1   Introduction to advanced technologies: Definition, Scope, Trends, Entrepreneurship     2   Identifying Market Opportunities: Robotics Market, Needs, Applications, Case Studies     3   Commercializing a Product: Prototype, Challenges, Guest Speaker     4   Company Setup: Startup Formation, Legal Aspects, Regulations     5   Team Formation: Team Importance, Balanced Team, Conflict Management     6   Product Identification: Viable Product, Development Lifecycle, MVP Concept     7   Project Management: Basics, Agile Methodologies, Risk Management     8   Business Model: Understanding, Monetization, Case Studies     9   Sales and Marketing: Sales Strategies, Marketing Channels, B2B, B2C     10   Accounting and Finance: Basics, Financial Management, Cash Flow     11   Budgeting and Funding: Budgeting, Funding Sources, Investment Rounds     12   Business Plan and Investment Deck: Business Plan, Investment Deck, Pitching   ", "required_readings": "There is no textbook that can satisfy the needs of this course. The course contents will be organized in the form of lecture notes, as well as a list of recommended readings.", "recommended_readings": "1. Peter Thiel, Blake Masters, “Zero to One: Notes on Startups, or How to Build the Future”, 1st Edition, Crown Business, 2014.2. Eric Ries, “The Lean Startup: How Today's Entrepreneurs Use Continuous Innovation to Create Radically Successful Businesses”, 1st Edition, Crown Business, 2011.3. Steve Blank, Bob Dorf, “The Startup Owner's Manual: The Step-by-Step Guide for Building a Great Company”, 1st Edition, K&S Ranch, 2012.", "terms": {"2025-26 Term 1": {"--LEC (3771)": {"startTimes": ["18:30"], "endTimes": ["21:15"], "days": [5], "locations": ["Esther Lee Bldg LT1"], "instructors": ["Professor LAM Hiu Fung"], "meetingDates": ["5/9", "12/9", "19/9", "26/9", "3/10", "10/10", "17/10", "24/10", "31/10", "7/11", "14/11", "21/11", "28/11", "5/12"]}}}, "assessments": {"Discussion": "20", "Project": "70", "Participation": "10"}}, {"code": "5910", "title": "M.Sc.Projects", "career": "Postgraduate - Taught", "units": "3.00", "grading": "Graded", "components": "Laboratory", "campus": "Main Campus", "academic_group": "Div of Mechan & Automation Erg", "requirements": "For students in MSc Robotics", "description": "In this course, each student will conduct research project on a topic within the robotics areas of study. Faculty members from the department will supervise the project. Upon completion, students must submit a written report and deliver an oral presentation for performance evaluation.", "outcome": "Upon successful completion of this course, students will be able to:1. Understand the fundamental knowledge and latest developments in the selected research area.2. Conduct research in the selected research area and solve problems effectively.3. Communicate effectively through both written reports and oral presentations.", "syllabus": "In this course, each student will perform research project on a topic related to robotics area under the supervision of faculty members supported by various related available facilities, such as the faculty labs, CUHK Robotics Institute, InnoHK Centres, start-ups and state-of-the-art robot equipment and hardware. No class will be arranged. The student will meet with the supervisor regularly to discuss the research progress. At the end of the project, the student is required to submit a written report and give an oral presentation for the assessment of performance.", "required_readings": "There is no textbook that can satisfy the needs of this course. The course contents will be organized in the form of lecture notes, as well as a list of recommended readings.", "recommended_readings": "Reading materials will be provided by each supervisor according to research topics.", "terms": {"2025-26 Term 2": {"-L01-LAB (3689)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["No Room Required"], "instructors": ["Professor XU Dongyan"], "meetingDates": ["23/02/2026 - 04/05/2026", "05/01/2026 - 09/02/2026"]}}}, "assessments": {"Essays": "70", "Presentation": "30"}}]