[{"code": "1000", "title": "Russian I", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "Classwork", "campus": "Main Campus", "academic_group": "Dept of Linguistics & Mod Lang", "requirements": "Not for students who have taken RUSS2000,2001,2050,3000 or 3050", "description": "As the first in a series of six language courses, this course invites students without prior knowledge of Russian to explore the basic features of the Russian language. Supported by audiovisual aids, students will receive intensive practice in spoken and written Russian through interactive class work, homework and online exercises. They will become familiar with the basic concepts of Russian grammar and learn how to interact in some simple everyday situations.", "outcome": "Upon successful completion of the course, students should be able to:  • Understand short, simple messages and announcements;  • read short simple texts and find specific information;  • communicate in simple, routine situations;  • write simple notes, messages and short personal letters.  By the end of the course, students should be able to perform at Level A1.1 of the Common European Framework", "syllabus": "    RUSS1000      Unit Topics Content & Structures   1 Russia and Russian. Introduction to the Russian language and culture.  Alphabet. Consonants and vocals. Intonation.    2  Popular occupations. Self-introduction.  Personal pronouns. Nouns’ gender (introduction). Here and there. Unstressed (o).   3 My family. Who/ what is it?  Possessive pronouns (introduction). Negation. Numerals 1 to 10. Consonants (hard and soft).   4  Strange city. Asking and giving directions.  Gender of nouns. Where is?   5 Well-known personalities. Who? Where? When? Possessive pronouns. Plural of nouns (introduction). Whose? (introduction) To know.   6 Living. My room.    Plural of nouns. Whose? Cases system of nouns (introduction).   7 In the shop. I like it. How much? Numerals 11-100. Adjectives. Which? Days of the week. Verb conjugation I and II.     ", "required_readings": "• Nachalo Book 1 (Student Edition) + Listening Comprehension Audio CD, by: Sophia Lubensky,Gerard Ervin,Larry McLellan,Donald Jarvis,Sophia Lubensky; ISBN-13: 9780072433937 / ISBN-10: 0072433930; Edition: 2, 2002,| 448 pages • Terence Wade, A Comprehensive Russian Grammar, London: WileyBlackwell, 2000.  • Terence Wade, A Russian Grammar Workbook, London: WileyBlackwell, 1995.  • Terence Wade, Using Russian Vocabulary, Cambridge, CUP 2009  • Daphne M.West, Beginner's Russian Grammar (Teach Yourself), McGraw-Hill/Contemporary, 2000", "recommended_readings": "• Nachalo Book 1 (Student Edition) + Listening Comprehension Audio CD, by: Sophia Lubensky,Gerard Ervin,Larry McLellan,Donald Jarvis,Sophia Lubensky; ISBN-13: 9780072433937 / ISBN-10: 0072433930; Edition: 2, 2002,| 448 pages • Terence Wade, A Comprehensive Russian Grammar, London: WileyBlackwell, 2000.  • Terence Wade, A Russian Grammar Workbook, London: WileyBlackwell, 1995.  • Terence Wade, Using Russian Vocabulary, Cambridge, CUP 2009  • Daphne M.West, Beginner's Russian Grammar (Teach Yourself), McGraw-Hill/Contemporary, 2000", "terms": {"2022-23 Term 1": {"-C01-CLW (6432)": {"startTimes": ["9:30"], "endTimes": ["12:15"], "days": [4], "locations": ["Yasumoto Int'l Acad Park 404"], "instructors": ["Ms. ZAITSEVA Marina"], "meetingDates": ["8/9", "15/9", "22/9", "29/9", "6/10", "13/10", "20/10", "27/10", "3/11", "10/11", "17/11", "24/11", "1/12"]}}, "2022-23 Term 2": {"-C01-CLW (5314)": {"startTimes": ["9:30"], "endTimes": ["12:15"], "days": [4], "locations": ["T.C. Cheng Bldg 208"], "instructors": ["Staff"], "meetingDates": ["12/1", "19/1"]}}}, "assessments": {"Essays": "10", "Essay test or exam": "40", "Others": "15", "Presentation": "15", "Short answer test or exam": "20"}}, {"code": "2000", "title": "Russian II", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "Classwork", "campus": "Main Campus", "academic_group": "Dept of Linguistics & Mod Lang", "requirements": "Pre-requisite: RUSS1000\nNot for students who have taken RUSS2001,2050,3000 or 3050", "description": "Building on the knowledge acquired in RUSS1000, this course aims to further develop students' ability to communicate in Russian in various everyday situations. It also seeks to give students a taste of Russian culture and invites them to explore cultural differences. Through intensive practice students will develop more confidence in interacting in Russian while further expanding and solidifying their understanding of the basic grammar and pronunciation patterns.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "2001", "title": "Russian III", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "Classwork", "campus": "Main Campus", "academic_group": "Dept of Linguistics & Mod Lang", "requirements": "1.Not for students who have taken RUSS3000 or 3050\n2.Pre-requisite: RUSS2000 or 2050", "description": "This course aims to further enhance students’ communication skills in the four language domains listening, speaking, reading and writing. Students are expected to communicate confidently in a wider range of social interactions including more formal situations and simple professional contexts as well as reporting past events and sharing experience. At the end of this course, students will have completed a proficiency level comparable to level A1 of the Common European Framework of Reference for Languages (CEFR).", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "2050", "title": "Russian I & II", "career": "Undergraduate", "units": "6.00", "grading": "Graded", "components": "Classwork", "campus": "Main Campus", "academic_group": "Dept of Linguistics & Mod Lang", "requirements": "Not for students who have taken RUSS1000,2000,2001,3000,3050", "description": "This is a summer intensive Russian language course for beginners, covering the full syllabus of RUSS1000 and 2000.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "3000", "title": "Russian IV", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "Classwork", "campus": "Main Campus", "academic_group": "Dept of Linguistics & Mod Lang", "requirements": "1.Not for students who have taken RUSS3050\n2.Pre-requisite: RUSS2001", "description": "This course aims at increasing students’ communicative fluency in oral and written Russian. Using a variety of classroom activities and multimedia, students will build up their competence in the four language domains listening, speaking, reading and writing. Through intensive practice they will be able to communicate in a wide range of social situations with the appropriate awareness of the pragmatic rules involved. Students will receive guidance in the process of composing longer texts displaying a range of registers and styles relating to past, present and future events.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "3050", "title": "Russian III & IV", "career": "Undergraduate", "units": "6.00", "grading": "Graded", "components": "Classwork", "campus": "Main Campus", "academic_group": "Dept of Linguistics & Mod Lang", "requirements": "Not for students who have taken RUSS2001 or RUSS3000. Pre-requisite: RUSS2000 or RUSS2050.", "description": "This is a summer intensive Russian language course, covering the full syllabus of RUSS2001 and 3000.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}]