[{"code": "6001", "title": "Issues and Advances in School Improvement", "career": "Postgraduate - Taught", "units": "3.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Div of Education", "requirements": "For students in MA School Improvement and Leadership", "description": "This module will critically examine key current issues related to school improvement. These issues include postmodern views on leadership, management and school change, creating schools as learning as well as knowledge creation and management organizations, improvement plans, whole-school curriculum planning, inclusiveness, student and parental involvement in improvement and partnership development. Up-to-date theories and practice drawing on school improvement experience from international and comparative perspectives will also be covered, as well as critical analysis of self-managing schools and school effectiveness and improvement research. The perspectives of stakeholders such as teachers, principals, policy-makers, students and parents on school improvement will also be discussed.", "outcome": "To enable participant to  1. acquire understanding of different perspectives and theories related to school improvement; 2. apply the acquired knowledge to analyze how schools develop and improve; 3. acquire practical strategies to initiate school improvement; 4. critically examine different school improvement cases.  (Individual course teachers may update the learning outcome as and whenever necessary.)", "syllabus": "(Please refer to the course outline of respective teacher for details.)", "required_readings": "(Required readings (if any) would depend on individual course teachers. Please refer to the course outline of respective teacher for details.)", "recommended_readings": "(Recommended readings (if any) would depend on individual course teachers. Please refer to the course outline of respective teacher for details.)", "terms": {"2022-23 Term 2": {"--LEC (2537)": {"startTimes": ["18:30"], "endTimes": ["21:00"], "days": [1], "locations": ["Hui Yeung Shing Bldg G01"], "instructors": ["Professor CHEUNG Chi Keung Alan"], "meetingDates": ["9/1", "16/1"]}}}, "assessments": {"Homework or assignment": "0", "Presentation": "0", "Participation": "0"}}, {"code": "6002", "title": "Leadership for Student Learning", "career": "Postgraduate - Taught", "units": "3.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Div of Education", "requirements": "For students in MA School Improvement and Leadership", "description": "The heart of school leadership and professional development is the improvement of student life and learning. This module will critically examine key leadership and professional development issues specifically as they relate to learning, teaching and curriculum in the school context. With reference to different levels of school leadership, the course is designed to promote the critical evaluation of theories related to effective learning and teaching and their application to local classrooms and schools. Course content includes current local and international thinking in areas such as school restructuring, instructional and curriculum leadership, teacher professional development, action research and reflective practice, teacher motivation, team building, peer observation and developmental supervision. Students are encouraged to pool theoretical and craft knowledge to develop approaches and strategies to lead and manage effective learning in their own schools.", "outcome": "To enable participant to  1. Developed a stance of what effective leadership means in Hong Kong. 2. A firm understanding of the latest school leadership literature. 3. Understood the factors contributing to effective leadership in Hong Kong schools. 4. Appreciated the applicability of the theories in Hong Kong context 5. Proposed a number of key approaches and strategies to lead and manage effective learning in your school. 6. Reflected upon leadership. 7. Enjoyed your learning and the community you share with other learners.  (Individual course teachers may update the learning outcome as and whenever necessary.)", "syllabus": "1. Foundations of management and leadership theories 2. Accountability and governance in schools  3. Leadership and school improvement 4. Leadership and teacher development 5. Leadership and student learning  6. Integration  (For reference only, please refer to the course outline of respective teacher for details.)", "required_readings": "(Required readings (if any) would depend on individual course teachers. Please refer to the course outline of respective teacher for details.)", "recommended_readings": "(Recommended readings (if any) would depend on individual course teachers. Please refer to the course outline of respective teacher for details.)", "terms": {"2022-23 Term 1": {"--LEC (3477)": {"startTimes": ["18:30"], "endTimes": ["21:00"], "days": [3], "locations": ["Esther Lee Bldg 403"], "instructors": ["Dr. HO Sai Mun Stanley, \n\nProfessor YUEN Yuet Mui"], "meetingDates": ["7/9", "14/9", "21/9", "28/9", "5/10", "12/10", "19/10", "26/10", "2/11", "9/11", "16/11", "23/11", "30/11"]}}}, "assessments": {"Essays": "50", "Project": "50"}}, {"code": "6003", "title": "Evaluation for School Improvement", "career": "Postgraduate - Taught", "units": "1.50", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Div of Education", "requirements": "For students in MA School Improvement and Leadership", "description": "This module focuses on different perspectives, models and methodologies for evaluating school improvement. First, various evaluation ideologies and perspectives will be examined. Secondly, different models of formative and summative methods of evaluation, role of stakeholders in school-based evaluation and their relationships with school improvement would be explored. A workshop on the use of SPSS for basic statistical skills and a follow-up tutorial on data entry and analyses will be given to each student. Finally, issues on school based evaluation, external review and teacher evaluation would be discussed.", "outcome": "After the course, students will be able: 1. To become familiar with the body of knowledge that comprises current approaches to educational evaluation and a number of current issues related to school improvement. 2. To define the problems and questions in educational evaluation and to decide what to measure in assessing school performance. 3. To understand the requirements in establishing a quality assurance mechanism within the school and the strategies to build up such a mechanism. 4. To acquire the skills and techniques in school self-evaluation and to formulate the necessary tools and instruments that aligns with the realization of the school’s goals and missions. 5. To understand the functions and roles of both the external school reviews and school self-evaluation in relation to school improvement, including its strengths and weaknesses.  (Individual course teachers may update the learning outcome as and whenever necessary.)", "syllabus": "1. Educational Evaluation and Research from International Perspective 2. Educational Evaluation and Improvement in Local Context 3. Assessing Students’ Cognitive Domains 4. Assessing Students’ Affective and Social Domains 5. Workshop: Hands on Experience on Statistical Skills and Techniques 6. Educational Evaluation: Development vs Accountability 7. Tutorial SPSS, Data Entry and Analysis  (For reference only, please refer to the course outline of respective teacher for details.)", "required_readings": "(Required readings (if any) would depend on individual course teachers. Please refer to the course outline of respective teacher for details.)", "recommended_readings": "(Recommended readings (if any) would depend on individual course teachers. Please refer to the course outline of respective teacher for details.)", "terms": {"2022-23 Term 1": {"--LEC (1550)": {"startTimes": ["18:30"], "endTimes": ["21:00"], "days": [1], "locations": ["Ho Tim Building M1"], "instructors": ["Professor CHEUNG Chi Keung Alan"], "meetingDates": ["19/9", "26/9", "3/10", "10/10", "17/10"]}}}, "assessments": {"Discussion": "0", "Others": "0", "Project": "0", "Participation": "0"}}, {"code": "6004", "title": "Field Experience", "career": "Postgraduate - Taught", "units": "1.50", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Div of Education", "requirements": "For students in MA School Improvement and Leadership", "description": "In this module, students will participate in/ visit schools and other educational settings that are involved in exemplary schools, successful educational improvement projects, curriculum development efforts, and professional development activities. They will participate in seminars and workshops to learn strategies of school improvement. Through field study and various modes of learning, students will to be able to bridge theory and practice in school improvement for their own needs.", "outcome": "Through class participation, field experience and other learning activities of different course components, students should be able to: 1. understand the core ideas, logic, relevance and implications of educational change 2. grasp the key concepts and their interrelationship and theoretical frameworks of educational change, school improvement and leadership 3. appreciate the contexts, rationales and justification of specific cases of school improvement 4. reflect on their day-to-day practices for educational change and school improvement and share their personal experience, views and critical comments 5. apply what they have learnt from the course to writing a proposal with literature/research basis, rationales and justification in context on the implementation and evaluation of a school improvement project  (Individual course teachers may update the learning outcome as and whenever necessary.)", "syllabus": "(Please refer to the course outline of respective teacher for details.)", "required_readings": "(Required readings (if any) would depend on individual course teachers. Please refer to the course outline of respective teacher for details.)", "recommended_readings": "(Recommended readings (if any) would depend on individual course teachers. Please refer to the course outline of respective teacher for details.)", "terms": {"2022-23 Term 2": {"--LEC (4004)": {"startTimes": ["18:30"], "endTimes": ["21:00"], "days": [3], "locations": ["Hui Yeung Shing Bldg G05"], "instructors": ["Dr. HO Sai Mun Stanley"], "meetingDates": ["11/1", "18/1"]}}}, "assessments": {"Others": "0", "Participation": "0", "Report": "0"}}, {"code": "6005", "title": "Guided Improvement Project", "career": "Postgraduate - Taught", "units": "6.00", "grading": "Graded", "components": "Lecture\nProject", "campus": "Main Campus", "academic_group": "Div of Education", "requirements": "For students in MA School Improvement and Leadership", "description": "Participants will participate in an improvement project under the guidance and support of practicum supervisors. They may either undertake the project individually or in pairs if the topic and context allows. The focus of improvement may be related to organizational, curriculum, teaching and learning aspects in a school or other educational organizations. The project should include an identification of a problem, a plan for initiating change based on theory and/ or other school practices, implementation of the plan and evaluation of the change outcomes. Participants will be placed in small support groups who are expected to share experiences and exchange ideas gained from the project.", "outcome": "After the guided improvement projects, students will be able: 1. To become familiar with the body of knowledge that comprises current approaches to educational research in school leadership and improvement. 2. To define the problems and questions in the organizations or schools that they are working for and to set priority in the agenda of improvement. 3. To solve the problems or address the questions through a systematic process of collecting and analyzing empirical information/ data. 4. To apply the skills and techniques in quantitative or qualitative research methodologies in answering the research questions. 5. To get significant meanings from the research findings and to present the findings properly with appropriate means. 6. To formulate suggestions and recommendations of school improvement based on the empirical findings from the study, that aligns with the realization of the school’s goals and missions. 7. To understand the functions and roles of an scientific project in relation to school improvement, including its strengths and weaknesses.  (Individual course teachers may update the learning outcome as and whenever necessary.)", "syllabus": "(Please refer to the course outline of respective teacher for details.)", "required_readings": "(Required readings (if any) would depend on individual course teachers. Please refer to the course outline of respective teacher for details.)", "recommended_readings": "(Recommended readings (if any) would depend on individual course teachers. Please refer to the course outline of respective teacher for details.)", "terms": {"2022-23 Term 1": {"AJ01-PRJ (2591)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["No Room Required"], "instructors": ["Professor CHEUNG Chi Keung Alan, \n\nProfessor WONG Lai Ngok Jocelyn, \n\nProfessor YUEN Yuet Mui"], "meetingDates": ["05/09/2022 - 28/11/2022"]}}, "2022-23 Term 2": {"BJ01-PRJ (2675)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["No Room Required"], "instructors": ["Dr. HO Sai Mun Stanley, \n\nDr. TAM Wai Ming Frank, \n\nProfessor CHEUNG Chi Keung Alan, \n\nProfessor WONG Lai Ngok Jocelyn, \n\nProfessor YUEN Yuet Mui, \n\nProfessor ZOU Xiaoping"], "meetingDates": ["09/01/2023 - 17/04/2023"]}}}}]