[{"code": "1001", "title": "Design Thinking in Social Innovation", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "Lecture\nInteractive Tutorial", "campus": "Main Campus", "academic_group": "Fac Office of Social Science", "requirements": "", "description": "“It’s not ‘us versus them’ or even ‘us on behalf of them.’ For a design thinker it has to be ‘us with them’” -Tim Brown“Human-centered design is a philosophy, not a precise set of methods, but one that assumes that innovation should start by getting close to users and observing their activities.” – Donald A. NormanDesign thinking creates value through systematic innovation. The objective of this course is to enable students to apply design thinking to create social value through systematic social innovation. To elaborate, this course introduces students to design thinking theories, methods and skills and their applications in the context of social innovation. Design thinking is an increasingly important concept needed for an effective implementation of ideas. It supports development of human-centric solutions, and uses a design-based mindset to provide practical solutions to complex problems. According to Soule, Malhota and Clavier, social innovation “is the process of developing and deploying effective solutions to challenging and often systemic social and environmental issues in support of social progress.” Social innovation focuses on the ideas and solutions that create social value, which can come from the nonprofit, private and public sectors. Modern social problems are enormously complex and this course will emphasize the interaction between different social science disciplines in the formulation of feasible and practical human-centric solutions that create social value.The course is modeled on the MIT Sloan Design Thinking program, which consists of 9 modules (see list of topics below). In this course, through interactive experiential learning, students will learn the key concepts and methods in design thinking and apply them to solve a current real life social problem. The ideas and insights gained in this course will be further applied in the other CU-FLASH minor courses.Group work is thoroughly emphasized and interaction of students from different majors is strongly encouraged. Students will work in groups and each group will be required to i) participate in group learning activities in classes, ii) perform exercises, and iii) do a final project on social innovation. A series of social innovation case studies and guest lectures from social innovators will be presented to students, reinforcing the practical aspects of this course. Students are strongly encouraged to interact with these practitioners.", "outcome": "  Students will understand what innovation is and how it creates social values.    Students will master the basic design thinking skills.   Students will learn concrete methods in identifying and emphasizing with user needs   Students will learn to translate user needs into product/service specifications   Students will learn and apply group creativity skills to co-create multiple solutions to a social problem   Students will learn the skills to select ideas for prototyping   Students will learn to apply modular and integral product/service architectures to design the building blocks of a product/service   Students will learn to perform financial analysis of their project, understand a product life cycle and select a product/service development process to suit their project need.   Students will appreciate the value of interdisciplinary exchange and collaboration in social innovation ", "syllabus": "1. Introduction to Social Innovation  2. Understanding Design Thinking  3. Identifying User Needs4. Product and service specification5. Brainstorming6. Prototyping7. Product and Service Architecture8. Financial Analysis9. Product Development Processes", "required_readings": "(For reference only, subject to change.)  Tom Kelley and David Kelley (2013), Creative confidence: Unleashing the creative potential within us.(This book introduces basic concepts and applications of design thinking.) Tim Brown (2009). Change by design: How design thinking transforms organizations and inspires innovation.  (This book discusses how design thinking converts need into demand through a collaborative process.)", "recommended_readings": "(For reference only, subject to change.)  Nigel Cross: Design thinkingJeanne Liedtka, Tim Ogilvie, and Rachel Brozenske: The designing for growth field book (a step-by-step project guide) Bill Burnett and Dave Evans: Designing your life: How to build a well-lived joyful lifeTom Kelley: The of innovation", "terms": {"2024-25 Term 1": {"--LEC (7007)": {"startTimes": ["9:30"], "endTimes": ["11:15"], "days": [2], "locations": ["Wu Ho Man Yuen Bldg 404"], "instructors": ["Professor MA Kit Yi"], "meetingDates": ["3/9", "10/9", "17/9", "24/9", "8/10", "15/10", "22/10", "29/10", "5/11", "12/11", "19/11", "26/11"]}, "-T01-TUT (5640)": {"startTimes": ["11:30"], "endTimes": ["12:15"], "days": [2], "locations": ["Wu Ho Man Yuen Bldg 404"], "instructors": ["Professor MA Kit Yi"], "meetingDates": ["3/9", "10/9", "17/9", "24/9", "8/10", "15/10", "22/10", "29/10", "5/11", "12/11", "19/11", "26/11"]}}}, "assessments": {"Project": "35", "Participation": "25", "Report": "40"}}, {"code": "1002", "title": "Managing Creativity and Group Dynamics in Innovation Teams", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "Lecture\nInteractive Tutorial", "campus": "Main Campus", "academic_group": "Fac Office of Social Science", "requirements": "", "description": "How to go from idea formation to implementation? What makes a winning innovation team?Modern organizational environments require creative solutions and the setting up of interdisciplinary innovation teams have become increasingly common. While the concepts and importance of interdisciplinary teamwork are well embraced, the additional practical considerations needed to foster a successful innovation team are relatively new and less well understood. This course focuses on two important aspects needed for an innovation team – the nurturing of individual and team creativity and management of group dynamics in innovation team. This course will cover the following topics: The nature of creativity (Creativity is not a gift; it is an extraordinary outcome of ordinary processes); Lack of creativity is a mental habit (Can over-learning kill creativity? Does too much education kill creativity? Novel conceptual combination could be magical cure of our uncreative mental habit); Characteristics of a creative mind (openness to experience, counterfactual thinking, use of paradoxical frames, and having the growth mindset); How to reward creativity; How does collective genius emerge in an organization; How did genius get inspired; Team diversity and team creativity; Team leadership; Transactive memory and coordination; and Challenges of interdisciplinary collaboration. This course is highly interactive and emphasizes on active learning. Students should expect to share ideas and listen to viewpoints offered by peers. Besides theories, each class will feature examples of modern social and business group management problems in a variety of organization settings that require innovative ideas. Through experiential group learning activities, students will appreciate the skills needed to improve team effectiveness with an aim of becoming effective, forward looking and positive contributing team members in an innovation team.", "outcome": "  Understand the advantages of building an interdisciplinary innovation team   Understand when diversity will contribute to and when it will hurt individual and team creativity    Appreciate the major personal and contextual factors that affect creative performance of individual team members.   Understand the basic skills in leading and managing an interdisciplinary innovation team   Identify suitable strategies for enhancing creative performance of the self and an innovation team ", "syllabus": "  Demystify Creativity    Is Lack of Creativity a Mental Habit?    What Are the Characteristics of Creative Mind?    Should We Reward Creativity?    Collective Creativity?    How Did Genius Get Inspired?    Team Composition   Team Leadership   Communication and Coordination   Interdisciplinary Collaboration ", "required_readings": "​ (For reference only, subject to change.)  Sternberg, R. J., & Lubart, T. I. (1996). Investing in creativity. American Psychologist, 51(7), 677–688. https://doi.org/10.1037/0003-066X.51.7.677   https://www.ted.com/talks/elizabeth_gilbert_your_elusive_creative_genius   Ward, T. B. et al. (2002). The role of graded category structure in imaginative thought. Memory & Cognition.   https://www.youtube.com/watch?v=iG9CE55wbtY   Neal Roese (2005). If only: How to turn regret into opportunity.    https://fortune.com/2018/09/24/microsoft-culture-peggy-johnson-brainstorm-reinvent/   B. A. Hennessey and T. M. Amabile (1998). Reward, intrinsic motivation, and creativity. American Psychologist.   https://www.youtube.com/watch?v=XD6N8bsjOEE   Hill, Linda A., Brandeau, G., Truelove, E., & Lineback, K. (2014). Collective Genius.\" Harvard Business Review, 92, no. 6: 94–102.   https://www.ted.com/talks/linda_hill_how_to_manage_for_collective_creativity   Thrash, T. M., Moldovan, E. G., Oleynick, V. C., & Maruskin, L. A. (2014). The psychology of inspiration. Social and Personality Psychology Compass, 8(9), 495–510.    https://doi.org/10.1111/spc3.12127   Rubino, A. Jr. (2010). Why didn't I think of that?: 101 inventions that changed the world by hardly trying.   https://www.youtube.com/watch?v=4L30uIkMeMM   Leung, A. K-y., Maddux, W. W., Galinsky, A. D., & Chiu, C-y. (2008). Multicultural experience enhances creativity: The when and how? American Psychologist, 63, 169-181.    https://www.ted.com/talks/rocio_lorenzo_how_diversity_makes_teams_more_innovative   Schwarz, R. (2015). What the research tells us about team creativity and innovation. Harvard Business Review.   Wang, X., Li, H., & Yin, H. Antecedents and consequences of creativity in teams: When and how leader humility promotes performance via team creativity. The Journal of Creative Behavior, 54(4):843-856.   Cao, X., & Ali, A. (2017). Enhancing team creative performance through social media and transactive memory system. International Journal of Information Management, 39, 69-79.   https://www.coursera.org/lecture/leading-teams/04-10-transactive-memory-IDIbN   Chiu, C-y., Kwan, L., & Liou, S. (2013). Culturally motivated challenges to innovations in integrative research: Theory and solutions. Social Issues and Policy Review, 7. 10.1111/j.1751-2409.2012.01046.x   https://www.youtube.com/watch?v=C_OFmc5A8p8   https://www.youtube.com/watch?v=OLcE8aR64D4  ", "recommended_readings": "Please refer to the course outline.", "terms": {"2024-25 Term 2": {"--LEC (9008)": {"startTimes": ["9:30"], "endTimes": ["11:15"], "days": [4], "locations": ["Sino Building UG06"], "instructors": ["Dr. ZHAO Yukun"], "meetingDates": ["9/1", "16/1", "23/1", "6/2", "13/2", "20/2", "27/2", "13/3", "20/3", "27/3", "3/4", "10/4", "17/4"]}, "-T01-TUT (9009)": {"startTimes": ["11:30"], "endTimes": ["12:15"], "days": [4], "locations": ["Sino Building UG06"], "instructors": ["Dr. ZHAO Yukun"], "meetingDates": ["9/1", "16/1", "23/1", "6/2", "13/2", "20/2", "27/2", "13/3", "20/3", "27/3", "3/4", "10/4", "17/4"]}}}, "assessments": {"Essays": "35", "Project": "50", "Participation": "15"}}, {"code": "1003", "title": "Introduction to Art Tech Design and Interactivity", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "Lecture\nInteractive Tutorial", "campus": "Main Campus", "academic_group": "Fac Office of Social Science", "requirements": "", "description": "This introductory course investigates computer coding and variable-based methods within visual arts. Participants will adopt a design thinking approach toward translating ideas into prototypes using micro-processors and sensors for creative outcomes. Students will consider interactivity as the processing of data and gain greater understanding of how this translates into an expression of art and technology. They will be presented with both technical and theoretical frameworks for exploring artistic expression, compositional strategies, design culture, and artistic experience. This course will serve as foundation for future courses on creative communications, media, technology, and cultural studies.", "outcome": " Understand and modify computer code. Adopt AI tools and methods for problem solving and coding. Understand basic robotic control systems and microcontrollers. Develop Creative and Kinetic Graphic Outcomes Understand design methodologies and cultural phenomena. Understand how to document and present creative / design works.", "syllabus": " Introduction to Art and Technology Understanding Artistic Experience Developing Compositional Strategies Interactivity and Sensors Microprocessors and Robotics Computer Programming and Control Systems AI assisted Coding Prototyping Life Cycles Documenting and Presenting Design and Creative Works Understanding Design Culture", "required_readings": "Gramophone, Film, Typewriter: Friedrich KittlerHere/There: Telepresence, Touch, and Art at the Interface: Kris PaulsenProgrammed Visions: Software and Memory: Wendy Hui Kyong ChunThe Interface Effect: Alexander R. GallowayNew Media Art: Mark Tribe, Uta Grosenick, Reena JanaProcessing: A Programming Handbook for Visual Designers and Artists: Casey Reas, Ben Fry", "recommended_readings": "", "terms": {"2024-25 Term 2": {"--LEC (8614)": {"startTimes": ["14:30"], "endTimes": ["16:15"], "days": [1], "locations": ["Wu Ho Man Yuen Bldg 504"], "instructors": ["Staff"], "meetingDates": ["6/1", "13/1", "20/1", "27/1", "10/2", "17/2", "24/2", "10/3", "17/3", "24/3", "31/3", "7/4", "14/4"]}, "-T01-TUT (8615)": {"startTimes": ["16:30"], "endTimes": ["17:15"], "days": [1], "locations": ["Wu Ho Man Yuen Bldg 504"], "instructors": ["Staff"], "meetingDates": ["6/1", "13/1", "20/1", "27/1", "10/2", "17/2", "24/2", "10/3", "17/3", "24/3", "31/3", "7/4", "14/4"]}}}, "assessments": {"Project": "60", "Participation": "10", "Report": "30"}}, {"code": "4001", "title": "ASK Project I", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "Project", "campus": "Main Campus", "academic_group": "Fac Office of Social Science", "requirements": "Students are required to have taken or be taking SOSC1001 or SOSC1002 before/while enrolling into SOSC4001.", "description": "In this course, students will form teams to undertake projects that activate practice-driven theory and theory-driven practice, reach out and interact with relevant stakeholders (e.g. NGOs and Industry professionals), and design practical and innovative solutions for a social problem under the supervision of course instructor(s) from constituent unit(s) of the Faculty, based on the nature of the problem they seek to solve.", "outcome": "Learning outcomes will be developed by the Supervisor according to the project selected.", "syllabus": "The topics and contents of the study will be individually determined by students and their respective project supervisor.", "required_readings": "To be decided by individual project supervisor.", "recommended_readings": "To be decided by individual project supervisor.", "terms": {"2024-25 Term 1": {"-J01-PRJ (9195)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["No Room Required"], "instructors": ["Dr. ZHAO Yukun"], "meetingDates": ["02/09/2024 - 25/11/2024"]}}, "2024-25 Term 2": {"-J01-PRJ (9010)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["No Room Required"], "instructors": ["Dr. ZHAO Yukun"], "meetingDates": ["06/01/2025 - 14/04/2025"]}}}}, {"code": "4002", "title": "ASK Project II", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "Project", "campus": "Main Campus", "academic_group": "Fac Office of Social Science", "requirements": "Students are required to have taken or be taking SOSC1001 or SOSC1002 before/while enrolling into SOSC4002.", "description": "In this course, students will form teams to undertake projects that activate practice-driven theory and theory-driven practice, reach out and interact with relevant stakeholders (e.g. NGOs and Industry professionals), and design practical and innovative solutions for a social problem under the supervision of course instructor(s) from constituent unit(s) of the Faculty, based on the nature of the problem they seek to solve.(This course is a continuation of SOSC4001 ASK Project I/SOSC4010 ASK Internship I.)", "outcome": "Learning outcomes will be developed by the Supervisor according to the project selected.", "syllabus": "The topics and contents of the study will be individually determined by students and their respective project supervisor.", "required_readings": "To be decided by individual project supervisors.", "recommended_readings": "To be decided by individual project supervisors.", "terms": {"2024-25 Term 1": {"-J01-PRJ (9196)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["No Room Required"], "instructors": ["Dr. ZHAO Yukun"], "meetingDates": ["02/09/2024 - 25/11/2024"]}}, "2024-25 Term 2": {"-J01-PRJ (9011)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["No Room Required"], "instructors": ["Dr. ZHAO Yukun"], "meetingDates": ["06/01/2025 - 14/04/2025"]}}}}, {"code": "4010", "title": "ASK Internship I", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "Practicum", "campus": "Main Campus", "academic_group": "Fac Office of Social Science", "requirements": "Students are required to have taken or be taking SOSC1001 or SOSC1002 before/while enrolling into SOSC4010.", "description": "This course aims to provide students with on-site learning experience for their integration of the theories and concepts in design thinking, team creativity and group dynamics in innovation team that they learn in classroom activities. Students will work at institutions recognized by the Faculty for up to 200 hours per term. Students will be asked to attend orientation and sharing sessions before and after their internship.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "4020", "title": "ASK Internship II", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "Practicum", "campus": "Main Campus", "academic_group": "Fac Office of Social Science", "requirements": "Students are required to have taken or be taking SOSC1001 or SOSC1002 before/while enrolling into SOSC4020.", "description": "This course aims to provide students with on-site learning experience for their integration of the theories and concepts in design thinking, team creativity and group dynamics in innovation team that they learn in classroom activities. Students will work at institutions recognized by the Faculty for up to 200 hours per term. Students will be asked to attend orientation and sharing sessions before and after their internship.(This course is a continuation of SOSC4001 ASK Project I/SOSC4010 ASK Internship I.)", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "7001", "title": "Independent Studies I", "career": "Postgraduate - Taught", "units": "0.00", "grading": "Multi-Term Course Grades", "components": "Independent Study", "campus": "Main Campus", "academic_group": "Div of Social Science", "requirements": "For students in Doctor of Social Science Programme in Applied Social Science", "description": "For the Independent Studies Course, students are required to do a review-type paper on a topic related to their field of study as approved by their thesis committee. The student has to pass an examination, which consists of a written review paper and an oral examination. A student will be asked to retake the examination if he/she fails the examination for the first time. A student, however, will be asked to withdraw from the programme if he/she has failed the examination for the second time.(SOSC7001 is intended to be the first part of a sequence of the course, Independent Studies. For the second part, see SOSC7004; no unit would be awarded if SOSC7004 is not taken subsequently.)", "outcome": "Learning outcomes will be developed by the Supervisor according to the subject/field selected.", "syllabus": "The topics and contents of the study will be individually determined by students and their respective thesis supervisors.", "required_readings": "To be decided by individual thesis supervisors.", "recommended_readings": "To be decided by individual thesis supervisors.", "terms": {"2024-25 Term 1": {"-I01-IND (3508)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["No Room Required"], "instructors": ["Staff"], "meetingDates": ["02/09/2024 - 25/11/2024"]}}, "2024-25 Term 2": {"-I01-IND (1968)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["No Room Required"], "instructors": ["Staff"], "meetingDates": ["06/01/2025 - 14/04/2025"]}}}}, {"code": "7002", "title": "Creative Project I", "career": "Postgraduate - Taught", "units": "0.00", "grading": "Multi-Term Course Grades", "components": "Project", "campus": "Main Campus", "academic_group": "Div of Social Science", "requirements": "For students in Doctor of Social Science Programme in Applied Social Science", "description": "Students are required to design and carry out a creative project under the guidance of their supervisors. The project is a translational research that seeks to apply theories and basic research findings to solve a significant problem in the candidate’s profession or field of study. The student is required to present his/her project report at an annual conference organized by the Programme.(SOSC7002 is intended to be the first part of a sequence of the course, Creative Project. For the second part, see SOSC7005; no unit would be awarded if SOSC7005 is not taken subsequently.)", "outcome": "Learning outcomes will be developed by the Supervisor according to the subject/field selected.", "syllabus": "The topics and contents of the study will be individually determined by students and their respective thesis supervisors. ", "required_readings": "To be decided by individual thesis supervisors.", "recommended_readings": "To be decided by individual thesis supervisors.", "terms": {"2024-25 Term 1": {"-J01-PRJ (3509)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["No Room Required"], "instructors": ["Staff"], "meetingDates": ["02/09/2024 - 25/11/2024"]}}, "2024-25 Term 2": {"-J01-PRJ (1969)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["No Room Required"], "instructors": ["Staff"], "meetingDates": ["06/01/2025 - 14/04/2025"]}}}}, {"code": "7003", "title": "Thesis in Applied Social Science I", "career": "Postgraduate - Taught", "units": "0.00", "grading": "Multi-Term Course Grades", "components": "Others", "campus": "Main Campus", "academic_group": "Div of Social Science", "requirements": "For students in Doctor of Social Science Programme in Applied Social Science", "description": "Students will build on the outcomes of their creative project, continue to conduct research and produce a dissertation in their area of research under the guidance of a thesis committee. The dissertation should be an original contribution to the application of social science knowledge and contain material worthy of publication.(SOSC7003 is intended to be the first part of a sequence of the course, Thesis in Applied Social Science. For the second part, see SOSC7006; no unit would be awarded if SOSC7006 is not taken subsequently.)", "outcome": "Learning outcomes will be developed by the Supervisor according to the subject/field selected.", "syllabus": "The topics and contents of the study will be individually determined by students and their respective thesis supervisors.", "required_readings": "To be decided by individual thesis supervisors. ", "recommended_readings": "To be decided by individual thesis supervisors. ", "terms": {"2024-25 Term 1": {"-O01-OTH (3510)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["No Room Required"], "instructors": ["Staff"], "meetingDates": ["02/09/2024 - 25/11/2024"]}}, "2024-25 Term 2": {"-O01-OTH (1970)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["No Room Required"], "instructors": ["Staff"], "meetingDates": ["06/01/2025 - 14/04/2025"]}}}}, {"code": "7004", "title": "Independent Studies II", "career": "Postgraduate - Taught", "units": "6.00", "grading": "Graded", "components": "Independent Study", "campus": "Main Campus", "academic_group": "Div of Social Science", "requirements": "For students in Doctor of Social Science Programme in Applied Social Science", "description": "For the Independent Studies Course, students are required to do a review-type paper on a topic related to their field of study as approved by their thesis committee. The student has to pass an examination, which consists of a written review paper and an oral examination. A student will be asked to retake the examination if he/she fails the examination for the first time. A student, however, will be asked to withdraw from the programme if he/she has failed the examination for the second time.(SOSC7004 is intended to be the second part of a sequence of the course, Independent Studies. For the first part, see SOSC7001; no unit would be awarded if SOSC7004 is not taken subsequently.)", "outcome": "Learning outcomes will be developed by the Supervisor according to the subject/field selected.", "syllabus": "The topics and contents of the study will be individually determined by students and their respective thesis supervisors.", "required_readings": "To be decided by individual thesis supervisors.", "recommended_readings": "To be decided by individual thesis supervisors.", "terms": {"2024-25 Term 1": {"-I01-IND (3507)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["No Room Required"], "instructors": ["Staff"], "meetingDates": ["02/09/2024 - 25/11/2024"]}}, "2024-25 Term 2": {"-I01-IND (3518)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["No Room Required"], "instructors": ["Staff"], "meetingDates": ["06/01/2025 - 14/04/2025"]}}}}, {"code": "7005", "title": "Creative Project II", "career": "Postgraduate - Taught", "units": "6.00", "grading": "Graded", "components": "Project", "campus": "Main Campus", "academic_group": "Div of Social Science", "requirements": "For students in Doctor of Social Science Programme in Applied Social Science", "description": "Students are required to design and carry out a creative project under the guidance of their supervisors. The project is a translational research that seeks to apply theories and basic research findings to solve a significant problem in the candidate’s profession or field of study. The student is required to present his/her project report at an annual conference organized by the Programme.(SOSC7005 is intended to be the second part of a sequence of the course, Creative Project. For the first part, see SOSC7002; no unit would be awarded if SOSC7005 is not taken subsequently.)", "outcome": "Learning outcomes will be developed by the Supervisor according to the subject/field selected.", "syllabus": "The topics and contents of the study will be individually determined by students and their respective thesis supervisors.", "required_readings": "To be decided by individual thesis supervisors.", "recommended_readings": "To be decided by individual thesis supervisors.", "terms": {"2024-25 Term 1": {"-J01-PRJ (3528)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["No Room Required"], "instructors": ["Staff"], "meetingDates": ["02/09/2024 - 25/11/2024"]}}, "2024-25 Term 2": {"-J01-PRJ (3538)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["No Room Required"], "instructors": ["Staff"], "meetingDates": ["06/01/2025 - 14/04/2025"]}}}}, {"code": "7006", "title": "Thesis in Applied Social Science II", "career": "Postgraduate - Taught", "units": "6.00", "grading": "Graded", "components": "Others", "campus": "Main Campus", "academic_group": "Div of Social Science", "requirements": "For students in Doctor of Social Science Programme in Applied Social Science", "description": "Students will build on the outcomes of their creative project, continue to conduct research and produce a dissertation in their area of research under the guidance of a thesis committee. The dissertation should be an original contribution to the application of social science knowledge and contain material worthy of publication.(SOSC7006 is intended to be the second part of a sequence of the course, Thesis in Applied Social Science. For the first part, see SOSC7003; no unit would be awarded if SOSC7006 is not taken subsequently.)", "outcome": "Learning outcomes will be developed by the Supervisor according to the subject/field selected.", "syllabus": "The topics and contents of the study will be individually determined by students and their respective thesis supervisors.", "required_readings": "To be decided by individual thesis supervisors.", "recommended_readings": "To be decided by individual thesis supervisors.", "terms": {"2024-25 Term 1": {"-O01-OTH (3573)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["No Room Required"], "instructors": ["Staff"], "meetingDates": ["02/09/2024 - 25/11/2024"]}}, "2024-25 Term 2": {"-O01-OTH (3582)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["No Room Required"], "instructors": ["Staff"], "meetingDates": ["06/01/2025 - 14/04/2025"]}}}}, {"code": "7010", "title": "Seminar (I): Computational Social Science", "career": "Postgraduate - Research", "units": "3.00", "grading": "Graded", "components": "Seminar", "campus": "Main Campus", "academic_group": "Div of Social Science", "requirements": "For students in MPhil-PhD Architecture, PhD Communication, MPhil-PhD Psychology, MPhil-PhD Geography and Resource Management, MPhil-PhD Social Welfare, and MPhil-PhD Sociology", "description": "This main objective of this course is to familiarize pre-candidacy students in the Computational Social Science (CSS) Concentration of any graduate division in the Faculty of Social Science with the field of computational social science. In each semester, the seminar will consist of a combination of lectures, student presentations, and project-based learning-by-doing activities. Learning will be organized around constantly updated individual/team projects. Each project will be an opportunity for all students in the course to expand their technical know-how and toolkits, deepen their appreciation of innovation and collaboration in social science empirical research, practice the development and completion of original research, and accumulate inspiration for one’s research agenda.", "outcome": "At the end of each course, students would gain: familiarity with latest advances in multi/inter/cross-disciplinary research on computational social science,  project-based practice of doing CSS research,  expanded technical know-how and toolkits,  enhanced appreciation of innovation and collaboration in social science empirical research,  improved academic presentation skills, and  the practice of original research.", "syllabus": "The topics and contents of the seminars will be constantly adjusted over time to avoid repetition and individually tailored for each student.", "required_readings": "To be decided by course teacher.", "recommended_readings": "To be decided by course teacher.", "terms": {"2024-25 Term 1": {"-S01-SEM (2008)": {"startTimes": ["11:30"], "endTimes": ["14:15"], "days": [4], "locations": ["Chen Kou Bun Bldg UG05"], "instructors": ["Staff"], "meetingDates": ["5/9", "12/9", "19/9", "26/9", "3/10", "10/10", "17/10", "24/10", "31/10", "7/11", "14/11", "21/11", "28/11", "5/12", "12/12"]}}, "2024-25 Term 2": {"-S01-SEM (1024)": {"startTimes": ["11:30"], "endTimes": ["14:15"], "days": [4], "locations": ["Wong Foo Yuan Bldg UG02"], "instructors": ["Staff"], "meetingDates": ["9/1", "16/1", "23/1", "6/2", "13/2", "20/2", "27/2", "6/3", "13/3", "20/3", "27/3", "3/4", "10/4", "17/4", "24/4"]}}}}, {"code": "7020", "title": "Seminar (II): Computational Social Science", "career": "Postgraduate - Research", "units": "3.00", "grading": "Graded", "components": "Seminar", "campus": "Main Campus", "academic_group": "Div of Social Science", "requirements": "For students in MPhil-PhD Architecture, PhD Communication, MPhil-PhD Psychology, MPhil-PhD Geography and Resource Management, MPhil-PhD Social Welfare, and MPhil-PhD Sociology", "description": "This main objective of this course is to expand the breadth and depth of training for post-candidacy students in the Computational Social Science (CSS) Concentration. In each semester, the seminar will consist of a combination of lectures, student presentations, and project-based learning-by-doing activities. Learning will be organized around constantly updated individual/team projects. Each project will be an opportunity for all students in the course to expand their technical know-how and toolkits, deepen their appreciation of innovation and collaboration in social science empirical research, practice the development and completion of original research, and accumulate inspiration for one’s research agenda.", "outcome": "At the end of each course, students would gain: familiarity with latest advances in multi/inter/cross-disciplinary research on computational social science, project-based practice of doing CSS research, expanded technical know-how and toolkits, enhanced appreciation of innovation and collaboration in social science empirical research, improved academic presentation skills, and the practice of original research", "syllabus": "The topics and contents of the seminars will be constantly adjusted over time to avoid repetition and individually tailored for each student.", "required_readings": "To be decided by course teacher.", "recommended_readings": "To be decided by course teacher.", "terms": {"2024-25 Term 1": {"-S01-SEM (2022)": {"startTimes": ["11:30"], "endTimes": ["14:15"], "days": [4], "locations": ["Chen Kou Bun Bldg UG05"], "instructors": ["Staff"], "meetingDates": ["5/9", "12/9", "19/9", "26/9", "3/10", "10/10", "17/10", "24/10", "31/10", "7/11", "14/11", "21/11", "28/11", "5/12", "12/12"]}}, "2024-25 Term 2": {"-S01-SEM (1785)": {"startTimes": ["11:30"], "endTimes": ["14:15"], "days": [4], "locations": ["Wong Foo Yuan Bldg UG02"], "instructors": ["Staff"], "meetingDates": ["9/1", "16/1", "23/1", "6/2", "13/2", "20/2", "27/2", "6/3", "13/3", "20/3", "27/3", "3/4", "10/4", "17/4", "24/4"]}}}}]