[{"code": "6103", "title": "Sport Development and Delivery", "career": "Postgraduate - Taught", "units": "3.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Div of Education", "requirements": "For students in MA Sports Studies; MPhil Sports Sci & Phys Edu; PhD Education; Master of Education; PgD Exer Sci & Phy Edu", "description": "The course begins by defining sport and other forms of physical activity and discussing the relationship between sport and society, both past and present. The course then examines the difference between sports management and sports development and, in more detail, the scope, purpose, principles and framework of sports development. The course then looks at various sports delivery systems and, in detail, the process of strategic planning for sports development. Strategic planning and sports development models are evaluated during the course. The strategic and developmental plans of selected organizations in the public and private sectors will be discussed.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "6202", "title": "Sponsorship and Marketing of Sport Events and Performance", "career": "Postgraduate - Taught", "units": "3.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Div of Education", "requirements": "For students in MA Sports Studies; MPhil Sports Sci & Phys Edu; PhD Education; Master of Education; PgD Exer Sci & Phy Edu", "description": "This course aims to help students to acquire knowledge of the basic concepts in sport marketing and sport sponsorship and the skills required in drawing up marketing plans and strategies in organizing sports events and sponsorship deals. Topics including the special nature of sport marketing, marketing management in sport, customer relationship management, sports pricing strategies, sport event as a product, customer’s and sport organization’s buying behaviour, sport market research and marketing information systems, sport sponsorship packages, public relations and promotion, ambush marketing and legal aspects in sport sponsorships will be covered. Other than lectures, students are requested to conduct case studies in sport marketing and to draw up a sport event marketing plan to earn hands-on experience.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "6701", "title": "Guided Studies: Sports Studies", "career": "Postgraduate - Taught", "units": "3.00", "grading": "Graded", "components": "Project", "campus": "Main Campus", "academic_group": "Div of Education", "requirements": "For students in MA Sports Studies", "description": "The purpose of this course is to allow students in the Masters’ degree programme to pursue advanced guided individual study in selected areas of sports studies. It provides an opportunity for students to review the literature of their fields of specialization and to prepare for the writing of their project proposals. Examples are topics within the areas of biomechanics, exercise physiology, sports management, sports psychology, etc. A student is expected to read according to a reading list prescribed or approved by the supervisors and to confer regularly and frequently with the supervisor. Assessment is based on the completion of reading and course requirements.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "6901", "title": "Research Project: Sports Studies", "career": "Postgraduate - Taught", "units": "9.00", "grading": "Graded", "components": "Project", "campus": "Main Campus", "academic_group": "Div of Education", "requirements": "For students in MA Sports Studies", "description": "The research project requires final year students to complete an independent research project that focuses on a specific aspect of sport that is of interest to the student. The student will be guided by a supervisor who will work closely with the student to develop a research question by reviewing the literature, plan the approach with an appropriate theoretical framework, select an appropriate methodology, collect data in a professional and ethical manner, analyze the data and present the analysis in a conventional research format.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}]