[{"code": "6501", "title": "TESOL Curriculum & Methodology", "career": "Postgraduate - Taught", "units": "3.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Div of Education", "requirements": "For students in MA Teaching English to Speakers of Other Languages", "description": "This course covers the fundamental concepts related to (I) the TESOL curriculum and (II) English language teaching methodology. Part I aims to provide general coverage of important theories and issues concerning the curriculum with an emphasis on curricular design, implementation, and evaluation. Part II comprises an overview of various major language teaching methods as well as those specific to listening, reading, speaking, and writing. Students are expected to participate actively in teaching demonstrations in order to better grasp and reflect on the different approaches introduced.", "outcome": "By the end of the course, students should be able to: - gain a good understanding of the relevant theories and issues related to the TESOL curriculum- design, implement, and evaluate a curriculum making reference to relevant frameworks - demonstrate a good grasp of various major language teaching methods - describe, demonstrate, and evaluate specific teaching methods related to listening, reading, speaking, and writing (Individual course teachers may update the learning outcome as and whenever necessary.)", "syllabus": "Part I 1. Defining ‘curriculum’ and related concepts such as syllabi2. Major theories, frameworks, and issues related to the English language curriculum including its recent and current development 3. Design, implementation, and evaluation of the English language curriculum Part II4. Major language teaching methods (e.g. Communicative Language Teaching (CLT), Task-Based Language Teaching (TBLT)) and their history 5. Teaching methods specific to listening, reading, speaking, and writing6. Demonstrating and evaluating the teaching methods introduced (For reference only, please refer to the course outline of respective teacher for details.)", "required_readings": "Paran, A. (2012). Language skills: questions for teaching and learning. ELT journal, 66(4), 450-458.Richards, J. C. (2013). Curriculum Approaches in Language Teaching: Forward, Central, and Backward Design. RELC Journal, 44(1), 5-33.Ur, P. (2013). Language-teaching method revisited. ELT journal, 67(4), 468-474.(For reference only, please refer to the course outline of respective teacher for details.)", "recommended_readings": "Brown, J. (1995). The elements of language curriculum: A systematic approach to program development. Boston: Heinle & Heinle.Burns, A., Richards, J.C. (2009). The Cambridge guide to second language teacher education. Cambridge: Cambridge University Press.Butler, Y. G. (2015). English language education among young learners in East Asia: A review of current research (2004–2014). Language Teaching, 48(3), 303-342.Harmer, J. (2015). The practice of English language teaching (5th ed.). Harlow, England: Pearson Education Limited.Nation, I. S. P. & Macalister, J. (2010). Language curriculum design. New York; London: Routledge.Richards, J. C. (2001). Curriculum Development in Language Teaching. Cambridge: Cambridge university press.Richards, J. C., & Burns, A. (2012). The Cambridge guide to pedagogy and practice in second language teaching. New York: New York : Cambridge University Press.Richards, J. C., & Renandya, W. A. (Eds.). (2002). Methodology in language teaching: An anthology of current practice. Cambridge: Cambridge university press.Stronge, J. (2018). Qualities of Effective Teachers (3rd ed.). Alexandria, VA USA: Association for Supervision and Curriculum Development.Tsang, A. (2019). Reconceptualizing Speaking, Listening, and Pronunciation: Glocalizing TESOL in the Contexts of World Englishes and English as a Lingua Franca. TESOL Quarterly, 53(2), 580-588.Ur, P. (2012). A course in English language teaching. Cambridge: Cambridge University Press.Wang, W. & Lam, A. S. (2009). The English language curriculum for senior secondary school in China: Its evolution from 1949. RELC Journal, 40(1), 65-82.West, R. (1994). Needs Analysis in Language Teaching. Language Teaching. 27(1), 1-19.See Also: Key concepts in ELT Journal: https://academic.oup.com/eltj/pages/Key_Conceptsand articles published in key journals in TESOL/FL education such as (but not limited to): ELT JournalForeign Language AnnalsJournal of Multilingual and Multicultural DevelopmentLanguage AwarenessLanguage Teaching ResearchModern Language JournalRELC JournalStudies in second language acquisitionSystemTESOL Quarterly(For reference only, please refer to the course outline of respective teacher for details.)", "terms": {"2024-25 Term 1": {"--LEC (2066)": {"startTimes": ["14:30", "18:30"], "endTimes": ["17:00", "21:30"], "days": [4, 4], "locations": ["Yasumoto Int'l Acad Park 201", "Cheng Yu Tung Building 209A"], "instructors": ["Professor TSANG Wai Chung", "Professor TSANG Wai Chung"], "meetingDates": ["12/9", "19/9", "26/9", "3/10", "10/10", "17/10", "24/10", "31/10", "7/11", "14/11", "21/11", "28/11", "5/12"]}}}}, {"code": "6502", "title": "Second Language Acquisition", "career": "Postgraduate - Taught", "units": "3.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Div of Education", "requirements": "For students in MA Teaching English to Speakers of Other Languages", "description": "This course focuses on a number of contemporary theories and issues in second language acquisition (SLA) with the aim of preparing students for applications both in research and teaching. Topics will include, but are not limited to, internal factors, external factors, sociocultural aspects, cognition, metacognition, and learning strategies related to SLA. Recent research developments in the field in SLA will also be introduced for students to better understand practical applications of SLA theories. Students will be expected to read research articles in order to develop a solid foundation in SLA theories and their applications.", "outcome": "By the end of the course, students should be able to:•    Gain a good understanding of contemporary SLA theories;•    Critique a range of issues related to SLA with reference to teaching and learning; •    Show a good understanding of applications of SLA theories to research and teaching; •    Demonstrate the ability to conceptualize empirical research guided by SLA theories. (Individual course teachers may update the learning outcome as and whenever necessary.)", "syllabus": "1.    Learner errors and analysis2.    Individual learner differences3.    Interlanguage4.    The zone of proximal development (ZPD)5.    Input and interaction  6.    Cognitive aspects of learning7.    Metacognitive aspects of learning8.    Language learning strategies (Please refer to the course outline of respective teacher for details.)", "required_readings": " Ellis, R. (2008). The study of second language acquisition (2nd ed.). Oxford University Press. VanPatten, B., & Williams, J. (Eds.) (2015). Theories in second language acquisition. Routledge. Three articles chosen by the student from the following journals:Applied linguisticsSecond language researchStudies in second language acquisitionJournal of second language studies (John Benjamins)  (For reference only, please refer to the course outline of respective teacher for details.)", "recommended_readings": " Ahmadian, M.J. (2020). Explicit and implicit instruction of refusal strategies: Does working memory capacity play a role? Language Teaching Research, 24, 163–188. Allwright, D., & Hanks, J. (2009). The developing language learner: An introduction to exploratory practice. Palgrave Macmillan. Bai, B., Shen, B., & Wang, J. (2021). Impacts of social and emotional learning (SEL) on English learning achievements in Hong Kong secondary schools. Language Teaching Research, 1-25. doi: 10.1177/13621688211021736. Bai, B., & Wang, J. (2021). Hong Kong secondary school students’ self-regulated language learning strategy use and English writing competence: Influences of motivational beliefs. System, 96, 1-14.  Csizér, K. (2017). Motivation in the L2 classroom. In Loewen, S., Sato, M. (Eds.), The Routledge handbook of instructed second language acquisition (pp. 418–432). Routledge. Dewaele, J.-M., Li, C. (2021). Teacher enthusiasm and students’ social-behavioral learning engagement: The mediating role of student enjoyment and boredom in Chinese EFL classes. Language Teaching Research. Epub ahead of print 13 May 2021. DOI: 10.1177/13621688211014538. Dornyei, Z. (2006). Individual differences in second language acquisition. AILA Review, 19, 42-68. Hummel, K. M. (2021). Introducing second language acquisition: Perspectives and practices. Wiley Blackwell. Larsen-Freeman, D. & Anderson, M. (2011). Techniques and Principles in Language Teaching. (3rd ed.). Oxford University Press. Lantolf, J. P. (ed.). (2000). Sociocultural theory and second language learning. Oxford University Press. Lou, N.M., & Noels, K.A. (2016). Changing language mindsets: Implications for goal orientations and responses to failure in and outside the second language classroom. Contemporary Educational Psychology, 46, 22–33. Mackay, J. (2019). An ideal second language self intervention: Development of possible selves in an English as a foreign language classroom context. System, 81, 50–62. Wang, J., & Bai, B., (2022). Whose goal emphases play a more important role in ESL/EFL learners’ motivation, self-regulated learning and achievement?: Teachers’ or parents’. Research Papers in Education, 1-22. doi:10.1080/02671522.2022.2030395. (For reference only, please refer to the course outline of respective teacher for details.)", "terms": {"2024-25 Term 1": {"--LEC (1076)": {"startTimes": ["18:30"], "endTimes": ["21:00"], "days": [5], "locations": ["Esther Lee Bldg 302"], "instructors": ["Professor BAI Barry"], "meetingDates": ["6/9", "13/9", "20/9", "27/9", "4/10", "18/10", "25/10", "1/11", "8/11", "15/11", "22/11", "29/11", "6/12", "13/12"]}}}, "assessments": {"Essays": "50", "Others": "20", "Presentation": "30"}}, {"code": "6503", "title": "Second Language Assessment", "career": "Postgraduate - Taught", "units": "3.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Div of Education", "requirements": "For students in MA Teaching English to Speakers of Other Languages", "description": "This course introduces students to theoretical foundations and key concepts of second language assessment, such as reliability, validity, authenticity and washback. It examines basic principles of test design and evaluation and equips students with skills to construct, critique, adapt and score language tests, to conduct test item analysis, and to report and interpret test results. The course also discusses language assessment in relation to summative and formative assessment, assessment of, for and as learning, and alternative assessment, with specific reference to how assessment can be used to support classroom instruction. Students will be provided with opportunities for hands-on practice and to reflect critically on conventional assessment approaches in the light of best practices in language assessment.", "outcome": "By the end of the course, students should be able to: demonstrate a solid understanding of key theoretical concepts of second language assessment; construct, critique, adapt and score language tests; conduct test item analysis; and report and interpret test results; develop a strong grasp of summative and formative assessment, assessment of, for and as learning, and alternative assessment, with specific reference to how assessment can be used to support classroom instruction; and reflect critically on conventional assessment approaches in the light of best practices in language assessment.(Individual course teachers may update the learning outcome as and whenever necessary.)", "syllabus": " Key concepts in language assessment Constructing language tests Item analysis in language testing Scoring techniques (e.g. different kinds of scoring schemes; developing scoring rubrics) Reporting and interpreting test results Summative and formative assessment Assessment of, for and as learning Alternative assessment Evaluation and critique of language tests(Please refer to the course outline of respective teacher for details.)", "required_readings": "Brown, H.D. (2018). Language assessment: Principles and classroom practices (3nd ed.). Pearson Education, Inc.(For reference only, please refer to the course outline of respective teacher for details.)", "recommended_readings": "Alderson, J.C. (2000). Assessing reading. Cambridge University Press.Bachman, L., & Dambock, B. (2018). Language assessment for classroom teachers. Oxford University Press.Bailey, K. (1998). Learning about language assessment. Heinle & Heinle.Bailey, K., & Curtis, A. (2015). Learning about language assessment: Dilemmas, decisions, and directions (2nd ed.). National Geographic Learning.Berry, R. (2008). Assessment for learning. Hong Kong University Press.Berry, R., & Adamson, B. (2011). Assessment reform in education: Policy and practice. Springer.Black, P., Harrison, C., Lee, C., Marshall, B., & Wiliam, D. (2003). Assessment for learning: Putting it into practice. Open University Press.Buck, G. (2001). Assessing listening. Cambridge University Press.Carless, D. (2011). From testing to productive student learning: Implementing formative assessment in Confucian-heritage settings. Routledge.Carless, D., Joughin, G., Liu, N.F., and Associates. (2006). How assessment supports learning: Learning-oriented assessment in action. Hong Kong University Press.CDI, & EMB. (2004). Promoting assessment for learning in English language education at primary Level. Hong Kong Government Printer.Chappuis, J. (2009). Seven strategies of assessment for learning. Pearson.Cheng, L., & Fox, J. (2017). Assessment in the language classroom: Teachers supporting student learning. Palgrave.Coniam, D. (2014). English language education and assessment: Recent developments in Hong Kong and Chinese Mainland. Springer.Education Bureau. (2012). Assessment and learning. Issue 1. HKSARG: Hong Kong.Education Bureau. (2013). Assessment and learning. Issue 2. HKSARG: Hong Kong.Education Bureau. (2014). Assessment and learning. Issue 3. Hong Kong Government Printer.Falvey, P., Holbrook, J., & Coniam, D. (1994). Assessing students. Longman.Gardner, J. (2006). Assessment for learning. Sage Publications.Genesee, F., & Upshur, J. (1996). Classroom-based evaluation in second language education. Cambridge University Press.Harris, M., & McCann, P. (1994). Assessment. Heinemann.Heaton, J.B. (1990). Classroom testing. Longman.Hughes, A. (2003). Testing for language teachers. Cambridge University Press.Lam, R. (2018). Portfolio assessment for the teaching and learning of writing. Springer.Lee, I. (2017). Classroom writing assessment and feedback in L2 school contexts. Springer.Luoma, S. (2004). Assessing speaking. Cambridge: Cambridge University Press.O’ Malley, J.M. & Valdez-Pierce, L. (1996). Authentic assessment for English language learners: Practical approaches for teachers. New York: Addison-Wesley.Purpura, J.E. (2004). Assessing grammar. Cambridge: Cambridge University Press.Read, J. (2000). Assessing vocabulary. Cambridge University Press.Ruecker, T., & Crusan, D. (2018). The politics of English language writing assessment in global contexts. Routledge.Stiggins, R. (2008). An introduction to student-involved assessment for learning. Pearson Merrill Prentice Hall.Torrance, H., & Pryor, J. (1998). Investigating formative assessment: Teaching, learning and assessment in the classroom. Open University Press.Weigle, S.C. (2002). Assessing writing. Cambridge University Press.(For reference only, please refer to the course outline of respective teacher for details.)", "terms": {"2024-25 Term 2": {"--LEC (1067)": {"startTimes": ["18:30"], "endTimes": ["21:00"], "days": [4], "locations": ["Esther Lee Bldg 303"], "instructors": ["Professor ZHOU Sihan"], "meetingDates": ["9/1", "16/1", "23/1", "6/2", "13/2", "20/2", "27/2", "6/3", "13/3", "20/3", "27/3", "3/4", "10/4", "17/4"]}}}, "assessments": {"Essays": "50", "Others": "20", "Presentation": "30"}}, {"code": "6504", "title": "Research Methods in TESOL", "career": "Postgraduate - Taught", "units": "3.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Div of Education", "requirements": "For students in MA Teaching English to Speakers of Other Languages", "description": "This course introduces research methods in TESOL with the goal of equipping students with the knowledge and skills to evaluate research in terms of appropriate research design, data collection instruments, and analytical procedures. The first part of the course discusses the major research traditions in TESOL, with a particular focus on classroom-based, practitioner research. The second part of the course examines a range of data collection techniques in relation to concepts such as internal/external reliability and validity. Authentic data will also be provided to students so that they can gain practical skills in qualitative and quantitative data analysis. Throughout the course, students will be expected to regularly read articles in academic journals with the aim of building an awareness of current research issues and developing their own research interests.", "outcome": "By the end of the course, students should be able to: Discuss and evaluate different research methods in TESOL; Formulate research questions relating to issues in TESOL and suggest appropriate research designs to investigate these issues; Define, exemplify and discuss key concepts and terms including external/internal reliability and validity, construct operationalization, and variables; Critique a range of data collection procedures and methods, including introspection, diary studies, questionnaires, interviews, and discoursal analysis; and Demonstrate the ability to analyze sample qualitative and quantitative data.(Individual course teachers may update the learning outcome as and whenever necessary.)", "syllabus": " Types of data, variables, and constructs Experimental and non-experimental designs Action research and exploratory practice Surveys and introspective data collection  Observing and analyzing classroom interaction Qualitative and quantitative data analysis Research ethics(For reference only, please refer to the course outline of respective teacher for details.)", "required_readings": "Ellis, R. (2012). Methods for researching the second language classroom (Chapter 1). Language teaching research and language pedagogy. John Wiley & Sons.Allwright, D. (2005). Developing principles for practitioner research: The case of exploratory practice. Modern Language Journal, 89(3), 353-363.Articles chosen by the student from the following journals:ELT JournalForeign Language AnnalsLanguage AwarenessLanguage Teaching ResearchModern Language JournalRELC JournalStudies in second language acquisitionSystemTESOL Quarterly(For reference only, please refer to the course outline of respective teacher for details.)", "recommended_readings": "Burns, A. (2009). Doing action research in English language teaching: A guide for practitioners. Routledge.Burns, A., & Khalifa, H. (2017). Second language assessment and action research. Cambridge University Press.Burton, D., & Bartlett, S. (2005). Practitioner research for teachers. Paul Chapman.Dörnyei, Z. (2010). Questionnaires in second language research: Construction, administration, and processing (2nd ed.). Routledge.Mackey, A., & Gass, S.M. (2021). Second language research - methodology and design. [3rd ed.]. Routledge.McKay, S.L. (2006). Researching second language classrooms. Lawrence Erlbaum.Nunan, D., & Bailey, K. (2008). Exploring second language classroom research. Heinle-Cengage.Plonsky, L. (2015). Advancing quantitative methods in second language research. Routledge.Seliger, H.W., & Shohamy, E. (2013). Second language research methods. Oxford University Press.(For reference only, please refer to the course outline of respective teacher for details.)", "terms": {"2024-25 Term 2": {"--LEC (4516)": {"startTimes": ["18:30"], "endTimes": ["21:00"], "days": [1], "locations": ["Ho Tim Building M1"], "instructors": ["Professor Scott Charles AUBREY"], "meetingDates": ["6/1", "13/1", "20/1", "27/1", "10/2", "17/2", "24/2", "3/3", "10/3", "17/3", "24/3", "31/3", "7/4", "14/4"]}}}, "assessments": {"Essays": "80", "Others": "20"}}, {"code": "6600", "title": "Independent Research Project", "career": "Postgraduate - Taught", "units": "6.00", "grading": "Graded", "components": "Project", "campus": "Main Campus", "academic_group": "Div of Education", "requirements": "For students in MA Teaching English to Speakers of Other Languages", "description": "This course provides an opportunity for students to explore a significant issue in TESOL (Teaching English to Speakers of Other Languages) through undertaking an independent research project. Under the guidance of a supervisor, students will conceive, design and carry to completion the research study on an individual basis. They will survey relevant literature, formulate research questions, work out an appropriate methodological design, gather data, engage in critical data analysis, and report on the study in a dissertation of 8,000 to 10,000 words. Before embarking on the study, students will submit a research proposal that includes a literature review, research questions, methodology, and an implementation plan.", "outcome": "By the end of the course, students should be able to: conceive, design and carry to completion an independent research study that explores a significant issue in TESOL;  conduct a thorough review of literature pertinent to the research study; demonstrate skills in the collection and critical analysis of data; write up the research study into a dissertation of 8,000 to 10,000 words; and make an original contribution to the field of study through the independent research study.(Individual course teachers may update the learning outcome as and whenever necessary.)", "syllabus": " Theoretical and practical rationale of research Review of literature Research design Data collection and analysis Reporting of findings Implications, limitations and future research(For reference only, please refer to the course outline of respective teacher for details.)", "required_readings": "(Please refer to the course outline of respective teacher for details.)", "recommended_readings": "Brown, J. (1988). Understanding research in second language learning. Cambridge University Press.Brown, J.D., & Rodgers, T.S. (2002). Doing second language research. Oxford University Press.Burns, A. (2009). Doing action research in English language teaching: A guide for practitioners. Routledge.Burns, A., & Khalifa, H. (2017). Second language assessment and action research. Cambridge University Press.Burton, D., & Bartlett, S. (2005). Practitioner research for teachers. Paul Chapman.Chaudron, C. (1988). Second language classrooms: research on teaching and learning. Cambridge University Press.Hopkins, D. (2002). A teacher's guide to classroom research. Open University Press.McKay, S.L. (2006). Researching second language classrooms. Lawrence Erlbaum. Mackey, A., & Gass, S.M. (2021). Second language research - methodology and design. [3rd ed.]. Routledge. Plonsky, L. (2015). Advancing quantitative methods in second language research. Routledge.Seliger, H.W., & Shohamy, E. (2013). Second language research methods. Oxford University Press.Tracy, S.J. (2019). Qualitative research methods: Collecting evidence, crafting analysis, communicating impact. Wiley Blackwell.(For reference only, please refer to the course outline of respective teacher for details.)", "terms": {"2024-25 Term 1": {"AJ01-PRJ (3412)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["No Room Required"], "instructors": ["Dr. CHAN Kam Wing, \n\nDr. SHIU Wing Hoi Cathy, \n\nDr. SZE Man Man, \n\nDr. WEI Hong Qiang, \n\nProfessor BAI Barry, \n\nProfessor PENG Yue, \n\nProfessor TSANG Wai Chung, \n\nProfessor ZHOU Sihan"], "meetingDates": ["02/09/2024 - 02/12/2024"]}}, "2024-25 Term 2": {"BJ01-PRJ (3430)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["No Room Required"], "instructors": ["Dr. CHAN Kam Wing, \n\nDr. SHIU Wing Hoi Cathy, \n\nDr. SZE Man Man, \n\nDr. WEI Hong Qiang, \n\nProfessor BAI Barry, \n\nProfessor PENG Yue, \n\nProfessor TSANG Wai Chung, \n\nProfessor ZHOU Sihan"], "meetingDates": ["06/01/2025 - 21/04/2025"]}}}}]