[{"code": "1001", "title": "Understanding China", "career": "Undergraduate", "units": "1.00", "grading": "Distinction/Pass/Failure", "components": "Web-enhanced Teaching", "campus": "Main Campus", "academic_group": "Office of University GE", "requirements": "", "description": "The history of China is both rich and complex, as is its development in the modern era. The growing influence of China on the world stage, as one of the largest economies, a prominent player in international relations, and a major centre for knowledge creation, highlights the need for an integrated and multi-disciplinary understanding of its past and present. This course brings together several perspectives on China in addressing the following topics: cultural and intellectual roots, epochal events in history, modernisation and social change, economic development, and science and technology. This online course is required of all undergraduates admitted in 2022-23 and thereafter.", "outcome": "Students enrolled in this course will (1)      acquire a basic understanding of selected key cultural concepts that have shaped individuals and society in Chinese history, with reference to the Confucian, Daoist and Buddhist traditions;(2)      gain an appreciation of the complex forces that have impacted historical development in China and contributed to unity and division, the cultural and ethnic diversity of the nation, as well as continuities between past and present in government institutions, in the relations between China and the West, and in the historical-mindedness of the people;(3)      develop a basic grasp of the modernisation of China as a movement of national salvation and self-empowerment involving giant social transformations, the emergent role and influence of China as an important member of the international community, and the concept of modernity in relation to Westernisation and globalisation;(4)      become familiar with selected milestones in the economic development of China in the last two centuries, in particular the period since the founding of the People’s Republic, and future challenges in sustainable development;(5)     acquire a basic knowledge of the major scientific and technological advances in ancient and modern China, with an understanding of the significance of these achievements as well as their limitations from a comparative cultural perspective in the study of scientific discoveries;(6)      develop an understanding of the phenomenon of China rising in the broader context of Chinese culture and history, and reflect on how one may respond to the challenges of China;(7)      enhance awareness of cultural differences, leading to further reflections of one’s own cultural identity;(8)      develop a deepened appreciation of the complexity, grandeur and richness of Chinese history and culture, and with it a potentially enhanced sense of national identity. ", "syllabus": "I. IntroductionThe introductory lecture will articulate the objectives of this core requirement in the context of the history and mission of CUHK, as well as the challenges facing Hong Kong as a special administrative region of China and as a major international metropolis in an increasingly globalized world. It will outline the different themes and topics to be covered, and how they contribute to the overall structure of the course. II. Understanding China: Intellectual FoundationsCulture has significant transformative power on the individual and society. It informs identity and the collective imagination. It shapes beliefs and values. In the Chinese context, the influence of Confucian, Daoist and Buddhist traditions has been deep-rooted and pervasive, finding expression in every level of Chinese society and every level of Chinese life, in ethics and religion, laws and government, education and science, art and architecture and other aspects of material culture, and shaping the ways in which people relate to each other, and how they view the world. Selected core concepts which figure prominently in the Chinese intellectual and cultural tradition will be critically examined, including the concepts of order and harmony, the junzi-ideal person, ren or benevolence and empathetic concern, li or ritual and propriety, and dao or the way. These ideas provide an entry into a world of ideas that is not only critical to understanding China but also significant to global dialogue. III. History as Mirror: Looking at Today’s China from the PastThe purpose of this part of the course is not to rehearse the history of China, but to explore the recurrent themes and conceptual underpinnings that fuel and impact the remarkable phenomenon of China rising.  We will examine five themes: (a) The grand unification of the Qin dynasty, and the central government and the standardization measures it introduced; (b) The Silk Road, consisting of a network of commercial and cultural cities leading from the ancient capitals of China through India and Central Asia all the way to the Mediterranean Coast, revealing the many-faceted and multi-levelled relations between China and the West; (c) Tang Cosmopolitanism, representing a golden age of cultural development which embraced an open-door policy, with the Chinese capital serving as a major centre of art, literature, philosophy and religion in Asia; (d) The Confucian Civil Service Examination, a three-tiered examination system administered at the local, provincial and national levels, which served for centuries as a method of recruiting civil officials, and can be said to be a model of participatory equality and meritocracy; and (e) The century of humiliation, covering the period of intervention and subjugation of the Qing Dynasty and the Republic of China by Western Powers  and Japan, from the Opium War to the founding of the People’s Republic of China in 1949.  IV. China’s Road to Modernisation The multi-faceted process of modernisation and social change demands careful attention. The modernisation of China can be distinguished from that of the Western nations in its being a historical movement of national salvation and self-empowerment, and also as a historical struggle to become one of the multiple centres of the world from a position of the periphery. From the perspective of social change, the country’s modernisation involved giant transformations from an agricultural civilisation to an industrial one, from a monarchy to a republic, and from the study of Confucian classics to the study of science, in a leap from “tradition” to “modernity”. This part of the course will discuss the underlying patterns of Chinese modernisation in relation to selected historical events of late Qing and Republican China, as well as the reforms of the People’s Republic of China, addressing issues such as the relationship between modernisation and Westernisation, and the possibility of different forms of modernity in the context of globalisation. V. The Chinese Economy: Past, Present and FutureThis part of the course looks at the Chinese economy in the context of the global economy. It reviews the economic development of China from the late Qing period to the present day, comparing it to the economy of other nations and with a focus on the developments since the founding of the People’s Republic of China, as well as projections for the future. The review makes reference to a wide range of economic indicators, including Gross Domestic Product (GDP) growth, employment, imports and exports, income distribution, national savings, and infrastructure investment, as well as development strategies such as the dual-circulation economic development strategy and the internationalisation of the Renminbi. The lecture will also examine indicators related to sustainable development such as literacy and educational attainments, public health, prevention of climate change, air and water quality and the eradication of extreme poverty. VI. Science and Technology in China In the twenty-first century, science and technology are becoming an increasingly important facet of modernization for China, driving first an industrial and then an innovation economy, with major impacts on improving livelihood and in geopolitical competition. The topics covered in this part of the course include the Four Great Inventions, mathematics and astronomy in ancient and medieval China, and the question raised by Needham on why modern science emerged in Europe but not in China. Developments since the late Ming period are discussed with reference to science brought by missionaries, and the political, social and cultural reforms from the mid-19th century onwards. A critical examination will be provided of two recent periods, which saw achievements in a few centrally directed projects starting in the 1960s, and advances across a broad front since about 1980, but showing weaknesses in some sectors. ", "required_readings": "I.  Understanding China: Intellectual Foundations  Csikszentmihalyi, Mark. 2020. Confucius. The Stanford Encyclopedia of Philosophy, edited by Edward N. Zalta. <https://plato.stanford.edu/archives/sum2020/entries/confucius/> Chan, Alan. 2018. Laozi. The Stanford Encyclopedia of Philosophy, edited by Edward N. Zalta. <https://plato.stanford.edu/archives/win2018/entries/laozi/> (Parts 1, 2, 5, 6, 7) II.  History as Mirror: Looking at Today’s China from the Past  Baaquie, Belal Ehsan and Qing-hai Wang. 2018. Chinese Dynasties and Modern China: Unification and Fragmentation. China and the World: Ancient and Modern Silk Road, Vol. 1, No.1, 1-43. III.  China’s Road to Modernisation  King, Ambrose Y. C. 2018. “Modernization” and “Modernity”: The Construction of a Modern Chinese Civilizational Order. China’s Great Transformation: Selected Essays on Confucianism, Modernization, and Democracy, 111-128. Hong Kong: The Chinese University of Hong Kong Press.  IV.  The Chinese Economy: Past, Present and Future  Lau, Lawrence J. 2022. Public Goods Provision and Chinese Economic Development. China and the World: Ancient and Modern Silk Road, Vol. 5, No. 1, 2250002. (34 pages) Lau, Lawrence J. 2022. The Prospects of the Chinese Economy. Special issue in celebration of the Centenary of Prof. YANG Chen-Ning, Twenty-First Century Bimonthly (二十一世紀評論), October 2022.V.  Science and Technology in China Young, K. 2022. Science and Technology in China: Required Reading. Manuscript, The Chinese University of Hong Kong. (39 pages)", "recommended_readings": "I.  Understanding China: Intellectual Foundations  Chan, Wing-Tsit. (1963) 2008. The Lao Tzu (Tao-Te Ching). In A Source Book in Chinese Philosophy. Translated and compiled by Wing-Tsit Chan. Princeton: Princeton University Press. Lau, D.C. (1992) 2010. Confucius: The Analects. 2nd ed. Third Printing. Hong Kong: The Chinese University of Hong Kong Press.  Hershock, Peter. 2019. Chan Buddhism. The Stanford Encyclopedia of Philosophy, edited by Edward N. Zalta. <https://plato.stanford.edu/archives/spr2019/entries/buddhism-chan/>. II.  History as Mirror: Looking at Today’s China from the Past  Auyang, Sunny Y. 2014. The Dragon and the Eagle: The Rise and Fall of the Chinese and Roman Empires. Armonk, New York: M.E. Sharpe. De Bary, William Theodore, ed. 1960. Sources of Chinese Tradition.  New York: Columbia University Press. Elman, Benjamin. 2010.  A Cultural History of Civil Service Examinations in Late Imperial China. Berkeley and Los Angeles: University of California Press. Fairbank, John King. 1992. China: A New History. Cambridge, MA: Harvard University Press. Fang, Y.H. 1986. The Making of the Third Superpower. Hong Kong: Eastern Era Publisher. Lewis, Mark Edward. 2009. China’s Cosmopolitan Empire: The Tang Dynasty. Cambridge, MA: Harvard University Press. Li, Xiaobing and Xiansheng Tian, eds. 2014. Evolution of Power:  China’s Struggles, Survival, and Success. Lexington, Maryland: Lexington Books. Liu, Xinru. 2010. The Silk Road in World History. New York: Oxford University Press. Pines, Yuri et al. 2014. Birth of An Empire: The State of Qin Revisited. Berkeley and Los Angeles: University of California Press. Rojas, Carlos. 2010. The Great Wall: A Cultural History. Cambridge, MA: Harvard University Press. Sheridan, James E. 1975. China in Disintegration. New York: The Free Press. Twitchett, Denis and John K. Fairbank, eds. 1986-1989. The Cambridge History of China, Vol. I, II, X, XI. London: The Cambridge University Press. Xiong, Victor Cunrui and Kenneth J. Hammond. 2019. Routledge Handbook of Imperial Chinese History. London: Routledge. III.  China’s Road to Modernisation (to be provided) IV.  The Chinese Economy: Past, Present and Future  Lau, Lawrence J. 2019. The China-U.S. Trade War and Future Economic Relations. Hong Kong: The Chinese University of Hong Kong Press.   V.  Science and Technology in China Young, K. 2022. Science and Technology in China: Supplementary Reading. Manuscript, The Chinese University of Hong Kong. (106 pages)", "terms": {"2022-23 Term 1": {"-X01-WBL (9153)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["No Room Required"], "instructors": ["Staff"], "meetingDates": ["05/09/2022 - 28/11/2022"]}}}, "assessments": {"Examination": "90", "Homework or assignment": "10"}}, {"code": "1002", "title": "Hong Kong in the Wider Constitutional Order", "career": "Undergraduate", "units": "1.00", "grading": "Distinction/Pass/Failure", "components": "Web-enhanced Teaching", "campus": "Main Campus", "academic_group": "Office of University GE", "requirements": "", "description": "This course views the overall development of Hong Kong from the perspectives of the nation and the wider constitutional order in China. It highlights the interlocking relations between law, national security and national development in the context of state capacity building in modern Chinese history, and introduces the fundamental constitutional principles underlying the One-Country-Two-Systems framework, the Basic Law of Hong Kong, and the Hong Kong National Security Law. This online course is required of all undergraduates admitted in 2022-23 and thereafter. It is recommended that students complete the online course UGCP1001 “Understanding China” before taking this course.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}]