[{"code": "1001", "title": "Understanding China", "career": "Undergraduate", "units": "1.00", "grading": "Distinction/Pass/Failure", "components": "Web-enhanced Teaching", "campus": "Main Campus", "academic_group": "Office of University GE", "requirements": "", "description": "The history of China is both rich and complex, as is its development in the modern era. The growing influence of China on the world stage, as one of the largest economies, a prominent player in international relations, and a major centre for knowledge creation, highlights the need for an integrated and multi-disciplinary understanding of its past and present. This course brings together several perspectives on China in addressing the following topics: cultural and intellectual roots, epochal events in history, modernisation and social change, economic development, and science and technology. This online course is required of all undergraduates admitted in 2022-23 and thereafter.", "outcome": "Students enrolled in this course will (1)      acquire a basic understanding of selected key cultural concepts that have shaped individuals and society in Chinese history, with reference to the Confucian, Daoist and Buddhist traditions;(2)      gain an appreciation of the complex forces that have impacted historical development in China and contributed to unity and division, the cultural and ethnic diversity of the nation, as well as continuities between past and present in government institutions, in the relations between China and the West, and in the historical-mindedness of the people;(3)      develop a basic grasp of the modernisation of China as a movement of national salvation and self-empowerment involving giant social transformations, the emergent role and influence of China as an important member of the international community, and the concept of modernity in relation to Westernisation and globalisation;(4)      become familiar with selected milestones in the economic development of China in the last two centuries, in particular the period since the founding of the People’s Republic, and future challenges in sustainable development;(5)     acquire a basic knowledge of the major scientific and technological advances in ancient and modern China, with an understanding of the significance of these achievements as well as their limitations from a comparative cultural perspective in the study of scientific discoveries;(6)      develop an understanding of the phenomenon of China rising in the broader context of Chinese culture and history, and reflect on how one may respond to the challenges of China;(7)      enhance awareness of cultural differences, leading to further reflections of one’s own cultural identity;(8)      develop a deepened appreciation of the complexity, grandeur and richness of Chinese history and culture, and with it a potentially enhanced sense of national identity. ", "syllabus": "I. IntroductionThe introductory lecture will articulate the objectives of this core requirement in the context of the history and mission of CUHK, as well as the challenges facing Hong Kong as a special administrative region of China and as a major international metropolis in an increasingly globalized world. It will outline the different themes and topics to be covered, and how they contribute to the overall structure of the course. II. Understanding China: Intellectual FoundationsCulture has significant transformative power on the individual and society. It informs identity and the collective imagination. It shapes beliefs and values. In the Chinese context, the influence of Confucian, Daoist and Buddhist traditions has been deep-rooted and pervasive, finding expression in every level of Chinese society and every level of Chinese life, in ethics and religion, laws and government, education and science, art and architecture and other aspects of material culture, and shaping the ways in which people relate to each other, and how they view the world. Selected core concepts which figure prominently in the Chinese intellectual and cultural tradition will be critically examined, including the concepts of order and harmony, the junzi-ideal person, ren or benevolence and empathetic concern, li or ritual and propriety, and dao or the way. These ideas provide an entry into a world of ideas that is not only critical to understanding China but also significant to global dialogue. III. History as Mirror: Looking at Today’s China from the PastThe purpose of this part of the course is not to rehearse the history of China, but to explore the recurrent themes and conceptual underpinnings that fuel and impact the remarkable phenomenon of China rising.  We will examine five themes: (a) The grand unification of the Qin dynasty, and the central government and the standardization measures it introduced; (b) The Silk Road, consisting of a network of commercial and cultural cities leading from the ancient capitals of China through India and Central Asia all the way to the Mediterranean Coast, revealing the many-faceted and multi-levelled relations between China and the West; (c) Tang Cosmopolitanism, representing a golden age of cultural development which embraced an open-door policy, with the Chinese capital serving as a major centre of art, literature, philosophy and religion in Asia; (d) The Confucian Civil Service Examination, a three-tiered examination system administered at the local, provincial and national levels, which served for centuries as a method of recruiting civil officials, and can be said to be a model of participatory equality and meritocracy; and (e) The century of humiliation, covering the period of intervention and subjugation of the Qing Dynasty and the Republic of China by Western Powers  and Japan, from the Opium War to the founding of the People’s Republic of China in 1949.  IV. China’s Road to Modernisation The multi-faceted process of modernisation and social change demands careful attention. The modernisation of China can be distinguished from that of the Western nations in its being a historical movement of national salvation and self-empowerment, and also as a historical struggle to become one of the multiple centres of the world from a position of the periphery. From the perspective of social change, the country’s modernisation involved giant transformations from an agricultural civilisation to an industrial one, from a monarchy to a republic, and from the study of Confucian classics to the study of science, in a leap from “tradition” to “modernity”. This part of the course will discuss the underlying patterns of Chinese modernisation in relation to selected historical events of late Qing and Republican China, as well as the reforms of the People’s Republic of China, addressing issues such as the relationship between modernisation and Westernisation, and the possibility of different forms of modernity in the context of globalisation. V. The Chinese Economy: Past, Present and FutureThis part of the course looks at the Chinese economy in the context of the global economy. It reviews the economic development of China from the late Qing period to the present day, comparing it to the economy of other nations and with a focus on the developments since the founding of the People’s Republic of China, as well as projections for the future. The review makes reference to a wide range of economic indicators, including Gross Domestic Product (GDP) growth, employment, imports and exports, income distribution, national savings, and infrastructure investment, as well as development strategies such as the dual-circulation economic development strategy and the internationalisation of the Renminbi. The lecture will also examine indicators related to sustainable development such as literacy and educational attainments, public health, prevention of climate change, air and water quality and the eradication of extreme poverty. VI. Science and Technology in China In the twenty-first century, science and technology are becoming an increasingly important facet of modernization for China, driving first an industrial and then an innovation economy, with major impacts on improving livelihood and in geopolitical competition. The topics covered in this part of the course include the Four Great Inventions, mathematics and astronomy in ancient and medieval China, and the question raised by Needham on why modern science emerged in Europe but not in China. Developments since the late Ming period are discussed with reference to science brought by missionaries, and the political, social and cultural reforms from the mid-19th century onwards. A critical examination will be provided of two recent periods, which saw achievements in a few centrally directed projects starting in the 1960s, and advances across a broad front since about 1980, but showing weaknesses in some sectors. ", "required_readings": "I.  Understanding China: Intellectual Foundations  Csikszentmihalyi, Mark. 2020. Confucius. The Stanford Encyclopedia of Philosophy, edited by Edward N. Zalta. <https://plato.stanford.edu/archives/sum2020/entries/confucius/> Chan, Alan. 2018. Laozi. The Stanford Encyclopedia of Philosophy, edited by Edward N. Zalta. <https://plato.stanford.edu/archives/win2018/entries/laozi/> (Parts 1, 2, 5, 6, 7) II.  History as Mirror: Looking at Today’s China from the Past  Baaquie, Belal Ehsan and Qing-hai Wang. 2018. Chinese Dynasties and Modern China: Unification and Fragmentation. China and the World: Ancient and Modern Silk Road, Vol. 1, No.1, 1-43. III.  China’s Road to Modernisation  King, Ambrose Y. C. 2018. “Modernization” and “Modernity”: The Construction of a Modern Chinese Civilizational Order. China’s Great Transformation: Selected Essays on Confucianism, Modernization, and Democracy, 111-128. Hong Kong: The Chinese University of Hong Kong Press.  IV.  The Chinese Economy: Past, Present and Future  Lau, Lawrence J. 2022. Public Goods Provision and Chinese Economic Development. China and the World: Ancient and Modern Silk Road, Vol. 5, No. 1, 2250002. (34 pages) Lau, Lawrence J. 2022. The Prospects of the Chinese Economy. Special issue in celebration of the Centenary of Prof. YANG Chen-Ning, Twenty-First Century Bimonthly (二十一世紀評論), October 2022.V.  Science and Technology in China Young, K. 2022. Science and Technology in China: Required Reading. Manuscript, The Chinese University of Hong Kong. (39 pages)", "recommended_readings": "I.  Understanding China: Intellectual Foundations  Chan, Wing-Tsit. (1963) 2008. The Lao Tzu (Tao-Te Ching). In A Source Book in Chinese Philosophy. Translated and compiled by Wing-Tsit Chan. Princeton: Princeton University Press. Lau, D.C. (1992) 2010. Confucius: The Analects. 2nd ed. Third Printing. Hong Kong: The Chinese University of Hong Kong Press.  Hershock, Peter. 2019. Chan Buddhism. The Stanford Encyclopedia of Philosophy, edited by Edward N. Zalta. <https://plato.stanford.edu/archives/spr2019/entries/buddhism-chan/>. II.  History as Mirror: Looking at Today’s China from the Past  Auyang, Sunny Y. 2014. The Dragon and the Eagle: The Rise and Fall of the Chinese and Roman Empires. Armonk, New York: M.E. Sharpe. De Bary, William Theodore, ed. 1960. Sources of Chinese Tradition.  New York: Columbia University Press. Elman, Benjamin. 2010.  A Cultural History of Civil Service Examinations in Late Imperial China. Berkeley and Los Angeles: University of California Press. Fairbank, John King. 1992. China: A New History. Cambridge, MA: Harvard University Press. Fang, Y.H. 1986. The Making of the Third Superpower. Hong Kong: Eastern Era Publisher. Lewis, Mark Edward. 2009. China’s Cosmopolitan Empire: The Tang Dynasty. Cambridge, MA: Harvard University Press. Li, Xiaobing and Xiansheng Tian, eds. 2014. Evolution of Power:  China’s Struggles, Survival, and Success. Lexington, Maryland: Lexington Books. Liu, Xinru. 2010. The Silk Road in World History. New York: Oxford University Press. Pines, Yuri et al. 2014. Birth of An Empire: The State of Qin Revisited. Berkeley and Los Angeles: University of California Press. Rojas, Carlos. 2010. The Great Wall: A Cultural History. Cambridge, MA: Harvard University Press. Sheridan, James E. 1975. China in Disintegration. New York: The Free Press. Twitchett, Denis and John K. Fairbank, eds. 1986-1989. The Cambridge History of China, Vol. I, II, X, XI. London: The Cambridge University Press. Xiong, Victor Cunrui and Kenneth J. Hammond. 2019. Routledge Handbook of Imperial Chinese History. London: Routledge. III.  China’s Road to Modernisation (to be provided)Articles:金耀基 , 2013, 中國「現代轉向」的漫長革命,  《中國的現代轉向》,  1-30頁, 香港：牛津大學出版社。金耀基, 2013, 全球化，多元現代性和中國對新文明秩序的追尋,  《中國的現代轉向 》, 169-180頁,  香港：牛津大學出版社。金耀基, 2013,  文化自覺、全球化與中國現代性之構建, 《中國的現代轉向》,  181-198頁, 香港：牛津大學出版社。金耀基,  1989, 天安門悲劇事件的解讀 ,  《神州悲劇的沉思 : 1989年天安門事件評析》, 臺北：正中書局。金耀基, 2020, 中國百年學術之變與發展：從經學到科學的範式轉變,  《百年中國學術與文化之變 : 探索中國的現代文明秩序》, 14-27頁, 香港：中華書局香港有限公司。金耀基, 2013,  中國文化意識之變與反思 ,  《中國社會與文化》, 香港：牛津大學出版社。金耀基, 2013. 中國現代文明秩序的耕建：論中國的「現代化」與「現代性」, 《中國社會與文化》, 香港：牛津大學出版社。金耀基, 2014, 現代性論辯與中國社會學的定位, 《社會學與中國研究》,  香港： 牛津大學出版社。金耀基, 2013, 中國現代化的終極願景 , 《 中國現代化的終極願景 : 金耀基自選集》,  88-94頁：上海; 上海人民出版社。King, Ambrose Y. C. 1997. Confucianism, Modernity and Asian Democracy.  Justice and Democracy: Cross-Cultural Perspectives, edited by Ron Bontekoe, Marietta Stepaniants, Honolulu. Hawaii: University of Hawai'i Press.King, Ambrose Y. C. 2002. The Emergence of Alternative Modenity in East Asia. Reflections on Multiple Modernities : European, Chinese and Other Interpretations, edited by Dominic Sachsenmaier and Jens Riedel, with Shmuel N. Eisenstadt. Multiple Modernities Conference. Leiden; Boston, Mass.: Brill.Pfeffer, Richard M. 1997. The Pursuit of Purity: Mao's Cultural Revolution. China in Ferment; Perspectives on the Cultural Revolution. Richard Baum edited, with Louise B. Bennett. Englewood Cliffs, N.J. : Prentice-Hall. Inglehart, R., Baker, W. E. Modernization.2000. Cultural Change, and the Persistence of Traditional Values. American Sociological Review, vol. 65.Havel, Vaclav. 1995. Civilization's Thin Veneer. Harvard Magazine, vol. 97.Eisenstadt, S. N. 2000. Multiple Modernities in an Age of Globalization.  Truman Institute Reprints (n.d) Jerusalem: The Hebrew University.Books:金耀基, 2013, 《中國政治與文化》,  香港：牛津大學出版社。金耀基, 2014, 《 社會學與中國研究》,  香港： 牛津大學出版社, 。金耀基, 2016, 《 中國文明的現代轉型》,  廣州： 廣東人民出版社, 。金耀基, 2017, 《 從傳統到現代》,  北京：北京法律出版社, 。亨利．.基辛格, 2019, 《論中國》,   胡利平, 林華, 楊韻琴, 朱敬文譯.北京：中信出版社。郭廷以, 1979, 《 中國近代史綱》, 香港：香港中文大學出版社。埃里克．伊茲拉萊維奇 (Erik Izraelewicz), 2006, 《當中國改變世界》,      姚海星, 斐曉亮譯, 臺北：高寶。馬丁・雅克 (Martin Jacques), 2010, 《當中國統治世界 : 中國的崛起和西方世界的衰落》,  張莉、劉曲譯, 北京：中信出版社。法理德．劄卡瑞亞 (Fareed Zakaria), 2008,  《後美國世界 : 群雄崛起的經濟新秩序時代》, 杜默譯, 台北市： 麥田出版。許倬雲, 2014,  《現代文明的批判 : 剖析人類未來的困境》, 台北市： 遠見天下文化出版。King, Ambrose Y. C. 2018. China's Great Transformation: Selected Essays on Confucianism, Modernization, and Democracy. Hong Kong: The Chinese University Press.Fukuyama, Francis. 1992. The End of History and the Last Man. New York: Free Press.Huntington, Samuel. 2011. The Clash of Civilization and the Remaking of World Order. New York: Simon & Schuster.Friedman, Thomas L. 2005. The World is Flat: A Brief History of the Globalized World in the Twenty-first Century. London: Allen Lane. IV.  The Chinese Economy: Past, Present and Future  Lau, Lawrence J. 2019. The China-U.S. Trade War and Future Economic Relations. Hong Kong: The Chinese University of Hong Kong Press.   V.  Science and Technology in China Young, K. 2022. Science and Technology in China: Supplementary Reading. Manuscript, The Chinese University of Hong Kong. (106 pages)", "terms": {"2022-23 Term 1": {"-X01-WBL (9153)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["No Room Required"], "instructors": ["Staff"], "meetingDates": ["05/09/2022 - 28/11/2022"]}}, "2022-23 Term 2": {"-X01-WBL (9060)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["No Room Required"], "instructors": ["Staff"], "meetingDates": ["09/01/2023 - 17/04/2023"]}}}, "assessments": {"Examination": "90", "Homework or assignment": "10"}}, {"code": "1002", "title": "Hong Kong in the Wider Constitutional Order", "career": "Undergraduate", "units": "1.00", "grading": "Distinction/Pass/Failure", "components": "Web-enhanced Teaching", "campus": "Main Campus", "academic_group": "Office of University GE", "requirements": "", "description": "This course views the overall development of Hong Kong from the perspectives of the nation and the wider constitutional order in China. It highlights the interlocking relations between law, national security and national development in the context of state capacity building in modern Chinese history, and introduces the fundamental constitutional principles underlying the One-Country-Two-Systems framework, the Basic Law of Hong Kong, and the Hong Kong National Security Law. This online course is required of all undergraduates admitted in 2022-23 and thereafter. It is recommended that students complete the online course UGCP1001 “Understanding China” before taking this course.", "outcome": "Students enrolled in this course will be able to: Articulate why security has become an issue of pivotal importance for all human society, which includes the expanding interests in and the growing importance of national security; Recognise that the loss of Hong Kong in the wake of the Opium war is a symbol of state failure, as well as the historical roots of the rise of national insecurity from mid-19th century onwards;  Explain how national security issues have gained prominence with the global rise of new China; Describe the role of state capacity in China’s national development and the rising sense of national security; Recognise that national security capacity building has become a prioritized national concern for China in the 21st century; Explain why pursuant to the goals of both security and development, a broader view of Hong Kong in the wider constitutional order is both essential and necessary for the development of HKSAR; Recognise a broader notion of the Hong Kong National Security Law as an integral part of China’s constitutional system, which promotes multiple national developmental goals and pluralistic general principles for security and development in the region and the whole nation.", "syllabus": "I. Introduction: Basic Concepts and ThemesBuilding on the knowledge foundation provided by the course “Understanding China” (UGCP1001), this course focuses on understanding Hong Kong in the context of China and situating “Hong Kong in the wider constitutional order.” This opening lecture introduces the notion of constitutional order and the methodology of the course by emphasizing a trilogy of themes: law, security, and development. The security themes such as national security, international security, global security, and cyber security have become popular topics attracting the attention and efforts of academics the world over. There is a growing consensus that security has become a crucial and common interest for all human societies to survive and develop as a city, a country, and one world. Based on the interlocking themes of security, law and development, this course provides longer-term perspectives on Hong Kong in the wider constitutional order. II. China’s Rise: A Bicentennial Perspective II-1. The 1840 Dilemma: A Brief History of State FailureThis lecture focuses on the notion of “national insecurity” emerging in mid-19th century China. After the Opium War waged by Britain against China, China gradually became a failed state. This post-opium-war state failure is referred to as “China’s 1840 dilemma”, which reflects, in essence, multiple national security dimensions. II-2. New China: China’s Rise and its Global ImplicationsThis lecture introduces the notion of a “new China”. China’s global rise not only speaks to its great achievement in light of national development, but also indicates the growing concern for national security (vs. national insecurity). The correlation between national development and national security takes a central place in understanding China’s rise and its global implications.   III. Dimensions of State Capacity and National Security III-1. State Capacity and National DevelopmentThis lecture discusses in detail the crucial importance of state capacity for national development. Students are encouraged to understand the notion of state capacity and effective government, which combine to provide the pivotal foundation for the achievements of national security, constitutional order, and national development. III-2. National Security Capacity: A New DevelopmentThis lecture begins with a comparison of the United States of America (U.S.) and the United Kingdom (U.K.) with respect to recent developments in their respective national security strategies, which converge on national security capacity building through a comprehensive “whole-of-government” approach. The policies and laws China has recently adopted and legislated are nothing new or exceptional. This background knowledge provides a good starting point for understanding the Hong Kong National Security Law. IV. One Country, Two Systems: Past and Present IV-1. Unitary State: Constitutional Legacies of Ancient ChinaThe main purpose of this lecture is to explain the notion of a unitary state, which provides the historical and constitutional foundation for both “one country” and “two systems”. The notion of a unitary state will be explained in great detail in comparative terms. The Chinese constitutional wisdom in implementing “one country, many systems” under the rubric of a unitary state sheds light on the historical roots of the “one country, two systems” in Hong Kong.  IV-2.  One Country, Two Systems: an in-depth and comprehensive overview Critical to our understanding of Hong Kong in the wider constitutional order is developing an in-depth and comprehensive understanding of the “One Country, Two Systems (OCTS)” policy. Emphasis is placed on the close reading of original documents, namely, the three sets of official documents which chart the evolution of the OCTS policy: the speeches of Deng Xiaoping on Hong Kong, and the two White Papers of the State Council (2014/2021). IV-3.  Hong Kong Basic Law as a Chinese National Law This lecture focuses on the Hong Kong Basic Law (HKBL). The main point of this lecture is that Hong Kong Basic Law is a national law of China. Chinese citizens across the country without exception abide by this law. About one-fifth of the 160 articles of the HKBL contain the term “the central government”. These articles substantiate the principle of “One Country” within the text of the HKBL, highlighting the pivotal importance of these articles in maintaining the wider constitutional order.    V. National Security in the Wider Constitutional Order V-1. Constitution and National SecurityBuilding on the preceding lectures on the notions of a unitary state, the primacy of “one country”, and the constitutional principles of nationalism, this lecture explains the relation of national security to the constitution. Adopting a comparative perspective, this lecture starts with the “national security constitution” conception in the United States. One takeaway from this week’s lecture is that national security is part of constitutional law, and it is a misconception to think of a national security law merely as a criminal law or an emergency law. V-2. Law as Safeguard: General principles of HKNSL This lecture guides students in learning about The Law of the People’s Republic of China on Safeguarding National Security in the Hong Kong Special Administrative Region (hereafter “Hong Kong National Security Law”, or HKNSL) by focusing on the general principles, and provides a comparative perspective based on a survey of the 1947 National Security Act of the United States. HKNSL is first and foremost a national law of China that empowers both the nation and region to safeguard national security in the HKSAR after June 30, 2020. The innermost essence of this law is about the central government’s overarching responsibility in safeguarding national security for all Chinese, country-wide and region-wide. Second, this law safeguards the authority of the HKSAR government to lawfully guard national sovereignty, unity, territorial integrity, and other major national security interests in Hong Kong.   V-3. National Security Framework CasesThere are two categories of cases which apply different laws. For cases in Category One, which arise from “the events in 2019”, effective laws in Hong Kong other than HKNSL can be cited as the authority in making judgments. In those cases, no citation of the HKNSL is allowed, because HKNSL is a non-retroactive law. Only for cases in Category Two, that is, the “national security cases”, which arose after the HKNSL took effect in Hong Kong, can HKNSL be cited as the authority to decide a case. Making a difference between the two categories of cases is important. This lecture discusses some recent court cases pertaining to HKNSL and the constitutional significance of these cases.  V-4.  Imagining the Future of “One Country, Two Systems”This final lecture concludes the course by recommending a longer-term perspective on law, development and security in the context of Hong Kong as a special administrative region of China. Everyone has an important part to play in contributing to the betterment of Hong Kong in the wider constitutional order. ", "required_readings": "II. China’s Rise: A Bicentennial PerspectiveSpence, Jonathan D. 2013. The Search for Modern China. New York: W.W. Norton & Company, 152-163.  Wang, Shaoguang. 2021. China’s Rise and Its Global Implications. Singapore: Springer Nature Singapore, 11-14, 69-86, 131-154. III. Dimensions of State Capacity and National SecurityWang, Shaoguang. 2021. China’s Rise and Its Global Implications. Singapore: Springer Nature Singapore, 15-64. The State Council of the People’s Republic of China. 2016. The 13th Five-Year National Social and Economic Development Plan. Beijing: Central Compilation & Translation Press, Chapter 73. The State Council of the People’s Republic of China. 2021. The 14th Five-Year National Social and Economic Development Plan. China: The People's Publishing House, Parts 15 & 18. IV. One Country, Two Systems: Past and PresentDeng, Xiaoping. 2004. Deng Xiaoping on “One country, Two systems”. Hong Kong: Joint Publishing (Hong Kong) Co. Ltd., 1-5, 13-18, 67-78, 87. The State Council of the People’s Republic of China. 2014. Fully and Accurately Understanding and Implementing the Policy of “One Country, Two Systems (Part V). The Practice of the “One Country, Two Systems” policy in the Hong Kong Special Administrative Region. Chen, Albert H. Y. 2021. The Theory and Practice of Autonomy: The Case of Hong Kong. In The changing legal orders in Hong Kong and Mainland China: essays on “One Country, Two Systems”. Hong Kong: City University of Hong Kong Press, 57-68. Wang, Zhenmin. 2019. Relationship Between the Chinese Central Authorities and Regional Governments of Hong Kong and Macao: A Legal Perspective. Singapore: Springer Singapore, 108-141, 291-299. V. National Security in the Wider Constitutional Order           Wang, Zhenmin; et al. 2021. Hong Kong SAR National Security Law: A Reader. Hong Kong: Joint Publishing (Hong Kong) Co. Ltd., 1-24, 66-81, 120-145.             Alternatively, for students who do not read Chinese or may prefer to read in English:         The Law of the People’s Republic of China on Safeguarding National Security in the Hong Kong Special Administrative Region, Articles 1-11.                    Decision of the National People’s Congress on Establishing and Improving the Legal System and Enforcement Mechanisms for the Hong Kong Special Administrative Region to Safeguard National Security. Retrieved from: https://www.elegislation.gov.hk/hk/capA215/                   Chen, Albert H. Y. 2020. Hong Kong in China: The Project of ‘One Country, Two Systems’ and the Question of National Security. In China’s National Security: Endangering Hong Kong’s Rule of Law? Edited by Cora Chan and Fiona de Londras. Oxford: Hart Publishing, 19-40.               Chen, Albert H. Y. 2021. The National Security Law of the HKSAR: A Contextual and Legal Study. SSRN Electronic Journal. doi:10.2139/ssrn.3958261               Chen, Albert H. Y. 2021. A ‘Post-National Security Law Era’ Narrative for Hong Kong (Preface). In Hong Kong in China: Rethinking the Hong Kong-Mainland Relationship. Hong Kong: City University of Hong Kong Press. Retrieved from: http://researchblog.law.hku.hk/2021/09/albert-chen-on-post-national-security.html.", "recommended_readings": "I. Introduction: Basic Concepts and ThemesCorn, Geoffrey S. Corn, Jimmy Gurulé, Jeffrey D. Kahn and Gary Corn. 2021. National Security Law and the Constitution. New York: Wolters Kluwer.Corn, Geoffrey S., Jimmy Gurulé, Eric Talbot Jensen and Peter Margulies, 2019. National Security Law: Principles and Policy. New York: Wolters Kluwer.Dycus, Stephen, William C. Banks and Peter Raven-Hansen, Stephen I. Vladeck. 2020. National Security Law. New York: Wolters Kluwer.Geiss, R., Melzer, N., Devaney, J. G. and Methymaki, E. 2021. The Oxford Handbook of the International Law of Global Security (First edition. ed.). Oxford, United Kingdom: Oxford University Press.Gheciu, A. and Wohlforth, W. C. 2018. The Oxford Handbook of International Security. United Kingdom: Oxford University Press.Lessambo, Felix. I. 2020. Mergers in the Global Markets: A Comparative Approach to the Competition and National Security Laws among the US, EU, and China. Switzerland: Palgrave Macmillan.Reveron, Derek S., Nikolas K. Gvosdev, and John A. Cloud, eds. 2018. The Oxford Handbook of U.S. National Security. New York: Oxford University Press.Scott, Paul F. 2018. The National Security Constitution. New York: Hart Publishing.Ward, Robert, and Jones, Rupert. 2021. National Security: Law, Procedure, and Practice. New York: Oxford University Press. II. China’s Rise: A Bicentennial PerspectiveFu, Xiaolan, Bruce McKern, and Jin Chen, eds. 2021. The Oxford Handbook of China Innovation. New York: Oxford University Press.Kennedy, David and Joseph E. Stiglitz. 2013. Law and Economics with Chinese Characteristics: Institutions for Promoting Development in the Twenty-first Century. United Kingdom: Oxford University Press.Maddison, Angus. 2007. Contours of the World Economy, 1-2030 AD: Essays in Macro-economic History. New York: Oxford University Press.Men, Honghua. 2020. On China’s Road: In Search of a New Modernity. Singapore: Springer Singapore.Spence, Jonathan D. 2013. The Search for Modern China. New York: W.W. Norton & Company.Yü, Ying-shih. 2016. Chinese History and Culture: Seventeenth Century Through Twentieth Century, Volume 2. New York: Columbia University Press. III. Dimensions of State Capacity and National SecurityLi, Zhanshu. 2021. Report on the Work of the Standing Committee of the National People’s Congress. Delivered at the Fourth Session of the 13th National People’s Congress on March 8, 2021.Fukuyama, Francis. 2004. State Building: Governance and World Order in the 21st Century. New York: Cornell University Press.Morris, Ian. 2013. The Measure of Civilization: How Social Development Decides the Fate of Nations. Princeton, New Jersey: Princeton University Press.Parker, Geoffrey. 1996. The Military Revolution: Military Innovation and the Rise of the West, 1500-1800. Cambridge: Cambridge University Press.Tilly, Charles. 1992. Coercion, Capital, and European States, AD 990-1992. Cambridge, MA: Wiley-Blackwell.Wang, Shaoguang. 2003. The Problem of State Weakness. Journal of Democracy, 14(1), pp. 36-42. doi:DOI 10.1353/jod.2003.0022 IV. One Country, Two Systems: Past and PresentChen, Albert H.Y. 2021. The Changing Legal Orders in Hong Kong and Mainland China: Essays on “One Country, Two Systems”. Hong Kong: City University of Hong Kong Press.Deng, Xiaoping. 2004. Deng Xiaoping on “One country, Two systems”. Hong Kong: Joint Publishing (Hong Kong) Co. Ltd.Lim, C. L. 2022. Treaty for a Lost City: The Sino-British Joint Declaration. Cambridge, United Kingdom: Cambridge University Press.Ramsden, Michael and Stuart, Hargreaves, eds. 2022. Hong Kong Basic Law Handbook. Hong Kong: Thomson Reuters Hong Kong Limited. The State Council of the People’s Republic of China. 2014. The Practice of the “One Country, Two Systems” Policy in the Hong Kong Special Administrative Region. Retrieved from http://www.scio.gov.cn/zfbps/ndhf/2014/Document/1373163/1373163.htm.Wang, Zhenmin. 2019. Relationship Between the Chinese Central Authorities and Regional Governments of Hong Kong and Macao: A Legal Perspective. Singapore: Springer Singapore.Zhang, Yongle and Daniel A., Bell, eds. 2018. The Constitution of Ancient China. Princeton, New Jersey: Princeton University Press. V. National Security in the Wider Constitutional Order陸恭蕙, 高禮文著, 魏磊傑譯, 2021, 《香港在中國: 重新思考內地與香港關係》, 香港：香港城市大學出版社。陳弘毅等著, 2020 ,《香港國家安全法解讀 : 立法與管治》, 香港：中華書局香港有限公司。劉兆佳, 2020, 《思考香港一國兩制的未來 》, 香港：商務印書館香港有限公司。王振民等著, 2021 , 《香港特別行政區維護國家安全法讀本》, 香港： 三聯書店香港有限公司。朱國斌, 韓大元, 王江雨, 黃明濤主編, 2021, 《香港國家安全法:法理與實踐》, 香港： 三聯書店香港有限公司。The State Council of the People’s Republic of China. 2021. Hong Kong: Democratic Progress under the Framework of One Country, Two Systems. Retrieved from http://www.news.cn/english/2021-12/20/c_1310383195.htmLoh, Christine and Richard, Cullen. 2018. No Third Person: Rewriting the Hong Kong Story. Hong Kong: Abbreviated Press.", "terms": {"2022-23 Term 2": {"-X01-WBL (9062)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["No Room Required"], "instructors": ["Staff"], "meetingDates": ["15/01/2023 - 23/04/2023"]}}}, "assessments": {"Examination": "90", "Homework or assignment": "10"}}]