[{"code": "1212", "title": "Understanding China through Cultural Landscape", "career": "Undergraduate", "units": "2.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Office of University GE", "requirements": "UGEA1212 is double-coded with GRMD1003. Not for Geography and Resource Management Majors; and students who have taken GESC2380 or GRMD1003. \nCo-requisite: Any course with “UGFH” or “UGFN” as prefix", "description": "(UGEA1212 is double-coded with GRMD1003.)  This course aims to introduce China’s cultural heritages from the perspective of cultural geography. As an important sub-discipline in human geography, cultural geography examines how people use space and develop it into places – a process of cultural landscape formation. “Space” here is nothing immutable or monolithic; instead, individuals, groups, civilizations and their culture “craft” characteristic places through interactions with the surrounding environment and specific political and economic systems (themselves determined by culture). China provides numerous extraordinary examples to illustrate these topics. The course includes four key components: 1) the theoretical foundation: fundamentals of cultural geography; 2) the legacies and regional variations of China’s cultural heritages; 3) topical issues about China’s cultural heritages; 4) the cultural convergence in aspects of globalization and cultural transformation. The course provides not only a body of knowledge about the cultural landscape and spatial variations of places in China, but also an understanding of their major transformations that have taken place in a globalizing world.", "outcome": "     Students are expected to develop a general and comprehensive understanding of China’s cultural heritages, using the approach of cultural geography. Broad issues regarding China’s cultural heritages will be discussed to appreciate that cultural landscape formation is the result of multiple forces (e.g. natural, geographical, social, economic, political, etc) working together to form space and then places. After completing the course, students will be able to:      adopt a normative stance in evaluating the cultural landscapes;       identify essential features of China’s cultural heritages from the lens of cultural geography;       understand Chinese cultural heritages’ multiple dimensions and geographical variations, and how these factors shape and reinforce space, place and cultural formation;       discover cases or use experiences to describe and diagnose how the development of Chinese cultural heritages is associated with forces at different geographical scales such as local, regional, national and even global scales;       organize their ideas and information under the framework of cultural geography; and       explain their ideas in a communicative manner to promote Chinese culture.         ", "syllabus": " As shown below, the course contents will be divided into 4 parts and 12 topics.   Part I: Fundamental of Cultural Geography: Interpreting Places and Spaces of Cultural Heritages (3 lectures):   This component covers key theories and concepts developed over the past 30 years in cultural geography (both classical and new cultural geography approaches), and explain why cultural geography offers a very unique but important approach to study China’s cultural heritages. Theoretical exploration will help bring out ideas about space, place, power, cultural landscape, and identity. How people use space and develop it into place will be discussed. Many examples will be used to help students understand the approaches of cultural geography.   1. Introduction: cultural geography as an approach 文化地理方法导读   2. Culture, space, place and power 文化、空間、地方與權力   3. Shaping of China’s cultural landscape: traditions, foreign imports, and globalization 中国文化景觀的形成：傳統、外來影響與全球化   Part II: Cultural Heritages and Regional Variations (5 lectures) In the first three weeks, the course has laid the theoretical foundation. Now, student will begin their journey of understanding the subject matter, with a focus on several key cultural regions in China. The aim of this component is to covey a deep sense of place as an integral system engaging multiple force, e.g. myth and legend, power and politics, history and tradition, religion and symbol, nature and geography, cultural practices, and society’s interconnection with the environment. Students will make a good sense of a wide geographical variation of Chinese cultural values and practices.     4. Beijing: Beijing Culture and the place of politics 北京：京派文化與空間的政治   5. Shanghai: Shanghai Culture and the place for spatial competition 上海：海派文化與空間的爭奪   6. Southwest: Ethnic culture and the place of ethnicity 西南：民族文化與鄉土空間   7. Tibet: Religious culture and the place of belief 西藏：宗教文化與信仰空間   8. Lingnan: Lingnan culture and the place of diversity 嶺南：嶺南文化與多元空間   Part III: China’s Cultural Imprints and Dynamics: Topical Issues (3 lectures) The aim of this component is to let students further appreciate the diversified studies of cultural geography by introducing several topical issues.   9. Ancient villages: A place of spatial representation 古村落的空間意象   10. The cultures of production and workspace 生産的文化與勞動場所   11. Graffiti: the cultural geography of Youth in China 塗鴉：青年文化地理   Part IV: Cultural Convergence and Transformation (Globalization) (1 lecture) Globalization is an unescapable trend, and this powerful trend has greatly impacted on China’s cultural heritages. The cultural convergence and transformation will be discussed. The focus is not simply to interpret convergence as some kind of loss of unique characteristics of our cultural tradition. Rather, we wish to stress that when one gets involved in intercultural interaction, one should be likely to become aware of and even enhance one’s cultural tradition. Problems and local responses in cultural heritage conservation in China will be explored.   12. China’s cultural heritage under globalization: a cultural geography perspective 全球化下的中国文化遺產: 文化地理學的解讀  ", "required_readings": " Those with *are required readings and others are recommended readings.    Introduction: culture geography as an approach  *Chapter 1-3, Jon Anderson (2009), Understanding Cultural Geography: Places and Traces, New York and Oxon: Routledge.  *Anderson, B. (2020). Cultural geography III: The concept of ‘culture.’ Progress in Human Geography, 44(3): 608-617.  Chapter 1-3, Mike Crang (1998), Cultural Geography, London and New York: Routledge.   Culture, space, place and power  *Chapter 4-5, Jon Anderson (2009), Understanding Cultural Geography: Places and Traces, New York and Oxon: Routledge.  Anderson B (2017) Cultural geography I: Intensities and forms of power. Progress in Human Geography 36: 1136–1153.  Anderson B (2018) Cultural geography II: The force of representations. Progress in Human Geography. DOI: 1177/0309132518761431.   Shaping of China’s cultural landscape: traditions, foreign imports, and globalization  *Wang, Jing (2005), ‘Introduction: the politics and production of scales in China: how does geography matter to studies of local, popular culture?’, in ed. Wang, Jing, Locating China: space, place and popular culture, Oxon: Routledge, pp. 1-30.  李天綱（2008）“全球化真諦：文化多樣性的可持續發展”。信報財經新聞，2008年5月29日，P47   Beijing: Beijing Culture and the place of politics  *洪長泰(2011), 地標：北京的空間政治，香港：牛津出版社 (序與第一章：天安門廣場：民族主義的新政治舞臺), XI-55.  Wang, Jing (2005), “Bourgeois Bohemians in China? Neo-Tribes and the Urban Imaginary”, The China Quarterly, 183: pp. 532 - 548.   Shanghai: Shanghai Culture and the place for spatial competition  *羅崗(2007), ‘空間的生產與空間的轉移’, 華東師範大學學報(哲學社會科學版), 第39 卷第6 期, 91-96頁  Lee, L.O. (1999), Shanghai Modern: The Flowering of a New Urban Culture in China, 1930-1945, Cambridge, Mass.: Harvard University Press.   Tibet: Religious culture and the place of belief  *張學梅、陳昌群（2007），‘藏族傳統聚落形態與藏傳佛教的世界觀’，宗教學研究，2：201-206.  *黃淩江、劉超群（2010），‘西藏傳統建築空間與宗教文化的意象關係’, 華中建築，第5期。  康•格桑益希（2003），‘苯教- 藏族傳統文化的源頭’，四川大學學報（哲學社會科學版），5：59-62.  Chapter 9 (Senses of place: scales and beliefs), Jon Anderson (2009), Understanding Cultural Geography: Places and Traces, New York and Oxon: Routledge.   Southwest: Ethnic culture and the place of ethnicity  *Chapter 8 (The place of ethnicity), Jon Anderson (2009), Understanding Cultural Geography: Places and Traces, New York and Oxon: Routledge.  Chapter 1 (Remapping Shanghai: pp. 1-42), Stevan Harrell (2001), Ways of Being Ethnic in Southwest China, Seattle : University of Washington Press. Part I (The Political, Natural, and Historical Setting).   Lingnan: Lingnan culture and the place of diversity  *劉益（1997）, ‘嶺南文化的特點及其形成的地理因素’，人文地理，第1期；   Ancient villages: A place of spatial representation  *劉沛林（1997），古村落：和諧的人聚空間，上海 : 上海三聯書店。(第2-6章：15-123)  段進, 揭明浩（2009），世界文化遺產宏村古村落空間解析，南京：東南大學出版社。(第一章：宏村物質空間調 研報告)   The place of physical nature and political tension  *Chapter 7 (The place of nature), Jon Anderson (2009), Understanding Cultural Geography: Places and Traces, New York and Oxon: Routledge.   The culture of production and workspace  *Chapter 9: (Cultures of production), Mike Crang (1998), Cultural Geography, London and New York: Routledge.   Graffiti: the cultural geography of Youth in China  *Chapter 10 (Making and marking new places: the cultural geographies of youth), Jon Anderson (2009), Understanding Cultural Geography: Places and Traces, New York and Oxon: Routledge.  *Valjakka, M. (2016) ‘Contesting Transcultural Trends: Emerging Self-identities and Urban Art Images in Hong Kong’, in Jeffrey Ian Ross (ed.), Routledge Handbook of Graffiti and Street Art, 357‒371, Oxford: Routledge.  *Valjakka, M. (2016) ‘Claiming spaces for urban art images in Beijing and Shanghai’, in Jeffrey Ian Ross (ed.), Routledge Handbook of Graffiti and Street Art, 372‒387, Oxford: Routledge.  ", "recommended_readings": " See the list above. Those without *are recommended readings.", "terms": {"2024-25 Term 1": {"--LEC (8443)": {"startTimes": ["10:30"], "endTimes": ["12:15"], "days": [2], "locations": ["Ho Tim Building B6"], "instructors": ["Professor XU Jiang"], "meetingDates": ["3/9", "10/9", "17/9", "24/9", "8/10", "15/10", "22/10", "29/10", "5/11", "12/11", "19/11", "26/11"]}}}, "assessments": {"Classwork": "15", "Examination": "65", "Project": "20"}}, {"code": "1310", "title": "Artistic Traditions in China", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "Lecture\nInteractive Tutorial", "campus": "Main Campus", "academic_group": "Office of University GE", "requirements": "UGEA1310 is double-coded with FAAS1600. \nNot for Fine Arts Majors; and students who have taken FAAS1600 or UGED2291.\nCo-requisite: UGFH1000, UGFN1000 or UGFN1001 (only applicable to students admitted to the 4-year curriculum)", "description": "(UGEA1310 is double-coded with FAAS1600.) In light of artifacts whether excavated or collected as well as historical texts, this course provides an overview of Chinese art over 5000 years. Through studying the art and culture of the pre-historic era and the Bronze Age, and the development of painting, calligraphy, religious sculpture, architecture, jade, gold, silver, and ceramics throughout the centuries, students will understand the special characteristics and historical development of Chinese art and culture over the centuries. Artistic exchange between China and its neighbouring countries will be given special attention. Tutorial sessions involve practical workshop or the study of actual art objects at the Art Museum.", "outcome": "After taking this course, students are expected to get a basic understanding of:   1. The origin and development of major artistic traditions in China; 2. The artistic and cultural significance of Chinese art; 3. The achievements and contributions of great masters; 4. The ways of looking at Chinese art; and 5. The relationship between Chinese art and foreign culture.    ", "syllabus": "1. The art and culture of prehistoric and Bronze Age China; 2. Chinese ceramics and other decorative arts; 3. Chinese imperial art throughout the ages; 4. Art of the Chinese literati; 5. Chinese religious art; and 6. Artistic exchange between China and its neighboring countries.  ", "required_readings": "China 5000 Years: Innovation and Transformation in the Arts. New York: Guggenheim Museum, 1998. Especially chapters by Patricia Ebrey, Jenny F. So, Wu Hung, Wang Qingzheng, Regina Krahl, Helmut Brinker, Su Bai, Peter Sturman, James Cahill   Clunas, Craig. Art in China. Oxford History of Art. Oxford: Oxford University Press, 1997.   Rawson, Jessica, ed. The British Museum Book of Chinese Art. London: The Trustees of the British Museum, 1992.   Sullivan, Michael. The Arts of China. Revised edition. Berkeley, L.A. and London: University of California Press, 1982. 蘇立文著，曾堉、王寶連譯：《中國藝術史》。台北：南天書局，1985。   Yang Xin et al. Three Thousand Years of Chinese Painting. New Haven & London: Yale University Press; Beijing: Foreign Language Press, 1997. 楊新等：《中國繪畫三千年》。北京：外文出版社、耶魯大學出版社，1997。   Sullivan, Michael: Art and Artists of Twentieth-Century China. Berkeley: University of California Press, 1996.   Vainker, S. J. Chinese Pottery and Porcelain: From Prehistory to the Present. London: British Museum Press, 1991.   陶瓷史話編寫組：《陶瓷史話》。上海：上海科技出版社，1982，頁1-35，48-57。   Patricia Ebrey, The Cambridge Illustrated History of China. Cambridge: Cambridge University Press, 1996.   伊佩霞著，趙世瑜、趙世玲、張宏豔譯：《劍橋插圖中國史》。濟南：山東畫報出版社，2001。   中國硅酸鹽學會主編：《中國陶瓷史》。北京：文物出版社，1982。", "recommended_readings": "Distributed with each lecture.", "terms": {"2024-25 Term 2": {"A-LEC (5337)": {"startTimes": ["14:30"], "endTimes": ["16:15"], "days": [1], "locations": ["T.C. Cheng Bldg 114"], "instructors": ["Professor HO Ka Yi, \n\nProfessor WAN Chui Ki"], "meetingDates": ["6/1", "13/1", "20/1", "27/1", "10/2", "17/2", "24/2", "10/3", "17/3", "24/3", "31/3", "7/4", "14/4"]}, "AT01-TUT (8656)": {"startTimes": ["10:30"], "endTimes": ["11:15"], "days": [3], "locations": ["T.C. Cheng Bldg 201"], "instructors": ["Professor HO Ka Yi, \n\nProfessor WAN Chui Ki"], "meetingDates": ["8/1", "15/1", "22/1", "5/2", "12/2", "19/2", "26/2", "12/3", "19/3", "26/3", "2/4", "9/4", "16/4"]}, "B-LEC (8798)": {"startTimes": ["14:30"], "endTimes": ["16:15"], "days": [1], "locations": ["T.C. Cheng Bldg C5"], "instructors": ["Professor HO Ka Yi, \n\nProfessor WAN Chui Ki"], "meetingDates": ["6/1", "13/1", "20/1", "27/1", "10/2", "17/2", "24/2", "10/3", "17/3", "24/3", "31/3", "7/4", "14/4"]}, "BT01-TUT (8799)": {"startTimes": ["11:30"], "endTimes": ["12:15"], "days": [3], "locations": ["T.C. Cheng Bldg 201"], "instructors": ["Professor HO Ka Yi, \n\nProfessor WAN Chui Ki"], "meetingDates": ["8/1", "15/1", "22/1", "5/2", "12/2", "19/2", "26/2", "12/3", "19/3", "26/3", "2/4", "9/4", "16/4"]}, "BT02-TUT (8800)": {"startTimes": ["12:30"], "endTimes": ["13:15"], "days": [3], "locations": ["T.C. Cheng Bldg 201"], "instructors": ["Professor HO Ka Yi, \n\nProfessor WAN Chui Ki"], "meetingDates": ["8/1", "15/1", "22/1", "5/2", "12/2", "19/2", "26/2", "12/3", "19/3", "26/3", "2/4", "9/4", "16/4"]}}}, "assessments": {"Essays": "40", "Essay test or exam": "30", "Short answer test or exam": "30"}}, {"code": "1333", "title": "Multiculturalism and China", "career": "Undergraduate", "units": "2.00", "grading": "Graded", "components": "Field Studies/Field-trip\nLecture", "campus": "Main Campus", "academic_group": "Office of University GE", "requirements": "Not for Anthropology Majors. \nCo-requisite: Any course with “UGFH” or “UGFN” as prefix", "description": "This course introduces students to an understanding of the changes of the ethnic landscape in China from the past to the present. Through close readings of ethnographies, viewing of videos, and fieldtrips, this class examines various topics in multiculturalism in China, including ethnic relations, global economy, religion pluralism, and cross-cultural romance and marriage, in the context of globalization. This course also compares multiculturalism in different Chinese societies and discusses the possible futures of PRC. Over the past decade, China has been committed to advance the UN’s 2030 Sustainable Development Agenda (17 Sustainable Development Goals, SDGs). This course also discusses to what extent the development in China meets these goals, particularly in the area of sustainable economic growth, social equality, and cultural inclusiveness. ", "outcome": " Students taking this course will:  acquire basic anthropological knowledge in multiculturalism, globalization, and ethnicity and develop the ability to comprehend and apply related knowledge;  gain a better appreciation of Chinese cultural heritage and other cultural traditions;  recognize that Chinese culture involves multicultural components;   acquire a critical mind to examine any social issues; and  recognize the importance of sustainable development from the social and cultural perspectives.  ", "syllabus": " The major concepts in this course include multiculturalism, globalization, and ethnicity. The core content includes:   Module 1: Multiculturalism in the Past   Chapter 1&2: Multicultural China in History   The first two chapters review various episodes of multiculturalism in Chinese history and shows that ethnic boundaries in China are always fluid, not a fixed entity.   Module 2: Multiculturalism at Present   Chapter 3&4: Ethnic Relations (SDG10, 16)   These two chapters discuss the current ethnic relations in urban China – it is not a simple dichotomy between Chinese and non-Chinese but interrelated with gender, race, ethnicity, class, and language.   Chapter 5&6: Global Economy (SDG8, 10)   These two chapters discuss the economic role of China in the global economy, particularly, its role in the high-end and low-end globalization, and how this role has transformed the urban space in China.   Chapter 7&8: Religion Pluralism (SDG16)   These two chapters discuss the role of the state in the regulation of religion (i.e. promoting religion pluralism in a hierarchal structure) and how non-Chinese believers comply with or circumvent these regulations.   Chapter 9&10: Cross-cultural Romance and Marriage (SDG5)   These two chapters discuss the opportunities and constraints configured by cross-cultural relationships in romance and marriage in China.   Module 3: Multiculturalism in Future (SDG8, 10, 17)   Chapter 11&12: Comparing Multiculturalism in Hong Kong and China   This topic compares the discourses and practices of multiculturalism in Hong Kong and China and discusses the future development of these two places – will they become more alike or different with regard to multiculturalism?   Various topics in relation to multiculturalism in China, such as food, education, environment, popular culture, migration, and sports, are the selected topics for this course.     ", "required_readings": " 1)       Multicultural China in History Leung, Irene S. 2003. “‘Felt Yurts Neatly Arrayed, Large Tents Huddle Close”: Visualizing the Frontier in the Northern Song Dynasty.” In Nicola di Cosmo and Don J. Wyatt, eds. Political Frontiers, Ethnic Boundaries, and Human Geographies in Chinese History, pp.192-219. New York: Routledge. 2)       Ethnic Relations Mathews, Gordon. 2017. “Legal-Illegal in Guangzhou.” In The World in Guangzhou: Africans and Other Foreigners in South China’s Global Marketplace, pp.115-138. Hong Kong: Hong Kong University Press. Kim, H. 2003. Ethnic enclave economy in urban China: the Korean immigrants in Yanbian. Ethnic and Racial Studies, 26 (5) (2003), pp. 802-828. 3)       Global Economy Mathews, Gordon. 2017. “Low-End Globalization.” In The World in Guangzhou: Africans and Other Foreigners in South China’s Global Marketplace, pp.81-114. Hong Kong: Hong Kong University Press. Zhang, Li. 2008. “Ethnic Congregation in a Globalizing City: The Case of Guangzhou, China.” Cities 25(6):383-95. 4)       Religion Pluralism Haugen, Heidi Østbø. 2013. “African Pentecostal Migrants in China: Marginalization and the Alternative Geography of a Mission Theology.” African studies Review 56(1):81-102. Liang, Yonjia. 2014. “Hierarchical Plurality: State, Religion and Pluralism in Southwest China.” In Chiara Formichi, ed., Religious Pluralism, State and society in Asia, pp.51-70. Abingdon: Routledge. 5)       Cross-cultural Romance and Marriage Clark, Constance. 2001. “Foreign Marriage, ‘Tradition’, and the Politics of Border Crossing.” In Nancy Chen, Constance Clark, Suzanne Gottschang, and Lyn Jeffreys, eds. China Urban, pp.104–122. Durham: Duke University Press. Lan, Shanshan. 2015. “Transnational Business and Family Strategies among Chinese/Nigerian Couples in Guangzhou and Lagos.” Asian Anthropology 14(2):133-149. 6)       Comparing Multiculturalism in Hong Kong and China Chu, Stephen Yiu-wai. 2010. “Brand Hong Kong: Asia’s World City as Method?” Visual Anthropology 24(1-2):46-58. Pieke, Frank N. 2012. “Immigrant China.” Modern China 38(1):40-77.", "recommended_readings": " Mathews, Gordon. 2017. The World in Guangzhou: Africans and Other Foreigners in South China’s Global Marketplace. Hong Kong: Hong Kong University Press.", "terms": {"2024-25 Term 1": {"--LEC (6550)": {"startTimes": ["10:30"], "endTimes": ["12:15"], "days": [4], "locations": ["Humanities Building 213"], "instructors": ["Dr. TANG Wai Man"], "meetingDates": ["5/9", "12/9", "19/9", "26/9", "3/10", "10/10", "17/10", "24/10", "31/10", "7/11", "14/11", "21/11", "28/11"]}}}, "assessments": {"Essays": "30", "Essay test or exam": "40", "Report": "30"}}, {"code": "1450", "title": "Chinese Culture and Its Religion", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "Lecture\nInteractive Tutorial", "campus": "Main Campus", "academic_group": "Office of University GE", "requirements": "UGEA1450 is double-coded with CURE1122. \nNot for Cultural Studies; Religious Studies; Theology Majors; and students who have taken CURE1122. \nCo-requisite: UGFH1000, UGFN1000 or UGFN1001 (only applicable to students admitted to the 4-year curriculum)", "description": "(UGEA1450 is double-coded with CURE1122.) The aim of this course is to help students understand the basic religious characteristics of Chinese culture and the relationship between religions and the daily life of Chinese people. It also helps students to appreciate the richness and diversity of the Chinese traditions and acquiring essential preparation for more advanced courses in the area of Chinese culture and religions. The course is divided under the familiar categories of Buddhism, Taoism, Confucianism, and Popular religion. These traditions are, by no means, discrete and mutually exclusive. It will be demonstrated that they overlap and interact with each other through a variety of confluences and conflicts. Students will also be introduced to some primary source of the Chinese traditions including both textual and fieldwork data.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "1515", "title": "Reading Chinese Culture and Politics through Movies", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "Discussion\nLecture", "campus": "Main Campus", "academic_group": "Office of University GE", "requirements": "UGEA1515 is double-coded with GPAD1073.\nNot for Government and Public Administration Majors; and students who have taken GPAD1073.\nCo-requisite: Any course with “UGFH” or “UGFN” as prefix", "description": "(UGEA1515 is double-coded with GPAD1073.)  Since its birth in the late-19th/early-20th century, Chinese movies have provided a very rich pool of images and stories, real or fictional, through which political messages could be read, interpreted, constructed, and re-constructed. As politics is a reflection of culture, a systematic analysis of these movies will provide students with a “softer” way to understand the cultural context which shapes Chinese politics. After an introduction of the relationship between culture, movies, and politics, the course will examine how Chinese political culture could be read through Chinese movies produced under different political settings (Republican, Maoist, and post-Maoist China).", "outcome": " Knowledge outcomes  Basic understanding of the relationship between culture, movies, and politics.  Exposure to major Chinese cultural-political issues as reflected in Chinese movies.  Skill outcomes  Ability to apply relevant concepts/theories to comprehend Chinese political and cultural issues.  Ability to think critically.  Ability to think creatively.  Ability to relate the academic pursuits to life experience.  Independent learning capacity and initiative in identifying problems.  Communication and interpersonal skills.  Writing skills to convey political and cultural concepts and analysis.  Value outcomes  Sense of political and cultural awareness.  Sense of civic and cultural engagement.", "syllabus": " Introduction: Chinese culture, movies, and Chinese politics Major approaches in film reading: classical Marxism; Frankfurt School; postmodern approach; postcolonial critique, etc. Basic issues of Chinese politics and cultural politics: the inter-relationship between politics and culture in the Chinese context. Chinese movies under different political settings: changes in the mode of production, themes, and discursive strategies of Chinese movies during Republican, Maoist, and post-Maoist eras. Chinese political culture in first- to post-sixth-generation Chinese movies: examination of characteristics Chinese political culture as reflected in different generations of Chinese movies. Diaspora movies in Hong Kong and Taiwan: cinematic reflections on the relation between Hong Kong and Taiwan with mainland China. Chinese movies and politics under globalization: impact of globalization on the mode of production and discursive practice of Chinese movies.", "required_readings": " Introduction: Chinese culture, movies, and Chinese politics Douglas A. Van Belle, A novel approach to politics: introducing political science through books, movies, and popular culture (Thousand Oaks, Calif.: CQ PRess, 2013). Chris Berry (ed.), Chinese cinema: critical concepts in media and cultural studies (New York: Routledge, 2013). 傅葆石:《雙城故事: 中國早期電影的文化政治》(劉輝譯) (北京: 北京大學出版社, 2008). Major approaches in film reading David Bordwell and Kristin Thompson, Film art: an introduction (New York: McGraw-Hill, 10th edition, 2013). 劉立行:《當代電影理論與批評》(台北: 五南圖書, 2012). Basic issues of Chinese politics and cultural politics Hsiu-Chuang Deppman, Adapted for the screen: the cultural politics of modern Chinese fiction and film (Honolulu: University of Hawaii Press, 2010). Robert E. Gamer (ed.), Understanding contemporary China (Boulder: Lynne Rienner Publishers, 2003), ch. 1, 3, 4, 13. Chinese movies under different political settings: Republican, Maoist, and post-Maoist China Jason C. Kuo (ed.), Contemporary Chinese art and film: theory applied and resisted (Washington, DC: New Academia Publishing, 2013). 张英进:《多元中国 : 电影与文化论集》(南京: 南京大学出版社, 2012). Chinese political culture in first- to post-sixth-generation Chinese movies Song Hwee Lim and Julian Ward (eds.), The Chinese cinema book (London: British Film Institute, 2011). 刘阳:《媒介转型论: 从第五代, 第六代导演看中国当代电影的商业化转型》(北京: 中国传媒大学出版社, 2008). Paternalism and Chinese politics Kwang-Kuo Hwang, Foundations of Chinese Psychology: Confucian Social Relations (New York: Springer, 2012),c h. 5-7. To-chol Sin, Confucianism and Democratization in East Asia (New York: Cambridge University Press, 2012), ch. 1-2. Chinese cultural identity in movies Chris Berry (ed.), ----------  Chinese Cinema: Critical Concepts in Media and Cultural Studies (Abingdon: Routledge, 2013). Philippa Gates and Lisa Funnell (eds.), Transnational Asian Identities in Pan-Pacific Cinemas: the Reel Asian Exchange (New York: Routledge, 2012), ch. 1, 2,7. Gender politics in Chinese movies Lingzhen Wang (ed.), Chinese Women’s Cinema: Transnational Contexts (New York: Columbia University Press, 2011). Nanxiu Qian, Politics, Poetics, and Gender in Late Qing China (Stanford: Stanford University Press, 2015). Diaspora movies in Hong Kong and Taiwan Yau Shuk-ting (ed.), East Asian cinema and cultural heritage: from China, Hong Kong, Taiwan to Japan and South Korea (New York : Palgrave Macmillan, 2011). Chinese movies and political culture under globalization Michael Curtin, Playing to the world's biggest audience: the globalization of Chinese film TV (Berkeley: University of California Press, 2007). 尹鸿编:《跨越百年: 全球化背景下的中国电影》(北京: 清华大学出版社, 2007).", "recommended_readings": "       Selected film titles   Mainland Chinese movies:  《定军山》(1905)  《难夫难妻》(1913)  《劳工之爱情》(1922)  《大路》(1934)  《孤岛天堂》(1939)  《小城之春》(1948)  《南征北战》(1952)  《红色娘子军》(1962)  《创业》(1974)  《如意》(1982)  《城南旧事》(1983)    《一个和八个》(1983)  《黄土地》（1984）  《红高粱》(1989)  《北京杂种》(1993)  《变脸》(1994)  《青红》 (2005)  《三峡好人》(2006)  《建黨偉業》(2011)  《萬箭穿心》(2012)    《青春派》 (2013)  Diaspora movies in Hong Kong and Taiwan:  《民族的吼聲》(1941)  《家在台北》(1969)  《投奔怒海》(1982)  《悲情城市》(1989)  《南海十三朗》(1997)  《賽德克·巴萊》(2011)     ", "terms": {"2024-25 Term 2": {"--LEC (9063)": {"startTimes": ["15:30"], "endTimes": ["18:15"], "days": [1], "locations": ["Humanities Building 115"], "instructors": ["Professor MA Shu Yun"], "meetingDates": ["6/1", "13/1", "20/1", "27/1", "10/2", "17/2", "24/2", "10/3", "17/3", "24/3", "31/3", "7/4", "14/4"]}}}, "assessments": {"Essay test or exam": "50", "Short answer test or exam": "50"}}, {"code": "1545", "title": "China and Asia: Past and Present", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Office of University GE", "requirements": "Not for Global Studies (GLBS and GLSD) Majors.\nCo-requisite: UGFH1000, UGFN1000 or UGFN1001 (only applicable to students admitted to the 4-year curriculum)", "description": "This course aims to introduce the history of interaction between China and its neighbouring states in Asia since the premodern time. This course adopts an interdisciplinary approach – including the perspectives of history, international relations, and Chinese culture – to understand China's subjective and objective position in the region. China had been regarding herself as the leader in East Asia until European Imperialism intervened in the 19th century which challenged the legitimacy of Sino-centric order. With the growing acceptance of China's resurgence, this course provides a systematic analytical framework for students to understand the contribution of such historical and cultural factors to China's foreign policymaking nowadays.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "1881", "title": "Everyday Chinese Medicine", "career": "Undergraduate", "units": "2.00", "grading": "Graded", "components": "Exercise\nLecture\nWeb-enhanced Teaching", "campus": "Main Campus", "academic_group": "Office of University GE", "requirements": "Not for Chinese Medicine Majors; and students who have taken UGEB2831 or UGEC2821. \nCo-requisite: Any course with “UGFH” or “UGFN” as prefix", "description": "With increasing interest and usage of traditional, complementary and integrative medicine (TCIM) worldwide, it is recognized that public education is a key to promote safe and effective use of TCIM in the community. The World Health Organization Traditional Medicine Strategy 2014-23 has specified the strategic direction of: 1. Ensuring consumers of TCIM can make informed choices about self-health care. 2. Promoting proper use of TCIM products and services. This course aims to serve as an education intervention for achieving these two goals. As the most important form of TCIM in China and Hong Kong is traditional Chinese Medicine (TCM), this course aims to introduce the basic theory and practice of TCM to our students. In addition, it will also briefly introduce the cultural and philosophical aspects of TCM . We aim to empower informed healthcare choices by promoting awareness on TCM diagnostic and therapeutic approaches. As a secondary aim, this course serves as an introduction to TCM, such that students from the Faculty of Medicine (e.g. western medicine, nursing, public health and pharmacy) can gain a basic understanding on TCM, preparing them for future interprofessional learning and practice of integrative medicine. ", "outcome": " 1. State the basic theory of Chinese medicine and explain their linkages with traditional Chinese culture and philosophy.   2. Describe the diagnostic approach of Chinese medicine and the process of diagnostic procedure.   3. Describe the therapeutic approach of Chinese medicine and explain how it links to decision making in Chinese herbal medicine prescription.   4. Describe the core principles of acupuncture and therapeutic massage, and modern understanding of their mechanism, safety and effectiveness.    5. Describe how Chinese culture and philosophy influence Chinese medicine practice.     (Evaluation on learning outcomes 1-5 will be conducted via [i] graded exercise embedded in Coursera; and [ii] written final examination.)   6. Develop self-care plan using the practice of acupressure and mind body interventions like Tai Chi.    (This learning outcome will be assessed via a graded group written assignmen t. In this assignment, students will be expected to write out and demonstrate the application of TCM knowledge they have gained through the course.)", "syllabus": " Week 1-6: Online learning via Everyday Chinese Medicine 1 and 2 [13 hrs]  1. Chinese Medicine: Introduction to Basic Theory  2. Zang-Fu Organs Concepts in Chinese Medicine  3. Relationship between Zang-Fu Organs; An introduction of Qi in Chinese medicine  4. Blood, Body Fluids and Pathogenesis of disease in Chinese Medicine  5. Basics of Chinese Medicine Diagnostics (I)   6. Basics of Chinese Medicine Diagnostics (II) 7. Treatment Principles of Traditional Chinese Medicine  8. Introduction of Chinese Materia Medica  9. The Basic Concept of Health Preservation in Chinese Medicine 10. Integrative Medicine, the Way Forward   Week 7-12: Face to Face / online learning (11 hours) Implementation plan for lecture: large lecture halls which can accommodate >320 students will be used. For exercise requiring body movement, Zoom based live broadcast with live interaction will used. Students can perform the exercise in suitable spaces of their choice.   Including the following content 11.  Introduction to Chinese herbal formulation and their therapeutic principles 12.  Introduction to Acupuncture, Bone setting, Tuina: mechanism, safety and effectiveness [i] 13.  Introduction to Acupuncture, Bone setting, Tuina: mechanism, safety and effectiveness [ii] 14.  Self-care using mind – body interventions in Chinese medicine [i] 15.  Self-care using mind – body interventions in Chinese medicine [ii] 16.  Influence of Chinese culture and philosophy on Chinese medicine practice       Week 13: Designing self care plan as a graded group assignment  (2 hours)   ", "required_readings": " Topics 1-10: Main textbook Cai, Y., Deng, J. Y., Hao, Y. N., & Wang, H. Z. (Eds.). (2006). A Brief Introduction to Chinese Medicine for Medical Practitioners.  Beijing : Peoples Medical Pub House.  https://julac.hosted.exlibrisgroup.com/permalink/f/1l4frf6/CUHK_IZ21817656190003407  Topic 1: Cai et al Chapter 1, Section 1  Topic 2: Cai et al Chapter 1, Section 2.1-2.4  Topic 3: Cai et al Chapter 1, Section 2.5-2.6  Topic 4: Cai et al Chapter 1, Section 2.7-2.8 and Section 3  Topic 5: Cai et al Chapter 1, Section 4.1-4.2  Topic 6: Cai et al Chapter 1, Section 4.3-4.4  Topic 7: Cai et al Chapter 1, Section 5-6  Topic 8: Cai et al Chapter 2, Section 1.1-1.2  Topic 9: Liu, Z. (2010). Health Preservation. In Essentials of Chinese Medicine (pp. 351-358). Springer, London.  Topic 10: Griffiths, Sian M., Vincent CH Chung, and Jin Ling Tang. \"Integrating traditional Chinese medicine: experiences from China.\" Australasian Medical Journal (Online) 3.7 (2010): 385.   Topic 11: Liu, Z. (2010). Basic Principles of CM Herbal Formulation. In Essentials of Chinese Medicine. London: Springer London. Volume 2. Chapter 6 https://link-springer-com.easyaccess2.lib.cuhk.edu.hk/book/10.1007/978-1-84882-112-5 Yifan Yang, & Jeremy Ross. (2010). Theories and concepts in the composition of Chinese herbal formulas. In Chinese Herbal Formulas. Elsevier. Part I, P.1-34 https://www-sciencedirect-com.easyaccess2.lib.cuhk.edu.hk/book/9780702031328/chinese-herbal-formulas   Topics 12-13: Stux, G., Berman, B., & Pomeranz, B. (2003). Basics of acupuncture. Springer Science & Business Media. Page 112-251 only https://julac.hosted.exlibrisgroup.com/permalink/f/3fo5ao/CUHK_IZ511093024280003407 Jiang, Yang, Robidoux, Yang, Guanhu, and Robidoux, Suzanne(2008). Clinical Research & Application of Acupuncture & Tuina. Beijing, China: People's Medical Publishing House. Chapter1,2 and 4 https://oce.ovid.com/book?SerialCode=01438128 Guo Chang-qing, Hu Bo, Liu Nai-gang [and others]; translated by the board of translators; edited by Suzanne Robidoux(2008). Anatomical illustration of acupuncture points. Beijing, China: People’s Medical Publishing House. Chapter 1 https://oce.ovid.com/book?SerialCode=01438156   Topics 14-15: Ya-Li, F. (1997). Chinese Self-Massage Therapy. Blue Poppy Enterprises, Inc.. Chapter 1-2 https://julac.hosted.exlibrisgroup.com/permalink/f/1l4frf6/CUHK_IZ51867135700003407 Kamieniarz, Anna ; Milert, Agata ; Grzybowska-Ganszczyk, Dominika ; Opara, Józef ; Juras, Grzegorz. Tai Chi and Qi Gong therapies as a complementary treatment in Parkinson’s disease – a systematic review. Scotland: Elsevier Ltd. Complementary therapies in medicine, 2021-01, Vol.56, p.102589-102589 https://www.sciencedirect.com/science/article/pii/S0965229920318562?via%3Dihub   Topic 16: Kuriyama, Shigehisa, et al. The Expressiveness of the Body and the Divergence of Greek and Chinese Medicine, 1999. p.61-p.110 https://julac.hosted.exlibrisgroup.com/permalink/f/1l4frf6/CUHK_IZ511045596240003407 Kurt Greiner, Fritz Wallner: Innovative Ontology and Methodology:As Introduction Into Constructive Realism , in Five Lectures on the Foundations of Chinese Medicine: Copyedited by Florian Schmidsberger (Culture and Knowledge),p.17-24. Available at the medical library", "recommended_readings": " N/A", "terms": {"2024-25 Term 2": {"--LEC (8493)": {"startTimes": ["15:30"], "endTimes": ["17:15"], "days": [5], "locations": ["Lee Shau Kee Building LT5"], "instructors": ["Dr. LIN Wai Ling, \n\nDr. YIM Wan Sze, \n\nMiss HUNG Hing Yu"], "meetingDates": ["10/1", "17/1", "24/1", "7/2", "14/2", "21/2", "28/2", "14/3", "21/3", "28/3", "11/4"]}}}, "assessments": {"Classwork": "25", "Examination": "50", "Homework or assignment": "25"}}, {"code": "2100", "title": "Outline of Chinese Culture", "career": "Undergraduate", "units": "2.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Office of University GE", "requirements": "Not for Philosophy Majors; and students who have taken IASP2550 or UGEA2110.\nCo-requisite: UGFH1000, UGFN1000 or UGFN1001 (only applicable to students admitted to the 4-year curriculum)", "description": "This course aims to provide a general understanding of traditional Chinese culture. It covers the following core topics: characteristics of Chinese culture; Chinese thought; and Chinese political, social, and economic life. Other topics may also be covered, such as Chinese religion, science and technology in traditional China, the Chinese intelligentsia, and so on.", "outcome": "    Identify the main characteristics of traditional Chinese culture.    Appraise Chinese culture.    Reflect on the future of Chinese culture in contemporary world. ", "syllabus": "(The fundamental concepts and academic content which need to be understood in each course. The core content/syllabus should be covered by all sections of the same course and selected topics may be added by individual course teacher.  Core content should comprise not less than 50% of the course)      (1-4) 核心內容。任教老師必須講授的專題 (5-8) 選項。任教老師可自行選擇講授的專題，以下所列僅供參考。   1.      導論：何謂「中國文化」？ 2.      傳統中國哲學思想 3.      傳統中國政治 4.      傳統中國的社會、經濟生活   5.      傳統中國的科學技術 6.      中國的宗教 7.      傳統中國的藝術、文學 8.      中國文化與現代化     ", "required_readings": "1.    唐君毅：《中國文化之精神價值》 (臺北：正中書局，1959)。 2.    梁漱溟：《中國文化要義》 (香港：三聯書店，1987)。 3.    勞思光：《中國文化要義（新編）》 (香港：中文大學出版社，1998)。", "recommended_readings": "1.    Benjamin I. Schwartz, The World of Thought in Ancient China, Cambridge: Belknap Press of Harvard University Press, 1985. 2.    Chow Tse-tsung, The May Fourth Movement: Intellectual Revolution in Modern China, Stanford: Stanford University Press, 1967. 3.    Tu Wei-ming, Confucian Thought: Selfhood as Creative Transformation, Albany : State University of New York Press, 1985. 4.    梁漱溟：《中國文化要義》(香港：三聯書店，1987)。 5.    唐君毅：《中國文化之精神價值》 (臺北：正中書局，1959)。 6.    牟宗三：《中國文化的省察》 (臺北：聯經出版事業公司，1983)。 7.    勞思光：《中國文化要義（新編）》 (香港：中文大學出版社，1998)。 8.    韋政通：《中國文化概論》(臺北：水牛出版社，1972)。 9.    殷海光：《中國文化的展望》(上、下冊)  (臺北：桂冠圖書，1990)。 10.葉朗、費振剛、王天有主編：《中國文化導讀》 (香港：香港城市大學出版社，2001)。 11.杜正勝主編：《中國文化史》(修訂版) (臺北市：三民書局，1996)。 12.唐君毅：《中國人文精神之發展》 (臺北：臺灣學生書店，1974)。 13.唐君毅：《中國人文與當今世界》（上、下冊） (臺北：臺灣學生書局，1988)。 14.全漢昇：《中國經濟史研究》 (香港：新亞硏究所，1976)。 15.牟宗三：《中國哲學的特質》 (臺北：臺灣學生書局，1975)。 16.余英時：《中國思想傳統的現代詮釋》 (臺北：聯經出版事業公司，1987)。 17.余英時：《從價值系統看中國文化的現代意義》 (臺北：時報文化出版事業有限公司，1984)。 18.李亦園、楊國樞編著：《中國人的性格》 (臺北：桂冠圖書有限公司，1989)。 19.李亦園等著：《知識份子12講》 (臺北：立緖文化事業有限公司，1999)。 20.李約瑟：《中國之科學與文明》（陳立夫主譯） (臺北：臺灣商務印書館，1974)。 21.李約瑟：《中國科技史》 (上海 : 上海古籍出版社，1990- )。 22.杜祖貽、劉述先合編：《哲學、文化與教育》 (香港：中文大學出版社，1988)。 23.周陽山編：《中國文化的危機與展望—文化傳統的重建》 (臺北：時報文化出版，1982)。 24.金耀基：《中國政治與文化》 (香港：牛津大學出版社，1997)。 25.金觀濤、劉青峰合著：《興盛與危機（修訂版）》 (香港：中文大學出版社，1992)。 26.孫隆基：《中國文化的深層結構》 (臺北：唐山出版社，1990)。 27.徐復觀等著：《知識分子與中國》(香港：九十年代雜誌社，1990)。 28.秦家懿、孔漢思合著：《中國宗教與基督教》 (北京：三聯書店，1990)。 29.袁行霈主編：《五千年中華文化大視野》(1至8冊)  (香港：明窗出版社，2002)。 30.王玉波：《中國家長制家庭制度史》 (天津：天津社會科學院出版社，1989)。 31.張光直：《美術、神話與祭祀》 (沈陽市：遼寧教育出版社，1988)。 32.許倬雲：《中國文化的發展過程》 (香港：中文大學出版社，1992)。 33.許倬雲：《中國古代文化的特質》 (臺北：聯經出版，1988)。 34.勞思光：《中國文化路向問題的新檢討》(臺北：東大圖書公司，1993)。 35.勞思光：《歷史之懲罰（新編）》 (香港：中文大學出版社，2000)。 36.費孝通：《鄉土中國》(臺北：風雲時代出版公司，1993)。 37.費孝通等著：《中華民族的多元一體格局》 (北京市：中央民族大學出版社，1999)。 38.劉澤華、汪茂和、王蘭仲合著：《專制權力與中國社會》 (香港：中華書局，1988)。 39.錢穆：《中國文化史導論（修訂本）》 (臺北：素書樓文敎基金會，2001)。 40.錢穆：《中國文化叢談》 (臺北：素書樓文敎基金會，2001)。 41.錢穆：《中國歷代政治得失》 (臺北：素書樓文敎基金會，2001)。 42.錢穆：《從中國歷史來看中國民族性及中國文化》 (臺北：素書樓文敎基金會，2001)。 43.瞿同祖：《中國法律與中國社會》 (上海：上海書店，1989)。  44. 《中國文化之旅》〔光碟〕 (上、下輯) (香港：香港中文大學中國文化研究所，2001)。 ", "terms": {"2024-25 Term 1": {"A-LEC (5670)": {"startTimes": ["10:30"], "endTimes": ["12:15"], "days": [1], "locations": ["Leung Kau Kui Bldg 101"], "instructors": ["Dr. CHONG Yun Chak"], "meetingDates": ["2/9", "9/9", "16/9", "23/9", "30/9", "7/10", "14/10", "21/10", "28/10", "4/11", "11/11", "18/11", "25/11"]}, "B-LEC (5671)": {"startTimes": ["9:30"], "endTimes": ["11:15"], "days": [4], "locations": ["Leung Kau Kui Bldg 101"], "instructors": ["Dr. CHAN Leong"], "meetingDates": ["5/9", "12/9", "19/9", "26/9", "3/10", "10/10", "17/10", "24/10", "31/10", "7/11", "14/11", "21/11", "28/11"]}, "C-LEC (5672)": {"startTimes": ["14:30"], "endTimes": ["16:15"], "days": [1], "locations": ["Humanities Building 115"], "instructors": ["Dr. LO Kit Hung"], "meetingDates": ["2/9", "9/9", "16/9", "23/9", "30/9", "7/10", "14/10", "21/10", "28/10", "4/11", "11/11", "18/11", "25/11"]}, "D-LEC (5673)": {"startTimes": ["10:30"], "endTimes": ["12:15"], "days": [3], "locations": ["Leung Kau Kui Bldg 101"], "instructors": ["Dr TSE Sai Kit"], "meetingDates": ["4/9", "11/9", "25/9", "2/10", "9/10", "16/10", "23/10", "30/10", "6/11", "13/11", "20/11", "27/11"]}, "E-LEC (5674)": {"startTimes": ["12:30"], "endTimes": ["14:15"], "days": [1], "locations": ["Lady Shaw Bldg LT3"], "instructors": ["Dr. HON Hiu Wah"], "meetingDates": ["2/9", "9/9", "16/9", "23/9", "30/9", "7/10", "14/10", "21/10", "28/10", "4/11", "11/11", "18/11", "25/11"]}, "F-LEC (9096)": {"startTimes": ["10:30"], "endTimes": ["12:15"], "days": [2], "locations": ["Lee Shau Kee Archi Bldg G03"], "instructors": ["Dr. LAU Po Hei"], "meetingDates": ["3/9", "10/9", "17/9", "24/9", "8/10", "15/10", "22/10", "29/10", "5/11", "12/11", "19/11", "26/11"]}, "G-LEC (8949)": {"startTimes": ["9:30"], "endTimes": ["11:15"], "days": [5], "locations": ["William M W Mong Eng Bldg 803"], "instructors": ["Dr WANG Xiaohong"], "meetingDates": ["6/9", "13/9", "20/9", "27/9", "4/10", "18/10", "25/10", "1/11", "8/11", "15/11", "22/11", "29/11"]}, "H-LEC (6018)": {"startTimes": ["16:30"], "endTimes": ["18:15"], "days": [1], "locations": ["Leung Kau Kui Bldg 101"], "instructors": ["Dr. HON Hiu Wah"], "meetingDates": ["2/9", "9/9", "16/9", "23/9", "30/9", "7/10", "14/10", "21/10", "28/10", "4/11", "11/11", "18/11", "25/11"]}, "I-LEC (5684)": {"startTimes": ["12:30"], "endTimes": ["14:15"], "days": [3], "locations": ["William M W Mong Eng Bldg 803"], "instructors": ["Dr. WONG Yiu Hong"], "meetingDates": ["4/9", "11/9", "25/9", "2/10", "9/10", "16/10", "23/10", "30/10", "6/11", "13/11", "20/11", "27/11"]}}, "2024-25 Term 2": {"A-LEC (8886)": {"startTimes": ["12:30"], "endTimes": ["14:15"], "days": [4], "locations": ["Leung Kau Kui Bldg 101"], "instructors": ["Dr. LO Kit Hung"], "meetingDates": ["9/1", "16/1", "23/1", "6/2", "13/2", "20/2", "27/2", "13/3", "20/3", "27/3", "3/4", "10/4", "17/4"]}, "B-LEC (8200)": {"startTimes": ["14:30"], "endTimes": ["16:15"], "days": [4], "locations": ["William M W Mong Eng Bldg 803"], "instructors": ["Dr. CHONG Yun Chak"], "meetingDates": ["9/1", "16/1", "23/1", "6/2", "13/2", "20/2", "27/2", "13/3", "20/3", "27/3", "3/4", "10/4", "17/4"]}, "C-LEC (5586)": {"startTimes": ["10:30"], "endTimes": ["12:15"], "days": [1], "locations": ["William M W Mong Eng Bldg 803"], "instructors": ["Dr TSE Sai Kit"], "meetingDates": ["6/1", "13/1", "20/1", "27/1", "10/2", "17/2", "24/2", "10/3", "17/3", "24/3", "31/3", "7/4", "14/4"]}, "D-LEC (5584)": {"startTimes": ["16:30"], "endTimes": ["18:15"], "days": [2], "locations": ["William M W Mong Eng Bldg 803"], "instructors": ["Dr. CHAN Leong"], "meetingDates": ["7/1", "14/1", "21/1", "4/2", "11/2", "18/2", "25/2", "11/3", "18/3", "25/3", "1/4", "8/4", "15/4"]}, "E-LEC (6728)": {"startTimes": ["10:30"], "endTimes": ["12:15"], "days": [3], "locations": ["William M W Mong Eng Bldg 803"], "instructors": ["Dr. LAU Po Hei"], "meetingDates": ["8/1", "15/1", "22/1", "5/2", "12/2", "19/2", "26/2", "12/3", "19/3", "26/3", "2/4", "9/4", "16/4"]}, "F-LEC (5585)": {"startTimes": ["14:30"], "endTimes": ["16:15"], "days": [2], "locations": ["Leung Kau Kui Bldg 101"], "instructors": ["Dr. WONG Yiu Hong"], "meetingDates": ["7/1", "14/1", "21/1", "4/2", "11/2", "18/2", "25/2", "11/3", "18/3", "25/3", "1/4", "8/4", "15/4"]}, "G-LEC (6709)": {"startTimes": ["12:30"], "endTimes": ["14:15"], "days": [3], "locations": ["William M W Mong Eng Bldg 803"], "instructors": ["Dr. HON Hiu Wah"], "meetingDates": ["8/1", "15/1", "22/1", "5/2", "12/2", "19/2", "26/2", "12/3", "19/3", "26/3", "2/4", "9/4", "16/4"]}, "I-LEC (4906)": {"startTimes": ["9:30"], "endTimes": ["11:15"], "days": [5], "locations": ["William M W Mong Eng Bldg 803"], "instructors": ["Dr WANG Xiaohong"], "meetingDates": ["10/1", "17/1", "24/1", "7/2", "14/2", "21/2", "28/2", "14/3", "21/3", "28/3", "11/4"]}}}, "assessments": {"Essays": "0", "Essay test or exam": "0"}}, {"code": "2110", "title": "An Introduction to Chinese Culture", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "Lecture\nInteractive Tutorial", "campus": "Main Campus", "academic_group": "Office of University GE", "requirements": "Not for Philosophy Majors; and students who have taken IASP2550 or UGEA2100.\nCo-requisite: UGFH1000, UGFN1000 or UGFN1001 (only applicable to students admitted to the 4-year curriculum)", "description": "This course aims to provide a general understanding of traditional Chinese culture. It covers the following core topics: characteristics of Chinese culture; Chinese thought; and Chinese political, social, and economic life. Other topics may also be covered, such as Chinese religion, science and technology in traditional China, the Chinese intelligentsia, and so on.* This course has tutorial teaching, but topics are the same as in UGEA2100.", "outcome": "    Identify the main characteristics of traditional Chinese culture.    Appraise Chinese culture.    Reflect on the future of Chinese culture in contemporary world    Engage in critical discussion concerning the future of Chinese culture.     ", "syllabus": "(1-4) 核心內容。任教老師必須講授的專題 (5-8) 選項。任教老師可自行選擇講授的專題，以下所列僅供參考。   1.      導論：何謂「中國文化」? 2.      傳統中國哲學思想 3.      傳統中國政治 4.      傳統中國的社會、經濟生活   5.      傳統中國的科學技術 6.      中國的宗教 7.      傳統中國的藝術、文學 8.      中國文化與現代化  ", "required_readings": "1.    唐君毅：《中國文化之精神價值》 (臺北：正中書局，1959)。 2.    梁漱溟：《中國文化要義》 (香港：三聯書店，1987)。 3.    勞思光：《中國文化要義（新編）》 (香港：中文大學出版社，1998)。 4.    余英時：《從價值系統看中國文化的現代意義》 (臺北：時報文化出版事業有限公司，1984)。 5.    許倬雲：《中國文化的發展過程》 (香港：中文大學出版社，1992)。   For English-teaching section:   1. Fung, Yu-Lan, edited by Derk Bodde, a Short History of Chinese Philosophy (New York: First Free Press, 1966)", "recommended_readings": "1.    Benjamin I. Schwartz, The World of Thought in Ancient China, Cambridge: Belknap Press of Harvard University Press, 1985. 2.    Chow Tse-tsung, The May Fourth Movement: Intellectual Revolution in Modern China, Stanford: Stanford University Press, 1967. 3.    Fung, Yu-Lan, edited by Derk Bodde, a Short History of Chinese Philosophy (New York: First Free Press, 1966) 4.    Tu Wei-ming, Confucian Thought: Selfhood as Creative Transformation, Albany : State University of New York Press, 1985. 5.    梁漱溟：《中國文化要義》(香港：三聯書店，1987)。 6.    唐君毅：《中國文化之精神價值》 (臺北：正中書局，1959)。 7.    牟宗三：《中國文化的省察》 (臺北：聯經出版事業公司，1983)。 8.    勞思光：《中國文化要義（新編）》 (香港：中文大學出版社，1998)。 9.    韋政通：《中國文化概論》(臺北：水牛出版社，1972)。 10.殷海光：《中國文化的展望》(上、下冊)  (臺北：桂冠圖書，1990)。 11.葉朗、費振剛、王天有主編：《中國文化導讀》 (香港：香港城市大學出版社，2001)。 12.杜正勝主編：《中國文化史》(修訂版) (臺北市：三民書局，1996)。 13.唐君毅：《中國人文精神之發展》 (臺北：臺灣學生書店，1974)。 14.唐君毅：《中國人文與當今世界》（上、下冊） (臺北：臺灣學生書局，1988)。 15.全漢昇：《中國經濟史研究》 (香港：新亞硏究所，1976)。 16.牟宗三：《中國哲學的特質》 (臺北：臺灣學生書局，1975)。 17.余英時：《中國思想傳統的現代詮釋》 (臺北：聯經出版事業公司，1987)。 18.余英時：《從價值系統看中國文化的現代意義》 (臺北：時報文化出版事業有限公司，1984)。 19.李亦園、楊國樞編著：《中國人的性格》 (臺北：桂冠圖書有限公司，1989)。 20.李亦園等著：《知識份子12講》 (臺北：立緖文化事業有限公司，1999)。 21.李約瑟：《中國之科學與文明》（陳立夫主譯） (臺北：臺灣商務印書館，1974)。 22.李約瑟：《中國科技史》 (上海 : 上海古籍出版社，1990- )。 23.杜祖貽、劉述先合編：《哲學、文化與教育》 (香港：中文大學出版社，1988)。 24.周陽山編：《中國文化的危機與展望—文化傳統的重建》 (臺北：時報文化出版，1982)。 25.金耀基：《中國政治與文化》 (香港：牛津大學出版社，1997)。 26.金觀濤、劉青峰合著：《興盛與危機（修訂版）》 (香港：中文大學出版社，1992)。 27.孫隆基：《中國文化的深層結構》 (臺北：唐山出版社，1990)。 28.徐復觀等著：《知識分子與中國》(香港：九十年代雜誌社，1990)。 29.秦家懿、孔漢思合著：《中國宗教與基督教》 (北京：三聯書店，1990)。 30.袁行霈主編：《五千年中華文化大視野》(1至8冊)  (香港：明窗出版社，2002)。 31.王玉波：《中國家長制家庭制度史》 (天津：天津社會科學院出版社，1989)。 32.張光直：《美術、神話與祭祀》 (沈陽市：遼寧教育出版社，1988)。 33.許倬雲：《中國文化的發展過程》 (香港：中文大學出版社，1992)。 34.許倬雲：《中國古代文化的特質》 (臺北：聯經出版，1988)。 35.勞思光：《中國文化路向問題的新檢討》(臺北：東大圖書公司，1993)。 36.勞思光：《歷史之懲罰（新編）》 (香港：中文大學出版社，2000)。 37.費孝通：《鄉土中國》(臺北：風雲時代出版公司，1993)。 38.費孝通等著：《中華民族的多元一體格局》 (北京市：中央民族大學出版社，1999)。 39.劉澤華、汪茂和、王蘭仲合著：《專制權力與中國社會》 (香港：中華書局，1988)。 40.錢穆：《中國文化史導論（修訂本）》 (臺北：素書樓文敎基金會，2001)。 41.錢穆：《中國文化叢談》 (臺北：素書樓文敎基金會，2001)。 42.錢穆：《中國歷代政治得失》 (臺北：素書樓文敎基金會，2001)。 43.錢穆：《從中國歷史來看中國民族性及中國文化》 (臺北：素書樓文敎基金會，2001)。 44.瞿同祖：《中國法律與中國社會》 (上海：上海書店，1989)。 45.《中國文化之旅》〔光碟〕 (上、下輯) (香港：香港中文大學中國文化研究所，2001)。", "terms": {"2024-25 Term 1": {"A-LEC (8984)": {"startTimes": ["15:30"], "endTimes": ["18:15"], "days": [4], "locations": ["William M W Mong Eng Bldg 803"], "instructors": ["Professor ZHENG Zemian"], "meetingDates": ["5/9", "12/9", "19/9", "26/9", "3/10", "10/10", "17/10", "24/10", "31/10", "7/11", "14/11", "21/11", "28/11"]}, "B-LEC (9035)": {"startTimes": ["14:30"], "endTimes": ["17:15"], "days": [2], "locations": ["Fung King Hey Bldg Swire Hall2"], "instructors": ["Dr. LAU Po Hei"], "meetingDates": ["3/9", "10/9", "17/9", "24/9", "8/10", "15/10", "22/10", "29/10", "5/11", "12/11", "19/11", "26/11"]}}, "2024-25 Term 2": {"A-LEC (6793)": {"startTimes": ["15:30"], "endTimes": ["18:15"], "days": [3], "locations": ["Cheng Yu Tung Building LT1B"], "instructors": ["Dr. LAU Po Hei"], "meetingDates": ["8/1", "15/1", "22/1", "5/2", "12/2", "19/2", "26/2", "12/3", "19/3", "26/3", "2/4", "9/4", "16/4"]}, "B-LEC (8797)": {"startTimes": ["12:30"], "endTimes": ["15:15"], "days": [2], "locations": ["William M W Mong Eng Bldg 803"], "instructors": ["Mr. IP Tat Leung"], "meetingDates": ["7/1", "14/1", "21/1", "4/2", "11/2", "18/2", "25/2", "11/3", "18/3", "25/3", "1/4", "8/4", "15/4"]}, "C-LEC (4950)": {"startTimes": ["15:30"], "endTimes": ["18:15"], "days": [5], "locations": ["William M W Mong Eng Bldg 803"], "instructors": ["Dr. HON Hiu Wah"], "meetingDates": ["10/1", "17/1", "24/1", "7/2", "14/2", "21/2", "28/2", "14/3", "21/3", "28/3", "11/4"]}}}, "assessments": {"Essays": "0", "Essay test or exam": "0", "Presentation": "0"}}, {"code": "2140", "title": "Chinese Culture and Its Modernization", "career": "Undergraduate", "units": "2.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Office of University GE", "requirements": "Not for Philosophy Majors; and students who have taken ANTH2420 or UGEA2332.\nCo-requisite: UGFH1000, UGFN1000 or UGFN1001 (only applicable to students admitted to the 4-year curriculum)", "description": "This course examines the special characteristics of Chinese culture in relation to the obstacles and the problems it has been facing in the process of modernization, and attempts to search for a direction for its future development.", "outcome": "    Identify the main characteristics of traditional Chinese culture.    Identify the basic issues underlying modernization.    Formulate the difficulties encountered by Chinese culture in the process of its modernization.    Discuss and relate Chinese culture’s contribution to reflections on contemporary cultural and ethical issues.    Discuss the future development of Chinese culture. ", "syllabus": "(1-6) 核心內容。任教老師必須講授的專題 (7-11) 選項。任教老師可自行選擇講授的專題，以下所列僅供參考。   1.      導論：「文化」、「現代化」釋義 2.      中國傳統文化的特質 3.      「現代性」的考查 4.      中國傳統政治制度與現代性 5.      中國傳統社會經濟生活與巿民社會、資本主義 6.      中國傳統科技與現代科學   7.      中國現代化歷程之考查 8.      中國哲學思想與現代性 9.      中國傳統宗教與現代性 10.  中國藝術之特質與「現代」、「後現代」 11.  中國文化與現代生活", "required_readings": "1.    勞思光：《中國文化要義（新編）》 (香港：中文大學出版社，1998)。 2.    勞思光：《中國文化路向問題的新檢討》 (臺北：東大圖書公司，1993)。 3.    唐君毅：《中國文化之精神價值》 (臺北：正中書局，1959)。  ", "recommended_readings": "1.    Hans Küng & Karl-Josef Kuschel eds., A Global Ethic, The Declaration of the Parliament of the World’s Religion, London: SCM Press, 1993. 2.    Li Chengyang ed., The Sage and the Second Sex, Chicago: Open Court, 2000. 3.    Mary Evelyn Tucker & John Berthrong eds., Confucianism and Ecology: The Interrelation of Heaven, Earth and Humans, Cambridge: Harvard University Press, 1998. 4.    Tu Wei-ming, Confucian Thought, Selfhood as Creative Transformation, Albany: State University of New York Press, 1985. 5.    Wm. Theodore de Bary & Tu Wei-ming eds., Confucianism and Human Rights, New York : Columbia University Press, 1998. 6.    Wm. Theodore de Bary, Asian Values and Human Rights, A Confucian Communitarian Perspective, Cambridge: Harvard University Press, 1998. 7.    代欽：《儒家思想與中國傳統數學》 (北京：商務印書館，2003)。 8.    史景遷 (J. D. Spence) 著，溫洽溢譯：《追尋現代中國》三卷 (臺北：時報文化出版事業，2001) 。 9.    石元康：《從中國文化到現代化：典範轉移？》 (北京：三聯書店，2000)。 10.牟宗三：《中國文化的省察》 (臺北：聯經出版，1983)。 11.余英時：《中國文化與現代變遷》 (臺北：三民書局，1992)。 12.余英時：《從價值系統看中國文化的現代意義：中國文化與現代生活總論》 (臺北：時報文化出版事業，1984)。 13.吳甿：《實證與唯心》（上、下冊） (香港：經要出版，2001)。 14.李約瑟（Joseph Needham）著，李彥譯：《中國古代科學》 (香港：中文大學出版社，1999)。 15.李約瑟（Joseph Needham）著，陳立夫譯：《中國之科學與文明》（第二冊）臺北：臺灣商務印書館，1974)。 16.杜維明：《十年機緣待儒學：東亞價值再評價》 (香港：牛津大學出版社，1999)。 17.林毓生：《思想與人物》 (臺北：聯經出版，1983)。 18.金耀基：《中國社會與文化》 (香港：牛津大學出版社，1992)。 19.金耀基：《中國政治與文化》 (香港：牛津大學出版社，1997)。 20.金耀基：《中國現代化與知識分子》 (臺北：時報出版，1988)。 21.金耀基：《從傳統到現代》 (臺北：時報文化出版，1979)。 22.金觀濤、劉青峰：《興盛與危機》 (香港 : 中文大學出版社，1992)。 23.哈佛燕京學社主編：《儒家與自由主義》 (北京：三聯書店，2001)。 24.唐君毅：《中國人文與當今世界》，二冊 (臺北：臺灣學生書局，1988)。 25.殷海光：《中國文化的展望》 (臺北：桂冠圖書，1990)。 26.張德勝：《儒家倫理與秩序情結：中國思想的社會學註釋》 (臺北：巨流圖書公司，1989)。 27.梁漱溟：《中國文化要義》 (香港：三聯書店，1987)。 28.許倬雲：《中國文化的發展過程》 (香港：中文大學出版社，1992。 29.傅偉勳：《批判的繼承與創造的發展：「哲學與宗教」二集》 (臺北：東大圖書公司，1989)。 30.勞思光：《中國之路向（新編）》 (香港：中文大學出版社，2000)。 31.勞思光：《中國文化要義（新編）》 (香港：中文大學出版社，1998)。  32.勞思光：《中國文化路向問題的新檢討》 (臺北：東大圖書公司，1993)。 33.勞思光：《歷史之懲罰（新編）》 (香港：中文大學出版社，2000)。勞思光：《中國之路向(新編)》。 34.黃仁宇：《中國大歷史》 (臺北：聯經出版，1993)。 35.楊君實、杜念中編：《儒家倫理與經濟發展》 (臺北：允晨文化，1987)。 36.戴大為編，郭文正譯：《從法律、哲學和政治觀點看人權與中國價值觀》 (香港：牛津大學出版社，1997)。 37.劉再復：《傳統與中國人》 (香港：三聯書店，1988)。 38.劉述先：《大陸與海外：傳統的反省與轉化》 (臺北：允晨文化，1989)。 39.劉述先：《中國哲學與現代化》 (臺北：時報文化出版事業，1980)。 40.劉述先：《全球倫理與宗教對話》 (臺北：立緖文化事業，2001)。 41.劉笑敢：《兩極化與分寸感：近代中國精英思潮的病態心理分析》 (臺北：東大圖書公司，1994)。 42.劉澤華、汪茂和、王蘭仲：《專制權力與中國社會》 (香港：中華書局，1988)。 43. 賴品超、李景雄編：《儒耶對話新里程》 (香港：香港中文大學崇基學院宗敎 與中國社會硏究中心，2001)。   ", "terms": {"2024-25 Term 1": {"--LEC (9175)": {"startTimes": ["14:30"], "endTimes": ["16:15"], "days": [1], "locations": ["Leung Kau Kui Bldg 101"], "instructors": ["Dr. CHONG Yun Chak"], "meetingDates": ["2/9", "9/9", "16/9", "23/9", "30/9", "7/10", "14/10", "21/10", "28/10", "4/11", "11/11", "18/11", "25/11"]}}, "2024-25 Term 2": {"--LEC (5911)": {"startTimes": ["10:30"], "endTimes": ["12:15"], "days": [4], "locations": ["William M W Mong Eng Bldg 803"], "instructors": ["Dr. CHONG Yun Chak"], "meetingDates": ["9/1", "16/1", "23/1", "6/2", "13/2", "20/2", "27/2", "13/3", "20/3", "27/3", "3/4", "10/4", "17/4"]}}}, "assessments": {"Essays": "0", "Essay test or exam": "0", "Short answer test or exam": "0", "Selected response test or exam": "0"}}, {"code": "2145", "title": "Chinese Music and Culture", "career": "Undergraduate", "units": "2.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Office of University GE", "requirements": "Not for Music Majors; and students who have taken GENA2342 or MUSC2562.\nCo-requisite: UGFH1000 or UGFN1000 (only applicable to students admitted to the 4-year curriculum)", "description": "As an important component of Chinese culture, Chinese music not only functions as entertainment, it also reflects the political situation and the social vicissitudes of China. In order to include multiple perspectives on viewing Chinese cultural heritage, the course is designed to provide a broad exposure to Chinese music through a wide spectrum of topics, such as basic concepts, notation, important genres and repertoire. No previous musical training is required, however, students’ understanding of Chinese musical culture will be reinforced and broadened by the end of the course. In addition, students will also understand how music serves political and social functions in ancient and contemporary China.", "outcome": " Student should be able to: 1 Distinguish different genres of Chinese music, and identify their essential features; 2 Recognize the role of music in Chinese culture, and its relations to other aspects of Chinese culture; 3 Outline the circumstantial factors that have affected the development of Chinese music;       4 Conduct an informed discussion of a wide range of issues concerning Chinese music.  ", "syllabus": " I.    Introduction     1. Basic concepts and terminology.  II. The evolution of Chinese music in two aspects     2. Chinese musical instruments        a. Traditional Chinese musical instruments.        b. Sinicization of foreign musical instruments from Central Asia in different period (Han, Tang, and Song dynasties) and the historical and cultural background behind it.        c. Modernization of Chinese musical instruments under Western influence after 1949 and its political background.      3. Musical notation         a. Traditional notation (lülüpu (律吕譜), jianzipu (減字譜), gongchepu (工尺譜)) and the underlying aesthetic.         b. Westernized cipher notation and staff notation.  III. Four major categories of Chinese music     4. Instrumental music         a. Traditional solo repertoire: Guqin (古琴) and its relation to the Chinese literati culture.         b. Ensemble: Jiangnan sizhu (江南絲竹), Guangdong yinyue (廣東音樂) and folk entertainment.     5. Song         The role of Shijing (詩經) , Ci songs (詞樂), and the ‘School Song Movement’ (學堂樂歌) in modern China.      6. Narrative singing         The decline of narrative singing (Nanyin 南音, banyan 板眼) and the social changes in Hong Kong (from the 1920s to the 1970s).      7. Chinese opera         The development of Jingju (京劇), Yueju (上海越劇) and Yueju (粤劇), and how they are affected by socio-political and economic factors. Optional Cultural and musical exchange         1. The influence of Chinese culture on Japan and Korea.         2. China’s reception of Western culture since the late Qing dynasty.", "required_readings": " Introduction 余少華 2005《樂猶如此》香港：國際演藝評論家協會，3-10。 張世彬 1975《中國音樂史論述稿》香港：友聯出版社，454-57。 Chinese musical instruments 余少華 2005《樂猶如此》香港：國際演藝評論家協會，58-71。 華夏樂韻編輯委員會編 1998 《音樂教室 (二)：華夏樂韻》香港：香港電台第四台、教育署輔導視學    處音樂組、香港教育學院藝術系，5-7。 Musical notation 余少華 2005《樂猶如此》香港：國際演藝評論家協會，80-90。 Instrumental music 余少華 2005《樂猶如此》香港：國際演藝評論家協會，169-81。 黄泉鋒主編 2009 《中國音樂導賞》香港：商務印書館，46-61，72-97。  Song 劉再生 2006 《中國古代音樂史簡述》(修訂版)，北京：人民音樂出版社，393-407。 華夏樂韻編輯委員會編 1998 《音樂教室 (二)：華夏樂韻》香港：香港電台第四台、教育署輔導視學    處音樂組、香港教育學院藝術系，119-38。 Narrative singing 余少華 2005《樂猶如此》香港：國際演藝評論家協會，120-26。 黄泉鋒主編 2009 《中國音樂導賞》香港：商務印書館，142-43。 Chinese opera 黄泉鋒主編 2009 《中國音樂導賞》香港：商務印書館，123-40。 華夏樂韻編輯委員會編 1998 《音樂教室 (二)：華夏樂韻》香港：香港電台第四台、教育署輔導視學    處音樂組、香港教育學院藝術系，164-69。", "recommended_readings": " 王耀華 1998 《中國傳統音樂概論》福州：福建教育出版社。 朱孟庭 2005 《詩經與音樂》台北：文津出版社。 朱謙之 1989 《中國音樂文學史》北京：北京大學出版社。 余少華 2001 《樂在顛錯中》香港：牛津大學出版社。 余少華 2005 《樂猶如此》香港：國際演藝評論家協會。 伍國棟 2010 《江南絲竹: 樂種文化與樂種形態的綜合研究》北京：人民音樂出版社。 李少恩 2010 《粵調詞風：香港撰曲之路》香港：香港中文大學音樂系中國音樂資料館。 李潔嫦 2000 《香港地水南音初探》香港：進一步多媒體有限公司。 李曉 2011 《京崑簡史》香港：香港中和出版有限公司。 阮弘 2008 《國樂與都市——江南絲竹與廣東音樂在上海》上海：上海文化出版社。 容世誠 2006  《粵韻留聲：唱片工業與廣東曲藝 (1903-1953)》香港：天地圖書有限公司。 容世誠 2012  《尋覓粵劇聲影：從紅船到水銀燈》香港：牛津大學出版社。 袁靜芳主編 2000 《中國傳統音樂概論》上海：上海音樂學院出版社。 袁靜芳編著 1987 《民族器樂》北京：人民音樂出版社。 袁靜芳編著 2006 《傳統器樂與樂種論著綜錄》北京：人民音樂出版社 黄泉鋒主編 2009 《中國音樂導賞》香港：商務印書館。 黄敏學編 2007 《中國音樂文化與作品賞析》合肥：合肥工業大學出版社。 陳明志 2004 《中樂因您更動聽：民族管絃樂導賞》香港：三聯出版社。 陳應時、陳聆群編 2006 《中國音樂簡史》北京：高等教育出版社。 葉明媚 1991 《古琴音樂藝術》香港：商務印書館。 葉明媚 1994 《古琴音樂藝術與中國文化》香港：商務印書館。 葉紹德編撰、張敏慧校訂 2015 《唐滌生戲曲欣賞 (一)：帝女花、牡丹亭驚夢》香港：匯智出版有限公司。 葉紹德編撰、張敏慧校訂 2016 《唐滌生戲曲欣賞 (二)：紫釵記、蝶影紅梨記》香港：匯智出版有限公司。 梁志鏘 2010《《詩經》與《楚辭》音樂研究》上海：上海古籍出版社。 梁培熾 2012 《南音與粵謳之研究》廣州：廣東人民出版社。 靳學東 2001《中國音樂導覽》北京：人民音樂出版社 。 華夏樂韻編輯委員會編 1998 《音樂教室 (二)：華夏樂韻》香港：香港電台第四台、教育署輔導視學    處音樂組、香港教育學院藝術系。 張敏慧 2011 《一台風景》香港：牛津大學出版社。 張敏慧 2014 《開鑼》香港：香港中和出版有限公司。 楊智深 1995 《唐滌生的文字世界：仙鳳鳴卷》香港：三聯書店。 齊琨 2009 《江南絲竹》杭州：浙江人民出版社。 劉以光 2008 《中國歌詞簡史》廈門: 廈門大學出版社。 劉再生 2006a 《中國古代音樂史簡述》(修訂版)，北京：人民音樂出版社。 劉再生 2006b 《中國音樂史簡明教程》(二冊)，上海：上海音樂學院出版社。 劉靖之 2009 《中國新音樂史論》(增訂版)，香港：中文大學出版社。 劉靖之 2013 《香港音樂史論》香港：商務印書館。 劉楚華主編 2016 《宋韻遺珍─白石道人歌曲重構》香港：商務印書館。 趙渢主編 1991《中國樂器》北京：現代出版社。 蔡仲德 1995《中國音樂美學史》北京: 人民音樂出版社。 黎鍵 1993 《香港粵劇口述史》香港：三聯書店。 黎鍵1998 《香港粵劇時蹤》香港：市政局公共圖書館。 黎鍵 2007 《粵調 • 樂與曲》香港：懿津出版企劃公司。 黎鍵著、湛黎淑貞編 2010 《香港粵劇敘論》香港：三聯書店。 盧瑋鑾編 2004 《姹紫嫣紅開遍—良辰美景仙鳳鳴》(纖濃本)，香港：三聯書店。 盧瑋鑾編 2009 《辛苦種成花錦繡：品味唐滌生《帝女花》》香港：三聯書店。 盧瑋鑾、張敏慧編 2011 《梨園生輝：任劍輝，唐滌生：記憶與珍藏》香港：三聯書店。 薛宗明 1981 《中國音樂史: 樂譜篇》台北：商務印書館。 薛宗明 1983 《中國音樂史: 樂器篇》台北：商務印書館。 應志良 2002《中國越劇發展史》北京：中國戲劇出版社。 戴微 2011 《中國音樂文化簡史》香港：香港中和出版有限公司。 羅麗 2007 《粤劇電影史》北京：中國戲劇出版社。 龔妮麗 2013《中國音樂美學史》太原：山西教育出版社。   Chao, Mei-pa 1969 A Guide to Chinese Music. Hong Kong: Tai Hwa Printing Factory. Cheung, Joys H.Y., and King Chung Wong, eds. 2010 Reading Chinese Music and Beyond. Hong Kong: City University of Hong Kong. Jie, Jin 2011 Chinese Music. Translated by Wang Li and Li Rong. Cambridge: Cambridge             University Press. Jones, Stephen 1995 Folk Music of China: Living Instrumental Traditions. Oxford: Clarendon Press. Jones, Stephen 1996 “Source and Stream: Early Music and Living Traditions in China.” Early Music     24: 374-88. Jones, Stephen 2004 Plucking the Winds: Lives of Village Musicians in Old and New China. Leiden:  CHIME Foundation. Lau, Frederick 2008 Music in China. Oxford: Oxford University Press. Li, Siu-leung 2003 Cross-dressing in Chinese Opera. Hong Kong: Hong Kong University Press. Liang, Mingyue 1985 Music of the Billion: An Introduction to Chinese Musical Culture. New York:   Heinrichshofen. Thrasher, Alan R. 2000 Chinese Musical Instruments. Oxford: Oxford University Press. Wiant, Bliss 1965 The Music of China. Hong Kong: The Chinese University of Hong Kong. Witzleben, J. Lawrence 1995 Silk and Bamboo Music in Shanghai. Kent, OH: The Kent State University Press. Yung, Bell 1997 Celestial Airs of Antiquity: Music of the Seven-String Zither of China. Madison, Wisconsin: A-R Editions.", "terms": {"2024-25 Term 2": {"--LEC (9517)": {"startTimes": ["16:30"], "endTimes": ["18:15"], "days": [1], "locations": ["Yasumoto Int'l Acad Park LT4"], "instructors": ["Staff"], "meetingDates": ["6/1", "13/1", "20/1", "27/1", "10/2", "17/2", "24/2", "10/3", "17/3", "24/3", "31/3", "7/4", "14/4"]}}}, "assessments": {"Essay test or exam": "40", "Report": "35", "Short answer test or exam": "25"}}, {"code": "2148", "title": "Chineseness through Music: Then and Now", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "Discussion\nLecture", "campus": "Main Campus", "academic_group": "Office of University GE", "requirements": "Not for Music Majors. \nCo-requisite: UGFH1000, UGFN1000 or UGFN1001 (only applicable to students admitted to the 4-year curriculum)", "description": "Music has existed in many forms throughout Chinese history. The characteristics of each style and genre are shaped by sociocultural, geographical, and historical contexts as well as changing definitions of what it means to be Chinese. Beginning with the notion that Chineseness and Chinese culture are changeable and malleable, this course introduces students to various forms of Chinese music performed and popularized in Chinese and Chinese-speaking communities and their relationship to the construction of Chinese identity and sociality. Students will not only learn to appreciate the nature of the ever-changing world of Chinese music but to listen to it with critical insights and to understand how it relates to its context. Rather than approaching Chinese music as fixed and unchanging tradition anchored in a lineal historical trajectory, this course will treat each genre as a unique product of its time and social ethos. Hearing music in social contexts is a dynamic and productive way to enhance students’ understanding of the evolution of Chinese culture, identity, and the construction of community. The final project will be a group collaboration analyzing aspects of a genre of Chinese music found in Hong Kong. No previous musical knowledge is required.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "2150", "title": "Chinese Culture and Its Philosophies", "career": "Undergraduate", "units": "2.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Office of University GE", "requirements": "Not for Philosophy Majors; and students who have taken PHIL2020, 2030 or UGEA2160. Co-requisite: UGFH1000, UGFN1000 or UGFN1001 (only applicable to students admitted to the 4-year curriculum)", "description": "The course introduces the philosophical thought of Confucianism, Taoism, and Buddhism, so as to give students a deeper understanding of the roots of Chinese values and culture. As a cornerstone of Chinese culture, Confucianism contributes to the establishment of the human moral way by articulating a conception of humans as moral subjects. Taoism stresses the pursuit of an ideal life by understanding the changes of the universe, while Buddhism applies the concept of karma to show how the ultimate cause of human suffering lies in ignorance. Other Chinese philosophical thought such as Mohism, Legalism, and the School of Yin and Yang may also be covered.", "outcome": "    Identify and characterize the central ideas of major schools of traditional Chinese philosophy and explain their connections to other major aspects or elements of Chinese culture.    Discuss the historical and cultural backgrounds of Chinese philosophy.    Discuss how traditional philosophical thought can inform our conception and appreciation of Chinese culture.    Illustrate how traditional philosophical thought can be brought to bear on analyzing and understanding some of the cultural and ethical issues in the contemporary world. ", "syllabus": "  (1-8) 核心內容。任教老師必須講授的專題 (9-16) 選項。任教老師可自行選擇講授的專題，以下所列僅供參考。    1.     導論：中國文化的精神方向與哲學思想的關係 2.     中國哲學的特質 中國哲學思想分論 (一) ：儒家 3.     儒家思想的主脈觀念 4.     儒家思想與文化的關係 (例如儒家與傳統君主政治、儒家與士人的憂患意識等等) 中國哲學思想分論 (二) ：道家 5.     道家哲學的核心觀念 6.     道家哲學與文化的關係 (例如道家與道教、道家與中國山水畫之淵源等等) 中國哲學思想分論 (三) ：佛家 7.     佛教的基本世界觀及義理 8.     佛教與文化的關係 (例如寺廟經濟、佛教中國化與入世轉向等等)   9.     其他哲學思想 ：墨家、法家、陰陽家等 10.   中國哲學與中國的教育觀 11.   中國哲學與中國人的生活情調 12.   儒家思想如何塑造中國社會的人倫結構 13.   道家如何塑造中國人的民族性格 14.   道教世俗化與超渡亡魂的禮俗 15.   佛教淨土宗與民間信仰 16.   當代中國哲學概述  ", "required_readings": "    1.    牟宗三：《中國哲學之特質》 (臺北：臺灣學生書局，1975)。 2.    勞思光：《新編中國哲學史》，三卷四冊 (臺北：三民書局，1984)。 3.    勞思光：《中國文化要義新編》，(香港：香港中文大學出版社，1998)。 4.    唐君毅：《中國文化之精神價值》 (臺北：正中書局，1959)。", "recommended_readings": "  1.    下村湖人著，林耀南譯：《論語故事》(臺北：協志工業叢書，1976)。 2.    方東美：《原始儒家道家哲學》 (臺北：黎明文化事業，1983)。 3.    王邦雄：《生命的大智慧：老子的現代解讀》(臺北：漢光文化，1991)。 4.    牟宗三：《才性與玄理》(香港：人生出版社，1963)。 5.    牟宗三：《中國哲學十九講》 (臺北：臺灣學生書局，1983)。 6.    牟宗三：《佛性與般若》，二冊 (臺北：臺灣學生書局，1977)。 7.    周紹賢：《佛學概論》 (臺北：臺灣商務印書館，1984)。 8.    胡適：《中國哲學史大綱》 (臺北：臺灣商務印書館，1968)。 9.    唐君毅：《中國哲學原論：導論篇》，見《唐君毅全集》卷 (臺北：臺灣學生書局，1991)。 10.唐端正：《先秦諸子論叢（續編）》 (臺北：東大圖書股份有限公司，1992)。 11.唐端正：《先秦諸子論叢》 (臺北：東大圖書公司，1981)。 12.徐復觀：《中國人性論史：先秦編》 (臺北：臺灣商務印書館，1978)。 13.徐復觀：《中國的藝術精神》 (臺北 : 臺灣學生書局，1979)。 14.張岱年：《中國哲學大綱》 (北京：中國社會科學出版社，1982)。 15.勞思光：《中國文化要義（新編）》 (香港：中文大學出版社，1998)。 16.勞思光：《哲學淺說（新編）》 (香港：中文大學出版社，1998)。 17.勞思光：《新編中國哲學史》，三卷四冊 (臺北：三民書局，1984)。 18.馮友蘭：《中國哲學史》，二冊 (香港：三聯書店，1992)。 19.馮友蘭：《中國哲學史新編》，三冊 (北京：人民出版社，1982)。 20.馮友蘭：《中國哲學簡史》 (北京：北京大學出版社，1985)。 21.蔡仁厚：《中國哲學史大綱》 (臺北：臺灣學生書局，1988)。 22.錢穆：《中國思想史》 (臺北：素書樓文教基金會，2001)。 23.霍韜晦：《如實觀的哲學》 (香港：佛教法住學會，1988)。 24.霍韜晦：《佛學》 (香港：中文大學出版社，1998)。 25.羅夢珊：《孔子未王而王論》 (臺北：臺灣學生書局，1982)。 26.嚴靈峰：《無求備齋學術新著》 (臺北：臺灣商務印書館，1987)。  ", "terms": {"2024-25 Term 1": {"A-LEC (5675)": {"startTimes": ["10:30"], "endTimes": ["12:15"], "days": [2], "locations": ["William M W Mong Eng Bldg 803"], "instructors": ["Dr. WONG Yiu Hong"], "meetingDates": ["3/9", "10/9", "17/9", "24/9", "8/10", "15/10", "22/10", "29/10", "5/11", "12/11", "19/11", "26/11"]}, "B-LEC (7027)": {"startTimes": ["10:30"], "endTimes": ["12:15"], "days": [4], "locations": ["Lady Shaw Bldg LT3"], "instructors": ["Dr WANG Xiaohong"], "meetingDates": ["5/9", "12/9", "19/9", "26/9", "3/10", "10/10", "17/10", "24/10", "31/10", "7/11", "14/11", "21/11", "28/11"]}, "C-LEC (5594)": {"startTimes": ["10:30"], "endTimes": ["12:15"], "days": [1], "locations": ["William M W Mong Eng Bldg 803"], "instructors": ["Dr. CHIU King Pong"], "meetingDates": ["2/9", "9/9", "16/9", "23/9", "30/9", "7/10", "14/10", "21/10", "28/10", "4/11", "11/11", "18/11", "25/11"]}}, "2024-25 Term 2": {"A-LEC (8877)": {"startTimes": ["9:30"], "endTimes": ["11:15"], "days": [5], "locations": ["Leung Kau Kui Bldg 101"], "instructors": ["Dr. WONG Yiu Hong"], "meetingDates": ["10/1", "17/1", "24/1", "7/2", "14/2", "21/2", "28/2", "14/3", "21/3", "28/3", "11/4"]}, "C-LEC (6740)": {"startTimes": ["10:30"], "endTimes": ["12:15"], "days": [2], "locations": ["Chung Chi College Lib CK TSE"], "instructors": ["Dr. CHIU King Pong"], "meetingDates": ["7/1", "14/1", "21/1", "4/2", "11/2", "18/2", "25/2", "11/3", "18/3", "25/3", "1/4", "8/4", "15/4"]}, "D-LEC (8996)": {"startTimes": ["10:30"], "endTimes": ["12:15"], "days": [4], "locations": ["Leung Kau Kui Bldg 101"], "instructors": ["Dr. WONG Yiu Hong"], "meetingDates": ["9/1", "16/1", "23/1", "6/2", "13/2", "20/2", "27/2", "13/3", "20/3", "27/3", "3/4", "10/4", "17/4"]}}}, "assessments": {"Essays": "50", "Essay test or exam": "50"}}, {"code": "2160", "title": "Mainstream Chinese Philosophical Thought", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "Lecture\nInteractive Tutorial", "campus": "Main Campus", "academic_group": "Office of University GE", "requirements": "Not for Philosophy Majors; and students who have taken PHIL2020, 2030 or UGEA2150.\nCo-requisite: UGFH1000, UGFN1000 or UGFN1001 (only applicable to students admitted to the 4-year curriculum)", "description": "The course introduces the philosophical thought of Confucianism, Taoism, and Buddhism, so as to give students a deeper understanding of the roots of Chinese values and culture. As a cornerstone of Chinese culture, Confucianism contributes to the establishment of the human moral way by articulating a conception of humans as moral subjects. Taoism stresses the pursuit of an ideal life by understanding the changes of the universe, while Buddhism applies the concept of karma to show how the ultimate cause of human suffering lies in ignorance. Other Chinese philosophical thought such as Mohism, Legalism, and the School of Yin and Yang may also be covered.* This course has tutorial teaching, but topics are the same as in UGEA2150.", "outcome": "    Identify and characterize the central ideas of major schools of traditional Chinese philosophy and explain their connections to other major aspects or elements of Chinese culture.    Discuss the historical and cultural backgrounds of Chinese philosophy.    Discuss how traditional philosophical thought can inform our conception and appreciation of Chinese culture.    Illustrate how traditional philosophical thought can be brought to bear on analyzing and understanding some of the cultural and ethical issues in the contemporary world.    Read and interpret selected classical texts, and analyze the content and philosophical issues addressed.  ", "syllabus": "  (1-8) 核心內容。任教老師必須講授的專題 (9-16) 選項。任教老師可自行選擇講授的專題，以下所列僅供參考。    1.     導論：中國文化的精神方向與哲學思想的關係 2.     中國哲學的特質 中國哲學思想分論 (一) ：儒家 3.     儒家思想的主脈觀念 4.     儒家思想與文化的關係 (例如儒家與傳統君主政治、儒家與士人的憂患意識等等) 中國哲學思想分論 (二) ：道家 5.     道家哲學的核心觀念 6.     道家哲學與文化的關係 (例如道家與道教、道家與中國山水畫之淵源等等) 中國哲學思想分論 (三) ：佛家 7.     佛教的基本世界觀及義理 8.     佛教與文化的關係 (例如寺廟經濟、佛教中國化與入世轉向等等)   9.     其他哲學思想 ：墨家、法家、陰陽家等 10.   中國哲學與中國的教育觀 11.   中國哲學與中國人的生活情調 12.   儒家思想如何塑造中國社會的人倫結構 13.   道家如何塑造中國人的民族性格 14.   道教世俗化與超渡亡魂的禮俗 15.   佛教淨土宗與民間信仰 16.   當代中國哲學概述  ", "required_readings": "    1.    牟宗三：《中國哲學之特質》 (臺北：臺灣學生書局，1975)。 2.    牟宗三：《中國哲學十九講》 (臺北：臺灣學生書局，1983)。 3.    勞思光：《新編中國哲學史》，三卷四冊 (臺北：三民書局，1984)。 4.    唐君毅：《中國文化之精神價值》 (臺北：正中書局，1959)。 5.    勞思光：《中國文化要義（新編）》 (香港：中文大學出版社，1998) 。    ", "recommended_readings": "  1.    下村湖人著，林耀南譯：《論語故事》(臺北：協志工業叢書，1976)。 2.    方東美：《原始儒家道家哲學》 (臺北：黎明文化事業，1983)。 3.    王邦雄：《生命的大智慧：老子的現代解讀》(臺北：漢光文化，1991)。 4.    牟宗三：《才性與玄理》(香港：人生出版社，1963)。 5.    牟宗三：《中國哲學十九講》 (臺北：臺灣學生書局，1983)。 6.    牟宗三：《佛性與般若》，二冊 (臺北：臺灣學生書局，1977)。 7.    周紹賢：《佛學概論》 (臺北：臺灣商務印書館，1984)。 8.    胡適：《中國哲學史大綱》 (臺北：臺灣商務印書館，1968)。 9.    唐君毅：《中國哲學原論：導論篇》，見《唐君毅全集》卷 (臺北：臺灣學生書局，1991)。 10.唐端正：《先秦諸子論叢（續編）》 (臺北：東大圖書股份有限公司，1992)。 11.唐端正：《先秦諸子論叢》 (臺北：東大圖書公司，1981)。 12.徐復觀：《中國人性論史：先秦編》 (臺北：臺灣商務印書館，1978)。 13.徐復觀：《中國的藝術精神》 (臺北 : 臺灣學生書局，1979)。 14.張岱年：《中國哲學大綱》 (北京：中國社會科學出版社，1982)。 15.勞思光：《中國文化要義（新編）》 (香港：中文大學出版社，1998)。 16.勞思光：《哲學淺說（新編）》 (香港：中文大學出版社，1998)。 17.勞思光：《新編中國哲學史》，三卷四冊 (臺北：三民書局，1984)。 18.馮友蘭：《中國哲學史》，二冊 (香港：三聯書店，1992)。 19.馮友蘭：《中國哲學史新編》，三冊 (北京：人民出版社，1982)。 20.馮友蘭：《中國哲學簡史》 (北京：北京大學出版社，1985)。 21.蔡仁厚：《中國哲學史大綱》 (臺北：臺灣學生書局，1988)。 22.錢穆：《中國思想史》 (臺北：素書樓文教基金會，2001)。 23.霍韜晦：《如實觀的哲學》 (香港：佛教法住學會，1988)。 24.霍韜晦：《佛學》 (香港：中文大學出版社，1998)。 25.羅夢珊：《孔子未王而王論》 (臺北：臺灣學生書局，1982)。 26.嚴靈峰：《無求備齋學術新著》 (臺北：臺灣商務印書館，1987)。", "terms": {"2024-25 Term 1": {"A-LEC (6788)": {"startTimes": ["12:30"], "endTimes": ["15:15"], "days": [4], "locations": ["Leung Kau Kui Bldg 101"], "instructors": ["Dr. WONG Yiu Hong"], "meetingDates": ["5/9", "12/9", "19/9", "26/9", "3/10", "10/10", "17/10", "24/10", "31/10", "7/11", "14/11", "21/11", "28/11"]}, "B-LEC (8992)": {"startTimes": ["14:30"], "endTimes": ["17:15"], "days": [3], "locations": ["Lee Shau Kee Building 514"], "instructors": ["Dr. CHONG Yun Chak"], "meetingDates": ["4/9", "11/9", "25/9", "2/10", "9/10", "16/10", "23/10", "30/10", "6/11", "13/11", "20/11", "27/11"]}, "C-LEC (8960)": {"startTimes": ["9:30"], "endTimes": ["12:15"], "days": [2], "locations": ["Lee Shau Kee Building 308"], "instructors": ["Professor David CHAI"], "meetingDates": ["3/9", "10/9", "17/9", "24/9", "8/10", "15/10", "22/10", "29/10", "5/11", "12/11", "19/11", "26/11"]}}, "2024-25 Term 2": {"A-LEC (4938)": {"startTimes": ["13:30"], "endTimes": ["16:15"], "days": [5], "locations": ["Lee Shau Kee Building 302"], "instructors": ["Dr. LO Kit Hung"], "meetingDates": ["10/1", "17/1", "24/1", "7/2", "14/2", "21/2", "28/2", "14/3", "21/3", "28/3", "11/4"]}, "B-LEC (5588)": {"startTimes": ["15:30"], "endTimes": ["18:15"], "days": [2], "locations": ["Lee Shau Kee Building 308"], "instructors": ["Dr. CHONG Yun Chak"], "meetingDates": ["7/1", "14/1", "21/1", "4/2", "11/2", "18/2", "25/2", "11/3", "18/3", "25/3", "1/4", "8/4", "15/4"]}}}, "assessments": {"Essays": "25", "Essay test or exam": "50", "Presentation": "25"}}, {"code": "2163", "title": "Great Debates on Chinese Traditional Thoughts", "career": "Undergraduate", "units": "2.00", "grading": "Graded", "components": "Debate\nDiscussion\nLecture", "campus": "Main Campus", "academic_group": "Office of University GE", "requirements": "Not for Philosophy Majors. \nCo-requisite: Any course with “UGFH” or “UGFN” as prefix", "description": "This course aims to provide a general understanding of traditional Chinese thoughts through some great debates in the development of Chinese culture. These great debates include various issues: man and heaven, human nature, individual and society, ethics and law, ideals of life, etc. The course is to be conducted in an argumentative approach, through lectures, readings,and particularly, debates and discussions, students will achieve a critical reflection on Chinese culture and its value for modern life.", "outcome": "    Recognize and describe the main characteristics of traditional Chinese thoughts, and different relevant views concerning those topics.    Analyze and elaborate the rationale behind those different views.    Develop a critical appreciation of traditional Chinese thoughts.    Recognize the values of traditional Chinese thoughts in modern life.      辨識及描述傳統思想的主要特徵及相關議題的不同觀點。    分析並闡述相關觀點背後的理據。    培養評鑑傳統思想之能力。    辨識傳統思想於現代生活之價值。     ", "syllabus": " 本科具有核心課題與選教課題，核心課題為任教導師必須教授的項目，有6個課題；選教課題則為任教導師自由選取其中至少3個課題作任教。   0. 導論：何謂「中國文化」 0.1 文化的界定和功能 0.2  如何了解「中國」 0.3 「文化中國」   核心課題( Core content)： 1 孟荀之辯：性善與性惡的諍辯 1.1 孟子「性善論」的論證 1.2 荀子「性惡論」（性惡善偽）的論證   2. 天人之辯：天人合德與天人相分 2.1 中庸、易傳的道德天思想 2.2 老莊的自然天 2.3 天人合德與天人相分   3. 自然與名教之辯：個體自由與社會規範的諍辯 3.1 道家的「自然」與「自由」觀念 3.2 嵇康「越名教任自然」的論證 3.3 郭象「即自然即名教」的論證   4. 禪宗之辯：神秀禪與慧能禪 4.1 佛教的要旨：離苦得樂 4.2 成佛的可能：戒定慧　（神秀禪的修悟） 4.3 成佛的關鍵：佛性覺悟（慧能禪的頓悟）   5. 朱陳之辯：道德判斷與歷史（事功）判斷的諍辯 5.1 陳同甫「事功判斷」的思考 5.2 朱熹「道德判斷」的思考   6. 中國文化與現代之辯 10.1 何謂現代化 10.2 儒教與資本主義 10.3中國文化與多元現代性   選教課題(Selected topics )： 1. 公私之辯：法理與人情的諍辯，以「父子互隱」為議論 1.1 葉公論「直」的可能依據 1.2 孔子論「隱」的可能詮解   2. 儒法之辯：德治與刑名 2.1 孟子的仁政王道學說 2.2 韓非子的刑名法術   3. 儒墨之辯：仁愛與兼愛（大愛）的諍辯 3.1 儒家「仁愛」的論證 3.2 墨家「兼愛」的論證   4.儒墨之辯：節葬與厚葬：以「三年之喪」為議論 4.1  孝：作為葬禮的理由 4.2  墨家主張「節葬」的理據 4.3  儒家主張「三年之喪」的可能理據   5.魚樂之辯：「知」與「樂」的諍論 5.1 莊子「樂」論的詮釋 5.2 惠施「知」論的詮釋 5.3「他心」問題的探討   6.形盡而神不滅之辯：精神不滅與生命輪迴的諍辯 6.1 佛教對「輪迴」的討論 6.2 慧遠「形盡神不滅」的論證 6.3 范縝「神滅論」的論證   7.言意之辯：言盡意與言不盡意的諍辯 7.1 歐陽建「言盡意」的論證 7.2 荀粲「言不盡意」的論證 7.3 王弼「意不盡而盡」的論證   8. 格物致知之辯：格物窮理與致良知 8.1 「成聖」的工夫問題：《大學》的架構 8.2  朱熹的「格物」詮釋 8.3  王陽明的「致知」詮釋   9. 墨兵之辯：非攻與戰爭的諍論：以「永久和平」為議論 9.1 「戰爭」的出現與「和平」的要求 9.2 墨家「非攻」與「尚同」的論證  ", "required_readings": " 0. 導論 0.1 勞思光《中國文化要義（新編）》，第一章〈緒論〉，頁1-12。 0.2 余英時《文化評論與中國情懷》，〈國家觀念與民族意識〉，頁17-32。 0.3 王賡武〈關於文化中國的四個疑問〉，陳其南、周英雄編《文化中國：理念與實踐》，頁3-10。   1. 孟荀之辯：性善與性惡的諍辯 1.1 楊澤波《孟子與中國文化》第四部分〈性善論可否成立〉，頁195-211。 1.2 韋政通《荀子與古代哲學》第二章頁63-80。   2. 天人之辯：道德天與自然天 2.1 唐端正《先秦諸子論叢》，〈論先秦諸子天人關係思想之發展〉，頁47-126。 2.2 傅佩榮〈天人合德論〉，台大哲學系編《中國人性論》，頁123-158。   3. 自然與名教之辯：個體自由與社會規範的諍辯 3.1 馮達文、郭齊勇《新論中國哲學史上》，第四章第二節〈嵇康、阮籍的社會批判意識〉，頁280-287。 3.2 馮達文、郭齊勇《新論中國哲學史上》，第四章第三節〈郭象的崇有哲學〉，頁288-297。   4. 禪宗之辯：神秀禪與慧能禪 4.1 葛兆光《中國禪思想史》，第三章第二節〈北宗禪思想的重新審視〉，頁188-207。 4.2 屈大成《佛學概論》，第十一章第二節〈禪宗〉，頁277-296。   5. 朱陳之辯：道德判斷與歷史（事功）判斷的諍辯 5.1 牟宗三《牟宗三先生全集10：政道與治道》，第十章〈道德判斷與歷史判斷〉，頁263-291。 5.2 劉述先《朱子哲學思想的發展與完成》，第七章第四節〈道德與功利的分疏〉，頁368-382。   6. 中國文化與現代之辯： 6.1杜維明〈何為儒家之道？〉，杜維明《東亞價值與多元現代性》，頁119-216。 6.2劉述先〈從哲學觀點看中國的現代化〉《中國哲學與現代化》頁3-18。 6.3石元康〈韋伯的比較宗教學〉，石元康《從中國文化到現代性：典範轉移》頁122-145。   7. 公私之辯：法理與人情的諍辯，以「父子互隱」為議論 7.1 王慶節〈親親相隱，正義與儒家倫理中的道德兩難〉，《中國文哲研究集刊》第五十期，2017年9月，頁39-64。 7.2 郭齊勇〈關於「親親互隱」、「愛有差等〉的爭鳴〉，《哲學研究》2005年 第3期，頁1-5。   8. 儒法之辯：德治與法治 8.1 楊澤波《孟子評傳》第三章〈王霸之辯〉，頁148-178 8.2  勞思光《新編中國哲學史》第七章第三節〈韓非子之思想〉，頁273-281。   9. 儒墨之辯：仁愛與兼愛（大愛） 9.1 牟宗三〈墨子之兼愛與孟子之等差〉，《牟宗三先生全集25：牟宗三先生早期文集 上》，pp.469-478。 9.2 蔡仁厚《墨家哲學》，第三章〈愛的社會之嚮往－兼愛〉，頁41-50。   10. 儒墨之辯：節葬與厚葬：以「三年之喪」為議論 10.1 伍至學〈論宰我問三年之喪〉，《止善》第六期，2009年9月，頁153-166。 10.2 吳進安《墨翟與《墨子》》，第二篇〈墨學的普世價值〉，台北：五南圖書出版，2012年3月，頁237-350。   11. 魚樂之辯：「知」與「樂」的諍論 11.1 岑溢成〈魚樂之辯之知與樂〉，《鵝湖月刊》第二十九期，1977年11月，頁2-12。 11.2 顏陽崑〈從莊子「魚樂」論道家「物我合一」的藝術境界及其所關涉諸問題〉，《中外文學》第五卷7期，1987年12月，頁14-39。   12. 形盡而神不滅之辯：精神不滅與生命輪迴的諍辯 12.1 鄭基良《魏晉南北朝形盡神滅或形盡神不滅的思想論證》，第二章 第四節〈慧遠〈形盡神不滅論〉〉，頁184-244；第三章 第一節〈范縝〈神滅論〉〉，頁367-411。 12.2 戴璉璋〈玄學與形神思想〉，《中國文哲研究集刊》第十三期，1998年9月，頁203-242。   13. 言意之辯：言盡意與言不盡意的諍辯 13.1 岑溢成〈魏晉「言意之辨」的兩個層面〉，《鵝湖學誌》第十一期，1993年12月，頁17-36。 13.2 蜂屋邦夫〈言盡意論與言不盡意論〉，辛冠潔等編《日本學者論中國哲學史》，頁.240-266。   14. 格物致知之辯：格物窮理與致良知 14.1 陳榮捷《朱熹》，第七章〈朱子論格物〉，頁81-92。 14.2 陳來《有無之境》，第七章第三節〈致良知〉，頁178-192。   15. 墨兵之辯：非攻與戰爭的諍論：以「永久和平」為議論 15.1 李零《兵以詐立：我讀《孫子》》，第三講〈（始）計第一〉，頁53-76。 15.2 何威萱〈《墨子》兵學思想的特色及其意義〉，《中國文化研究所學報》第五十五期，2012年7月，頁273-294。  ", "recommended_readings": "    勞思光《中國文化要義（新編）》（香港：中文大學出版社，1998年）    勞思光《文化哲學演講錄》（香港：中文大學出版社，1998年）    牟宗三《牟宗三先生全集25：牟宗三先生早期文集 上》（台北：聨經出版社，2003年）    辛冠潔等編《日本學者論中國哲學史》（北京：中華書局，1986年）    吳汝鈞《中國佛教的現代詮釋》（台北: 文津出版社，1995年）    曾春海《兩漢魏晉哲學史》（台北 : 五南圖書出版股份有限公司， 2000年）    楊澤波《孟子評傳》（南京：南京大學出版社，1988年）    韋政通《荀子與古代哲學》（台北：商務出版社，1966年）    石元康《從中國文化到現代性：典範轉移》（北京：三聯書局，2000年）    劉述先《中國哲學與現代化》（台北：時報文化出版企業有限公司1980年）    楊澤波 《孟子與中國文化》（貴陽：貴州人民出版社，2000年）    蔡仁厚《墨家哲學》（台北：東大圖書，1978年）    陳來《有無之境》（北京：人民出版社，1991年）    劉述先《朱子哲學思想的發展與完成》（台北：學生書局，1984年）    陳榮捷《朱熹》（台北：東大圖書，1990年）    葛兆光《中國禪思想史》（北京：北京大學出版社，1995年）    屈大成《佛學概論》（台北: 文津出版社，2002年）    李零《兵以詐立：我讀《孫子》》（北京：中華書局，2012年）    鄭基良《魏晉南北朝形盡神滅或形盡神不滅的思想論證》    吳進安《墨翟與《墨子》》（台北：五南圖書出版，2012年）    杜維明《東亞價值與多元現代性》（北京：中國社會科學出版社，2001年）    余英時《文化評論與中國情懷》，（台北：允晨，2011年）    陳其南、周英雄編《文化中國：理念與實踐》（台北：允晨，1994年）    台大哲學系編《中國人性論》（台北：東大圖書，1990年）    唐端正《先秦諸子論叢》（台北：東大圖書，1981年）     ", "terms": {"2024-25 Term 1": {"--LEC (8422)": {"startTimes": ["12:30"], "endTimes": ["14:15"], "days": [2], "locations": ["Lee Shau Kee Building 306"], "instructors": ["Dr. HON Hiu Wah"], "meetingDates": ["3/9", "10/9", "17/9", "24/9", "8/10", "15/10", "22/10", "29/10", "5/11", "12/11", "19/11", "26/11"]}}, "2024-25 Term 2": {"--LEC (8255)": {"startTimes": ["9:30"], "endTimes": ["11:15"], "days": [5], "locations": ["Lee Shau Kee Building 302"], "instructors": ["Dr. LAU Po Hei"], "meetingDates": ["10/1", "17/1", "24/1", "7/2", "14/2", "21/2", "28/2", "14/3", "21/3", "28/3", "11/4"]}}}, "assessments": {"Discussion": "30", "Essay test or exam": "40", "Report": "30"}}, {"code": "2180", "title": "Chinese Culture and Society", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "Lecture\nInteractive Tutorial", "campus": "Main Campus", "academic_group": "Office of University GE", "requirements": "UGEA2180 is double-coded with ANTH2410. \nNot for Anthropology Majors; and students who have taken ANTH2410, UGEA2190 or 2334.\nCo-requisite: Any course with “UGFH” or “UGFN” as prefix", "description": "(UGEA2180 is double-coded with ANTH2410.)  This course provides an anthropological approach to examining Chinese culture and society. Some of the key questions we raise include: What does it mean to be Chinese? What role does culture play in being Chinese, and what constitutes Chinese society? Our emphasis is on the dominant cultural practices of societies around the world that render them ‘Chinese’. The course will also situate contemporary China historically within the world-system and examine the dramatic transformations it has undergone as a result of the post-Mao reforms beginning in the late-1970s. Because China has become the world’s most dynamic growth-engine since these reforms were launched, the Chinese experience offers itself as a case-study of the benefits as well as challenges thrown up by modern development. Since China has committed to implementing the 2030 development agenda, including Sustainable Development Goals (SDGs) such as clean water, affordable clean energy, and climate action, this course will offer students the opportunity to familiarize themselves with the discourse of sustainability as articulated by the SDGs. But more than that, with specific reference to the experience of the People’s Republic of China in particular, the course will afford students the opportunity to reflect upon the apparent contradictions existing between what is understood to be ‘development’ on the one hand and ‘sustainability’ on the other. ", "outcome": " Upon completing this course, students should be able to:   - explain why claims about being Chinese and Chineseness can be such a source of contention. - explain why there are similarities as well as differences across different Chinese societies. - historically as well as anthropologically account for the place of contemporary China within the world-system. - critically discuss the major features and social institutions of Maoist and post-Mao China. - discuss the Sustainable Development Goals (SDGs), their significance in our times, and how ‘sustainability’ challenges ideas of development in general and Chinese development specifically. - critically evaluate which of the 17 SDGs are realized – or compromised by - the Chinese development experience.  ", "syllabus": " Core Content   1. Culture and Humanity 2. What Makes One Chinese?  3. Overseas Chinese and the Different Articulations of Chineseness 4. Situating the PRC in a historical and global context 5. Vignettes of Maoist China  6. The Anthropology of Post-Reform China 7. Discussing post-reform China in light of the Sustainability Development Goals (SDGs)   What does it mean to be Chinese? What role does culture play in being Chinese? And what constitutes Chinese society? When Chinese populations elsewhere (e.g. overseas Chinese) lay claim to being Chinese, what are they invoking? On the other hand, when ethnic Chinese Hong Kongers claim that they are not Chinese, for instance, what are they implying? Is being Chinese primarily given by ethnicity, nationality, cultural/civilizational practices, some combination of the above, or all of them?  This line of questioning would suggest that when we invoke “Chinese culture and society”, we refer not only to culture and society in China but also beyond, to Chinese societies elsewhere that have emerged as a result of the Chinese diaspora. Yet at the heart of this discussion still lies the question with which we first began: what does it mean to be Chinese? And what binds mainland Chinese societies with those overseas?  Because the shared identity of being Chinese has here been shown to transcend geographical and national boundaries, I would propose that being Chinese pertains more to the evolving practices of culture than it does the more limiting constraints of ethnicity, geography, or nationality. This class therefore examines the constituents of being Chinese, with the emphasis placed on culture as its animating force.  Accordingly, we begin the course by underlining the significance of  “culture” to being “human” and trace out the implications of this proposition. (Topic 1).     Indeed, it is because culture is a cumulative and evolving social phenomenon – a process - that accounts for the diversity of Chinese societies around the world (e.g. Hong Kong, Singapore, Taiwan), that there is something identifiably Chinese in each of them, yet something else that differentiates between them. A pluralist cultural view   of “Chinese” - a civilizational view (?) - will thus be taken as we tease out the similarities and differences existing across these societies. (Topics 2 and 3).  After discussing the differences between the Chinese societies of the world, we will turn our attention to examining the People’s Republic of China (PRC), whose breathtaking economic development over the past forty years is not in question. Because China - and the PRC, specifically - is a political entity that has had a history of antagonistic relations with the West, the course approaches discussion of China by first problematizing it as a political and historical entity, including its Maoist-Socialist past. (Topics 4 and 5). Such historic contextualization of China is felt to be necessary, the pre-requisite for any discussion of contemporary China, not least its post-Mao developments.  This brings us to the many aspects of post-Mao and post-reform China, the last forty years that have come to be associated with China’s famed developmental experience. (Topic 6).       The consequences of Chinese development - especially in the post-Mao era - speak to most, if not all, of the SDGs, which can be understood to refer to sustainability in three realms: economic, social and ecological. Hence, the anthropology of post-reform China (6) will necessarily highlight issues pertaining, for instance, to poverty and hunger alleviation (SDG 1,2), health and well-being (SDG3), gender (SDG 5), inequality  (SDG10), energy (SDG7), and urbanization (SDG 11), among others. This is conducive for a discussion about the SDGs with reference to Chinese development and an examination of whether or not, and when, they are consistent.      ", "required_readings": "   Culture and Humanity Goodman, Mary Ellen. 1967. “The Nature of Culture”. In The Individual and Culture. Homewood, Illinois: The Dorsey Press; pp. 32-50.     What Makes One Chinese? Chen, Lai. 2017. The Core Values of Chinese Civilization.   Fei, Xiaotong. 1992 (1947). “Special Characteristics of Rural Society,” and “Chaxu Geju: The Differential Mode of Association.” In From the Soil: The Foundations of Chinese Society. G.G. Hamilton and Z. Wang, pp. 37-44, 60-70.   Wang, Gungwu. 1991. “Among non-Chinese”. Daedalus. 120(2): 135-157.   Wang, Gangwu. 2000. “Seaward Sweep: The Chinese in Southeast Asia” in The Chinese Overseas. MA: Harvard University Press.   Overseas Chinese and Different Articulations of Chineseness Chun, Allen. 1996. “Discourses of identity in the changing spaces of public culture in Taiwan, Hong Kong and Singapore.” Theory, Culture and Society 13(1): 51-76.   Chun, Allen. 2017. Forget Chineseness: On the Geopolitics of Cultural Identification. Albany: SUNY Press; Introduction (pp. 1-13); pp. 75-77 and Chapter 4 (pp. 77-103): “Hong Kong Betwixt and Between: The Liminality of Culture Before the End of History” .   Situating the PRC in a Historical and Global Context Vukovic, Daniel F. 2019. “On Illiberalism and Seeing Like an Other State” In Illiberal China: The Ideological Challenge of the People’s Republic of China. London: Palgrave Macmillan.   Vignettes of Maoist China Bray, David. “Governing Urban China: Labor, Welfare and the Danwei,”. In Social Space and Governance in Urban China ; pp. 94-122.   Hershatter, Gail. 2011. The Gender of Memory: Rural Women and China’s Collective Past.   Karl, Rebecca. 2010. Mao Zedong and China in the Twentieth Century: A Concise History. Durham: Duke University Press. Pp. 1-34.   Karl, Rebecca. 2019. “Why Mao, Why Now? A Brief Essay on Pedagogy and Possibility”. In the PRC History Review. Vol. 4, No. 2. August.   Mao, “Report on the Peasant Movement in Hunan” In Cheek, Timothy. 2003. Mao Zedong and China’s Revolutions: A Brief History with Documents; pp. 41-75.   The Anthropology of Post-reform China Hansen, M.H, Li, H. and Svarverud, R. 2018. “Ecological civilization: Interpreting the Chinese past, projecting the global future.” Global Environment Change. 53: 195-203.   Hoffman, Lisa M. 2010. “Turning Culture into Profit”. In Patriotic Professionalism in Urban China: Fostering Talent, pp. 103-120.    Jacka, Tamara. 2013. “Chinese Discourses on Rurality, Gender and Development: A Feminist Critique,” The Journal of Peasant Studies, 40:6 (2013): 983-1007.   Kho, Tung-yi. 2017. “Urban Ethnography and the Margins at the Centre: An Account from Shenzhen”, in CITY.   Lin, Chun. 2015. “Modernity and the violence of global accumulation: the ethnic question in China.” In Bringel, Breno M. and Domingues, Jose Mauricio (eds.) Global Modernity and Social Contestation. London: SAGE.   Lora-Wainwright, Anna. “Water, Hard Work and Chemicals: The Moral Economy of Cancer”, Fighting for Breath: Living Morally and Dying of Cancer in a Chinese Village; pp. 91-116.   Zhang, Li. 2010. “Spatializing Class” in In Search of Paradise: Middle-class living in a Chinese metropolis, pp. 107-136. Ithaca: Cornell University Press.", "recommended_readings": "", "terms": {"2024-25 Term 1": {"--LEC (8957)": {"startTimes": ["13:30"], "endTimes": ["15:15"], "days": [3], "locations": ["Humanities Building 213"], "instructors": ["Professor ZHANG Chaoxiong"], "meetingDates": ["4/9", "11/9", "25/9", "2/10", "9/10", "16/10", "23/10", "30/10", "6/11", "13/11", "20/11", "27/11"]}, "-T01-TUT (8956)": {"startTimes": ["15:30"], "endTimes": ["16:15"], "days": [3], "locations": ["T.C. Cheng Bldg 208"], "instructors": ["Professor ZHANG Chaoxiong"], "meetingDates": ["4/9", "11/9", "25/9", "2/10", "9/10", "16/10", "23/10", "30/10", "6/11", "13/11", "20/11", "27/11"]}, "-T02-TUT (8958)": {"startTimes": ["16:30"], "endTimes": ["17:15"], "days": [3], "locations": ["T.C. Cheng Bldg 208"], "instructors": ["Professor ZHANG Chaoxiong"], "meetingDates": ["4/9", "11/9", "25/9", "2/10", "9/10", "16/10", "23/10", "30/10", "6/11", "13/11", "20/11", "27/11"]}, "-T03-TUT (5487)": {"startTimes": ["17:30"], "endTimes": ["18:15"], "days": [3], "locations": ["T.C. Cheng Bldg 208"], "instructors": ["Professor ZHANG Chaoxiong"], "meetingDates": ["4/9", "11/9", "25/9", "2/10", "9/10", "16/10", "23/10", "30/10", "6/11", "13/11", "20/11", "27/11"]}, "-T04-TUT (7344)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["No Room Required"], "instructors": ["Professor ZHANG Chaoxiong"], "meetingDates": ["02/09/2024 - 25/11/2024"]}}}, "assessments": {"Essays": "40", "Homework or assignment": "35", "Participation": "25"}}, {"code": "2190", "title": "Chinese Society", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Office of University GE", "requirements": "Not for Sociology Majors; and students who have taken ANTH2410, 2420, CCSS1004, GESC2118, SOCI2106, 2117, 2216, UGEA2180, 2300, 2332, 2334, UGEC2883 or 2963. \nCo-requisite: Any course with “UGFH” or “UGFN” as prefix", "description": "This course will introduce students to a variety of social science concepts and theories to analyse contemporary China from an integrated perspective. After taking this course, students should be able to grasp the current development in key areas of China including economic reform, political system and change, rural and urban development, social inequality, family and marriage, cultural and ideological issues, as well as other institutional developments.", "outcome": "    Students are expected to be familiar with the key concepts adopted from social sciences to understand and analyze the main aspects of social changes in contemporary China.  Students will grasp the basic knowledge about China’s major institutions such as socialist market economy, party-state politics, stratification and family, etc.  In addition to the general knowledge, students should be able to have a deep understanding of a particular topic of China (such as the dilemma between economic development and income equality, environmental issues, one-child policy and two-child policy) through their writing assignments.        ", "syllabus": " In this course, students will be taught the social facts and changes in contemporary China and how to understand these facts and changes from scholarly and objective perspectives. Key social science concepts like institution, ideology, socialism, marketization, industrialization, urbanization, stratification, family, and migration and some specialized terms in China studies such as hukou will be introduced. The course will cover the following topics. 01. Introduction 02. International Background 03. Economic Reform and Development 04. Political System and Change 05. Rural-urban Divide, Urbanization, and Migration 06. Social Stratification and Inequality 07. Education and Class Reproduction 08. Population and Demographic Transition 09. Family, Gender and Marriage 10. Social Welfare and Healthcare 11. Social Conflict 12. Environmental Issues 13. Course Summary    ", "required_readings": " Since one section of the course is instructed in English, the required readings of this course will be all in English as follows.              01. Introduction No reading required.   02. International Background Art, Robert J., and Robert Jervis. 2017. “Anarchy and Its Consequences.” Pp. 1–9 in International Politics: Enduring Concepts and Contemporary Issues, edited by R. J. Art and R. Jervis. Pearson Education Ltd.   03. Economic Reform and Development Lin, Justin Yifu, Fang Cai, and Zhou Li. 1998. “Competition, Policy Burdens, and State-Owned Enterprise Reform.” The American Economic Review 88(2):422–27.   04. Political System and Change Walder, Andrew G. 1995. “The Quiet Revolution from within: Economic Reform as a Source of Political Decline.” Pp. 1–24 in The waning of the communist state: Economic origins of political decline in China and Hungary, edited by A. G. Walder. Berkely: University of California Press.   05. Rural-urban Divide, Urbanization, and Migration Liang, Zai. 2016. “China’s Great Migration and the Prospects of a More Integrated Society.” Annual Review of Sociology 42:451–71.   06. Social Stratification and Inequality Bian, Yanjie. 2002. “Chinese Social Stratification and Social Mobility.” Annual Review of Sociology 28(1):91–116.   07. Education and Class Reproduction Wu, Xiaogang, and Zhuoni Zhang. 2010. “Changes in Educational Inequality in China, 1990–2005: Evidence from the Population Census Data.” Pp. 123–52 in Globalization, changing demographics, and educational challenges in East Asia, edited by E. Hannum, H. Park, and Y. G. Butler. Emerald Group Publishing Limited.   08. Population and Demographic Transition Greenhalgh, Susan. 2003. “Science, Modernity, and the Making of China’s One-Child Policy.” Population and Development Review 29(2):163–96.   09. Family, Gender, and Marriage Whyte, Martin King. 2005. “Continuity and Change in Urban Chinese Family Life.” The China Journal 53:9–33.   10. Social Welfare and Healthcare Selden, Mark, and Laiyin You. 1997. “The Reform of Social Welfare in China.” World Development 25(10):1657–68.   11. Social Conflict Walder, Andrew G. 2009. “Unruly Stability: Why China’s Regime Has Staying Power.” Current History 108(719):257–63.   12. Environmental Issues Yang, Guobin. 2010. “Brokering Environment and Health in China: Issue Entrepreneurs of the Public Sphere.” Journal of Contemporary China 19(63):101–18.   13. Course Summary No reading required.  ", "recommended_readings": " 01. Introduction No readings.   02. International Background Yan, Xuetong. 2014. “From Keeping a Low Profile to Striving for Achievement.” The Chinese Journal of International Politics 7(2):153–84.   03. Economic Reform and Development Nee, Victor. 1989. “A Theory of Market Transition: From Redistribution to Markets in State Socialism.” American Sociological Review 54(5):663–81.   04. Political System and Change Saich, Tony. 2000. “Negotiating the State: The Development of Social Organizations in China.” The China Quarterly (161):124–41. Yang, Dali L. 2006. “Economic Transformation and Its Political Discontents in China: Authoritarianism, Unequal Growth, and the Dilemmas of Political Development.” Annual Review of Political Science 9:143–64.   05. Rural-urban Divide, Urbanization, and Migration Chan, Kam Wing, and Li Zhang. 1999. “The Hukou System and Rural-Urban Migration in China: Processes and Changes.” The China Quarterly (160):818–55.   06. Social Stratification and Inequality Xie, Yu, and Xiang Zhou. 2014. “Income Inequality in Today’s China.” Proceedings of the National Academy of Sciences 111(19):6928–33.   07. Education and Class Reproduction Hao, Lingxin, and Xiao Yu. 2017. “Sources of Unequal Cognitive Development of Middle-School Students in China’s Rural–Urban Migration Era.” Chinese Journal of Sociology 3(1):32–55.   08. Population and Demographic Transition Zeng, Yi. 2007. “Options for Fertility Policy Transition in China.” Population and Development Review 33(2):215–46. Zhao, Zhongwei, and Wei Chen. 2011. “China’s Far below Replacement Fertility and Its Long-Term Impact: Comments on the Preliminary Results of the 2010 Census.” Demographic Research 25:819–36.   09. Family, Gender, and Marriage Du, Fenglian, and Xiao-Yuan Dong. 2013. “Women’s Employment and Child Care Choices in Urban China during the Economic Transition.” Economic Development and Cultural Change 62(1):131–55. Shu, Xiaoling, and Yanjie Bian. 2003. “Market Transition and Gender Gap in Earnings in Urban China.” Social Forces 81(4):1107–45.   10. Social Welfare and Healthcare Adams, Jennifer, and Emily Hannum. 2005. “Children’s Social Welfare in China, 1989–1997: Access to Health Insurance and Education.” The China Quarterly 181:100–121. Blumenthal, David, and William Hsiao. 2005. “Privatization and Its Discontents: The Evolving Chinese Health Care System.” The New England Journal of Medicine 353(11):1165–70.   11. Social Conflict Lee, Ching Kwan, and Yonghong Zhang. 2013. “The Power of Instability: Unraveling the Microfoundations of Bargained Authoritarianism in China.” American Journal of Sociology 118(6):1475–1508.   12. Environmental Issues Tong, Yanqi. 2007. “Bureaucracy Meets the Environment: Elite Perceptions in Six Chinese Cities.” The China Quarterly (189):100–121.   13. Course Summary No readings.     ", "terms": {"2024-25 Term 1": {"A-LEC (6498)": {"startTimes": ["14:30"], "endTimes": ["17:15"], "days": [2], "locations": ["Ho Tim Building B6"], "instructors": ["Dr. HO Ching Wai"], "meetingDates": ["3/9", "10/9", "17/9", "24/9", "8/10", "15/10", "22/10", "29/10", "5/11", "12/11", "19/11", "26/11"]}}, "2024-25 Term 2": {"B-LEC (6482)": {"startTimes": ["14:30"], "endTimes": ["17:15"], "days": [2], "locations": ["Chung Chi College Lib CK TSE"], "instructors": ["Dr. HO Ching Wai"], "meetingDates": ["7/1", "14/1", "21/1", "4/2", "11/2", "18/2", "25/2", "11/3", "18/3", "25/3", "1/4", "8/4", "15/4"]}, "C-LEC (8551)": {"startTimes": ["14:30"], "endTimes": ["17:15"], "days": [1], "locations": ["Wong Foo Yuan Bldg LT4"], "instructors": ["Staff"], "meetingDates": ["6/1", "13/1", "20/1", "27/1", "10/2", "17/2", "24/2", "10/3", "17/3", "24/3", "31/3", "7/4", "14/4"]}, "G-LEC (6373)": {"startTimes": ["10:30"], "endTimes": ["13:15"], "days": [2], "locations": ["Esther Lee Bldg LT1"], "instructors": ["Staff"], "meetingDates": ["7/1", "14/1", "21/1", "4/2", "11/2", "18/2", "25/2", "11/3", "18/3", "25/3", "1/4", "8/4", "15/4"]}, "H-LEC (6291)": {"startTimes": ["14:30"], "endTimes": ["17:15"], "days": [4], "locations": ["Esther Lee Bldg LT1"], "instructors": ["Staff"], "meetingDates": ["9/1", "16/1", "23/1", "6/2", "13/2", "20/2", "27/2", "13/3", "20/3", "27/3", "3/4", "10/4", "17/4"]}}}, "assessments": {"Essays": "40", "Presentation": "20", "Selected response test or exam": "40"}}, {"code": "2230", "title": "Introduction to Transformation in Chinese History", "career": "Undergraduate", "units": "2.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Office of University GE", "requirements": "Not for History Majors; and students who have taken GENA2322 or HIST1001. \nCo-requisite: UGFH1000, UGFN1000 or UGFN1001 (only applicable to students admitted to the 4-year curriculum)", "description": "From a historical perspective, the course explores the origin and evolution characteristics of Chinese culture. Its contents analyse and describe the historical traditions and changes in Chinese politics, economy, society, religion, culture and education, as well as the relationship between Chinese tradition and modernisation.", "outcome": "     1. 學生認識中國不同朝代的演變過程及發展特色以至不同史學家的演繹方法， 進而加強理解、欣賞和評價中國歷史及文化的能力。   Students can learn the evolution process and development characteristics of the different Chinese dynasties as well as the different interpretations of historians. This will strengthen their abilities to understand, appreciate and evaluate Chinese history and cultures.   2. 本科的課業要求， 讓學生學會撰寫研究報告的基礎技巧: 資料的蒐集、考證與分析， 從而應用於其研讀的學科，生活以至工作上。   The course requirements enable students to learn basic research skills such as data collection, verification and analysis in writing research reports.  Students can apply such skills to their field of study, lives and careers.   3. 多元史觀的展示與批判，將提升同學獨立思考的能力，同學可利用客觀分析事物的方法， 解決現實生活以至未來工作上的困難。   The demonstration and critique of multi-dimensional interpretations of history will enhance students’ critical thinking ability. Using an objective analytical approach, they will be able solve problems in life and in their future work.", "syllabus": "    中國歷史的多元論述 Multi-dimensional interpretations of Chinese history    中國皇權制度的建立與演變Establishment and evolution of Chinese monarchical political system    從小農經濟到市場經濟的發展 Chinese economy’s development from a rural economy to market economy    中國教育之傳統及其變革 Traditions and changes of the Chinese education system    中國耶、儒、釋、道與民間信仰的發展 Christianity, Confucianism, Buddhism, Taoism and folk beliefs in China    中國傳統社會結構特色及其轉型 Characteristics of Chinese traditional social structure and its transformation    中國古代都市文化特色 Characteristics of urban culture in ancient China    從中國臣民到中國公民 From Chinese subjects to Chinese citizens    中國與世界 China and the World    中國歷史從傳統過渡到現代縱論 Overview on the transition of Chinese history from traditional to modernity     ", "required_readings": "    中國歷史的多元論述      許倬雲：《萬古江河：中國歷史文化的轉折與開展》，上海：上海文藝出版社，2006，頁92-114。    錢穆：《國史大綱》，香港：商務印書館(香港)有限公司，1995，頁1-34。          中國皇權制度的建立與演變      吳晗、費孝通，《皇權與紳權》，上海：觀察社，1948，頁39-55。    錢穆：《中國歷代政治得失》，北京：三聯書店，2001，頁1-16，170-178。    蕭公權：《中國政治思想史》，瀋陽：遼寧教育出版社，1998，頁1-14。          從小農經濟到市場經濟的發展      Rawski, Evelyn, Agricultural Change and the Peasant Economy of South China, Harvard University Press, 1972, pp.139-163.    施堅雅 (Skinner, G. William)：《中國農村的市場和社會結構》 ，北京：中國社會科學出版社，1998)，頁5-67。    黃仁宇，《資本主義與二十一世紀》，北京：三聯書店，1997，頁201-287。          中國教育之傳統及其變革      Lee, Thomas H.C. , Education in Traditional China: A History, Leiden: Brill, 2000, pp. 1-40.    張仲禮著、李榮昌譯：《中國紳士：關於其在19世紀中國的作用》，上海：上海人民出版社，2001，頁184-229。    喻本伐、熊賢君：《中國教育發展史》，武漢：華中師範大學出版社，2000，頁1-17，344-355。          中國耶、儒、釋、道與民間信仰的發展      Wolf, Arthur ed., Religion and Ritual in Chinese Society, Stanford, Calif.: Stanford University Press, 1974, pp. 1-18.    何光滬、許志偉主編：《對話：儒釋道與基督教》，北京：社會科學文獻出版社，2001，頁1-22。    謝和耐 (Gernet, Jacques)著，耿升譯：《中國與基督教》，上海：上海古籍出版社，2003，頁124-174。          中國傳統社會結構特色及其轉型      Eastman, Lloyd, E., Family, Fields, and Ancestors: Constancy and Change in China’s Social and Economic History, 1550-1949, New York: Oxford University Press, 1988, pp. 15-40.    孫立平：《轉型與斷裂：改革以來中國社會結構的變遷》。北京：清華大學出版社，2004。〈改革以來中國社會結構的變遷〉，頁1-25。    費孝通：《鄉土中國》，北京：三聯書店，1985，頁1-9、21-41及71-77。          中國古代都市文化特色      吳剛：《中國古代的城市生活》，北京：商務印書館國際有限公司，1997，頁17-42，100-103。    劉方：《盛世繁華：宋代江南城市文化的繁榮與變遷》，杭州：浙江大學出版社，2011，頁 62-91。          從中國臣民到中國公民      Harrison, Henrietta, The Making of the Republican Citizen: Political Ceremonies and Symbols in China, 1911-1929, Oxford; New York: Oxford University Press, 2000, pp. 49-92.    李孝悌：《清末的下層社會啟蒙運動1901-1911》，石家莊：河北教育出版社，2001，頁1-16。      中國與世界      王國斌著，李伯重等譯：《轉變的世界：歷史變遷與歐洲經驗的局限》，南京：江蘇人民出版社，1998，頁7-74。    許倬雲：《中國文化與世界文化》，貴陽：貴州人民出版社，1991，頁8-15及171-224。    韓毓海：《五百年來的中國與世界》，北京：九州出版社，2009，頁285-302。          中國歷史從傳統過渡到現代縱論      余英時：《中國思想傳統的現代詮釋》，江蘇：江蘇人民出版社，1992，頁49-62。    金耀基：《從傳統到現代》，北京:中國人民大學出版社，1999，頁91-113，123-167。 ", "recommended_readings": "", "terms": {"2024-25 Term 1": {"C-LEC (5449)": {"startTimes": ["10:30"], "endTimes": ["12:15"], "days": [4], "locations": ["Lee Shau Kee Building LT4"], "instructors": ["Dr. SIU Kam Wah"], "meetingDates": ["5/9", "12/9", "19/9", "26/9", "3/10", "10/10", "17/10", "24/10", "31/10", "7/11", "14/11", "21/11", "28/11"]}, "D-LEC (4791)": {"startTimes": ["14:30"], "endTimes": ["16:15"], "days": [1], "locations": ["Lee Shau Kee Building LT2"], "instructors": ["Miss CHEUNG Ching Man"], "meetingDates": ["2/9", "9/9", "16/9", "23/9", "30/9", "7/10", "14/10", "21/10", "28/10", "4/11", "11/11", "18/11", "25/11"]}}, "2024-25 Term 2": {"B-LEC (5343)": {"startTimes": ["10:30"], "endTimes": ["12:15"], "days": [4], "locations": ["Lee Shau Kee Building LT3"], "instructors": ["Dr. WOO Tze Yan Jessie"], "meetingDates": ["9/1", "16/1", "23/1", "6/2", "13/2", "20/2", "27/2", "13/3", "20/3", "27/3", "3/4", "10/4", "17/4"]}, "D-LEC (8785)": {"startTimes": ["14:30"], "endTimes": ["16:15"], "days": [5], "locations": ["Lee Shau Kee Building LT4"], "instructors": ["Miss CHEUNG Ching Man"], "meetingDates": ["10/1", "17/1", "24/1", "7/2", "14/2", "21/2", "28/2", "14/3", "21/3", "28/3", "11/4"]}}}, "assessments": {"Essays": "0", "Essay test or exam": "0"}}, {"code": "2234", "title": "Imperial and Religious Power: The Transformation of Chinese Society and Culture", "career": "Undergraduate", "units": "2.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Office of University GE", "requirements": "Not for History Majors.\nCo-requisite: UGFH1000, UGFN1000 or UGFN1001 (only applicable to students admitted to the 4-year curriculum)", "description": "Demonstrating the history of changing relations between politics and religions in China, this course aims to analyse the historical process wherein important policies took form, which changed the entire socio-political structure. In class, students will be introduced to the ideology-religion-politics relationship in traditional China. Furthermore, they will learn how to explore and appreciate Chinese society and culture through a historical perspective.", "outcome": " By the end of the course, students will be able to:   A) understand the basic ideas about Chinese religious culture and concepts; B) identify the essential characteristics and development of Chinese political traditions; C) critically analyse the issues regarding Chinese political traditions and religious culture.", "syllabus": " 第一部份：理論與課題 　　導論 　　中國傳統的世界觀 第二部份：中古中國 　　儒學與漢代的政治體系 　　東漢道教的教區與官吏 　　唐佛教的治國意識形態 　　宋敕封、權力與祭祀政策 第三部份：晚期帝制中國 　　明宗教、祭典與國家規範 　　明嘉靖「大禮儀」之爭  　　明清國家與社會：神明的「標準化」 　　明清鄉土社會的神、鬼、祖先 第四部份：近代中國 　　 清末民初知識份子與反迷信運動        民國時期的典禮、象徵與公民的打造 　　總結  ", "required_readings": " 導論 Lagerwey, John, China: a religious state, Hong Kong: Hong Kong University Press, 2010, pp. 1-18. Feuchtwang, Stephan, “History, identification and belief,” in Popular Religion in China: The Imperial Metaphor, Richmond: Curzon, 2001, pp. 1-26. 鄭振滿、陳春聲，＜導論＞，《民間信仰與社會空間》，福建：福建人民出版社，2004年，第1-9頁。 中國傳統的世界觀 葛兆光：《中國古代社會與文化十講》，北京：清華大學出版社，2002年，第1-26頁。 葛兆光：《宅兹中國：重建有關「中国」的歷史論述》，台北市：聯經出版事業股份有限公司，2011年，第67-133頁。 儒學與漢代的政治體系 顧頡剛：《秦漢的方士與儒生》，上海：上海古籍出版社，2005年，第1-53頁。 Seidel, Anna, “Traces of Han Religion in Funerary Texts Found in Tombs,” in Akizuki Kan’ei, ed., Dokyō to shūkyō bunka, Tōkyō: Hirakawa Shuppansha, 1987, pp. 21-57. 東漢道教的教區與官吏 傅飛嵐著，呂鵬志譯，〈二十四治和早期天師道的空間與科儀結構〉，載《法國漢學》，第七輯，北京市：中華書局，2002年，第212－253頁。 Lagerwey, John,“Zhengyi Registers,” Journal of Chinese Studies Special Issue , 2005, pp. 35-88. 唐佛教的治國意識形態 古正美：《從天王傳統到佛王傳統：中國中世佛教治國意識形態研究》，臺北市：商周出版社，2003年，第223-324。 Yü Chün-fang, Kuan-yin : the Chinese Transformation of Avalokiteśvara, New York : Columbia University Press, 2001, pp. 151-222. 宋敕封、權力與祭祀政策 韓森著、包偉民譯：《變遷之神：南宋時期的民間信仰》，杭州：浙江人民出版社，1999年，第27-44、76-101、160-167頁。 Benn, Charles, “Taoism as Ideology in the Reign of Emperor Hsuan-tsung(712-755),”in D. Chappell, ed., Buddhist and Taoist Practice in Medieval Chinese Society, Asian Studies at Hawaii 34, Honolulu: University of Hawaii Press, 1987, pp. 127-145. 明宗教、祭典與國家規範 蔡志祥，〈城隍、厲鬼與明清國家規範〉，載林緯毅編：《城隍信仰》，新加坡：新加坡韮菜芭城隍廟，2008年，第49-63頁。 濱島敦俊著、朱海濱譯，〈明朝的祭祀政策與鄉村社會〉，《明清江南農村社會與民間信仰》，廈門：廈門大學出版社，2008年，第103-168頁。 明嘉靖「大禮儀」之爭 Chan Wing-Hoi, “Ordination names in Hakka genealogies: a religious practice and its decline,” in David Faure and Helen F. Siu eds., Down to Earth: the Territorial Bond in South China, Stanford, Calif.: Stanford University Press, 1995, pp. 65-82. 科大衛，〈祠堂與家廟：從宋末到明中葉宗族禮儀的演變〉，《歷史人類學學刊》，第1卷2期，2003年，第1-20頁。 科大衛、劉志偉，〈宗族與地方社會的國家認同〉，《歷史研究》，2000年第3期，第3-14頁。 明清國家與社會：神明的「標準化」 Watson, James L., “Standardizing the Gods: the Promotion of T’ien Hou (“Empress of Heaven”) along the South China Coast, 960—1960,” in David Johnson, Andrew J. Nathan, and Evelyn S. Rawski eds., Popular Culture in Late Imperial China, Berkeley: University of California Press, 1985, pp. 292-324. 劉志偉，〈神明的正統性與地方化﹕關於珠江三角洲北帝崇拜的一個解釋〉，《中山大學史學集刊》，第二輯，廣州：廣東人民出版社，1994年，第107-125頁。 明清鄉土社會的神、鬼、祖先 Wolf, Arthur P., “Gods, ghosts and ancestors”, in Arthur Wolf ed., Religion and Ritual in Chinese Society, Stanford: Stanford University Press, 1974, pp. 131-182. 蕭鳳霞 ，〈傳統的循環再生：小欖菊花會的文化、歷史與政治經濟〉，《歷史人類學學刊》，第1卷第1期， 2003年，第99-131頁。 蔡志祥：《打醮：香港的節日和地域社會》，香港：三聯書店 (香港) 有限公司，2000年，第89-110頁。 清末民初知識份子與反迷信運動 潘淑華，＜建構政權, 解構迷信—1929年至1930年廣州市風俗改革委員會的個案研究＞，載鄭振滿，陳春聲主編：《民間信仰與社會空間》，福州市：福建人民出版社，2003年，第108-122頁。 Duara, Prasenjit, “Knowledge and power in the discourse of modernity: the campaign against popular religion in early twentieth century China,” The Journal of Asian Studies, 50:1, 1991, pp. 67-83. 民國時期的典禮、象徵與公民的打造 Harrison, Henrietta, The Making of the Republican Citizen: Political Ceremonies and Symbols in China, 1911-1929, Oxford; New York: Oxford University Press, 2000, pp. 14-132. 總結", "recommended_readings": "", "terms": {"2024-25 Term 2": {"--LEC (4798)": {"startTimes": ["14:30"], "endTimes": ["16:15"], "days": [3], "locations": ["Lee Shau Kee Building LT4"], "instructors": ["Dr. FOK Yeung Yeung"], "meetingDates": ["8/1", "15/1", "22/1", "5/2", "12/2", "19/2", "26/2", "12/3", "19/3", "26/3", "2/4", "9/4", "16/4"]}}}, "assessments": {"Essays": "0", "Essay test or exam": "0"}}, {"code": "2236", "title": "Introduction to Classical History Books", "career": "Undergraduate", "units": "2.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Office of University GE", "requirements": "Not for History Majors. \nCo-requisite: UGFH1000 or UGFN1000 (only applicable to students admitted to the 4-year curriculum)", "description": "This course introduces four classical history books of ancient China: Records of the Grand Historian (Shiji), Standard History of the Han (Hanshu), Records of the Three Kingdoms (Sanguozhi) and Comprehensive Mirror for Aid in Government (Zizhi tongjian). It particularly analyses the historical contexts, purposes, genres, compilations, historical thoughts of these history books and the characteristics of the Chinese culture shown in them. Students are given close guidance to study the typical writings in these historical books to comprehend, analyse and appraise the essence of traditional Chinese historiography as well as the evolution and characteristics of history, politics, economics and society in the Chinese cultural heritage from multi-disciplinary and comparative perspectives, and reflect on the intellectual and cultural insights of these traditions into the contemporary society and life.", "outcome": " After completing this course, students are expected to be able to identify, comprehend and critically appraise through intellectual dialogue : 1. the essential features of the traditional Chinese historiography, which is an important part of the Chinese culture; 2. evolution and characteristics of these aspects of the Chinese cultural heritage in the historical contexts; 3. intellectual and cultural insights of these traditional aspects into the modern society and life as well as their close and meaningful relevance; Students are also expected to: 4. develop a broad historical perspective for reflecting on perennial issues and concern for various situations of human existence; 5. broaden the intellectual perspective for mastering the important ideological trends of the contemporary world and understanding issues related to their life and society, and addressing unfamiliar problems of today with the application of historical wisdom; and 6. master the ability to analyse and compare historical documents in depth and articulate the related history and its significance in writing.   同學修畢本科之後，當能通過智性的對話學會辨認，理解並批判地評鑑： 1. 作為中華文化重要部分的中國傳統史學的主要特徵； 2. 在歷史脈絡下中華文化傳承的演變及特色； 3. 傳統帶給現代社會和生活的智性的、文化的啟示，以及傳統與現代之間密切的、富意義的關聯； 4. 拓展歷史的視野，反思歷久彌新的課題，關注各種人類處境； 5. 擴展智性的視野，掌握當今世界的重要思潮，明瞭自身的人生和社會問題，運用歷史智慧處理今天的種種陌生問題； 6. 掌握深度分析和比較歷史文獻和書面表述歷史及其意義的能力。", "syllabus": " 1. Introduction to the Four Classical History Books   A. In Dialogue with Records of the Grand Historian (Shiji)   2. Historical Conception and Political Thoughts in Shiji 3. Economic and Social Thoughts in Shiji 4. Emperors, Empresses, Courtiers and Heroes: Analysis of Exemplary Persons in Shiji   B. In Dialogue with Standard History of the Han (Hanshu)   5. Academic Thoughts and Legal Principles in Hanshu 6. Order of Nature and Humanistic Spirit in Hanshu 7. A Comparative Analysis of Biographies in Shiji and Hanshu: Generals Xiang Yu and Li Guang   C. In Dialogue with Records of the Three Kingdoms (Sanguozhi)   8. Strategic Thoughts and Conciliation Strategies in Sanguozhi 9. Worlds of Talented Men and Women in Sanguozhi 10. Thoughts of Reclusion, Medicine, Physiognomy and Divination in Sanguozhi   D. In Dialogue with Comprehensive Mirror for Aid in Government (Zizhi tongjian)   11. Concepts of History and Nation in Zizhi tongjian 12. Crisis Management and National Defence Strategies in Zizhi tongjian 13. A Comparative Analysis of a Historical Event in Sanguozhi and Zizhi tongjian: Battle of Red Cliff   14. Conclusion       一. 傳承革新：四史概論   壹. 與《史記》對話   二. 天人通變：《史記》之歷史觀與政治思想 三. 善者因之：《史記》之經濟思想與社會思想 四. 帝后臣俠：《史記》典範人物評析   貳. 與《漢書》對話   五. 藝文刑法：《漢書》之學術思想與法律原則 六. 天人之和：《漢書》之自然秩序及人文精神 七. 史漢得失：《史記》與《漢書》人物傳記比較分析—項羽與李廣   參. 與《三國志》對話   八. 亂世英雄：《三國志》之策略思想與懷柔方略 九. 才士美人：《三國志》之人才世界與婦女世界 十. 隱世方技：《三國志》之隱逸、醫療、相術及卜筮思想   肆. 與《資治通鑑》對話   十一. 君道天意：《資治通鑑》之歷史觀與國族觀 十二. 智勢變御：《資治通鑑》之危機管理與國防策略 十三. 志鑑得失：《三國志》與《資治通鑑》史事記載比較分析—赤壁之戰   十四. 總結", "required_readings": " Lecture 1 杜維運：《中國史學史》第一冊(臺北巿：三民書局，1993)，頁171-180，258-274；第二冊(臺北巿：三民書局，1998)，頁92-101；第三冊(臺北巿：三民書局，2004)，頁79-85。(共43頁)   Lecture 2 《漢書》(北京中華書局本)卷六十二〈司馬遷傳〉，頁2735；《史記》(北京中華書局本)卷四〈周本紀〉，卷八〈高祖本紀〉十二年，卷十五〈六國年表〉，卷十七〈漢興以來諸候王表〉，卷二十六〈曆書〉，卷二十七〈天官書〉，卷二十八〈封禪書〉，卷三十〈平準書〉，卷一百一十二〈平津侯主父列傳〉，卷一百二十二〈酷吏列傳〉，卷一百二十九〈貨殖列傳〉，卷一百三十〈太史公自序〉，頁112，393-394，686，801，803，1258，1351，1366，1378，1381，1420，1442，2954，3154，3261，3304-3319。(共33頁)   Lecture 3 《史記》(北京中華書局本)卷一〈五帝本紀〉，卷八〈高祖本紀〉，卷九〈呂太后本紀〉，卷十六〈秦楚之際月表〉，卷三十〈平準書〉，卷一百二十四〈游俠列傳〉，卷一百二十九〈貨殖列傳〉，頁15，32-33，35，46，391，395-396，759，1417-1421，1431-1432，3181-3189，3253-3256，3270-3273。(共33頁)   Lecture 4 《史記》(北京中華書局本)卷六〈秦始皇本紀〉，卷九〈呂太后本紀〉，卷一百二十二〈酷吏列傳〉，卷一百二十四〈游俠列傳〉，頁235-236，283，291，395-412，3137-3144，3185-3189。(共35頁)   Lecture 5 《漢書》(北京中華書局本)卷二十三〈刑法志〉，卷三十〈藝文志〉，卷八十八〈儒林傳〉，頁1079，1096-1112，1701，3589-3597，3620-3621。(共29頁)   Lecture 6 《漢書》(北京中華書局本)卷二十〈古今人表〉，卷二十六〈天文志〉，卷二十八下〈地理志下〉，頁861，924-951，1273，1315-1347，1639-1641。(共33頁)   Lecture 7 《史記》(北京中華書局本)卷七〈項羽本紀〉，卷一百九〈李將軍列傳〉，頁295-296，338-339，2867-2878；《漢書》(北京中華書局本)卷三十一〈陳勝項籍傳〉，卷五十四〈李廣蘇建傳〉，頁1795-1769，1826，2439-2450。(共31頁)   Lecture 8 《三國志》(北京中華書局本)卷一〈魏書・武帝紀〉，卷三十五〈蜀書・諸葛亮傳〉，卷三十六〈關羽傳〉、〈張飛傳〉，卷四十七〈吳書・吳主傳〉及附裴松之注，頁55，911-927，939-944，1115-1123。(共33頁)   Lecture 9 《三國志》(北京中華書局本)卷一〈魏書・武帝紀〉，卷四〈魏書・三少帝紀〉，卷五〈魏書・后妃傳〉，卷二十一〈魏書・王衛二劉傅傳〉，卷二十三〈魏書・和常楊杜趙裴傳〉，卷二十七〈魏書・徐胡二王傳〉，卷二十八〈魏書・王毌丘諸葛鄧鍾傳〉，卷三十二〈蜀書・先主傳〉，卷三十三〈蜀書・後主傳〉，卷三十五〈蜀書・諸葛亮傳〉，卷三十六〈蜀書・關張馬黃趙傳〉，卷三十九〈蜀書・董劉馬陳董呂傳〉，卷四十〈蜀書・廖立傳〉，卷四十二〈蜀書・杜周杜許孟來尹李譙郤傳〉，卷四十三〈蜀書・黃李呂馬王張傳〉，卷四十七〈吳書・吳主傳〉，卷五十六〈吳書・朱治朱然呂範朱桓傳〉及裴松之《三國志注》，頁55，154，155-169，629，676，756，796-797，892，902-903，912-913，951，989，997-998，1042，1055，1149，1316。(共35頁)   Lecture 10 《三國志》(北京中華書局本)卷二十一〈魏書・阮瑀附子阮籍傳、嵇康傳〉，卷二十九〈魏書・方技傳》〈華佗傳並附吳普傳、樊阿傳〉、〈朱建平傳〉、〈周宣傳〉、〈管輅傳〉及附裴松之注，頁604-606，799-805，808-830。(共32頁)   Lecture 11 《資治通鑑》(北京中華書局本)卷一周威烈王二十三年條臣光曰，卷二周顯王十年、四十八年條，卷七始皇帝二十五年，卷九漢高帝元年條，卷十三漢文帝前二年條，卷十七漢孝武皇帝建元元年條，卷二十一漢孝武皇帝太初元年條，卷三十一漢孝成皇帝永始二年條，卷五十漢孝安皇帝元初六年條，卷一百三十八齊武皇帝下永明十一年條，卷一百五十九梁武皇帝大同十一年條，卷一百七十九隋文皇帝仁壽二年條，卷二百一十二唐玄宗開元十二年條，卷二百一十三唐玄宗開元十四年條，卷二百二十八唐德宗建中四年條，頁14-15，48-49，78-79，231-232，298，448-452，549-556，700，1010-1011，1602，4338，4934-4935，5593-5594，6774-6775，6759，7362-7365。(共38頁)   Lecture 12 《資治通鑑》(北京中華書局本)卷二周顯王十年、二十八年條 ，卷十漢高帝三年條，卷二十三漢孝昭皇帝元鳳四年條，卷二十七漢孝宣皇帝甘露二年條，卷四十七漢孝章皇帝章和二年條，卷四十八漢孝和皇帝永元四年條，卷五十六漢孝靈皇帝建寧二年、熹平六年條，卷六十七漢孝獻皇帝建安二十一年條，卷六十九魏文皇帝黃初三年條，卷九十八晉穆皇帝永和五年條，卷一百四十八梁高祖天監十七年條，卷一百八十三隋恭皇帝義寧元年條，卷一百八十八唐高祖武德三年條，卷一百九十唐高祖武德五年條，卷一百九十六唐太宗貞觀十六年、卷一百九十七貞觀十七年條，卷二百二十六唐德宗建中元年條，頁46-48，58-59，327-329，772-773，885-886，1517-1518，1536-1537，1816-1817，1842-1843，2146，2200-2203，3092-3093，4634，5719-5720，5881，5954，6178，6199-6202，7285。(共38頁)   Lecture 13 《三國志》(北京中華書局本)卷一〈魏書・武帝紀〉、卷十〈魏書・賈詡傳〉、卷三十二〈蜀書・先主傳〉、卷三十五〈蜀書・諸葛亮傳〉、卷四十七〈吳書・吳主傳〉、卷五十四〈吳書・周瑜傳〉、同卷〈吳書・魯肅傳〉及諸傳所附裴松之注，頁30-31，330，877-878，914-916，1117-1118，1261-1263，1269-1270；《資治通鑑》(北京中華書局本)卷六十五建安十三年七月至十二月條及附《通鑑考異》，頁2080-2095。(共31頁)", "recommended_readings": " 1. 司馬遷撰，裴駰集解，司馬貞索隱，張守節正義：《史記》。北京：中華書局，1959。 2. 班固撰，顔師古注：《漢書》。北京：中華書局，1962。 3. 陳壽撰，裴松之注：《三國志》。北京：中華書局，1959。 4. 司馬光編著，胡三省音注：《資治通鑑》。北京：中華書局，1956。 5. 杜維運：《中國史學史》第一冊。臺北巿：三民書局，1993。 6. 杜維運：《中國史學史》第二冊。臺北巿：三民書局，1998。 7. 杜維運：《中國史學史》第三冊。臺北巿：三民書局，2004。", "terms": {"2024-25 Term 2": {"--LEC (6370)": {"startTimes": ["10:30"], "endTimes": ["12:15"], "days": [2], "locations": ["Science Centre L1"], "instructors": ["Dr. SIU Kam Wah"], "meetingDates": ["7/1", "14/1", "21/1", "4/2", "11/2", "18/2", "25/2", "11/3", "18/3", "25/3", "1/4", "8/4", "15/4"]}}}, "assessments": {"Essays": "65", "Others": "10", "Selected response test or exam": "25"}}, {"code": "2288", "title": "Understanding China: Tradition and Modernity", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "Lecture\nInteractive Tutorial", "campus": "Main Campus", "academic_group": "Office of University GE", "requirements": "Co-requisite: Any course with \"UGFH\" or \"UGFN\" as prefix (only applicable to students admitted to the 4-year curriculum)", "description": "This course aims to provide a concise introduction to the rich and complex history of China, and how this historical heritage finds manifestation in the lives and thoughts of Chinese people today. Modelled upon and enriching UGCP1001 “Understanding China”, the course will focus on five themes: intellectual foundations, historical epochs, modernisation, economic development, and science and technology. It will explore the link between tradition and modernity for each theme, drawing on selected works on China from philosophy, history, sociology, economics, and science. Students will be introduced to major events, interpretations, and perspectives pertaining to China’s transformations in the past and present, and will be guided to reflect on contemporary developments in China through lectures, readings, and exploratory projects.", "outcome": " Upon the completion of the course, students will be able to –  recognise the main intellectual foundations that have shaped the people, culture, and society in the Chinese civilisation;  identify the key historical currents that forged and defined China’s transformations;  describe the core characteristics of China’s pathways towards modernity and modernisation;  understand the major economic transformations in modern China and the challenges it faces in the context of global economy;  understand the development of science and technology in China from the perspectives of cultural, societal and institutional change;  achieve a deeper understanding of the role of China’s tradition in shaping modern and contemporary China;  approach selected issues pertaining to China’s past and present from multidisciplinary perspectives;  gain a deepened appreciation of the grandeur and complexity of China.", "syllabus": " Weeks 1–2      Perspectives on China  The sessions explore the origins of the common perception of China as a unified multi-ethnic and multi-cultural socio-political entity, and anticipate the general challenges in understanding its grandeur, complexity and diversity. Week 1  Origins of Chinese civilisation  Ethnic diversity in China  Shifting borderlands of China Week 2  Beginnings of Chinese state and nation  Varied perspectives on China   Weeks 3–4      Intellectual Foundations The sessions explore the systems of thoughts which have shaped the people, society and culture of China in history and remain influential today. Week 3  Confucianism: The Pre-Qin Era to the Han Dynasty  Alternatives to Confucianism: Daoism between the Pre-Qin Era to the Northern and the Southern Dynasties  Revival of Confucianism: Neo-Confucianism in the Song and Ming Dynasties and beyond Week 4  Reformist thoughts in the Late Qing period  Challenges to tradition: The May Fourth Movement  Marxism: its adaptation and continuing development in China    Weeks 5–6      Historical Epochs The sessions explore the major historical currents that motivated social transformations and institutional changes in China, as well as China’s encounters with other civilisations. Week 5     The pursuit of unification since the Qin Dynasty and the establishment of the unitary state  The imperial examination system since the Sui Dynasty Week 6   Cultural encounters with other civilisations in Chinese history  “The Century of Humiliation”: China’s responses to imperialist aggressions since the First Opium War   Weeks 7–8      Modernisation The sessions explore China’s progress towards modernisation and the emergence of its characteristic traits as a modern state as shown in defining periods from the mid-19th century onwards. Week 7  The late-Qing reforms: sources, consequences, and the awakening of the masses  New Culture Movement: the emergence of the new vernacular Chinese language, avant-garde movements, mass culture movements, and its legacies today   Institutional changes in the early Republican era Week 8  Concepts of “modernity” and “modernisation”, and their applicability to the case of China  Globalisation and cultural China   Weeks 9–10    Economy The sessions explore some of the core characteristics of China’s economy. Week 9  Land, property and the agrarian society in traditional China   Demographic characteristics of the Chinese population Week 10  Land reform, labour, and social mobility   Development in infrastructures from the twentieth century onwards  Historical interpretations of recent economic strategies: Open-up and Reform and Belt and Road Initiative  Poverty alleviation  Sustainable development and the construction of “ecological civilisation”   Weeks 11–12      Science and Technology  The sessions explore the important achievements in science and technology in China’s past and present. Week 11  Major advances in science and technology from the Pre-Qin Era to the Song Dynasty  The scientific inventions and thoughts introduced by Western missionaries in the Ming and Qing Dynasties  Cross-cultural transmission of scientific concepts in China Week 12  The rise of scientific thinking and educational institution from the early 20th century onwards  Institutionalisation of science after 1949    Recent policies and initiatives to advance science and technology   Week 13         Connecting Tradition and Modernity in Understanding China  The concluding session extends the course’s discussion with a focus on the connection between tradition and modernity with respect to the five themes.  Manifestations of intellectual traditions in the present-day China  China in the history of the world  China in the post-modern era  Prospects of China in economy and science and technology  Global perspectives on China", "required_readings": " [The English readings are either translations of the Chinese readings or are comparable to the latter in content and substance.] [Readings recommended in UGCP1001 “Understanding China” are marked with *] Weeks 1–2   Perspectives on China  Week 1  費孝通，1989，〈中華民族的多元一體格局〉，載於費孝通等著，《中華民族多元一體格局》 ，1–36頁，北京︰中央民族學院出版社。[Fei, Xiaotong. 2017. The formation and development of the Chinese nation with multi-ethnic groups. International Journal of Anthropology and Ethology. 1, Article number 1. https://doi.org/10.1186/s41257-017-0001-z.] Week 2  葛兆光，2014，〈導論：有關「中國」的歷史形成與認同困境〉，《何為中國？疆域、民族、文化與歷史》，1–32頁，香港：牛津大學出版社。[Ge, Zhaoguang; Michael Gibbs Hill trans. 2018. “Introduction: On the Historical Formation of “China” and the Dilemma of Chinese Identity”. What is China: Territory, Ethnicity, Culture and History, 1–27. Cambridge, MA; London, England: The Belknap Press of Harvard University Press.]   Weeks 3–4  Intellectual Foundations Week 3             Schwartz, Benjamin I. 1985. Excerpt of “Confucius: The Vision of the Analects”. The World of Thought in Ancient China, 67–117. Harvard, MA: Harvard University Press, with sections on Li, Jen, learning, family, and government. [史華慈著，程鋼譯，2004， 〈孔子︰《論語》的通見〉節錄，載於《古代中國的思想世界》，68–115頁，南京︰江蘇人民出版社。] Week 4             Levenson, Joseph R. 1959. Excerpts of “The Breakdown of the Confucian Worlds” and “The Substitute for Tradition”. Liang Ch’i-ch’ao and the Mind of Modern China, 34–51 and 84–128. Cambridge, MA: Harvard University Press.  [列文森著，盛韻譯，2023，〈儒家世界的崩塌〉及〈傳統的替代物〉節錄，載於《梁啟超與近代中國思想》，35–52頁及87–133頁，香港︰香港中文大學出版社。]   Weeks 5–6     Historical Epochs Week 5             Su, Li. 2018. “The Constitution of the Territory and Politics of a Large State”. The Constitution of Ancient China, edited by Zhang Yongle and Daniel A. Bell, translated by Edmund Ryden, 33–65. Princeton, NJ: Princeton University Press. [蘇力，2017，〈第五章︰疆域管控與行政區劃〉，載於《大國憲制︰歷史中國的制度構成》，頁223–267，北京︰北京大學出版社。  * Elman, Benjamin A. 2000. A Cultural History of Civil Examinations in Late Imperial China, 5–19, 25–29, 38–46. Berkeley, CA: University of California Press. Week 6             * Fairbank, John K. and Merle Goldman. 2006. Excerpts of “Early Modernization and the Decline of Qing Power”, “The Republican Revolution 1901–1916”, and “The Quest for a Chinese Civil Society”. China: A New History. Second Enlarged Edition, 217–232, 241–253, and 257–262. Cambridge, MA; London, England: Belknap Press of Harvard University Press.  * Lewis, Mark Edward. 2021. Excerpt of “The Outer World”. China's Cosmopolitan Empire: The Tang Dynasty,145–172. Cambridge, MA: Harvard University Press.   Weeks 7–8      Modernisation Week 7  * 金耀基，2013，〈中國的現代化〉，載於《中國現代化的終極願景：金耀基自選集》， 3–30頁，上海：上海人民出版社。  * 金耀基，2013，〈中國現代文明秩序的建構——論中國的「現代化」與現代性〉，載於《中國社會與文化》，224–266頁，香港：牛津大學出版社。[King, Ambrose Y. C.. 2018. “‘Modernization’ and ‘Modernity’: The Construction of a Modern Chinese Civilizational Order”. China’s Great Transformation: Selected Essays on Confucianism, Modernization, and Democracy, 111–128. Hong Kong: The Chinese University of Hong Kong Press.]   Week 8  Lee, Leo Ou-fan. 1990. “In Search of Modernity: Some reflections on a New Mode of Consciousness in Twentieth-Century Chinese History and Literature”. Ideas across Cultures: Essays on Chinese Thought in Honor of Benjamin L. Schwartz, edited by Paul A. Cohen and Merle Goldman, 109–135. Cambridge, MA: Harvard University Asia Centre; Harvard University. [李歐梵，1999， 〈當代中國文化的現代性和後現代性〉，《文學評論》， 1999年第5期，129–139頁。]   Weeks 9–10    Economy Week 9  Lee, James and Wang Feng. 1999. “Subsistence” and “Society”. One Quarter of Humanity: Malthusian Mythology and Chinese Realities, 1700–2000, 27–41 and 123–136. Cambridge, MA: Harvard University Press. [李中清、王豐著，陳衛、姚遠譯，2000，〈生存〉及〈社會〉， 載於《人類的四分之一：馬爾薩斯的神話與中國的現實（1700–2000）》，39–63頁及179–201頁，北京：三聯書店。] Week 10  劉遵義，2022，〈中國經濟展望〉，《二十一世紀》，總193期，36–47頁。[* Lau, Lawrence J. 2022. “Public Goods Provision and Chinese Economic Development”. China and the World: Ancient and Modern Silk Road, Vol. 5, No. 1, 2250002. (34 pages)]   Weeks 11–12  Science and Technology Week 11  Elman, Benjamin A. 2006. Excerpts of “The Jesuit Legacy”, “The Rise of Imperial Chinese Manufacturing and Trade”, “Science and the Protestant Mission”, “Government Arsenals Spur New Technologies”, and “The Displacement of Traditional Chinese Science and Medicine”. A Cultural History of Modern Science in China, 16–34, 68–75, 101–111, 165–172, and 198–204. Cambridge, MA: Harvard University Press. [艾爾曼著，王紅霞等譯，2019，〈耶穌會士的遺產〉、〈中華帝國製造業和貿易的興起〉、〈科學與基督教傳教活動〉、〈官辦兵工廠激勵新技術〉及〈中國傳統科學和醫學的轉變〉，載於《中國近代科學的文化史》，16–33頁、 64–70頁、 94–106頁、156–164頁及 188–194頁，上海︰上海古籍出版社。]  Needham, Joseph. 1969. Excerpt of “Poverties and Triumphs of the Chinese Scientific Tradition”. The Grand Titration: Science and Society in East and West, 24–41. London: George Allen & Unwin Ltd.. [李約瑟著，張卜天譯，2016，〈中國科學傳統的不足與成就〉，載於《文明的滴定︰東西方的科學與社會》，13–28頁， 北京︰商務印書館。] Week 12           Dolla, Varaprasad S. 2015. “Science and Technology in Contemporary China: The Changing Contours”. Science and Technology in Contemporary China: Interrogating Policies and Progress, 42–86. Cambridge, MA: Cambridge University Press.  Ho, Yi Kai, ed. 2015. “Rethinking the 20th Century Denigration of Traditional Chinese Science and Medicine in the 21st Century.” Science in China, 1600-1900: Essays by Benjamin A. Elman, 228–247. Singapore; Hackensack, NJ: World Century.   Week 13   Connecting Tradition and Modernity in Understanding China  Wang, Gungwu. 2013. “China in World History” and “Tianxia. Perspectives from Outside of China”. Renewal: The Chinese State and the New Global History, 1–27 and 131–152. Hong Kong: The Chinese University of Hong Kong Press. [王賡武著，黃濤譯，2016，〈世界歷史中的中國〉及〈天下——境外看中華〉，載於《更新中國：國家與全球史》，1–32頁及 147–170頁，香港：商務印書館。]", "recommended_readings": " [Readings recommended in UGCP1001 “Understanding China” are marked with *] Weeks 1–2      Perspectives on China   Clegg, Jenny. 2009. China’s Global Strategy: Towards a Multipolar World. London; New York, NY: Pluto Press. [珍妮・克萊格著，葛雪蕾、洪漫、李莎譯，2010，《中國的全球戰略：走向一個多極世界》，北京：新華出版社。]  Feuchtwang, Stephan and Hans Steinmuller. 2017. China in Comparative Perspective. New Jersey: World Scientific.  Huang, Ray. 1988. China: A Macro History. Armonk, NY; London, England: M. E. Sharpe, INC.  王明珂，2006，《華夏邊緣：歷史記憶與族群認同》，北京：社會科學文獻出版社。   Weeks 3–4      Intellectual Foundations   Chan, Wing-tsit, trans and comp. 1963.  A Source Book in Chinese Philosophy. Princeton, NJ: Princeton University Press. [陳榮捷，1993，《中國哲學文獻選編》，臺北︰巨流圖書公司。]  Chow, Tse-Tsung. 1960. May Fourth Movement: Intellectual Revolution in Modern China. Cambridge, MA: Harvard University Press. [周策縱著，陳永明、張靜等譯，2016，《五四運動史︰現代中國的知識革命，北京︰世界圖書出版公司。]  Dirlik, Arif. 2005. Marxism in the Chinese Revolution. Lanham, Md.: Rowman & Littlefield Publishers, 75–122.  Levenson, Joseph Richmond. 1968. Confucian China and Its Modern Fate: A Trilogy. Berkeley, CA: University of California Press. [列文森著，劉文楠譯，2023，《儒家中國及其現代命運︰三部曲》，香港︰香港中文大學出版社。]  葛兆光，2023，〈家國秩序：國家、社會與儒家〉，載於《古代中國文化講義》。93–126頁，香港：商務印書館。  汪暉，2004，《現代中國思想的興起》（上卷及下卷），北京︰三聯書店。[Wang, Hui. Edited by Michael Gibbs Hill. 2023. The Rise of Modern Chinese Thought. Cambridge, MA: Harvard University Press.]   Weeks 5–6      Historical Epochs  * Auyang, Sunny Y. 2014. The Dragon and the Eagle: The Rise and Fall of the Chinese and Roman Empires. Armonk, New York: M.E. Sharpe.  Hansen, Valerie. 2000. The Open Empire: A History of China to 1600. New York: Norton [芮樂偉・韓森著，梁侃、鄒勁風譯，2007，《開放的帝國︰1600年前的中國歷史》，南京︰江蘇人民出版社。]  Hsiung, James Chieh. 2012. “Dawn of the Modern Age: Paradox of China’s Response to the West”. China into Its Second Rise: Myths, Puzzles, Paradoxes, and Challenge to Theory, 71–91. Singapore: World Scientific Publishing Company.  * Li, Xiaobing and Xiansheng Tian, eds. 2014. Evolution of Power: China’s Struggles, Survival, and Success. Lexington, Maryland: Lexington Books.  * Liu, Xinru. 2010. The Silk Road in World History. New York: Oxford University Press.  Teng, Ssu-yu and John K. Fairbank. 1963. China’s Response to the West: A Documentary Survey, 1839–1923. New York: Atheneum.  葛劍雄，2013，〈分合的標準〉，載於《統一與分裂：中國歷史的啟示》，67–83頁，北京：商務印書館。  趙汀陽，2016，〈內含天下的中國〉，載於《惠此中國︰作為一個神性概念的中國》，51–90頁，北京︰中信出版集團。   Weeks 7–8      Modernisation  * Eisenstadt, S. N. 2000. Multiple Modernities in an Age of Globalization. Truman Institute Reprints (n.d). Jerusalem: The Hebrew University.  Fairbank, John K. 1989. China: Tradition and Transformation. Boston, MA: Houghton Mifflin Co. [費正清著，張沛譯，2002，《中國：傳統與變遷》，北京：世界知識出版社。]  Kuhn, Philip A. 2022. Origins of the Modern Chinese State. Stanford, CA: Stanford University Press. [孔飛力著，陳兼、陳之宏譯，2014，《中國現代國家的起源》，香港：中文大學出版社。]  Spence, Jonathan D.. 2013. The Search for Modern China (Third edition). New York: W.W. Norton & Company. [史景遷著，溫洽溢、孟令偉、陳榮彬譯，2019，《追尋現代中國：最後的王朝》，台北：時代文化。]  余英時，2023，《從價值系統看中國文化的現代意義》（第三版），台北：時代文化。  甘陽，2014，《通三統》， 北京：三聯書店。   Weeks 9–10    Economy  Lin, Weiqiang, Johan Lindquist, Biao Xiang, and Brenda S. A. Yeoh. 2017. “Migration infrastructures and the product of migrant mobilities.” Mobilities. 12(2), 167–174. DOI: 10.1080/17450101.2017.1292770.  Naughton, Barry. 2007. The Chinese Economy: transitions and growth. Cambridge, MA: MIT Press.  Pan, Jiahua, Gao Shiji, Li Qingrui, Wang Jinnan, Wu Dekai, and Huang Chengliang eds. 2021. Beautiful China: 70 Years Since 1949 and 70 People’s Views on Eco-civilization Construction. Singapore: Springer Nature.  Vogel, Ezra F. 1989. One Step Ahead in China: Guangdong under Reform. Cambridge, MA: Harvard University Press. [傅高義著，凌可風、丁安雲譯，1991，《先行一步：改革中的廣東》，廣州：廣東人民出版社。]  Xiang, Biao. 2020. “The gyroscope-like economy, hypermobility, structural imbalance and pandemic governance in China”. Inter-Asia Cultural Studies. 21(4), 521–532. DOI: 10.1080/14649373.2020.1832305.  費孝通，1948，《鄉土中國》，上海：觀察社。  梁晨、董潔、任韵竹、李中清著，2017，〈江山代有才人出——中國教育精英的來源與轉變（1865–2014）〉，《社會學研究》，2017（30），48–70頁。  梁晨、李中清等著，2012，〈無聲的革命：北京大學與蘇州大學學生社會來源調查（1952-2002）〉，《中國社會科學》， 2012 （1）， 98–118頁。  張占斌等著，2024，〈中國經濟發展的歷史演進〉及〈中國經濟發展遠景展望〉，載於《當代中國經濟》，2–28及 244–270頁，香港︰中華書局。    Weeks 11–12    Science and Technology in China  Fu, Xiaolan, Bruce McKern, and Jin Chen, eds. 2021. The Oxford Handbook of China Innovation. New York: Oxford University Press.  Saich, Tony. 1989. China’s Science Policy in the 80s. Atlantic Highlands, NJ.: Humanities Press International, Inc.  Tsu, Jing and Benjamin A. Elman, eds. 2014. Science and Technology in Modern China, 1880s–1940s. Leiden: Brill.  潘吉星，1993，《中外科學之交流》，香港︰中文大學出版社。  邢兆良，2001，《中國傳統科學思想研究》， 南昌：江西人民出版社。   Week 13       Connecting Tradition and Modernity in Understanding China  Willis, Paul. 2019. Being modern in China: a Western cultural analysis of modernity, tradition and schooling in China today. Medford, MA: Polity Press.  Xiang, Biao and Wu Qi. 2023. Self as Method Thinking Through China and the World. Singapore: Springer Nature. [項飆、吳琦著，2020，《把自己作為方法：與項飆談話》，上海：上海文藝出版社。]  Yan, Xuetong. 2013. \"Pre-Qin Philosophy and China's Rise Today\". Ancient Chinese Thought, Modern Chinese Power, by Yan Xuetong, edited by Daniel A. Bell and Sun Zhe, translated by Edmund Ryden, 199-221. Princeton and Oxford: Princeton University Press.  金觀濤，2021，《軸心文明與現代社會》，北京：東方出版社。  金耀基，2013，《中國的現代轉向》， 香港：牛津大學出版社。  * 金耀基，2017，《 從傳統到現代》， 北京：北京法律出版社 。", "terms": {"2024-25 Term 1": {"A-LEC (9448)": {"startTimes": ["14:30"], "endTimes": ["16:15"], "days": [2], "locations": ["T.C. Cheng Bldg 201"], "instructors": ["Dr. CHOI Sze Hang"], "meetingDates": ["3/9", "10/9", "17/9", "24/9", "8/10", "15/10", "22/10", "29/10", "5/11", "12/11", "19/11", "26/11"]}, "AT01-TUT (9449)": {"startTimes": ["16:30"], "endTimes": ["17:15"], "days": [2], "locations": ["T.C. Cheng Bldg 201"], "instructors": ["Dr. CHOI Sze Hang"], "meetingDates": ["3/9", "10/9", "17/9", "24/9", "8/10", "15/10", "22/10", "29/10", "5/11", "12/11", "19/11", "26/11"]}, "B-LEC (9450)": {"startTimes": ["8:30"], "endTimes": ["10:15"], "days": [5], "locations": ["Yasumoto Int'l Acad Park 503"], "instructors": ["Dr. CHOI Sze Hang"], "meetingDates": ["6/9", "13/9", "20/9", "27/9", "4/10", "18/10", "25/10", "1/11", "8/11", "15/11", "22/11", "29/11"]}, "BT01-TUT (9451)": {"startTimes": ["10:30"], "endTimes": ["11:15"], "days": [5], "locations": ["Yasumoto Int'l Acad Park 503"], "instructors": ["Dr. CHOI Sze Hang"], "meetingDates": ["6/9", "13/9", "20/9", "27/9", "4/10", "18/10", "25/10", "1/11", "8/11", "15/11", "22/11", "29/11"]}, "C-LEC (9452)": {"startTimes": ["14:30"], "endTimes": ["16:15"], "days": [2], "locations": ["Wong Foo Yuan Bldg UG02"], "instructors": ["Dr. YE Jia"], "meetingDates": ["3/9", "10/9", "17/9", "24/9", "8/10", "15/10", "22/10", "29/10", "5/11", "12/11", "19/11", "26/11"]}, "CT01-TUT (9453)": {"startTimes": ["16:30"], "endTimes": ["17:15"], "days": [2], "locations": ["Wong Foo Yuan Bldg UG02"], "instructors": ["Dr. YE Jia"], "meetingDates": ["3/9", "10/9", "17/9", "24/9", "8/10", "15/10", "22/10", "29/10", "5/11", "12/11", "19/11", "26/11"]}, "D-LEC (9454)": {"startTimes": ["8:30"], "endTimes": ["10:15"], "days": [3], "locations": ["Hui Yeung Shing Bldg G04"], "instructors": ["Dr. YE Jia"], "meetingDates": ["4/9", "11/9", "25/9", "2/10", "9/10", "16/10", "23/10", "30/10", "6/11", "13/11", "20/11", "27/11"]}, "DT01-TUT (9455)": {"startTimes": ["10:30"], "endTimes": ["11:15"], "days": [3], "locations": ["Hui Yeung Shing Bldg G04"], "instructors": ["Dr. YE Jia"], "meetingDates": ["4/9", "11/9", "25/9", "2/10", "9/10", "16/10", "23/10", "30/10", "6/11", "13/11", "20/11", "27/11"]}}, "2024-25 Term 2": {"A-LEC (9356)": {"startTimes": ["14:30"], "endTimes": ["16:15"], "days": [2], "locations": ["Esther Lee Bldg 205"], "instructors": ["Dr. CHOI Sze Hang"], "meetingDates": ["7/1", "14/1", "21/1", "4/2", "11/2", "18/2", "25/2", "11/3", "18/3", "25/3", "1/4", "8/4", "15/4"]}, "AT01-TUT (9367)": {"startTimes": ["16:30"], "endTimes": ["17:15"], "days": [2], "locations": ["Esther Lee Bldg 205"], "instructors": ["Dr. CHOI Sze Hang"], "meetingDates": ["7/1", "14/1", "21/1", "4/2", "11/2", "18/2", "25/2", "11/3", "18/3", "25/3", "1/4", "8/4", "15/4"]}, "B-LEC (9368)": {"startTimes": ["8:30"], "endTimes": ["10:15"], "days": [3], "locations": ["Chen Kou Bun Bldg 109"], "instructors": ["Dr. CHOI Sze Hang"], "meetingDates": ["8/1", "15/1", "22/1", "5/2", "12/2", "19/2", "26/2", "12/3", "19/3", "26/3", "2/4", "9/4", "16/4"]}, "BT01-TUT (9369)": {"startTimes": ["10:30"], "endTimes": ["11:15"], "days": [3], "locations": ["Chen Kou Bun Bldg 109"], "instructors": ["Dr. CHOI Sze Hang"], "meetingDates": ["8/1", "15/1", "22/1", "5/2", "12/2", "19/2", "26/2", "12/3", "19/3", "26/3", "2/4", "9/4", "16/4"]}, "C-LEC (9370)": {"startTimes": ["8:30"], "endTimes": ["10:15"], "days": [5], "locations": ["Hui Yeung Shing Bldg G04"], "instructors": ["Dr. CHOI Sze Hang"], "meetingDates": ["10/1", "17/1", "24/1", "7/2", "14/2", "21/2", "28/2", "14/3", "21/3", "28/3", "11/4"]}, "CT01-TUT (9371)": {"startTimes": ["10:30"], "endTimes": ["11:15"], "days": [5], "locations": ["Hui Yeung Shing Bldg G04"], "instructors": ["Dr. CHOI Sze Hang"], "meetingDates": ["10/1", "17/1", "24/1", "7/2", "14/2", "21/2", "28/2", "14/3", "21/3", "28/3", "11/4"]}, "D-LEC (9373)": {"startTimes": ["14:30"], "endTimes": ["16:15"], "days": [2], "locations": ["Wu Ho Man Yuen Bldg 303"], "instructors": ["Dr. YE Jia"], "meetingDates": ["7/1", "14/1", "21/1", "4/2", "11/2", "18/2", "25/2", "11/3", "18/3", "25/3", "1/4", "8/4", "15/4"]}, "DT01-TUT (9372)": {"startTimes": ["16:30"], "endTimes": ["17:30"], "days": [2], "locations": ["Wu Ho Man Yuen Bldg 303"], "instructors": ["Dr. YE Jia"], "meetingDates": ["7/1", "14/1", "21/1", "4/2", "11/2", "18/2", "25/2", "11/3", "18/3", "25/3", "1/4", "8/4", "15/4"]}, "E-LEC (9374)": {"startTimes": ["8:30"], "endTimes": ["10:15"], "days": [3], "locations": ["Hui Yeung Shing Bldg G01"], "instructors": ["Dr. YE Jia"], "meetingDates": ["8/1", "15/1", "22/1", "5/2", "12/2", "19/2", "26/2", "12/3", "19/3", "26/3", "2/4", "9/4", "16/4"]}, "ET01-TUT (9465)": {"startTimes": ["10:30"], "endTimes": ["11:15"], "days": [3], "locations": ["Hui Yeung Shing Bldg G01"], "instructors": ["Dr. YE Jia"], "meetingDates": ["8/1", "15/1", "22/1", "5/2", "12/2", "19/2", "26/2", "12/3", "19/3", "26/3", "2/4", "9/4", "16/4"]}, "F-LEC (9466)": {"startTimes": ["8:30"], "endTimes": ["10:15"], "days": [4], "locations": ["Lee Shau Kee Archi Bldg 212"], "instructors": ["Dr. YE Jia"], "meetingDates": ["9/1", "16/1", "23/1", "6/2", "13/2", "20/2", "27/2", "13/3", "20/3", "27/3", "3/4", "10/4", "17/4"]}, "FT01-TUT (9467)": {"startTimes": ["10:30"], "endTimes": ["11:15"], "days": [4], "locations": ["Lee Shau Kee Archi Bldg 212"], "instructors": ["Dr. YE Jia"], "meetingDates": ["9/1", "16/1", "23/1", "6/2", "13/2", "20/2", "27/2", "13/3", "20/3", "27/3", "3/4", "10/4", "17/4"]}, "G-LEC (9468)": {"startTimes": ["8:30"], "endTimes": ["10:15"], "days": [1], "locations": ["Tsang Shiu Tim Bldg 312"], "instructors": ["Staff"], "meetingDates": ["6/1", "13/1", "20/1", "27/1", "10/2", "17/2", "24/2", "10/3", "17/3", "24/3", "31/3", "7/4", "14/4"]}, "GT01-TUT (9469)": {"startTimes": ["10:30"], "endTimes": ["11:15"], "days": [1], "locations": ["Tsang Shiu Tim Bldg 312"], "instructors": ["Staff"], "meetingDates": ["6/1", "13/1", "20/1", "27/1", "10/2", "17/2", "24/2", "10/3", "17/3", "24/3", "31/3", "7/4", "14/4"]}, "H-LEC (9470)": {"startTimes": ["8:30"], "endTimes": ["10:15"], "days": [3], "locations": ["Wu Ho Man Yuen Bldg 508"], "instructors": ["Staff"], "meetingDates": ["8/1", "15/1", "22/1", "5/2", "12/2", "19/2", "26/2", "12/3", "19/3", "26/3", "2/4", "9/4", "16/4"]}, "HT01-TUT (9471)": {"startTimes": ["10:30"], "endTimes": ["11:15"], "days": [3], "locations": ["Wu Ho Man Yuen Bldg 508"], "instructors": ["Staff"], "meetingDates": ["8/1", "15/1", "22/1", "5/2", "12/2", "19/2", "26/2", "12/3", "19/3", "26/3", "2/4", "9/4", "16/4"]}, "I-LEC (9472)": {"startTimes": ["8:30"], "endTimes": ["10:15"], "days": [4], "locations": ["Institute of Chin Studies L1"], "instructors": ["Staff"], "meetingDates": ["9/1", "16/1", "23/1", "6/2", "13/2", "20/2", "27/2", "13/3", "20/3", "27/3", "3/4", "10/4", "17/4"]}, "IT01-TUT (9473)": {"startTimes": ["10:30"], "endTimes": ["11:15"], "days": [4], "locations": ["Institute of Chin Studies L1"], "instructors": ["Staff"], "meetingDates": ["9/1", "16/1", "23/1", "6/2", "13/2", "20/2", "27/2", "13/3", "20/3", "27/3", "3/4", "10/4", "17/4"]}, "J-LEC (9474)": {"startTimes": ["8:30"], "endTimes": ["10:15"], "days": [5], "locations": ["Hui Yeung Shing Bldg G01"], "instructors": ["Staff"], "meetingDates": ["10/1", "17/1", "24/1", "7/2", "14/2", "21/2", "28/2", "14/3", "21/3", "28/3", "11/4"]}, "JT01-TUT (9475)": {"startTimes": ["10:30"], "endTimes": ["11:15"], "days": [5], "locations": ["Hui Yeung Shing Bldg G01"], "instructors": ["Staff"], "meetingDates": ["10/1", "17/1", "24/1", "7/2", "14/2", "21/2", "28/2", "14/3", "21/3", "28/3", "11/4"]}}}, "assessments": {"Essays": "30", "Presentation": "20", "Participation": "20", "Report": "30"}}, {"code": "2290", "title": "Chinese Culture and Literature", "career": "Undergraduate", "units": "2.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Office of University GE", "requirements": "Not for Chinese Language and Literature; and Chinese Language Studies and Chinese Language Education (CLED) Majors.\nCo-requisite: Any course with “UGFH” or “UGFN” as prefix", "description": "This course examines the relations between Chinese culture and literature, enabling students to gain a critical understanding of the cultural content in Chinese literary works as well as the cultural contexts in which literary developments took place. Topics of discussion include the characteristic features of Chinese culture and literature, and the cultural factors that influence literary developments, such as language, philosophy, cultural fashion of the times and regional culture. Relations between the cultural background of major authors and their creative styles will also be examined.", "outcome": " 預期修畢本科目，學生能夠： 1.      了解中國文化及中國文學的特點，並認識時代地域文化、漢語的特點、哲學思想等文化因素對中國文學的影響。 2.      辨認不同作家的創作風格，了解他們的文化背景。 3.      能分析中國文學作品中的文化內涵特點。", "syllabus": "  (一)    緒論 n          中國文化及中國文學的特點概說   (二)    時代、地域文化與中國文學的關係 n          時代風尚與中國文學 n          地域文化與中國文學   (三)    漢語的特點與中國文學的關係 n          詩詞的格律 n          駢散文的節奏 n          詩文的句式   (四)    哲學思想與中國文學的關係 n          儒家思想與中國文學 n          道家思想與中國文學 n          佛家思想與中國文學   (五)    作家研究 n          作家的文化背景與其創作風格的關係    ", "required_readings": "馮友蘭著，趙復三譯：《中國哲學簡史（英漢對照本）》，天津：天津社會科學院出版社，2007年。（Fung Yu Lan .1948. A Short History of Chinese Philosophy. New York : Macmillan） 第4、7、9、10、11、21、22章 唐君毅：《中國文化之精神價值》，臺北：正中書局，1994年。 第1、2、3、11、12章 徐復觀：《中國藝術精神》，增補六版，臺北：臺灣學生書局，1979年。 第1、2章 袁行霈：《中國文學概論》，增訂彩圖本，北京：高等教育出版社，2006年。 第一編的第1、5、7章 蔣紹愚：《唐詩語言研究》，北京：語文出版社，2008年。 第1、3章", "recommended_readings": "（一） 作品歷代詩選讀歷代詞選讀歷代曲選讀歷代散文選讀歷代小說選讀《詩經》選讀《楚辭》選讀《論語》選讀《孟子》選讀《老子》選讀《莊子》選讀《世說新語》選讀《百喻經》選讀《六祖壇經》選讀禪宗語錄選讀（二） 論著張岱年：《中國哲學大綱》，南京：江蘇教育出版社，2005年。勞思光：《新編中國哲學史》，臺北：三民書局，2000年。葛兆光：《中國思想史》，上海：復旦大學出版社，2005年。陳來：《古代思想文化的世界——春秋時代的宗教、倫理與社會思想》，北京：三聯書店，2002年。陰法魯、許樹安主編：《中國古代文化史》，北京：北京大學出版社，1989年。郭紹虞主編：《中國歷代文論選》，上海：上海古籍出版社，1979年。張少康：《中國文學理論批評史》，第二版，北京：北京大學出版社，2005年。羅宗強：《魏晉南北朝文學思想史》，第二版，北京：中華書局，2006年。羅宗強：《隋唐五代文學思想史》，修訂本，北京：中華書局，2003年。劉若愚著，杜國清譯：《中國文學理論》，臺北：聯經出版事業公司，1981年。章培恆、駱玉明主編：《中國文學史新著》，上海：復旦大學出版社、上海文藝出版社，2007年。褚斌杰：《中國古代文體槪論》，增訂本，北京：北京大學出版社，1998年。袁行霈：《中國詩歌藝術硏究》，第三版，北京：北京大學出版社，2009年。葛曉音：《唐詩宋詞十五講》，北京：北京大學出版社，2003年。魯迅：〈魏晉風度及文章與藥及酒之關係〉，收錄於《魯迅全集》第三卷《而已集》，北京：人民文學出版社，1972年。牟宗三：《才性與玄理》，桂林：廣西師範大學出版社，2006年。羅宗強：《玄學與魏晉士人心態》，天津：南開大學出版社，2003年。曹道衡：《南朝文學與北朝文學》，南京：江蘇古籍出版社，1998年。牟潤孫：〈唐初南北學人論學之異趣及其影響〉，《中國文化研究所學報》，第1卷，1968年。戴偉華：《地域文化與唐代詩歌》，北京：中華書局，2006年。郭紹虞：《論中國文學中的音節問題》，香港：龍門書局，1969年。啟功：《詩文聲律論稿》，北京：中華書局，2002年。葛兆光：《漢字的魔方》，香港：中華書局，1989年。高友工、梅祖麟著，李世耀譯，武菲校：《唐詩的魅力》，上海：上海古籍出版社，1989年。王力：《漢語詩律學》，香港：中華書局，1999年。夏靜：《禮樂文化與中國文論早期形態研究》，北京：中華書局，2007年。張毅：《儒家文藝學》，天津：南開大學出版社，2004年張松輝：《先秦兩漢道家與文學》，北京：東方出版社，2004年。劉紹瑾：《莊子與中國美學》，長沙：岳麓書社，2007年。孫昌武：《禪思與詩情》，增訂本，北京：中華書局，2006年。胡遂：《佛教禪宗與唐代詩風之發展演變》，北京：中華書局，2007年。", "terms": {"2024-25 Term 1": {"A-LEC (5210)": {"startTimes": ["9:30"], "endTimes": ["11:15"], "days": [1], "locations": ["Lee Shau Kee Building 304"], "instructors": ["Mr CHOR Koon Fai"], "meetingDates": ["2/9", "9/9", "16/9", "23/9", "30/9", "7/10", "14/10", "21/10", "28/10", "4/11", "11/11", "18/11", "25/11"]}}, "2024-25 Term 2": {"B-LEC (5925)": {"startTimes": ["9:30"], "endTimes": ["11:15"], "days": [1], "locations": ["Lee Shau Kee Building 306"], "instructors": ["Mr CHOR Koon Fai"], "meetingDates": ["6/1", "13/1", "20/1", "27/1", "10/2", "17/2", "24/2", "10/3", "17/3", "24/3", "31/3", "7/4", "14/4"]}}}, "assessments": {"Essay test or exam": "40", "Homework or assignment": "60"}}, {"code": "2300", "title": "China from Tradition to Modernity", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Office of University GE", "requirements": "Not for Sociology Majors; and students who have taken SOCI2117(1101) or UGEA2190.\nCo-requisite: UGFH1000, UGFN1000 or UGFN1001 (only applicable to students admitted to the 4-year curriculum)", "description": "This course compares and contrasts traditional Chinese society and its modern development. In addition, it also seeks to understand and explain the transition between these two contrasting stages. The course will be organized along the line of the “from tradition to modernity” thesis, by way of which the institutional and cultural development in Chinese society can be re-examined in a comprehensive light, encompassing both their traditional formation and modern transformation.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "2330", "title": "China's Cultural Heritage", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "Lecture\nInteractive Tutorial", "campus": "Main Campus", "academic_group": "Office of University GE", "requirements": "UGEA2330 is double-coded with ANTH2760. \nNot for Anthropology Majors; and students who have taken ANTH2760. \nCo-requisite: UGFH1000, UGFN1000 or UGFN1001 (only applicable to students admitted to the 4-year curriculum)", "description": "(UGEA2330 is double-coded with ANTH2760.) This course aims to give students a visual and integrated understanding of Chinese civilization and cultural development in mainland China through analysing China's material cultural heritage, mainly traditional villages, ancient cities and grottos, as well as ceramics, jade and bronze items. The course will discuss the ecological, economic and cultural meanings of the above cultural properties in China, examine the preservation, management and exploitation of cultural heritage, and analyse how China's heritage has been re-interpreted and reconstructed to suit current economic, social and political needs, including the development of tourism, and the construction of ethnicity, nationalism and Chinese identity.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "2332", "title": "Culture and Modernity in China", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "Lecture\nInteractive Tutorial", "campus": "Main Campus", "academic_group": "Office of University GE", "requirements": "UGEA2332 is double-coded with ANTH2420. Not for Anthropology Majors; and students who have taken ANTH2420 or UGEA2140. \nCo-requisite: UGFH1000, UGFN1000 or UGFN1001 (only applicable to students admitted to the 4-year curriculum)", "description": "(UGEA2332 is double-coded with ANTH2420.) The remarkable economic emergence of China and Asia more broadly in recent decades has transformed many impoverished and largely agriculturally based societies into the most dynamic region of the contemporary world. China’s burgeoning aspirational middle classes, rapid urbanisation, time-space compression and the shift from command economies to de-regulated markets have had profound effects on people's everyday lives and the diverse cultural practices that have long shaped local livelihoods and community expectations. This course offers an introduction into anthropological approaches to the study of culture, modernity and globalisation in China and Asia more broadly. Relevant themes that have attracted anthropological interest include changing traditions and popular culture, adaptive custom and cosmopolitanism, migration and citizenship, identity politics and social movements as well as distinctive and emergent forms of governance in both collective and self-cultivating forms of expression. Drawing on a rich corpus of social theory and ethnographic research from anthropologists past and present, the course will provide students with conceptual and analytical tools to appreciate adaptive cultural practices in comparative terms, to review and appreciate the key anthropological debates and influential works in the study of modernity, and to introduce students to ethnographic approaches for researching and writing on modernity and contemporary ethnographies of global connection.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "2334", "title": "China Today", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "Lecture\nInteractive Tutorial", "campus": "Main Campus", "academic_group": "Office of University GE", "requirements": "Not for Anthropology Majors; and students who have taken ANTH2410, UGEA2180 or 2190. \nCo-requisite: Any course with “UGFH” or “UGFN” as prefix", "description": "China is looming large on the global scene and our everyday life. It is a rising power that is changing the world order. It is a land of promising opportunities that attract an immense amount of capital and talents from overseas. Not to mention that a large part of the stuff we consume is produced in China. However, China is still—at least nominally—a socialist country that continues to embrace one-party rule and political censorship. Through the holistic perspective of anthropology that gives equal emphasis on political, economic, social, cultural, and ecological factors, this course addresses a host of issues that are salient in understanding China and its position in the contemporary world. The anthropological perspective is particularly good at making sense of the macro-level issues through studying day-to-day details and processes in a small locale. This course starts with examining China's revolution-packed modern history and the making of the powerful Communist Party; topics covered include classical anthropological themes on family, kinship, religion, education, ethnicity, identity, and morality. In the second half of the semester, this course examines emerging social concerns to explore how global processes such as modernization and late-capitalist development shape Chinese cultural and social institutions. These concerns include consumerism, individualism, urbanization, underground (unofficial) culture, civil society and activism, and financialization and digitalization. The course also draws from disciplines other than anthropology—for example, history—and some of the finest journalist writings on China. The overall intention is to provide a well-rounded and nuanced understanding of China today. The course prepares students for the United Nation’s Sustainable Development Goals (SDGs). Anthropology has a strong heritage concerning inequality, marginalized group, human and environment, and wellbeing for all. Analyzing China, this course aims at understanding the development and choices of human beings. Therefore, the course will improve students’ reflection on several SDGs including “promoting inclusive and sustainable economic growth,” “reducing inequality within and among countries,” “sustainable consumption and production patterns,” and “peaceful and inclusive societies for sustainable development and providing access to justice for all.” ", "outcome": "  Acquire a good understanding of contemporary China.  Be acquainted with the anthropological holistic perspective.  Identify the core cultural characteristics of Chinese society and how they are shaped by political, economic, social and ecological factors.  Analyze emerging concerns in China in the context of global transitions.  Reflect upon the challenges regarding inequality, marginality, sustainability, and inclusiveness based on the analysis of China.  Establish the students’ own critical perspective of China today and the world.  Evaluate the concept of sustainability and development anthropologically to figure out how to meet the challenges of SDGs.", "syllabus": " I.        Introduction   1. Introduction: China and the World Key: China is a an integrated part of the world, not an exotic other. SDGs: choices and development for human beings   2. Diversity: History, Geography and Ethnicity Key1: Holistic understanding of China that considered the imapcts of geography, climate, history, economic life, and social institutions on cultures. Key 2: Understanding the implication of the claim “China is a unified multi-ethnic country”   SDGs: poverty and ethnic inequality   3. Relatedness: Family, Kinship and Morality Key: Understanding traditional Chinese cosmology and therefore the importance of the family through an analysis of Fei Xiaotong’s Differential Mode of Association. SGDs: culture, environment and social institution   4. Modernization: A One Hundred Year Quest Key: Why does being modern so attractive to the Chinese? Understanding historically the evolving meanings of modernity in the Chinese context. SDGs: nation-building and marginality   II.     Contemporary China   5. Dangguo: The Party-State Key: Analyzing the ideology and practices of dangguo, the party-state, and how political institution shapes identity and daily practices. SDGs: political institution and justice   6. Hierarchy: Class and Radical Individualism Key: Introducing the transition from collectivism to a market-oriented individualism and explain how extreme consumerism and the prioritzing of self-enterprising will result in an alienation from social well-being.  SDGs: historical contingency, sustainable consumption patterns   7. Divide: The Dying Village and Migration Key: Arguing how the hukou, household registration, system has resulted in a urban-rural divide and the pursuit of urbanization becomes an ideology that contribute to economic development at the expense of the environment and personal well-being.  SDGs: sustainable production, inclusive society, and wellbeing   8. Noise: Underground Music and Unofficial Culture Key: While the the various processes (consumerism, individualization, urbanization, etc.) has resulted in strict social formation of appropriate subjectivity, there are always rooms for negotiation and having different voices. This week we focus on music and other cultural production to deliver this argument. SDGs: resillience and empowerment   9. Activism: Labor and Gender Key: In this week, we use up to date social events in either labor or gender related issues to examine how individuals exercise agency in existing structure and analyze whether actions could lead to effective changes. If not, why? We will also contemplate on what “public opinion” means in China. SDGs: Inequality, decent work, and empowering women and girls     10. Environment: Development and the Nature   Key: The ideology of development has been strongly a part of China’s political and economic legitimacy since the end of the 1970s. This week we explore how the nature and the environment are understood in these years. SDGs: Responsible production and sustainable future   11. Digitalization: E-Commerce and Digital Governing Key: How have the fast development of e-commerce platforms and the employement of digital governing technologies – shape the society? This week we will use the concept of “the exemplary soceity” to analyze the various perception regarding digitalization. SDGs: Inequality, effective institutions and sustainable economy   12. The Epidemic: Crisis and Humanity Key: The recent epidemic crisis shows how the world is highly connected and integrated and, on the other hand, reveals how class, racial and other boundaries are created in contexts. We will use the concept of “pandemic public” to facilitate arguments about China as an area studies. SDGs: Healthcare and accountable institutions   III.   Wrap Up   13. China, Asia and The World Key: In the future, will China dominate the world as a superpower or facilitate cooperation as a leader? This week we will both look back in history to see what’s the relationship between China and the world before we have a strong idea of territorial boundary and also examine whether there be another China that focus on common values. SDGs: Inclusive and sustainable future  ", "required_readings": " The instructor will select a number of journalistic writings that focus on current affairs to supplement the readings, which are mostly scholarly writings, listed below.   1. Introduction: China and the World No required reading    2. Diversity: History, Geography and Ethnicity Tamara Jacka, Andrew B. Kipnis and Sally Sargeson, “Introduction (excerpt)” in Contemporary China: Society and Social Change, Pp. 6-23, Cambridge University Press, 2013. Recommended:  Mark Elliott, “What is the Source of Ethnic Tension?” in The China Questions: Critical Insights into a Rising Power, Jennifer Rudolph and Michael Sonya eds., Pp. 33-42, Harvard University Press, 2018.   3. Relatedness: Family, Kinship and Morality Charlotte Bruckermann and Stephan Feuchtwang, “Anthropology of China: History, Regionalism, and Comparison (excerpt)” in The Anthropology of China: China as Ethnographic and Theoretical Critique, Pp. 24-38, Imperial College Press, 2016. Recommended: Tamara Jacka, Andrew B. Kipnis and Sally Sargeson, “CH1. Families, Kinship and Relatedness” in Contemporary China: Society and Social Change. Pp. 27-46, Cambridge University Press, 2013.   4. Modernization: A One Hundred Year Quest Rebecca Karl, “Rules for Destroying Countries: China and the Colonial World in the Early 20th Century,” Viewpoint Magazine, 2018, https://www.viewpointmag.com/2018/02/01/rules-destroying-countries-china-colonial-world-early-20th-century/ Film/Video: Wang Shuibo, Sunrise over Tiananmen Square, 1998 http://www.youtube.com/watch?v=thrT8hmh8CI Recommended:  Myron Cohen, “Cultural and Political Inventions in Modern China: The Case of the Chinese “Peasant”,” Daedalus 122(2): 151-170, 1993. Michael Puett, “Who is Confucius in Today’s China?” in The China Questions: Critical Insights into a Rising Power, Jennifer Rudolph and Michael Sonya eds., Pp. 231-237, Harvard University Press, 2018.   5. Dangguo: The Party-State Elizebeth Perry, “Is the Chinese Communist Regime Legitimate?” in The China Questions: Critical Insights into a Rising Power, Jennifer Rudolph and Michael Sonya eds., Pp. 11-17, Harvard University Press, 2018. Roderick MacFarquhar, “Does Mao Still Matter?” in The China Questions: Critical Insights into a Rising Power, Jennifer Rudolph and Michael Sonya eds., Pp. 26-32, Harvard University Press, 2018. Recommended:  Jie Li, “Has Chinese Propaganda Won Hearts and Minds?” in The China Questions: Critical Insights into a Rising Power, Jennifer Rudolph and Michael Sonya eds., Pp. 268-275, Harvard University Press, 2018. News Article: “The Real Man of the Dog Year.” China Heritage. http://chinaheritage.net/journal/the-real-man-of-the-dog-year/ News Article: “十九大專題。”端傳媒. https://theinitium.com/channel/china-politics/   吳國光, 權力的劇場: 中共黨代會的制度運作, 香港中文大學出版社, 2018.   6. Hierarchy: Class and Radical Individualism Tamara Jacka, Andrew B. Kipnis and Sally Sargeson, “Ch10. Social Class and Stratification” in Contemporary China: Society and Social Change. Pp. 199-216, Cambridge University Press, 2013. Recommended:  Yan Yunxiang, “Introduction: the Rise of the Chinese Individual” in The Individualization of Chinese Society. Pp. xv-xxiii, 2009. Vanessa L. Fong, “Great Expectations: Singletons as the Vanguard of Modernization” in Only Hope: Coming of Age under China’s One-Child Policy, Pp. 69-86, Stanford University Press, 2004. William C. Kirby, “Why Do So Many Chinese Students Come to the United States?” In The China Questions: Critical Insights into a Rising Power,  Jennifer Rudolph and Michael Sonya eds., Pp. 219-228, Harvard University Press, 2018.   7. Divide: The Dying Village and Migration Meg Rithmire, “Will Urbanisation Save the Chinese Economy or Destroy it?” in The China Questions: Critical Insights into a Rising Power,  Jennifer Rudolph and Michael Sonya eds., Pp. 133-140, Harvard University Press, 2018. Recommended: Tamara Jacka, Andrew B. Kipnis and Sally Sargeson, “Ch11. Regional, Rural-Urban and Within-community Inequalities” in Contemporary China: Society and Social Change. Pp. 217-236. Cambridge University Press, 2013. Tamara Jacka, “Between Rural “Idiocy” and Urban “Modernity”” in Rural Women in Urban China: Gender, Migration, and Social Change, Pp. 31-58, M.E. Sharpe, Inc., 2006. Film/Video: The Last Train Home 歸途列車, Lixin Fan, 2009, 85 mins News Article: “I am Fan Yusu.” What’s On Weibo https://www.whatsonweibo.com/fan-yusu-%E6%88%91%E6%98%AF%E8%8C%83%E9%9B%A8%E7%B4%A0-full-translation/ News Article: “Beijing’s cruel eviction of its migrant workers is a stain on China’s urbanisation drive.” SCMP https://www.scmp.com/comment/insight-opinion/article/2121930/beijings-cruel-eviction-its-migrant-workers-stain-chinas News Article: ”北京切除後，二十萬拾荒者去哪了？“ 端傳媒 https://theinitium.com/article/20180109-mainland-beijing-scanvengers-after-eviction/   8. Noise: Underground Music and Unofficial Culture Jeroen de Kloet, “Popular Music and Youth in Urban China: The Dakou Generation” The China Quarterly 183: 609-626, 2005. Recommended: Tamara Jacka, Andrew B. Kipnis and Sally Sargeson, “Ch9. Modernity, Youth Identities and Popular Culture” in Contemporary China: Society and Social Change, Pp. 179-195, Cambridge University Press, 2013. David Der-wei Wang, “How Have Chinese Writers Imagined China’s Future?” in The China Questions: Critical Insights into a Rising Power. Jennifer Rudolph and Michael Sonya eds., Pp. 261-267, Harvard University Press, 2018. Film/Video: Nirvana and Pulp A Story of Scrapped CDs, Jada Li https://www.youtube.com/watch?v=bn21ywCLQTs Film/Video: Never Release My Fist, Wang Shuibo https://www.dailymotion.com/video/x6kn4n3 and https://www.dailymotion.com/video/x6kn9lq   9. Activism: Labor and Gender Lei Ya-Wen, “What Should We Know about Public Opinion in China?” in The China Questions: Critical Insights into a Rising Power. Jennifer Rudolph and Michael Sonya eds., Pp. 43-50, Harvard University Press, 2018. Recommended:  Kam Lucetta Yip Lo, “Ch5. A Smile on the Surface: The Politics of Public Correctness” in Shanghai Lalas: Female Tongzhi Communities and Politics in Urban China, Pp. 89-104, 2013. Yan Yunxiang, “Neo-Familism and the State in Contemporary China,” Urban Anthropology. 47(3, 4): 181-224, 2018. News Article: “Gay Couples in China Look Abroad to Start a Family.” The Wall Street Journal https://blogs.wsj.com/chinarealtime/2015/10/02/gay-couples-in-china-look-abroad-to-start-a-family/ News Article: “LGBT Parents Challenge Stereotypes in China.” Reuters https://www.reuters.com/article/us-china-lgbt-children/lgbt-parents-challenge-stereotypes-in-china-idUSKCN1OJ1XR News Article: “不一樣的媽媽力，我們是彩虹寶寶的母親” 端傳媒https://theinitium.com/article/20160826-mainland-lesbianmothers/   10. Environment: Development and the Nature   Bryan Tilt, “Pollution, Perceptions and Environmental Values,” in The Struggle for Sustainability in Rural China: Environmental Values and Civil Society, Pp. 83-107, Columbia University Press, 2009. Film/Video: Plastic China. Wang Jiu-liang, 2017 News Article: “China and the Environment: The East is Grey.” The Economist, 10 August, 2013 Recommended:  Film/Video: The Warriors of Qiugang 仇崗衛士. Ruby Yang, 2010, 39 mins, Simmon Craig, “Time Travel,” in The Devouring Dragon: How China’s Rise Threatens Our Natural World, St. Martin’s Press, 2014 Robert Weller, Discovering Nature: Globalization and Environmental Culture in China and Taiwan, Cambridge University Press, 2006.   11. Digitalization: E-Commerce and Digital Governing Borge Bakken,“Ch7. The Disciplinary Techniques of Evaluation,” in The Exemplary Society: Human Improvement, Social Control, and The Danger of Modernity in China. Pp. 243-287, Oxford University Press, 2000. Recommended: News Article: “專訪政治學家韓博天：數字列寧主義下，中國家如何重塑全球秩序？.”Initium Media 2018 https://theinitium.com/article/20180222-mainland-sebastian-heilmann-interview/?fbclid=IwAR3xw-rMGoQT-od2wjXJvFoJsPEu_lAp0HYa0d8MrzqZbPcxeLf5lKfFKxA News Article: “The West may be wrong about China’s social credit system.” Washington Post https://www.washingtonpost.com/news/theworldpost/wp/2018/11/29/social-credit/?noredirect=on&utm_term=.7d845c5b8f48 News Article: “China: The frontier of networked money – China’s latest business and technology news.” SupChina https://supchina.com/2017/10/18/china-frontier-networked-money-chinas-latest-business-technology-news/ Recommended:  News Article: “中國大數據四問：官商民集體狂歡的背後，「數據利維坦」正在降臨？” 端傳媒 https://theinitium.com/article/20180221-mainland-big-data/?fbclid=IwAR0QdVgNMvgGfN9-SKRqhyzywBnlZrjjz2M_2MbFlxBjjkXjcLKGC9VH_ew News Article: “China’s Orwellian Social Credit Score Isn’t Real.” FP https://foreignpolicy.com/2018/11/16/chinas-orwellian-social-credit-score-isnt-real/   12. The Epidemic: Crisis and Humanity Ruth Prince, “Pandemic publics: how epidemics transform social and political collectives of public health” in The Anthropology of Epidemics, Pp.135-153, Ann H. Kelly, Frederic Keck and Christos Lynteris, eds., Routledge, 2019. Recommended: Hannah Brown, “Complexity, anthropology, and epidemics” in The Anthropology of Epidemics, Pp. 121-134, Ann H. Kelly, Frederic Keck and Christos Lynteris, eds., Routledge, 2019. News Article: “病毒、極權與無權者的權力” https://matters.news/@az/%E7%97%85%E6%AF%92-%E6%A5%B5%E6%AC%8A%E8%88%87%E7%84%A1%E6%AC%8A%E8%80%85%E7%9A%84%E6%AC%8A%E5%8A%9B-bafyreihykentpjm7vbwzfqscosdn2u2mp23k57nbvbqp6ziheoapl6pxfq News Article: “70 Days of Denial, Delays and Dysfunction” Washington Post. 5 April 2020 http://thewashingtonpost.newspaperdirect.com/epaper/iphone/homepage.aspx#_articleview?issue=10582020040500000000001001&page=1&article=4ef12751-27a1-4c1b-bacb-ba510e1ac0bd&previewmode=2&noredirect=false News Article: “你做好一直使用健康碼的準備了嗎” https://mp.weixin.qq.com/s/xDKKicV22IBRGnNnNStOVg?fbclid=IwAR3xUYrvlrUdKm09vmrc78XC76IWMRU7Dcf_XXp2mf-nhtOXbCOAzBJFpis   13. China, Asia and The World Odd Arne Westad, “Can China Lead Asia?” in The China Questions: Critical Insights into a Rising Power. Jennifer Rudolph and Michael Sonya eds., Pp. 67-72, Harvard University Press, 2018. Andrew S. Erickson, “What Does the Rise of China Mean for the United States?” in The China Questions: Critical Insights into a Rising Power. Jennifer Rudolph and Michael Sonya eds., Pp. 81-89, Harvard University Press, 2018. Recommended:  News Article: “China has designs on Europe. Here is how Europe should respond.” The Economist. https://www.economist.com/leaders/2018/10/04/china-has-designs-on-europe-here-is-how-europe-should-respond News Article: “鐵幕降臨，中美關係迎來”新冷戰時代“？” Matters https://matters.news/forum/?post=55f59257-7176-4446-b521-256bda56e139  ", "recommended_readings": "", "terms": {"2024-25 Term 1": {"--LEC (6070)": {"startTimes": ["14:30"], "endTimes": ["16:15"], "days": [5], "locations": ["T.C. Cheng Bldg C4"], "instructors": ["Professor HO Hang Kei"], "meetingDates": ["6/9", "13/9", "20/9", "27/9", "4/10", "18/10", "25/10", "1/11", "8/11", "15/11", "22/11", "29/11"]}, "-T01-TUT (9169)": {"startTimes": ["16:30"], "endTimes": ["17:15"], "days": [5], "locations": ["T.C. Cheng Bldg C5"], "instructors": ["Professor HO Hang Kei"], "meetingDates": ["6/9", "13/9", "20/9", "27/9", "4/10", "18/10", "25/10", "1/11", "8/11", "15/11", "22/11", "29/11"]}}, "2024-25 Term 2": {"--LEC (4582)": {"startTimes": ["14:30"], "endTimes": ["16:15"], "days": [5], "locations": ["Tsang Shiu Tim Bldg 104"], "instructors": ["Professor HO Hang Kei"], "meetingDates": ["10/1", "17/1", "24/1", "7/2", "14/2", "21/2", "28/2", "14/3", "21/3", "28/3", "11/4"]}, "-T01-TUT (4583)": {"startTimes": ["16:30"], "endTimes": ["17:15"], "days": [5], "locations": ["Tsang Shiu Tim Bldg 104"], "instructors": ["Professor HO Hang Kei"], "meetingDates": ["10/1", "17/1", "24/1", "7/2", "14/2", "21/2", "28/2", "14/3", "21/3", "28/3", "11/4"]}}}, "assessments": {"Essays": "20", "Essay test or exam": "20", "Presentation": "20", "Short answer test or exam": "40"}}, {"code": "2433", "title": "An Introduction to the Development of Science and Technology in China", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "Lecture\nInteractive Tutorial", "campus": "Main Campus", "academic_group": "Office of University GE", "requirements": "The course is double-coded with CHES2107. \nNot for Contemporary China Studies; and Chinese Studies Majors; and students who have taken CHES2107\nCo-requisite: Any course with “UGFH” or “UGFN” as prefix", "description": "(UGEA2433 is double-coded with CHES2107.) Science and technology in China from antiquity to the present is surveyed through the study of selected topics in some depth. Particular emphasis is given to science and technology as a window to appreciate certain aspects of Chinese culture and history. Two important questions are explored through contrasting China with the West: the conditions for the development of modern science and the central role of science and technology in modernization.Specific topics include the following: (1) history of science and technology in the West as background; (2) scientific thought and concepts of nature in ancient China; (3) traditional Chinese mathematics; (4) traditional Chinese astronomy; (5) Chinese medicine: history, philosophy, theory and practice; (6) innovation and progress in pre-modern Chinese technology; (7) early introduction of western science by missionaries and the Needham question; (8) science and technology in the Self-Strengthening Movement and the May Fourth Movement (‘Mr Science’); (9) science and technology from 1949 to the 1980s; (10) innovation and technology since the 1980s.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "2451", "title": "Chinese Novels and Religious Culture", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "Lecture\nInteractive Tutorial", "campus": "Main Campus", "academic_group": "Office of University GE", "requirements": "Not for Cultural Studies; and Religious Studies Majors.\nCo-requisite: UGFH1000, UGFN1000 or UGFN1001 (only applicable to students admitted to the 4-year curriculum)", "description": "Chinese novels have long been intertwined with religious culture. The Confucian, Buddhist and Daoist thoughts permeate classical Chinese novels. As a lively epitome of Chinese religious culture, these novels also promoted the spread of religious thoughts among the people. This course aims to investigate the interactive relationship between Chinese novels and religion. Students will be guided to examine the religious contents in novels and the ways in which religious thoughts shape the motifs, characterization, language and narrative structure of the novels. Texts selected for reading include masterpieces of Chinese novels, such as The Story of the Stone, The Journey to the West, The Investiture of the Gods and Strange Tales of Liaozhai.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "1432", "title": "Changing Value Systems in Chinese History", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "Debate\nDiscussion\nExercise\nLecture", "campus": "Main Campus", "academic_group": "Office of University GE", "requirements": "Not for Chinese Studies; Contemporary China Studies Majors; and students who have taken CCSS3411 or CHES3104. \nCo-requisite: UGFH1000, UGFN1000 or UGFN1001 (only applicable to students admitted to the 4-year curriculum)", "description": "The aim of this course will be to examine four key moments of paradigm shift in Chinese value systems, in the Warring States (481-256 BC), the Period of Division (220-589 AD), the Song-Yuan (960-1368), and modern China (1850-present). The focus will be on the history of thought, religion, and medicine so as to see how key values in Chinese cultural history change over time, and how distinctions between elite and popular, male and female are also vital to a balanced understanding of what it means to be Chinese through history.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "3318", "title": "Modern Challenges: Chinese Art of the Twentieth Century", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "Lecture\nInteractive Tutorial", "campus": "Main Campus", "academic_group": "Office of University GE", "requirements": "UGEA3318 is double-coded with FAAS3117. \nNot for Fine Arts Majors; and students who have taken FAAS3117. \nCo-requisite: Any course with “UGFH” or “UGFN” as prefix", "description": "(UGEA3318 is double-coded with FAAS3117.) This course traces the development of Chinese art during the twentieth century. Major topics to be covered include new directions of traditionalism and westernization for innovation before 1949, as well as the development of Chinese art on the Mainland and elsewhere since 1949. Special attention will be paid to Chinese artists’ artistic response to political turmoil, cultural changes and Western influences in the new era.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "2770", "title": "Science and Technology: Lessons from China", "career": "Undergraduate", "units": "2.00", "grading": "Cross Institutional Project", "components": "Independent Study\nLecture\nInteractive Tutorial", "campus": "Main Campus", "academic_group": "Office of University GE", "requirements": "Co-requisite: UGFH1000, UGFN1000 or UGFN1001 (only applicable to students admitted to the 4-year curriculum)", "description": "The University of Hong Kong (HKU), The Chinese University of Hong Kong (CUHK), The Hong Kong University of Science and Technology (HKUST), and The Hong Kong Polytechnic University (PolyU) are partners in a joint project entitled “The Responsive Universities: Appreciating Content Sharing in General Education”, which is funded by the UGC Funding Scheme for Teaching and Learning Related Proposals in the 2016-19 Triennium. Arising from this joint project, the four universities enter into an Agreement for Collaboration in Cross-institutional General Education Course Enrolment, under which students in the four universities can enrol in a list of designated General Education courses respectively offered by the four universities. This course, offered by The University of Hong Kong, is one of the designated courses under the Agreement.By confirming your enrolment of the course, you agree to give consent to CUHK in sharing your personal data among the partner institution of the Agreement for Collaboration in Cross-institutional Course Enrolment among HKU, CUHK, HKUST and PolyU, and to the partner institution for releasing your grades or other information relating to your study of the course to CUHK.In spite of the vast and superior knowledge possessed by the ancient Chinese relative to the rest of the world, China did not develop into a dominant technoculture. This course will explore some of the lesser known inventions and scientific development in ancient China and factors that caused China to fall behind the West in technological development. The contents of the course include perception of the material world in ancient China, early Chinese views of the universe, earth and nature, changes in the perception of these entities over time, scientific inventions and theories of ancient China, and the linkage between science, art and literature in China. Guest speakers will give insights on specific areas of technological advancement in ancient China. ", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}]